{smcl}
{txt}{sf}{ul off}{.-}
      name:  {res}<unnamed>
       {txt}log:  {res}/Users/farshadpourmalek/Downloads/covir2-main/20210604/code/UCLA/log Iran UCLA.smcl
  {txt}log type:  {res}smcl
 {txt}opened on:  {res} 5 Jun 2021, 07:46:07
{txt}
{com}. 
. ***************************************************************************
. * This is "do Iran UCLA.do"
. 
. * Project: COVID-19 Iran Review No 2
. * Person: Farshad Pourmalek pourmalek_farshad@yahoo.com
. * Time (initial): 2021-02-10
. 
. * OBJECTIVE: Get and prepare UCLA data for Iran
. ***************************************************************************
. 
. 
. * Get UCLA estimates 
. 
. /* 
> 
> estimates files:
> 
> 
>                 ucla-covid19-forecasts-master/
>                 
>                 /current_projection/pred_world_new.csv                  24 days ago on 20210530 (History on GitHub: _latest interaction_)
>                 
>                         Iran 2021-05-02 to 2021-08-09
> 
>                 /current_projection/pred_world.csv                              5 months ago on 20210530 (History on GitHub)
>                 
>                         Iran 2020-11-08 to 2021-02-15
>                         
>                         
>                 /projection_reult/pred_world_01-03.csv to pred_world-05-08.csv
>                 
>                         pred_world-05-08.csv            Region = US                                             3 months ago on 20210530 (History on GitHub)
>                         pred_world-05-01-210            Region = US
>                         pred_world-4-24                         Region = US
>                         pred_world_12-20                        Iran 2020-12-20 to 2021-03-29
>                         ...                     
>                         pred_world_01-03                        Iran 2021-01-03 to 2021-04-12   5 months ago on 20210530 (History on GitHub)
>                 
>                 
>                 timeline for Iran:
>                 
>                 2020-11-08 to 2021-02-15                /current_projection/pred_world.csv
>                 2021-01-03 to 2021-04-12                /projection_reult/pred_world_01-03.csv          overlap = 2021-01-03 to 2021-02-15
>                 2021-05-02 to 2021-08-09                /current_projection/pred_world_new.csv
>                 
>                 
> */ 
. 
. 
. ** get 2020-11-08 to 2021-02-15         /current_projection/pred_world.csv
. 
. clear
{txt}
{com}. 
. copy https://raw.githubusercontent.com/uclaml/ucla-covid19-forecasts/master/current_projection/pred_world.csv pred_world.csv
{txt}
{com}. 
. import delimited using "pred_world.csv", clear varnames(1)
{res}{text}(17 vars, 2,600 obs)

{com}. 
. rename region loc_grand_name
{res}{txt}
{com}. 
. keep if loc_grand_name == "Iran"
{txt}(2,500 observations deleted)

{com}. 
. * gen date
. 
. rename date date_original
{res}{txt}
{com}. gen year = substr(date_original,1,4) 
{txt}
{com}. gen month = substr(date_original,6,2) 
{txt}
{com}. gen day = substr(date_original,9,2) 
{txt}
{com}. egen date2 = concat(day month year)
{txt}
{com}. gen date = date(date2, "DMY", 2050)
{txt}
{com}. format date %tdDDMonCCYY
{txt}
{com}. codebook date // 08nov2020,15feb2021

{txt}{hline}
{res}date{right:(unlabeled)}
{txt}{hline}

{col 19}type:  numeric daily date ({res}float{txt})

{col 18}range:  [{res}22227{txt},{res}22326{txt}]{col 55}units:  {res}1
{col 8}{txt}or equivalently:  [{res}08nov2020{txt},{res}15feb2021{txt}]{col 55}units:  {res}days
{col 10}{txt}unique values:  {res}100{col 51}{txt}missing .:  {res}0{txt}/{res}100

{txt}{col 19}mean:{res}{col 26} 22276.5{txt} = {res}27dec2020{txt} (+ 12 hours)
{col 15}std. dev:{res}{col 26} 29.0115

{txt}{col 12}percentiles:{col 32}10%{col 42}25%{col 52}50%{col 62}75%{col 72}90%
{res}{col 27} 22236.5{col 37} 22251.5{col 47} 22276.5{col 57} 22301.5{col 67} 22316.5
{col 26}17nov2020{col 36}02dec2020{col 46}27dec2020{col 56}21jan2021{col 66}05feb2021
{txt}
{com}. drop year month day date2
{txt}
{com}. 
. save "pred_world.dta", replace
{txt}(note: file pred_world.dta not found)
file pred_world.dta saved

{com}. 
. 
. 
. 
. ** get 2021-01-03 to 2021-04-12         /projection_reult/pred_world_01-03.csv
. 
. 
. clear
{txt}
{com}. 
. copy https://raw.githubusercontent.com/uclaml/ucla-covid19-forecasts/master/projection_result/pred_world_01-03.csv pred_world_01-03.csv
{txt}
{com}. 
. import delimited using "pred_world_01-03.csv", clear varnames(1)
{res}{text}(17 vars, 2,600 obs)

{com}. 
. rename region loc_grand_name
{res}{txt}
{com}. 
. keep if loc_grand_name == "Iran"
{txt}(2,500 observations deleted)

{com}. 
. * gen date
. 
. rename date date_original
{res}{txt}
{com}. gen year = substr(date_original,1,4) 
{txt}
{com}. gen month = substr(date_original,6,2) 
{txt}
{com}. gen day = substr(date_original,9,2) 
{txt}
{com}. egen date2 = concat(day month year)
{txt}
{com}. gen date = date(date2, "DMY", 2050)
{txt}
{com}. format date %tdDDMonCCYY
{txt}
{com}. codebook date // 03jan2021,12apr2021

{txt}{hline}
{res}date{right:(unlabeled)}
{txt}{hline}

{col 19}type:  numeric daily date ({res}float{txt})

{col 18}range:  [{res}22283{txt},{res}22382{txt}]{col 55}units:  {res}1
{col 8}{txt}or equivalently:  [{res}03jan2021{txt},{res}12apr2021{txt}]{col 55}units:  {res}days
{col 10}{txt}unique values:  {res}100{col 51}{txt}missing .:  {res}0{txt}/{res}100

{txt}{col 19}mean:{res}{col 26} 22332.5{txt} = {res}21feb2021{txt} (+ 12 hours)
{col 15}std. dev:{res}{col 26} 29.0115

{txt}{col 12}percentiles:{col 32}10%{col 42}25%{col 52}50%{col 62}75%{col 72}90%
{res}{col 27} 22292.5{col 37} 22307.5{col 47} 22332.5{col 57} 22357.5{col 67} 22372.5
{col 26}12jan2021{col 36}27jan2021{col 46}21feb2021{col 56}18mar2021{col 66}02apr2021
{txt}
{com}. drop year month day date2
{txt}
{com}. 
. save "pred_world_01-03.dta", replace
{txt}(note: file pred_world_01-03.dta not found)
file pred_world_01-03.dta saved

{com}. 
. 
. 
. 
. ** get 2021-05-02 to 2021-08-09         /current_projection/pred_world_new.csv
. 
. 
. clear
{txt}
{com}. 
. copy https://raw.githubusercontent.com/uclaml/ucla-covid19-forecasts/master/current_projection/pred_world_new.csv pred_world_new.csv
{txt}
{com}. 
. import delimited using "pred_world_new.csv", clear varnames(1)
{res}{text}(17 vars, 2,600 obs)

{com}. 
. rename region loc_grand_name
{res}{txt}
{com}. 
. keep if loc_grand_name == "Iran"
{txt}(2,500 observations deleted)

{com}. 
. * gen date
. 
. rename date date_original
{res}{txt}
{com}. gen year = substr(date_original,1,4) 
{txt}
{com}. gen month = substr(date_original,6,2) 
{txt}
{com}. gen day = substr(date_original,9,2) 
{txt}
{com}. egen date2 = concat(day month year)
{txt}
{com}. gen date = date(date2, "DMY", 2050)
{txt}
{com}. format date %tdDDMonCCYY
{txt}
{com}. codebook date // 02may2021,09aug2021

{txt}{hline}
{res}date{right:(unlabeled)}
{txt}{hline}

{col 19}type:  numeric daily date ({res}float{txt})

{col 18}range:  [{res}22402{txt},{res}22501{txt}]{col 55}units:  {res}1
{col 8}{txt}or equivalently:  [{res}02may2021{txt},{res}09aug2021{txt}]{col 55}units:  {res}days
{col 10}{txt}unique values:  {res}100{col 51}{txt}missing .:  {res}0{txt}/{res}100

{txt}{col 19}mean:{res}{col 26} 22451.5{txt} = {res}20jun2021{txt} (+ 12 hours)
{col 15}std. dev:{res}{col 26} 29.0115

{txt}{col 12}percentiles:{col 32}10%{col 42}25%{col 52}50%{col 62}75%{col 72}90%
{res}{col 27} 22411.5{col 37} 22426.5{col 47} 22451.5{col 57} 22476.5{col 67} 22491.5
{col 26}11may2021{col 36}26may2021{col 46}20jun2021{col 56}15jul2021{col 66}30jul2021
{txt}
{com}. drop year month day date2
{txt}
{com}. 
. save "pred_world_new.dta", replace
{txt}(note: file pred_world_new.dta not found)
file pred_world_new.dta saved

{com}. 
. *
. 
. 
. ** append timelines for Iran
. 
. use "pred_world.dta", clear
{txt}
{com}. 
. append using "pred_world_01-03.dta", gen(source_pred_world_01_03) 
{txt}
{com}. 
. append using "pred_world_new.dta", gen(source_pred_world_new) 
{txt}
{com}. 
. duplicates tag date, gen(duptag)

{p 0 4}{txt}Duplicates in terms of {res} date{p_end}
{txt}
{com}. 
. tab duptag

     {txt}duptag {c |}      Freq.     Percent        Cum.
{hline 12}{c +}{hline 35}
          0 {c |}{res}        212       70.67       70.67
{txt}          1 {c |}{res}         88       29.33      100.00
{txt}{hline 12}{c +}{hline 35}
      Total {c |}{res}        300      100.00
{txt}
{com}. 
. gsort -duptag date 
{txt}
{com}. 
. list in 1/2, clean
{txt}
       {res}date_ori~l   lower_~m   upper_~m   lower_~a   upper_~a   pre_co~m   pre_fata   pre_fa~y   lower_..   upper_..   lower_~t   upper_~t    pre_act   pre_co~y   lower_..   upper_..   loc_gr~e        date   sourc~03   source~w   duptag {txt} 
  1.   {res}2021-01-03    1243434    1243434      55540      55540    1243434      55540          0          0          0          0     174876   129190.6          0          0          0       Iran   03Jan2021          1          0        1 {txt} 
  2.   {res}2021-01-03    1072077    1872029   53465.26   63547.55    1339989   56384.74   290.1429   202.2589    439.039   97338.35     585142   225338.5   13036.64   7243.422   22280.41       Iran   03Jan2021          0          0        1 {txt} 

{com}. 
. * get estimates for overlap period from /current_projection/pred_world.csv rather than from /projection_reult/pred_world_01-03.csv      
. 
. drop if source_pred_world_01_03 == 1
{txt}(100 observations deleted)

{com}. 
. 
. isid date
{txt}
{com}. 
. drop source_pred_world_01_03 source_pred_world_new duptag
{txt}
{com}. 
. sort date
{txt}
{com}. 
. codebook date // 08nov2020,09aug2021

{txt}{hline}
{res}date{right:(unlabeled)}
{txt}{hline}

{col 19}type:  numeric daily date ({res}float{txt})

{col 18}range:  [{res}22227{txt},{res}22501{txt}]{col 55}units:  {res}1
{col 8}{txt}or equivalently:  [{res}08nov2020{txt},{res}09aug2021{txt}]{col 55}units:  {res}days
{col 10}{txt}unique values:  {res}200{col 51}{txt}missing .:  {res}0{txt}/{res}200

{txt}{col 19}mean:{res}{col 26}   22364{txt} = {res}25mar2021{txt}
{col 15}std. dev:{res}{col 26} 92.3697

{txt}{col 12}percentiles:{col 32}10%{col 42}25%{col 52}50%{col 62}75%{col 72}90%
{res}{col 27} 22246.5{col 37} 22276.5{col 47}   22364{col 57} 22451.5{col 67} 22481.5
{col 26}27nov2020{col 36}27dec2020{col 46}25mar2021{col 56}20jun2021{col 66}20jul2021
{txt}
{com}. 
. 
. line pre_fata_daily date
{res}{txt}
{com}. 
. line pre_fata_daily lower_pre_fata_daily upper_pre_fata_daily date
{res}{txt}
{com}. 
. line pre_act date
{res}{txt}
{com}. 
. *
. 
. 
. ** keep using /ucla-covid19-forecasts-master/current_projection/pred_world_new.csv Iran 2021-05-02 to 2021-08-09
. 
. use "pred_world_new.dta", clear 
{txt}
{com}. 
. 
. line pre_fata_daily lower_pre_fata_daily upper_pre_fata_daily date
{res}{txt}
{com}. 
. 
. local varlist pre_fata_daily lower_pre_fata_daily upper_pre_fata_daily lower_pre_act pre_confirm_daily lower_pre_confirm_daily upper_pre_confirm_daily
{txt}
{com}. 
. foreach var of local varlist {c -(}
{txt}  2{com}. 
.         replace `var' = . if `var' == 0
{txt}  3{com}. 
. {c )-}
{txt}(1 real change made, 1 to missing)
(1 real change made, 1 to missing)
(1 real change made, 1 to missing)
(1 real change made, 1 to missing)
(1 real change made, 1 to missing)
(1 real change made, 1 to missing)
(1 real change made, 1 to missing)

{com}. *
. 
. line pre_fata_daily lower_pre_fata_daily upper_pre_fata_daily date
{res}{txt}
{com}. 
. line pre_confirm_daily lower_pre_confirm_daily upper_pre_confirm_daily date
{res}{txt}
{com}. 
. line pre_fata lower_pre_fata upper_pre_fata date
{res}{txt}
{com}. 
. line pre_confirm lower_pre_confirm upper_pre_confirm date
{res}{txt}
{com}. 
. 
. rename pre_fata_daily       DayDeaMeRaA17S00
{res}{txt}
{com}. rename lower_pre_fata_daily DayDeaLoRaA17S00
{res}{txt}
{com}. rename upper_pre_fata_daily DayDeaUpRaA17S00
{res}{txt}
{com}. 
. rename pre_confirm_daily       DayCasMeRaA17S00
{res}{txt}
{com}. rename lower_pre_confirm_daily DayCasLoRaA17S00
{res}{txt}
{com}. rename upper_pre_confirm_daily DayCasUpRaA17S00
{res}{txt}
{com}. 
. rename pre_fata       TotDeaMeRaA17S00
{res}{txt}
{com}. rename lower_pre_fata TotDeaLoRaA17S00
{res}{txt}
{com}. rename upper_pre_fata TotDeaUpRaA17S00
{res}{txt}
{com}. 
. rename pre_confirm       TotCasMeRaA17S00
{res}{txt}
{com}. rename lower_pre_confirm TotCasLoRaA17S00
{res}{txt}
{com}. rename upper_pre_confirm TotCasUpRaA17S00
{res}{txt}
{com}. 
. label var DayDeaMeRaA17S00 "Daily Deaths Mean UCLA"
{txt}
{com}. label var DayDeaLoRaA17S00 "Daily Deaths Lower UCLA"
{txt}
{com}. label var DayDeaUpRaA17S00 "Daily Deaths Upper UCLA"
{txt}
{com}. 
. label var DayCasMeRaA17S00 "Daily Cases Mean UCLA"
{txt}
{com}. label var DayCasLoRaA17S00 "Daily Cases Lower UCLA"
{txt}
{com}. label var DayCasUpRaA17S00 "Daily Cases Upper UCLA"
{txt}
{com}. 
. label var TotDeaMeRaA17S00 "Total Deaths Mean UCLA"
{txt}
{com}. label var TotDeaLoRaA17S00 "Total Deaths Lower UCLA"
{txt}
{com}. label var TotDeaUpRaA17S00 "Total Deaths Upper UCLA"
{txt}
{com}. 
. label var TotCasMeRaA17S00 "Total Cases Mean UCLA"
{txt}
{com}. label var TotCasMeRaA17S00 "Total Cases Lower UCLA"
{txt}
{com}. label var TotCasUpRaA17S00 "Total Cases Upper UCLA"
{txt}
{com}. 
. 
. * gen cfr 
. 
. gen DayCfrMeRaA17S00 = 100 * DayDeaMeRaA17S00 / DayCasMeRaA17S00
{txt}(1 missing value generated)

{com}. gen DayCfrLoRaA17S00 = 100 * DayDeaLoRaA17S00 / DayCasLoRaA17S00
{txt}(1 missing value generated)

{com}. gen DayCfrUpRaA17S00 = 100 * DayDeaUpRaA17S00 / DayCasUpRaA17S00
{txt}(1 missing value generated)

{com}. 
. label var DayCfrMeRaA17S00 "Daily CFR Mean UCLA"
{txt}
{com}. label var DayCfrLoRaA17S00 "Daily CFR Lower UCLA"
{txt}
{com}. label var DayCfrUpRaA17S00 "Daily CFR Upper UCLA"
{txt}
{com}. 
. 
. * gen "Daily cases mean div by daily deaths mean UCLA  DayCbD" for visulization of temporal relation of deaths and cases peaks 
. 
. 
. summ DayDeaMeRaA17S00 

{txt}    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayDeaMeR~00 {c |}{res}         99      183.32     91.8555   80.96031   415.7143
{txt}
{com}. gen DayDeMMeRaA17S00   = r(mean)
{txt}
{com}. label var DayDeMMeRaA17S00   "Daily deaths mean UCLA  DayDeM"
{txt}
{com}. 
. summ DayCasMeRaA17S00   

{txt}    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayCasMeR~00 {c |}{res}         99    3677.685    4514.465   289.2263   19807.29
{txt}
{com}. gen DayCaMMeRaA17S00   = r(mean)
{txt}
{com}. label var DayCaMMeRaA17S00   "Daily cases mean UCLA  DayCaM"
{txt}
{com}.                            
. gen DayCbDMeRaA17S00   = DayCaMMeRaA17S00   / DayDeMMeRaA17S00  
{txt}
{com}. label var DayCbDMeRaA17S00   "Daily cases mean div by daily deaths mean UCLA  DayCbD"
{txt}
{com}. summ DayCbDMeRaA17S00  

{txt}    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayCbDMeR~00 {c |}{res}        100    20.06156           0   20.06156   20.06156
{txt}
{com}.                                               
. gen DayDMuMeRaA17S00   = DayDeaMeRaA17S00   * DayCbDMeRaA17S00  
{txt}(1 missing value generated)

{com}. label var DayDMuMeRaA17S00   "Daily deaths scaled (times means of cases by deaths) UCLA "
{txt}
{com}. summ DayDMuMeRaA17S00  

{txt}    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayDMuMeR~00 {c |}{res}         99    3677.685    1842.764    1624.19   8339.876
{txt}
{com}.         
. 
. 
. 
. 
. ****************************
. 
. * graphs 
. 
. grstyle init
{res}{txt}
{com}. 
. grstyle color background white
{txt}
{com}. 
. 
. 
. * daily deaths 
. 
. twoway ///
> (line DayDeaMeRaA17S00 date, sort lcolor(black)) ///
> , xtitle(Date) xlabel(#5, format(%tdYY-NN-DD) labsize(small)) xlabel(, grid) xlabel(, grid) ///
> xlabel(, angle(forty_five)) ylabel(, format(%9.0fc) labsize(small))  ylabel(, labsize(small) angle(horizontal)) ///
> ytitle(Daily deaths) title("COVID-19 daily deaths, Iran, UCLA, default scenario", size(medium)) ///
> xscale(lwidth(vthin) lcolor(gray*.2)) yscale(lwidth(vthin) lcolor(gray*.2)) 
{res}{txt}
{com}. 
. graph save "graph 1 COVID-19 daily deaths, default scenario, Iran, UCLA.gph", replace
{txt}(note: file graph 1 COVID-19 daily deaths, default scenario, Iran, UCLA.gph not found)
{res}{txt}(file graph 1 COVID-19 daily deaths, default scenario, Iran, UCLA.gph saved)

{com}. graph export "graph 1 COVID-19 daily deaths, default scenario, Iran, UCLA.pdf", replace
{txt}(file /Users/farshadpourmalek/Downloads/covir2-main/20210604/code/UCLA/graph 1 COVID-19 daily deaths, default scenario, Iran, UCLA.pdf written in PDF format)

{com}. 
. 
. 
. 
. * daily deaths CI
. 
. twoway ///
> (rarea DayDeaLoRaA17S00 DayDeaUpRaA17S00 date, sort color(black*.2)) ///
> (line DayDeaMeRaA17S00 date, sort lcolor(black)) ///
> , xtitle(Date) xlabel(#5, format(%tdYY-NN-DD) labsize(small)) xlabel(, grid) xlabel(, grid) ///
> xlabel(, angle(forty_five)) ylabel(, format(%9.0fc) labsize(small))  ylabel(, labsize(small) angle(horizontal)) ///
> ytitle(Daily deaths) title("COVID-19 daily deaths, Iran, UCLA, default scenario", size(medium)) ///
> xscale(lwidth(vthin) lcolor(gray*.2)) yscale(lwidth(vthin) lcolor(gray*.2)) legend(off) ///
> subtitle("with confidence limits", size(small))
{res}{txt}
{com}. 
. graph save "graph 2 COVID-19 daily deaths, default scenario, Iran, UCLA.gph", replace
{txt}(note: file graph 2 COVID-19 daily deaths, default scenario, Iran, UCLA.gph not found)
{res}{txt}(file graph 2 COVID-19 daily deaths, default scenario, Iran, UCLA.gph saved)

{com}. graph export "graph 2 COVID-19 daily deaths, default scenario, Iran, UCLA.pdf", replace
{txt}(file /Users/farshadpourmalek/Downloads/covir2-main/20210604/code/UCLA/graph 2 COVID-19 daily deaths, default scenario, Iran, UCLA.pdf written in PDF format)

{com}. 
. 
. 
. 
. * daily cases 
. 
. twoway ///
> (line DayCasMeRaA17S00 date, sort lcolor(black)) ///
> , xtitle(Date) xlabel(#5, format(%tdYY-NN-DD) labsize(small)) xlabel(, grid) xlabel(, grid) ///
> xlabel(, angle(forty_five)) ylabel(, format(%9.0fc) labsize(small))  ylabel(, labsize(small) angle(horizontal)) ///
> ytitle(Daily cases) title("COVID-19 daily cases, Iran, UCLA, default scenario", size(medium)) ///
> xscale(lwidth(vthin) lcolor(gray*.2)) yscale(lwidth(vthin) lcolor(gray*.2)) 
{res}{txt}
{com}. 
. graph save "graph 3 COVID-19 daily cases, default scenario, Iran, UCLA.gph", replace
{txt}(note: file graph 3 COVID-19 daily cases, default scenario, Iran, UCLA.gph not found)
{res}{txt}(file graph 3 COVID-19 daily cases, default scenario, Iran, UCLA.gph saved)

{com}. graph export "graph 3 COVID-19 daily cases, default scenario, Iran, UCLA.pdf", replace
{txt}(file /Users/farshadpourmalek/Downloads/covir2-main/20210604/code/UCLA/graph 3 COVID-19 daily cases, default scenario, Iran, UCLA.pdf written in PDF format)

{com}. 
. 
. 
. 
. * daily cases CI
. 
. twoway ///
> (rarea DayCasLoRaA17S00 DayCasUpRaA17S00 date, sort color(black*.2)) ///
> (line DayCasMeRaA17S00 date, sort lcolor(black)) ///
> , xtitle(Date) xlabel(#5, format(%tdYY-NN-DD) labsize(small)) xlabel(, grid) xlabel(, grid) ///
> xlabel(, angle(forty_five)) ylabel(, format(%9.0fc) labsize(small))  ylabel(, labsize(small) angle(horizontal)) ///
> ytitle(Daily cases) title("COVID-19 daily cases, Iran, UCLA, default scenario", size(medium)) ///
> xscale(lwidth(vthin) lcolor(gray*.2)) yscale(lwidth(vthin) lcolor(gray*.2)) legend(off) ///
> subtitle("with confidence limits", size(small))
{res}{txt}
{com}. 
. graph save "graph 4 COVID-19 daily cases, default scenario, Iran, UCLA.gph", replace
{txt}(note: file graph 4 COVID-19 daily cases, default scenario, Iran, UCLA.gph not found)
{res}{txt}(file graph 4 COVID-19 daily cases, default scenario, Iran, UCLA.gph saved)

{com}. graph export "graph 4 COVID-19 daily cases, default scenario, Iran, UCLA.pdf", replace
{txt}(file /Users/farshadpourmalek/Downloads/covir2-main/20210604/code/UCLA/graph 4 COVID-19 daily cases, default scenario, Iran, UCLA.pdf written in PDF format)

{com}. 
. 
. 
. 
. * total deaths 
. 
. twoway ///
> (line TotDeaMeRaA17S00 date, sort lcolor(black)) ///
> , xtitle(Date) xlabel(#5, format(%tdYY-NN-DD) labsize(small)) xlabel(, grid) xlabel(, grid) ///
> xlabel(, angle(forty_five)) ylabel(, format(%9.0fc) labsize(small))  ylabel(, labsize(small) angle(horizontal)) ///
> ytitle(Total deaths) title("COVID-19 total deaths, Iran, UCLA, default scenario", size(medium)) ///
> xscale(lwidth(vthin) lcolor(gray*.2)) yscale(lwidth(vthin) lcolor(gray*.2)) 
{res}{txt}
{com}. 
. graph save "graph 5 COVID-19 total deaths, default scenario, Iran, UCLA.gph", replace
{txt}(note: file graph 5 COVID-19 total deaths, default scenario, Iran, UCLA.gph not found)
{res}{txt}(file graph 5 COVID-19 total deaths, default scenario, Iran, UCLA.gph saved)

{com}. graph export "graph 5 COVID-19 total deaths, default scenario, Iran, UCLA.pdf", replace
{txt}(file /Users/farshadpourmalek/Downloads/covir2-main/20210604/code/UCLA/graph 5 COVID-19 total deaths, default scenario, Iran, UCLA.pdf written in PDF format)

{com}. 
. 
. 
. 
. * total deaths CI
. 
. twoway ///
> (rarea TotDeaLoRaA17S00 TotDeaUpRaA17S00 date, sort color(black*.2)) ///
> (line TotDeaMeRaA17S00 date, sort lcolor(black)) ///
> , xtitle(Date) xlabel(#5, format(%tdYY-NN-DD) labsize(small)) xlabel(, grid) xlabel(, grid) ///
> xlabel(, angle(forty_five)) ylabel(, format(%9.0fc) labsize(small))  ylabel(, labsize(small) angle(horizontal)) ///
> ytitle(Total deaths) title("COVID-19 total deaths, Iran, UCLA, default scenario", size(medium)) ///
> xscale(lwidth(vthin) lcolor(gray*.2)) yscale(lwidth(vthin) lcolor(gray*.2)) legend(off) ///
> subtitle("with confidence limits", size(small))
{res}{txt}
{com}. 
. graph save "graph 6 COVID-19 total deaths, default scenario, Iran, UCLA.gph", replace
{txt}(note: file graph 6 COVID-19 total deaths, default scenario, Iran, UCLA.gph not found)
{res}{txt}(file graph 6 COVID-19 total deaths, default scenario, Iran, UCLA.gph saved)

{com}. graph export "graph 6 COVID-19 total deaths, default scenario, Iran, UCLA.pdf", replace
{txt}(file /Users/farshadpourmalek/Downloads/covir2-main/20210604/code/UCLA/graph 6 COVID-19 total deaths, default scenario, Iran, UCLA.pdf written in PDF format)

{com}. 
. 
. 
. 
. * total cases 
. 
. twoway ///
> (line TotCasMeRaA17S00 date, sort lcolor(black)) ///
> , xtitle(Date) xlabel(#5, format(%tdYY-NN-DD) labsize(small)) xlabel(, grid) xlabel(, grid) ///
> xlabel(, angle(forty_five)) ylabel(, format(%9.0fc) labsize(small))  ylabel(, labsize(small) angle(horizontal)) ///
> ytitle(Total cases) title("COVID-19 total cases, Iran, UCLA, default scenario", size(medium)) ///
> xscale(lwidth(vthin) lcolor(gray*.2)) yscale(lwidth(vthin) lcolor(gray*.2)) 
{res}{txt}
{com}. 
. graph save "graph 7 COVID-19 total cases, default scenario, Iran, UCLA.gph", replace
{txt}(note: file graph 7 COVID-19 total cases, default scenario, Iran, UCLA.gph not found)
{res}{txt}(file graph 7 COVID-19 total cases, default scenario, Iran, UCLA.gph saved)

{com}. graph export "graph 7 COVID-19 total cases, default scenario, Iran, UCLA.pdf", replace
{txt}(file /Users/farshadpourmalek/Downloads/covir2-main/20210604/code/UCLA/graph 7 COVID-19 total cases, default scenario, Iran, UCLA.pdf written in PDF format)

{com}. 
. 
. 
. 
. * total cases CI
. 
. twoway ///
> (rarea TotCasLoRaA17S00 TotCasUpRaA17S00 date, sort color(black*.2)) ///
> (line TotCasMeRaA17S00 date, sort lcolor(black)) ///
> , xtitle(Date) xlabel(#5, format(%tdYY-NN-DD) labsize(small)) xlabel(, grid) xlabel(, grid) ///
> xlabel(, angle(forty_five)) ylabel(, format(%9.0fc) labsize(small))  ylabel(, labsize(small) angle(horizontal)) ///
> ytitle(Total cases) title("COVID-19 total cases, Iran, UCLA, default scenario", size(medium)) ///
> xscale(lwidth(vthin) lcolor(gray*.2)) yscale(lwidth(vthin) lcolor(gray*.2)) legend(off) ///
> subtitle("with confidence limits", size(small))
{res}{txt}
{com}. 
. graph save "graph 8 COVID-19 total cases, default scenario, Iran, UCLA.gph", replace
{txt}(note: file graph 8 COVID-19 total cases, default scenario, Iran, UCLA.gph not found)
{res}{txt}(file graph 8 COVID-19 total cases, default scenario, Iran, UCLA.gph saved)

{com}. graph export "graph 8 COVID-19 total cases, default scenario, Iran, UCLA.pdf", replace
{txt}(file /Users/farshadpourmalek/Downloads/covir2-main/20210604/code/UCLA/graph 8 COVID-19 total cases, default scenario, Iran, UCLA.pdf written in PDF format)

{com}. 
. 
. 
. 
. * daily CFR 
. 
. twoway ///
> (line DayCfrMeRaA17S00 date, sort lcolor(black)) ///
> , xtitle(Date) xlabel(#5, format(%tdYY-NN-DD) labsize(small)) xlabel(, grid) xlabel(, grid) ///
> xlabel(, angle(forty_five)) ylabel(, format(%9.2fc) labsize(small))  ylabel(, labsize(small) angle(horizontal)) ///
> ytitle(Daily CFR) title("COVID-19 daily CFR, Iran, UCLA, default scenario", size(medium)) ///
> xscale(lwidth(vthin) lcolor(gray*.2)) yscale(lwidth(vthin) lcolor(gray*.2)) 
{res}{txt}
{com}. 
. graph save "graph 9 COVID-19 daily CFR, default scenario, Iran, UCLA.gph", replace
{txt}(note: file graph 9 COVID-19 daily CFR, default scenario, Iran, UCLA.gph not found)
{res}{txt}(file graph 9 COVID-19 daily CFR, default scenario, Iran, UCLA.gph saved)

{com}. graph export "graph 9 COVID-19 daily CFR, default scenario, Iran, UCLA.pdf", replace
{txt}(file /Users/farshadpourmalek/Downloads/covir2-main/20210604/code/UCLA/graph 9 COVID-19 daily CFR, default scenario, Iran, UCLA.pdf written in PDF format)

{com}. 
. 
. 
. 
. * daily CFR CI
. 
. twoway ///
> (rarea DayCfrLoRaA17S00 DayCfrUpRaA17S00 date, sort color(black*.2)) ///
> (line DayCfrMeRaA17S00 date, sort lcolor(black)) ///
> , xtitle(Date) xlabel(#5, format(%tdYY-NN-DD) labsize(small)) xlabel(, grid) xlabel(, grid) ///
> xlabel(, angle(forty_five)) ylabel(, format(%9.2fc) labsize(small))  ylabel(, labsize(small) angle(horizontal)) ///
> ytitle(Daily CFR) title("COVID-19 daily CFR, Iran, UCLA, default scenario", size(medium)) ///
> xscale(lwidth(vthin) lcolor(gray*.2)) yscale(lwidth(vthin) lcolor(gray*.2)) legend(off) ///
> subtitle("with confidence limits", size(small))
{res}{txt}
{com}. 
. graph save "graph 10 COVID-19 daily CFR, default scenario, Iran, UCLA.gph", replace
{txt}(note: file graph 10 COVID-19 daily CFR, default scenario, Iran, UCLA.gph not found)
{res}{txt}(file graph 10 COVID-19 daily CFR, default scenario, Iran, UCLA.gph saved)

{com}. graph export "graph 10 COVID-19 daily CFR, default scenario, Iran, UCLA.pdf", replace
{txt}(file /Users/farshadpourmalek/Downloads/covir2-main/20210604/code/UCLA/graph 10 COVID-19 daily CFR, default scenario, Iran, UCLA.pdf written in PDF format)

{com}. 
. 
. 
. 
. * DayCas DayDeaDay Dea_multip
. 
. twoway ///
> (line DayCasMeRaA17S00 date, sort lcolor(blue)) ///
> (line DayDeaMeRaA17S00 date, sort lcolor(red)) ///
> (line DayDMuMeRaA17S00 date, sort lpattern(dot) lcolor(red)) ///
> if date > td(01jan2020) ///
> , xtitle(Date) xlabel(, format(%tdYY-NN-DD) labsize(small)) xlabel(, grid) xlabel(, grid) ///
> xlabel(, angle(forty_five)) ylabel(, format(%12.0fc) labsize(small)) ylabel(, labsize(small) angle(horizontal)) ///
> ytitle(Daily cases and deaths) title("COVID-19 daily cases and deaths, Iran, UCLA ", size(medium)) ///
> xscale(lwidth(vthin) lcolor(gray*.2)) yscale(lwidth(vthin) lcolor(gray*.2)) yscale(titlegap(4)) legend(region(lcolor(none)))  ///
> legend(order(1 "Daily cases" 2 "Daily deaths" 3 "Daily deaths scaled for visualization") size(small)) ///
> subtitle("Daily deaths, scaled = times (means of cases divided by deaths) for visualization only", size(small)) ///
> note("Current scenario, mean estimate")
{res}{txt}
{com}. 
. qui graph save "graph 10 COVID-19 daily deaths and cases Iran, UCLA .gph", replace
{txt}
{com}. qui graph export "graph 10 COVID-19 daily deaths and cases Iran, UCLA .pdf", replace
{txt}
{com}. 
. ***
. 
. 
. 
. 
. qui compress
{txt}
{com}. 
. sort date loc_grand_name 
{txt}
{com}. 
. save "Iran UCLA.dta", replace
{txt}(note: file Iran UCLA.dta not found)
file Iran UCLA.dta saved

{com}.  
. 
. 
. view "log Iran UCLA.smcl"
{txt}
{com}. 
. log close
      {txt}name:  {res}<unnamed>
       {txt}log:  {res}/Users/farshadpourmalek/Downloads/covir2-main/20210604/code/UCLA/log Iran UCLA.smcl
  {txt}log type:  {res}smcl
 {txt}closed on:  {res} 5 Jun 2021, 07:46:20
{txt}{.-}
{smcl}
{txt}{sf}{ul off}