{smcl}
{com}{sf}{ul off}{txt}
{com}. 
. *****************************************************************************
. * This is "do country LANL.do"
. 
. * Project: CovidVisualized country - countries without subnational estimates
. * Person: Farshad Pourmalek pourmalek_farshad at yahoo dot com
. * Time (initial): 2021-02-10
. 
. * OBJECTIVE: Get and prepare LANL data for country
. *****************************************************************************
. 
. 
.                                                                                                          ***************************
. * To change update date, find and replace all, 2021-08-22 (old), with 2021-08-22 (new) <<--       <<<--- * change update date here *
.                                                                                                          ***************************
. 
. 
. * Get LANL estimates 
. 
. clear 
{txt}
{com}. 
. 
. * download four files for four outcomes
.                                                                        
. copy https://covid-19.bsvgateway.org/forecast/global/2021-08-22/files/2021-08-22_global_cumulative_daily_cases_website.csv 2021-08-22_global_cumulative_daily_cases_website.csv
{txt}
{com}. 
. copy https://covid-19.bsvgateway.org/forecast/global/2021-08-22/files/2021-08-22_global_cumulative_daily_deaths_website.csv 2021-08-22_global_cumulative_daily_deaths_website.csv
{txt}
{com}. 
. copy https://covid-19.bsvgateway.org/forecast/global/2021-08-22/files/2021-08-22_global_incidence_daily_cases_website.csv 2021-08-22_global_incidence_daily_cases_website.csv
{txt}
{com}. 
. copy https://covid-19.bsvgateway.org/forecast/global/2021-08-22/files/2021-08-22_global_incidence_daily_deaths_website.csv 2021-08-22_global_incidence_daily_deaths_website.csv 
{txt}
{com}. 
. 
. 
. 
. * import csv files
. 
. 
. 
. * Total Cases
. import delimited using "2021-08-22_global_cumulative_daily_cases_website.csv", clear varnames(1)
{res}{text}(30 vars, 110,979 obs)

{com}. save "global_cumulative_daily_cases.dta", replace
{txt}file global_cumulative_daily_cases.dta saved

{com}. 
. * Total Deaths
. import delimited using "2021-08-22_global_cumulative_daily_deaths_website.csv", clear varnames(1)
{res}{text}(30 vars, 110,979 obs)

{com}. save "global_cumulative_daily_deaths.dta", replace
{txt}file global_cumulative_daily_deaths.dta saved

{com}. 
. * Daily Cases
. import delimited using "2021-08-22_global_incidence_daily_cases_website.csv", clear varnames(1)
{res}{text}(30 vars, 110,979 obs)

{com}. save "global_incidence_daily_cases.dta", replace
{txt}file global_incidence_daily_cases.dta saved

{com}. 
. * Daily Deaths 
. import delimited using "2021-08-22_global_incidence_daily_deaths_website.csv", clear varnames(1)
{res}{text}(30 vars, 110,979 obs)

{com}. save "global_incidence_daily_deaths.dta", replace
{txt}file global_incidence_daily_deaths.dta saved

{com}.         
. 
. 
. 
. 
. *******************
. 
. 
. * Total Cases
. 
. use "global_cumulative_daily_cases.dta", clear 
{txt}
{com}. 
. keep date q50 q025 q975 truth_confirmed obs name 
{txt}
{com}. 
. keep if regexm(name,"$country") == 1
{txt}(110,352 observations deleted)

{com}. 
. 
. 
. * gen date
. 
. rename date date_original
{res}{txt}
{com}. 
. gen year = substr(date_original,1,4) 
{txt}
{com}. gen month = substr(date_original,6,2) 
{txt}
{com}. gen day = substr(date_original,9,2) 
{txt}
{com}. egen date2 = concat(day month year)
{txt}
{com}. gen date = date(date2, "DMY", 2050)
{txt}
{com}. format date %tdDDMonCCYY
{txt}
{com}. codebook date

{txt}{hline}
{res}date{right:(unlabeled)}
{txt}{hline}

{col 19}type:  numeric daily date ({res}float{txt})

{col 18}range:  [{res}21936{txt},{res}22562{txt}]{col 55}units:  {res}1
{col 8}{txt}or equivalently:  [{res}22jan2020{txt},{res}09oct2021{txt}]{col 55}units:  {res}days
{col 10}{txt}unique values:  {res}627{col 51}{txt}missing .:  {res}0{txt}/{res}627

{txt}{col 19}mean:{res}{col 26}   22249{txt} = {res}30nov2020{txt}
{col 15}std. dev:{res}{col 26} 181.144

{txt}{col 12}percentiles:{col 32}10%{col 42}25%{col 52}50%{col 62}75%{col 72}90%
{res}{col 27}   21998{col 37}   22092{col 47}   22249{col 57}   22406{col 67}   22500
{col 26}24mar2020{col 36}26jun2020{col 46}30nov2020{col 56}06may2021{col 66}08aug2021
{txt}
{com}. 
. drop year month day date2
{txt}
{com}. 
. 
. * rename estimate vars
. 
. rename q50  TotCasMeRaA04S00
{res}{txt}
{com}. rename q025 TotCasLoRaA04S00
{res}{txt}
{com}. rename q975 TotCasUpRaA04S00
{res}{txt}
{com}. 
. label var TotCasMeRaA04S00 "Total Cases Mean LANL S0"
{txt}
{com}. label var TotCasLoRaA04S00 "Total Cases Lower LANL S0"
{txt}
{com}. label var TotCasUpRaA04S00 "Total Cases Upper LANL S0"
{txt}
{com}. 
. save "country LANL Total Cases.dta", replace
{txt}file country LANL Total Cases.dta saved

{com}. 
. 
. 
. 
. 
. 
. 
. *******************
. 
. * Total Deaths
. 
. use "global_cumulative_daily_deaths.dta", clear 
{txt}
{com}. 
. keep date q50 q025 q975 truth_deaths obs name 
{txt}
{com}. 
. keep if regexm(name,"$country") == 1
{txt}(110,352 observations deleted)

{com}. 
. 
. 
. * gen date
. 
. rename date date_original
{res}{txt}
{com}. 
. gen year = substr(date_original,1,4) 
{txt}
{com}. gen month = substr(date_original,6,2) 
{txt}
{com}. gen day = substr(date_original,9,2) 
{txt}
{com}. egen date2 = concat(day month year)
{txt}
{com}. gen date = date(date2, "DMY", 2050)
{txt}
{com}. format date %tdDDMonCCYY
{txt}
{com}. codebook date

{txt}{hline}
{res}date{right:(unlabeled)}
{txt}{hline}

{col 19}type:  numeric daily date ({res}float{txt})

{col 18}range:  [{res}21936{txt},{res}22562{txt}]{col 55}units:  {res}1
{col 8}{txt}or equivalently:  [{res}22jan2020{txt},{res}09oct2021{txt}]{col 55}units:  {res}days
{col 10}{txt}unique values:  {res}627{col 51}{txt}missing .:  {res}0{txt}/{res}627

{txt}{col 19}mean:{res}{col 26}   22249{txt} = {res}30nov2020{txt}
{col 15}std. dev:{res}{col 26} 181.144

{txt}{col 12}percentiles:{col 32}10%{col 42}25%{col 52}50%{col 62}75%{col 72}90%
{res}{col 27}   21998{col 37}   22092{col 47}   22249{col 57}   22406{col 67}   22500
{col 26}24mar2020{col 36}26jun2020{col 46}30nov2020{col 56}06may2021{col 66}08aug2021
{txt}
{com}. 
. drop year month day date2
{txt}
{com}. 
. 
. * rename estimate vars
. 
. rename q50  TotDeaMeRaA04S00
{res}{txt}
{com}. rename q025 TotDeaLoRaA04S00
{res}{txt}
{com}. rename q975 TotDeaUpRaA04S00
{res}{txt}
{com}. 
. label var TotDeaMeRaA04S00 "Total deaths Mean LANL S0"
{txt}
{com}. label var TotDeaLoRaA04S00 "Total deaths Lower LANL S0"
{txt}
{com}. label var TotDeaUpRaA04S00 "Total deaths Upper LANL S0"
{txt}
{com}. 
. 
. save "country LANL Total Deaths.dta", replace
{txt}file country LANL Total Deaths.dta saved

{com}. 
. 
. 
. 
. *******************
. 
. * Daily Cases
. 
. use "global_incidence_daily_cases.dta", clear 
{txt}
{com}. 
. keep date q50 q025 q975 truth_confirmed obs name 
{txt}
{com}. 
. keep if regexm(name,"$country") == 1
{txt}(110,352 observations deleted)

{com}. 
. 
. 
. * gen date
. 
. rename date date_original
{res}{txt}
{com}. 
. gen year = substr(date_original,1,4) 
{txt}
{com}. gen month = substr(date_original,6,2) 
{txt}
{com}. gen day = substr(date_original,9,2) 
{txt}
{com}. egen date2 = concat(day month year)
{txt}
{com}. gen date = date(date2, "DMY", 2050)
{txt}
{com}. format date %tdDDMonCCYY
{txt}
{com}. codebook date

{txt}{hline}
{res}date{right:(unlabeled)}
{txt}{hline}

{col 19}type:  numeric daily date ({res}float{txt})

{col 18}range:  [{res}21936{txt},{res}22562{txt}]{col 55}units:  {res}1
{col 8}{txt}or equivalently:  [{res}22jan2020{txt},{res}09oct2021{txt}]{col 55}units:  {res}days
{col 10}{txt}unique values:  {res}627{col 51}{txt}missing .:  {res}0{txt}/{res}627

{txt}{col 19}mean:{res}{col 26}   22249{txt} = {res}30nov2020{txt}
{col 15}std. dev:{res}{col 26} 181.144

{txt}{col 12}percentiles:{col 32}10%{col 42}25%{col 52}50%{col 62}75%{col 72}90%
{res}{col 27}   21998{col 37}   22092{col 47}   22249{col 57}   22406{col 67}   22500
{col 26}24mar2020{col 36}26jun2020{col 46}30nov2020{col 56}06may2021{col 66}08aug2021
{txt}
{com}. 
. drop year month day date2
{txt}
{com}. 
. 
. * rename estimate vars
. 
. rename q50  DayCasMeRaA04S00
{res}{txt}
{com}. rename q025 DayCasLoRaA04S00
{res}{txt}
{com}. rename q975 DayCasUpRaA04S00
{res}{txt}
{com}. 
. label var DayCasMeRaA04S00 "Daily cases Mean LANL S0"
{txt}
{com}. label var DayCasLoRaA04S00 "Daily cases Lower LANL S0"
{txt}
{com}. label var DayCasUpRaA04S00 "Daily cases Upper LANL S0"
{txt}
{com}. 
. 
. save "country LANL Daily Cases.dta", replace
{txt}file country LANL Daily Cases.dta saved

{com}. 
. 
. 
. *******************
. 
. 
. 
. 
. 
. 
. * Daily Deaths
. 
. use "global_incidence_daily_deaths.dta", clear 
{txt}
{com}. 
. keep date q50 q025 q975 truth_deaths obs name 
{txt}
{com}. 
. keep if regexm(name,"$country") == 1
{txt}(110,352 observations deleted)

{com}. 
. 
. 
. * gen date
. 
. rename date date_original
{res}{txt}
{com}. 
. gen year = substr(date_original,1,4) 
{txt}
{com}. gen month = substr(date_original,6,2) 
{txt}
{com}. gen day = substr(date_original,9,2) 
{txt}
{com}. egen date2 = concat(day month year)
{txt}
{com}. gen date = date(date2, "DMY", 2050)
{txt}
{com}. format date %tdDDMonCCYY
{txt}
{com}. codebook date

{txt}{hline}
{res}date{right:(unlabeled)}
{txt}{hline}

{col 19}type:  numeric daily date ({res}float{txt})

{col 18}range:  [{res}21936{txt},{res}22562{txt}]{col 55}units:  {res}1
{col 8}{txt}or equivalently:  [{res}22jan2020{txt},{res}09oct2021{txt}]{col 55}units:  {res}days
{col 10}{txt}unique values:  {res}627{col 51}{txt}missing .:  {res}0{txt}/{res}627

{txt}{col 19}mean:{res}{col 26}   22249{txt} = {res}30nov2020{txt}
{col 15}std. dev:{res}{col 26} 181.144

{txt}{col 12}percentiles:{col 32}10%{col 42}25%{col 52}50%{col 62}75%{col 72}90%
{res}{col 27}   21998{col 37}   22092{col 47}   22249{col 57}   22406{col 67}   22500
{col 26}24mar2020{col 36}26jun2020{col 46}30nov2020{col 56}06may2021{col 66}08aug2021
{txt}
{com}. 
. drop year month day date2
{txt}
{com}. 
. 
. * rename estimate vars
. 
. rename q50  DayDeaMeRaA04S00
{res}{txt}
{com}. rename q025 DayDeaLoRaA04S00
{res}{txt}
{com}. rename q975 DayDeaUpRaA04S00
{res}{txt}
{com}. 
. label var DayDeaMeRaA04S00 "Daily deaths Mean LANL S0"
{txt}
{com}. label var DayDeaLoRaA04S00 "Daily deaths Lower LANL S0"
{txt}
{com}. label var DayDeaUpRaA04S00 "Daily deaths Upper LANL S0"
{txt}
{com}. 
. 
. save "country LANL Daily Deaths.dta", replace
{txt}file country LANL Daily Deaths.dta saved

{com}. 
. 
. 
. ******************
. 
. * merge four estimates files
. 
. 
. use "country LANL Total Cases.dta", clear 
{txt}
{com}. 
. merge 1:1 date using "country LANL Total Deaths.dta"
{res}
{txt}{col 5}Result{col 38}# of obs.
{col 5}{hline 41}
{col 5}not matched{col 30}{res}               0
{txt}{col 5}matched{col 30}{res}             627{txt}  (_merge==3)
{col 5}{hline 41}

{com}. 
. drop _merge
{txt}
{com}. 
. merge 1:1 date using "country LANL Daily Cases.dta"
{res}
{txt}{col 5}Result{col 38}# of obs.
{col 5}{hline 41}
{col 5}not matched{col 30}{res}               0
{txt}{col 5}matched{col 30}{res}             627{txt}  (_merge==3)
{col 5}{hline 41}

{com}. 
. drop _merge
{txt}
{com}. 
. merge 1:1 date using "country LANL Daily Deaths.dta"
{res}
{txt}{col 5}Result{col 38}# of obs.
{col 5}{hline 41}
{col 5}not matched{col 30}{res}               0
{txt}{col 5}matched{col 30}{res}             627{txt}  (_merge==3)
{col 5}{hline 41}

{com}. 
. drop _merge
{txt}
{com}. 
. drop date_original obs truth_confirmed truth_deaths
{txt}
{com}. 
. order ///
> TotDeaLoRaA04S00 TotDeaMeRaA04S00 TotDeaUpRaA04S00 ///
> DayDeaLoRaA04S00 DayDeaMeRaA04S00 DayDeaUpRaA04S00 ///
> TotCasLoRaA04S00 TotCasMeRaA04S00 TotCasUpRaA04S00 ///
> DayCasLoRaA04S00 DayCasMeRaA04S00 DayCasUpRaA04S00
{txt}
{com}. 
. order date name
{txt}
{com}. 
. rename name loc_grand_name
{res}{txt}
{com}. 
. 
. 
. 
. 
. * gen cfr
. 
. gen DayCfrMeRaA04S00 = 100 * DayDeaMeRaA04S00 / DayCasMeRaA04S00
{txt}(28 missing values generated)

{com}. gen DayCfrLoRaA04S00 = 100 * DayDeaLoRaA04S00 / DayCasLoRaA04S00
{txt}(28 missing values generated)

{com}. gen DayCfrUpRaA04S00 = 100 * DayDeaUpRaA04S00 / DayCasUpRaA04S00
{txt}(28 missing values generated)

{com}. 
. label var DayCfrMeRaA04S00 "Daily CFR Mean LANL S0"
{txt}
{com}. label var DayCfrLoRaA04S00 "Daily CFR Lower LANL S0"
{txt}
{com}. label var DayCfrUpRaA04S00 "Daily CFR Upper LANL S0"
{txt}
{com}. 
. 
. 
. 
. 
. 
. * gen "Daily cases mean div by daily deaths mean LANL DayCbD" for visulization of temporal relation of deaths and cases peaks 
. 
. 
. summ DayDeaMeRaA04S00 

{txt}    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayDeaMeR~00 {c |}{res}        627    216.0542    190.5297          0        852
{txt}
{com}. gen DayDeMMeRaA04S00  = r(mean)
{txt}
{com}. label var DayDeMMeRaA04S00  "Daily deaths mean LANL DayDeM"
{txt}
{com}. 
. summ DayCasMeRaA04S00  

{txt}    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayCasMeR~00 {c |}{res}        627    9668.281    10068.76          0      50228
{txt}
{com}. gen DayCaMMeRaA04S00  = r(mean)
{txt}
{com}. label var DayCaMMeRaA04S00  "Daily cases mean LANL DayCaM"
{txt}
{com}.                            
. gen DayCbDMeRaA04S00  = DayCaMMeRaA04S00  / DayDeMMeRaA04S00 
{txt}
{com}. label var DayCbDMeRaA04S00  "Daily cases mean div by daily deaths mean LANL DayCbD"
{txt}
{com}. summ DayCbDMeRaA04S00 

{txt}    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayCbDMeR~00 {c |}{res}        627    44.74932           0   44.74932   44.74932
{txt}
{com}.                                               
. gen DayDMuMeRaA04S00  = DayDeaMeRaA04S00  * DayCbDMeRaA04S00 
{txt}
{com}. label var DayDMuMeRaA04S00  "Daily deaths scaled (times means of cases by deaths) LANL"
{txt}
{com}. summ DayDMuMeRaA04S00 

{txt}    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayDMuMeR~00 {c |}{res}        627    9668.281    8526.074          0   38126.43
{txt}
{com}. 
. 
. 
. 
. 
. ***********************
. 
. * graphs
. 
. 
. grstyle init
{res}{txt}
{com}. 
. grstyle color background white
{txt}
{com}. 
. 
. summ date

{txt}    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
{space 8}date {c |}{res}        627       22249    181.1436      21936      22562
{txt}
{com}. 
. local xticks = ceil( ( r(max) - r(min) ) / 30 )
{txt}
{com}. 
. di `xticks'
{res}21
{txt}
{com}. 
. 
. 
. * daily deaths     
. 
. twoway (rarea DayDeaLoRaA04S00 DayDeaUpRaA04S00 date, sort color(green*.2)) ///
> (line DayDeaMeRaA04S00 date, sort lcolor(green)) ///
> , xtitle(Date) xlabel(#`xticks', format(%tdYY-NN-DD) labsize(small)) xlabel(, grid) xlabel(, grid) ///
> xlabel(, angle(forty_five)) ylabel(, format(%9.0fc) labsize(small))  ylabel(, labsize(small) angle(horizontal)) ///
> ytitle(Daily deaths) title("COVID-19 daily deaths, $country, LANL, single scenario", size(medium)) ///
> xscale(lwidth(vthin) lcolor(gray*.2)) yscale(lwidth(vthin) lcolor(gray*.2)) legend(off) 
{res}{txt}
{com}.            
. graph save "graph 1 COVID-19 daily deaths, $country, LANL.gph", replace
{res}{txt}(file graph 1 COVID-19 daily deaths, Iran, LANL.gph saved)

{com}. graph export "graph 1 COVID-19 daily deaths, $country, LANL.pdf", replace
{txt}(file /Users/farshadpourmalek/Downloads/covir2-main/20210824/code/LANL/graph 1 COVID-19 daily deaths, Iran, LANL.pdf written in PDF format)

{com}. 
. 
. 
. 
. * daily cases
. 
. twoway (rarea DayCasLoRaA04S00 DayCasUpRaA04S00 date, sort color(green*.2)) ///
> (line DayCasMeRaA04S00 date, sort lcolor(green)) ///
> , xtitle(Date) xlabel(#`xticks', format(%tdYY-NN-DD) labsize(small)) xlabel(, grid) xlabel(, grid) ///
> xlabel(, angle(forty_five)) ylabel(, format(%9.0fc) labsize(small))  ylabel(, labsize(small) angle(horizontal)) ///
> ytitle(Daily cases) title("COVID-19 daily cases, $country, LANL, single scenario", size(medium)) ///
> xscale(lwidth(vthin) lcolor(gray*.2)) yscale(lwidth(vthin) lcolor(gray*.2)) legend(off) 
{res}{txt}
{com}.            
. graph save "graph 2 COVID-19 daily cases, $country, LANL.gph", replace
{res}{txt}(file graph 2 COVID-19 daily cases, Iran, LANL.gph saved)

{com}. graph export "graph 2 COVID-19 daily cases, $country, LANL.pdf", replace
{txt}(file /Users/farshadpourmalek/Downloads/covir2-main/20210824/code/LANL/graph 2 COVID-19 daily cases, Iran, LANL.pdf written in PDF format)

{com}. 
. 
. 
. 
. * total deaths     
.            
. twoway (rarea TotDeaLoRaA04S00 TotDeaUpRaA04S00 date, sort color(green*.2)) ///
> (line TotDeaMeRaA04S00 date, sort lcolor(green)) ///
> , xtitle(Date) xlabel(#`xticks', format(%tdYY-NN-DD) labsize(small)) xlabel(, grid) xlabel(, grid) ///
> xlabel(, angle(forty_five)) ylabel(, format(%9.0fc) labsize(small))  ylabel(, labsize(small) angle(horizontal)) ///
> ytitle(Total deaths) title("COVID-19 total deaths, $country, LANL, single scenario", size(medium)) ///
> xscale(lwidth(vthin) lcolor(gray*.2)) yscale(lwidth(vthin) lcolor(gray*.2)) legend(off) 
{res}{txt}
{com}.    
. graph save "graph 3 COVID-19 total deaths, $country, LANL.gph", replace
{res}{txt}(file graph 3 COVID-19 total deaths, Iran, LANL.gph saved)

{com}. graph export "graph 3 COVID-19 total deaths, $country, LANL.pdf", replace
{txt}(file /Users/farshadpourmalek/Downloads/covir2-main/20210824/code/LANL/graph 3 COVID-19 total deaths, Iran, LANL.pdf written in PDF format)

{com}. 
. 
. 
. 
. * total cases      
.            
. twoway (rarea TotCasLoRaA04S00 TotCasUpRaA04S00 date, sort color(green*.2)) ///
> (line TotCasMeRaA04S00 date, sort lcolor(green)) ///
> , xtitle(Date) xlabel(#`xticks', format(%tdYY-NN-DD) labsize(small)) xlabel(, grid) xlabel(, grid) ///
> xlabel(, angle(forty_five)) ylabel(, format(%9.0fc) labsize(small))  ylabel(, labsize(small) angle(horizontal)) ///
> ytitle(Total cases) title("COVID-19 total cases, $country, LANL, single scenario", size(medium)) ///
> xscale(lwidth(vthin) lcolor(gray*.2)) yscale(lwidth(vthin) lcolor(gray*.2)) legend(off) 
{res}{txt}
{com}.            
. graph save "graph 4 COVID-19 total cases, $country, LANL.gph", replace
{res}{txt}(file graph 4 COVID-19 total cases, Iran, LANL.gph saved)

{com}. graph export "graph 4 COVID-19 total cases, $country, LANL.pdf", replace
{txt}(file /Users/farshadpourmalek/Downloads/covir2-main/20210824/code/LANL/graph 4 COVID-19 total cases, Iran, LANL.pdf written in PDF format)

{com}. 
. 
. 
. 
. * daily cfr
. 
. twoway (rarea DayCfrLoRaA04S00 DayCfrUpRaA04S00 date, sort color(green*.2)) ///
> (line DayCfrMeRaA04S00 date, sort lcolor(green)) ///
> , xtitle(Date) xlabel(#`xticks', format(%tdYY-NN-DD) labsize(small)) xlabel(, grid) xlabel(, grid) ///
> xlabel(, angle(forty_five)) ylabel(, format(%9.0fc) labsize(small))  ylabel(, labsize(small) angle(horizontal)) ///
> ytitle(Daily CFR) title("COVID-19 daily CFR, $country, LANL, single scenario", size(medium)) ///
> xscale(lwidth(vthin) lcolor(gray*.2)) yscale(lwidth(vthin) lcolor(gray*.2)) legend(off) 
{res}{txt}
{com}.    
. graph save "graph 5 COVID-19 daily CFR, $country, LANL.gph", replace
{res}{txt}(file graph 5 COVID-19 daily CFR, Iran, LANL.gph saved)

{com}. graph export "graph 5 COVID-19 daily CFR, $country, LANL.pdf", replace
{txt}(file /Users/farshadpourmalek/Downloads/covir2-main/20210824/code/LANL/graph 5 COVID-19 daily CFR, Iran, LANL.pdf written in PDF format)

{com}. 
. 
. 
. 
. * daily cfr, 01dec2020 on
. 
. twoway (rarea DayCfrLoRaA04S00 DayCfrUpRaA04S00 date, sort color(green*.2)) ///
> (line DayCfrMeRaA04S00 date, sort lcolor(green)) ///
> if date > td(01dec2020) ///
> , xtitle(Date) xlabel(, format(%tdYY-NN-DD) labsize(small)) xlabel(, grid) xlabel(, grid) ///
> xlabel(, angle(forty_five)) ylabel(, format(%9.2fc) labsize(small))  ylabel(, labsize(small) angle(horizontal)) ///
> ytitle(Daily CFR) title("COVID-19 daily CFR, $country, LANL, single scenario", size(medium)) ///
> xscale(lwidth(vthin) lcolor(gray*.2)) yscale(lwidth(vthin) lcolor(gray*.2)) legend(off) ///
> subtitle("after 2020-12-01", size(small))
{res}{txt}
{com}.    
. graph save "graph 6 COVID-19 daily CFR, $country, LANL, 01dec2020 on.gph", replace
{res}{txt}(file graph 6 COVID-19 daily CFR, Iran, LANL, 01dec2020 on.gph saved)

{com}. graph export "graph 6 COVID-19 daily CFR, $country, LANL, 01dec2020 on.pdf", replace
{txt}(file /Users/farshadpourmalek/Downloads/covir2-main/20210824/code/LANL/graph 6 COVID-19 daily CFR, Iran, LANL, 01dec2020 on.pdf written in PDF format)

{com}. 
. 
. 
. 
. 
. * DayCas DayDea Dea_multip
. 
. twoway ///
> (line DayCasMeRaA04S00  date, sort lcolor(blue)) ///
> (line DayDeaMeRaA04S00  date, sort lcolor(red)) ///
> (line DayDMuMeRaA04S00  date, sort lpattern(dot) lcolor(red)) ///
> , xtitle(Date) xlabel(#`xticks', format(%tdYY-NN-DD) labsize(small)) xlabel(, grid) xlabel(, grid) ///
> xlabel(, angle(forty_five)) ylabel(, format(%12.0fc) labsize(small)) ylabel(, labsize(small) angle(horizontal)) ///
> ytitle(Daily cases and deaths) title("COVID-19 daily cases and deaths, $country, LANL", size(medium)) ///
> xscale(lwidth(vthin) lcolor(gray*.2)) yscale(lwidth(vthin) lcolor(gray*.2)) yscale(titlegap(4)) legend(region(lcolor(none)))  ///
> legend(order(1 "Daily cases" 2 "Daily deaths" 3 "Daily deaths scaled for visualization") size(small)) ///
> subtitle("Daily deaths, scaled = times (means of cases divided by deaths) for visualization only", size(small)) ///
> note("Current scenario, mean estimate")
{res}{txt}
{com}. 
. qui graph save "graph 7 COVID-19 daily deaths and cases $country, LANL.gph", replace
{txt}
{com}. qui graph export "graph 7 COVID-19 daily deaths and cases $country, LANL.pdf", replace
{txt}
{com}. 
. ***
. 
. 
. 
. sort date loc_grand_name 
{txt}
{com}. 
. qui compress
{txt}
{com}. 
. save "country LANL.dta", replace
{txt}file country LANL.dta saved

{com}. 
. 
. 
. view "log country LANL.smcl"
{txt}
{com}. 
. log close
      {txt}name:  {res}<unnamed>
       {txt}log:  {res}/Users/farshadpourmalek/Downloads/covir2-main/20210824/code/LANL/log country LANL.smcl
  {txt}log type:  {res}smcl
 {txt}closed on:  {res}25 Aug 2021, 00:09:58
{txt}{.-}
{smcl}
{txt}{sf}{ul off}