{smcl}
{txt}{sf}{ul off}{.-}
      name:  {res}<unnamed>
       {txt}log:  {res}/Users/farshadpourmalek/Downloads/covir2-main/20210522/code/JOHNEMR/log EMR JOHN.smcl
  {txt}log type:  {res}smcl
 {txt}opened on:  {res}27 May 2021, 02:23:21
{txt}
{com}. 
. ***************************************************************************
. * This is "do EMR JOHN.do"
. 
. * Project: COVID-19 Iran Review No 2
. * Person: Farshad Pourmalek pourmalek_farshad@yahoo.com
. * Time (initial): 2021-02-10
. 
. * OBJECTIVE: Get and prepare Johns Hopkins data for EMR, compare timing of deaths and cases peaks
. ***************************************************************************
. 
. 
. 
. * get Johns Hopkins data for deaths
. 
. import delimited ///
> "https://raw.githubusercontent.com/CSSEGISandData/COVID-19/master/csse_covid_19_data/csse_covid_19_time_series/time_series_covid19_deaths_global.csv" ///
> , clear varnames(1) colrange(2:2)
{res}{text}(1 var, 275 obs)

{com}. 
. save "time_series_covid19_deaths_global col 2.dta", replace
{txt}(note: file time_series_covid19_deaths_global col 2.dta not found)
file time_series_covid19_deaths_global col 2.dta saved

{com}. 
. 
. import delimited ///
> "https://raw.githubusercontent.com/CSSEGISandData/COVID-19/master/csse_covid_19_data/csse_covid_19_time_series/time_series_covid19_deaths_global.csv" ///
> , clear varnames(1) colrange(5)
{res}{text}(491 vars, 275 obs)

{com}. 
. 
. save "time_series_covid19_deaths_global col 5 on.dta", replace
{txt}(note: file time_series_covid19_deaths_global col 5 on.dta not found)
file time_series_covid19_deaths_global col 5 on.dta saved

{com}. 
. 
. use "time_series_covid19_deaths_global col 2.dta", clear 
{txt}
{com}. 
. merge 1:1 _n using "time_series_covid19_deaths_global col 5 on.dta"
{res}
{txt}{col 5}Result{col 38}# of obs.
{col 5}{hline 41}
{col 5}not matched{col 30}{res}               0
{txt}{col 5}matched{col 30}{res}             275{txt}  (_merge==3)
{col 5}{hline 41}

{com}. 
. rename countryregion loc_grand_name
{res}{txt}
{com}. 
. qui destring *, replace
{txt}
{com}. 
. 
. 
. * gen global sum
. 
. save "global JOHN deaths wo sum.dta", replace
{txt}(note: file global JOHN deaths wo sum.dta not found)
file global JOHN deaths wo sum.dta saved

{com}. 
. drop loc_grand_name
{txt}
{com}. 
. qui destring *, replace
{txt}
{com}.  
. collapse (sum) *
{txt}
{com}. 
. gen loc_grand_name = "global"
{txt}
{com}.   
. save "global JOHN deaths sum.dta", replace
{txt}(note: file global JOHN deaths sum.dta not found)
file global JOHN deaths sum.dta saved

{com}. 
. *
. 
. 
. use "global JOHN deaths wo sum.dta", clear
{txt}
{com}. 
. 
. 
. keep if ///
> loc_grand_name == "Algeria" | ///
> loc_grand_name == "Bahrain" | ///
> loc_grand_name == "Djibouti" | ///
> loc_grand_name == "Egypt" | ///
> loc_grand_name == "Iran" | ///
> loc_grand_name == "Iraq" | ///
> loc_grand_name == "Israel" | ///
> loc_grand_name == "Jordan" | ///
> loc_grand_name == "Kuwait" | ///
> loc_grand_name == "Lebanon" | ///
> loc_grand_name == "Libya" | ///
> loc_grand_name == "Oman" | ///
> loc_grand_name == "Palestine" | ///
> loc_grand_name == "Qatar" | ///
> loc_grand_name == "Saudi Arabia" | ///
> loc_grand_name == "Syria" | ///
> loc_grand_name == "Tunisia" | ///
> loc_grand_name == "United Arab Emirates" | ///
> loc_grand_name == "Yemen" 
{txt}(257 observations deleted)

{com}. 
. 
. * gen EMR sum
. 
. save "EMR JOHN deaths wo sum.dta", replace
{txt}(note: file EMR JOHN deaths wo sum.dta not found)
file EMR JOHN deaths wo sum.dta saved

{com}. 
. drop loc_grand_name
{txt}
{com}. 
. qui destring *, replace
{txt}
{com}.  
. collapse (sum) *
{txt}
{com}. 
. gen loc_grand_name = "EMR"
{txt}
{com}.   
. save "EMR JOHN deaths sum.dta", replace
{txt}(note: file EMR JOHN deaths sum.dta not found)
file EMR JOHN deaths sum.dta saved

{com}. 
. 
. * 
. 
. use "EMR JOHN deaths wo sum.dta", clear 
{txt}
{com}. 
. qui append using "EMR JOHN deaths sum.dta"
{txt}
{com}. 
. qui append using "global JOHN deaths sum.dta"
{txt}
{com}. 
. 
. *
. 
. 
. order loc_grand_name, last
{txt}
{com}. 
. gen counter = _n
{txt}
{com}. 
. reshape long v, i(loc_grand_name) 
{txt}(note: j = 1 2 3 4 5 6 7 8 9 10 11 12 13 14 15 16 17 18 19 20 21 22 23 24 25 26 27 28 29 30 31 32 33 34 35 36 37 38 39 40 41 42 43 44 45 46 47 48 49 50 51 52 53 54 55 56 57 58 59 60 61 62 63 64 65 66 67 68 69 70 71 72 73 74 75 76 77 78 79 80 81 82 83 84 85 86 87 88 89 90 91 92 93 94 95 96 97 98 99 100 101 102 103 104 105 106 107 108 109 110 111 112 113 114 115 116 117 118 119 120 121 122 123 124 125 126 127 128 129 130 131 132 133 134 135 136 137 138 139 140 141 142 143 144 145 146 147 148 149 150 151 152 153 154 155 156 157 158 159 160 161 162 163 164 165 166 167 168 169 170 171 172 173 174 175 176 177 178 179 180 181 182 183 184 185 186 187 188 189 190 191 192 193 194 195 196 197 198 199 200 201 202 203 204 205 206 207 208 209 210 211 212 213 214 215 216 217 218 219 220 221 222 223 224 225 226 227 228 229 230 231 232 233 234 235 236 237 238 239 240 241 242 243 244 245 246 247 248 249 250 251 252 253 254 255 256 257 258 259 260 261 262 263 264 265 266 267 268 269 270 271 272 273 274 275 276 277 278 279 280 281 282 283 284 285 286 287 288 289 290 291 292 293 294 295 296 297 298 299 300 301 302 303 304 305 306 307 308 309 310 311 312 313 314 315 316 317 318 319 320 321 322 323 324 325 326 327 328 329 330 331 332 333 334 335 336 337 338 339 340 341 342 343 344 345 346 347 348 349 350 351 352 353 354 355 356 357 358 359 360 361 362 363 364 365 366 367 368 369 370 371 372 373 374 375 376 377 378 379 380 381 382 383 384 385 386 387 388 389 390 391 392 393 394 395 396 397 398 399 400 401 402 403 404 405 406 407 408 409 410 411 412 413 414 415 416 417 418 419 420 421 422 423 424 425 426 427 428 429 430 431 432 433 434 435 436 437 438 439 440 441 442 443 444 445 446 447 448 449 450 451 452 453 454 455 456 457 458 459 460 461 462 463 464 465 466 467 468 469 470 471 472 473 474 475 476 477 478 479 480 481 482 483 484 485 486 487 488 489 490 491)

Data{col 36}wide{col 43}->{col 48}long
{hline 77}
Number of obs.                 {res}      20   {txt}->{res}    9820
{txt}Number of variables            {res}     494   {txt}->{res}       5
{txt}j variable (491 values)                   ->   {res}_j
{txt}xij variables:
                         {res}v1 v2 ... v491   {txt}->   {res}v
{txt}{hline 77}

{com}. 
. drop counter 
{txt}
{com}. 
. codebook _j

{txt}{hline}
{res}_j{right:(unlabeled)}
{txt}{hline}

{col 19}type:  numeric ({res}int{txt})

{col 18}range:  [{res}1{txt},{res}491{txt}]{col 55}units:  {res}1
{col 10}{txt}unique values:  {res}491{col 51}{txt}missing .:  {res}0{txt}/{res}9,820

{txt}{col 19}mean:{res}{col 26}     246
{txt}{col 15}std. dev:{res}{col 26} 141.746

{txt}{col 12}percentiles:{col 32}10%{col 42}25%{col 52}50%{col 62}75%{col 72}90%
{res}{col 27}      50{col 37}     123{col 47}     246{col 57}     369{col 67}     442
{txt}
{com}. 
. gen date = date("22 Jan 2020", "DMY")
{txt}
{com}. 
. replace date = date + _j - 1
{txt}(9,800 real changes made)

{com}. 
. format date %td
{txt}
{com}. 
. codebook date

{txt}{hline}
{res}date{right:(unlabeled)}
{txt}{hline}

{col 19}type:  numeric daily date ({res}float{txt})

{col 18}range:  [{res}21936{txt},{res}22426{txt}]{col 55}units:  {res}1
{col 8}{txt}or equivalently:  [{res}22jan2020{txt},{res}26may2021{txt}]{col 55}units:  {res}days
{col 10}{txt}unique values:  {res}491{col 51}{txt}missing .:  {res}0{txt}/{res}9,820

{txt}{col 19}mean:{res}{col 26}   22181{txt} = {res}23sep2020{txt}
{col 15}std. dev:{res}{col 26} 141.746

{txt}{col 12}percentiles:{col 32}10%{col 42}25%{col 52}50%{col 62}75%{col 72}90%
{res}{col 27}   21985{col 37}   22058{col 47}   22181{col 57}   22304{col 67}   22377
{col 26}11mar2020{col 36}23may2020{col 46}23sep2020{col 56}24jan2021{col 66}07apr2021
{txt}
{com}. 
. order date 
{txt}
{com}. 
. rename v TotDeaMeRaA00S00
{res}{txt}
{com}. 
. label var TotDeaMeRaA00S00 "Total Deaths JOHN"
{txt}
{com}. 
. destring TotDeaMeRaA00S00, replace
{txt}TotDeaMeRaA00S00 already numeric; no {res}replace
{txt}
{com}. 
. list loc_grand_name TotDeaMeRaA00S00 if date == td(19feb2020) // Iran should be 2
{txt}
      {c TLC}{hline 22}{c -}{hline 10}{c TRC}
      {c |} {res}      loc_grand_name   TotDe~00 {txt}{c |}
      {c LT}{hline 22}{c -}{hline 10}{c RT}
  29. {c |} {res}             Algeria          0 {txt}{c |}
 520. {c |} {res}             Bahrain          0 {txt}{c |}
1011. {c |} {res}            Djibouti          0 {txt}{c |}
1502. {c |} {res}                 EMR          2 {txt}{c |}
1993. {c |} {res}               Egypt          0 {txt}{c |}
      {c LT}{hline 22}{c -}{hline 10}{c RT}
2484. {c |} {res}                Iran          2 {txt}{c |}
2975. {c |} {res}                Iraq          0 {txt}{c |}
3466. {c |} {res}              Israel          0 {txt}{c |}
3957. {c |} {res}              Jordan          0 {txt}{c |}
4448. {c |} {res}              Kuwait          0 {txt}{c |}
      {c LT}{hline 22}{c -}{hline 10}{c RT}
4939. {c |} {res}             Lebanon          0 {txt}{c |}
5430. {c |} {res}               Libya          0 {txt}{c |}
5921. {c |} {res}                Oman          0 {txt}{c |}
6412. {c |} {res}               Qatar          0 {txt}{c |}
6903. {c |} {res}        Saudi Arabia          0 {txt}{c |}
      {c LT}{hline 22}{c -}{hline 10}{c RT}
7394. {c |} {res}               Syria          0 {txt}{c |}
7885. {c |} {res}             Tunisia          0 {txt}{c |}
8376. {c |} {res}United Arab Emirates          0 {txt}{c |}
8867. {c |} {res}               Yemen          0 {txt}{c |}
9358. {c |} {res}              global       2123 {txt}{c |}
      {c BLC}{hline 22}{c -}{hline 10}{c BRC}

{com}. 
. gen DayDeaMeRaA00S00 =  TotDeaMeRaA00S00[_n] - TotDeaMeRaA00S00[_n-1]
{txt}(1 missing value generated)

{com}. 
. label var DayDeaMeRaA00S00 "Daily Deaths JOHN"
{txt}
{com}. 
. replace DayDeaMeRaA00S00 = TotDeaMeRaA00S00 if _j == 1
{txt}(20 real changes made)

{com}. 
. drop _j _merge
{txt}
{com}. 
. 
. order date loc_grand_name DayDeaMeRaA00S00 TotDeaMeRaA00S00 
{txt}
{com}.                                         
. 
. sort loc_grand_name date
{txt}
{com}. 
. save "EMR JOHN deaths.dta", replace
{txt}(note: file EMR JOHN deaths.dta not found)
file EMR JOHN deaths.dta saved

{com}. 
. 
. 
. 
. * get Johns Hopkins data for cases
. 
. 
. import delimited using ///
> "https://raw.githubusercontent.com/CSSEGISandData/COVID-19/master/csse_covid_19_data/csse_covid_19_time_series/time_series_covid19_confirmed_global.csv" ///
> , clear varnames(1) colrange(2:2)
{res}{text}(1 var, 275 obs)

{com}. 
. save "time_series_covid19_confirmed_global col 2.dta", replace 
{txt}(note: file time_series_covid19_confirmed_global col 2.dta not found)
file time_series_covid19_confirmed_global col 2.dta saved

{com}. 
. 
. import delimited using ///
> "https://raw.githubusercontent.com/CSSEGISandData/COVID-19/master/csse_covid_19_data/csse_covid_19_time_series/time_series_covid19_confirmed_global.csv" ///
> , clear varnames(1) colrange(5)
{res}{text}(491 vars, 275 obs)

{com}. 
. save "time_series_covid19_confirmed_global col 5 on.dta", replace 
{txt}(note: file time_series_covid19_confirmed_global col 5 on.dta not found)
file time_series_covid19_confirmed_global col 5 on.dta saved

{com}. 
. 
. use "time_series_covid19_confirmed_global col 2.dta", clear 
{txt}
{com}. 
. merge 1:1 _n using "time_series_covid19_confirmed_global col 5 on.dta"
{res}
{txt}{col 5}Result{col 38}# of obs.
{col 5}{hline 41}
{col 5}not matched{col 30}{res}               0
{txt}{col 5}matched{col 30}{res}             275{txt}  (_merge==3)
{col 5}{hline 41}

{com}. 
. rename countryregion loc_grand_name
{res}{txt}
{com}. 
. qui destring *, replace
{txt}
{com}. 
. 
. 
. * gen global sum
. 
. save "global JOHN cases wo sum.dta", replace
{txt}(note: file global JOHN cases wo sum.dta not found)
file global JOHN cases wo sum.dta saved

{com}. 
. drop loc_grand_name
{txt}
{com}. 
. qui destring *, replace
{txt}
{com}.  
. collapse (sum) *
{txt}
{com}. 
. gen loc_grand_name = "global"
{txt}
{com}.   
. save "global JOHN cases sum.dta", replace
{txt}(note: file global JOHN cases sum.dta not found)
file global JOHN cases sum.dta saved

{com}. 
. *
. 
. 
. use "global JOHN cases wo sum.dta", clear
{txt}
{com}. 
. 
. 
. 
. keep if ///
> loc_grand_name == "Algeria" | ///
> loc_grand_name == "Bahrain" | ///
> loc_grand_name == "Djibouti" | ///
> loc_grand_name == "Egypt" | ///
> loc_grand_name == "Iran" | ///
> loc_grand_name == "Iraq" | ///
> loc_grand_name == "Israel" | ///
> loc_grand_name == "Jordan" | ///
> loc_grand_name == "Kuwait" | ///
> loc_grand_name == "Lebanon" | ///
> loc_grand_name == "Libya" | ///
> loc_grand_name == "Oman" | ///
> loc_grand_name == "Palestine" | ///
> loc_grand_name == "Qatar" | ///
> loc_grand_name == "Saudi Arabia" | ///
> loc_grand_name == "Syria" | ///
> loc_grand_name == "Tunisia" | ///
> loc_grand_name == "United Arab Emirates" | ///
> loc_grand_name == "Yemen" 
{txt}(257 observations deleted)

{com}. 
. 
. 
. * gen EMR sum
. 
. save "EMR JOHN cases wo sum.dta", replace
{txt}(note: file EMR JOHN cases wo sum.dta not found)
file EMR JOHN cases wo sum.dta saved

{com}. 
. drop loc_grand_name
{txt}
{com}. 
. qui destring *, replace
{txt}
{com}.  
. collapse (sum) *
{txt}
{com}. 
. gen loc_grand_name = "EMR"
{txt}
{com}.   
. save "EMR JOHN cases sum.dta", replace
{txt}(note: file EMR JOHN cases sum.dta not found)
file EMR JOHN cases sum.dta saved

{com}. 
. 
. * 
. 
. use "EMR JOHN cases wo sum.dta", clear 
{txt}
{com}. 
. qui append using "EMR JOHN cases sum.dta"
{txt}
{com}. 
. qui append using "global JOHN cases sum.dta"
{txt}
{com}. 
. 
. *
. 
. 
. 
. order loc_grand_name, last
{txt}
{com}. 
. gen counter = _n
{txt}
{com}. 
. reshape long v, i(loc_grand_name) 
{txt}(note: j = 1 2 3 4 5 6 7 8 9 10 11 12 13 14 15 16 17 18 19 20 21 22 23 24 25 26 27 28 29 30 31 32 33 34 35 36 37 38 39 40 41 42 43 44 45 46 47 48 49 50 51 52 53 54 55 56 57 58 59 60 61 62 63 64 65 66 67 68 69 70 71 72 73 74 75 76 77 78 79 80 81 82 83 84 85 86 87 88 89 90 91 92 93 94 95 96 97 98 99 100 101 102 103 104 105 106 107 108 109 110 111 112 113 114 115 116 117 118 119 120 121 122 123 124 125 126 127 128 129 130 131 132 133 134 135 136 137 138 139 140 141 142 143 144 145 146 147 148 149 150 151 152 153 154 155 156 157 158 159 160 161 162 163 164 165 166 167 168 169 170 171 172 173 174 175 176 177 178 179 180 181 182 183 184 185 186 187 188 189 190 191 192 193 194 195 196 197 198 199 200 201 202 203 204 205 206 207 208 209 210 211 212 213 214 215 216 217 218 219 220 221 222 223 224 225 226 227 228 229 230 231 232 233 234 235 236 237 238 239 240 241 242 243 244 245 246 247 248 249 250 251 252 253 254 255 256 257 258 259 260 261 262 263 264 265 266 267 268 269 270 271 272 273 274 275 276 277 278 279 280 281 282 283 284 285 286 287 288 289 290 291 292 293 294 295 296 297 298 299 300 301 302 303 304 305 306 307 308 309 310 311 312 313 314 315 316 317 318 319 320 321 322 323 324 325 326 327 328 329 330 331 332 333 334 335 336 337 338 339 340 341 342 343 344 345 346 347 348 349 350 351 352 353 354 355 356 357 358 359 360 361 362 363 364 365 366 367 368 369 370 371 372 373 374 375 376 377 378 379 380 381 382 383 384 385 386 387 388 389 390 391 392 393 394 395 396 397 398 399 400 401 402 403 404 405 406 407 408 409 410 411 412 413 414 415 416 417 418 419 420 421 422 423 424 425 426 427 428 429 430 431 432 433 434 435 436 437 438 439 440 441 442 443 444 445 446 447 448 449 450 451 452 453 454 455 456 457 458 459 460 461 462 463 464 465 466 467 468 469 470 471 472 473 474 475 476 477 478 479 480 481 482 483 484 485 486 487 488 489 490 491)

Data{col 36}wide{col 43}->{col 48}long
{hline 77}
Number of obs.                 {res}      20   {txt}->{res}    9820
{txt}Number of variables            {res}     494   {txt}->{res}       5
{txt}j variable (491 values)                   ->   {res}_j
{txt}xij variables:
                         {res}v1 v2 ... v491   {txt}->   {res}v
{txt}{hline 77}

{com}. 
. drop counter 
{txt}
{com}. 
. codebook _j

{txt}{hline}
{res}_j{right:(unlabeled)}
{txt}{hline}

{col 19}type:  numeric ({res}int{txt})

{col 18}range:  [{res}1{txt},{res}491{txt}]{col 55}units:  {res}1
{col 10}{txt}unique values:  {res}491{col 51}{txt}missing .:  {res}0{txt}/{res}9,820

{txt}{col 19}mean:{res}{col 26}     246
{txt}{col 15}std. dev:{res}{col 26} 141.746

{txt}{col 12}percentiles:{col 32}10%{col 42}25%{col 52}50%{col 62}75%{col 72}90%
{res}{col 27}      50{col 37}     123{col 47}     246{col 57}     369{col 67}     442
{txt}
{com}. 
. gen date = date("22 Jan 2020", "DMY")
{txt}
{com}. 
. replace date = date + _j - 1
{txt}(9,800 real changes made)

{com}. 
. format date %td
{txt}
{com}. 
. codebook date

{txt}{hline}
{res}date{right:(unlabeled)}
{txt}{hline}

{col 19}type:  numeric daily date ({res}float{txt})

{col 18}range:  [{res}21936{txt},{res}22426{txt}]{col 55}units:  {res}1
{col 8}{txt}or equivalently:  [{res}22jan2020{txt},{res}26may2021{txt}]{col 55}units:  {res}days
{col 10}{txt}unique values:  {res}491{col 51}{txt}missing .:  {res}0{txt}/{res}9,820

{txt}{col 19}mean:{res}{col 26}   22181{txt} = {res}23sep2020{txt}
{col 15}std. dev:{res}{col 26} 141.746

{txt}{col 12}percentiles:{col 32}10%{col 42}25%{col 52}50%{col 62}75%{col 72}90%
{res}{col 27}   21985{col 37}   22058{col 47}   22181{col 57}   22304{col 67}   22377
{col 26}11mar2020{col 36}23may2020{col 46}23sep2020{col 56}24jan2021{col 66}07apr2021
{txt}
{com}. 
. order date 
{txt}
{com}. 
. rename v TotCasMeRaA00S00
{res}{txt}
{com}. 
. label var TotCasMeRaA00S00 "Total Cases JOHN"
{txt}
{com}. 
. gen DayCasMeRaA00S00 =  TotCasMeRaA00S00[_n] - TotCasMeRaA00S00[_n-1]
{txt}(1 missing value generated)

{com}. 
. label var DayCasMeRaA00S00 "Daily Cases JOHN"
{txt}
{com}. 
. replace DayCasMeRaA00S00 = TotCasMeRaA00S00 if _j == 1
{txt}(20 real changes made)

{com}. 
. drop _j _merge
{txt}
{com}. 
. 
. order date loc_grand_name DayCasMeRaA00S00 TotCasMeRaA00S00 
{txt}
{com}. 
. sort loc_grand_name date
{txt}
{com}. 
. compress
  {txt}variable {bf}date{sf} was {bf}{res}float{sf}{txt} now {bf}{res}int{sf}
  {txt}variable {bf}TotCasMeRaA00S00{sf} was {bf}{res}double{sf}{txt} now {bf}{res}long{sf}
  {txt}variable {bf}loc_grand_name{sf} was {bf}{res}str32{sf}{txt} now {bf}{res}str20{sf}
{txt}  (176,760 bytes saved)

{com}. 
. save "EMR JOHN Cases.dta", replace
{txt}(note: file EMR JOHN Cases.dta not found)
file EMR JOHN Cases.dta saved

{com}. 
. 
. * merge deaths and cases 
. 
. use "EMR JOHN deaths.dta", clear 
{txt}
{com}. 
. merge 1:1 loc_grand_name date using "EMR JOHN Cases.dta"
{res}
{txt}{col 5}Result{col 38}# of obs.
{col 5}{hline 41}
{col 5}not matched{col 30}{res}               0
{txt}{col 5}matched{col 30}{res}           9,820{txt}  (_merge==3)
{col 5}{hline 41}

{com}. 
. drop _merge
{txt}
{com}. 
. 
. 
. 
. 
. replace loc_grand_name = "Saudi_Arabia" if loc_grand_name == "Saudi Arabia"
{txt}(491 real changes made)

{com}. replace loc_grand_name = "UAE" if loc_grand_name == "United Arab Emirates"
{txt}(491 real changes made)

{com}. 
. replace loc_grand_name = "1_Global" if loc_grand_name == "global"
{txt}(491 real changes made)

{com}. replace loc_grand_name = "2_EMR" if loc_grand_name == "EMR"
{txt}(491 real changes made)

{com}. 
. 
. 
. 
. * gen "Daily cases mean div by daily deaths mean JOHN DayCbD" for visulization of temporal relation of deaths and cases peaks 
. 
. 
. levelsof loc_grand_name, local(levels)
{txt}`"1_Global"' `"2_EMR"' `"Algeria"' `"Bahrain"' `"Djibouti"' `"Egypt"' `"Iran"' `"Iraq"' `"Israel"' `"Jordan"' `"Kuwait"' `"Lebanon"' `"Libya"' `"Oman"' `"Qatar"' `"Saudi_Arabia"' `"Syria"' `"Tunisia"' `"UAE"' `"Yemen"'

{com}. 
. foreach l of local levels {c -(}
{txt}  2{com}. 
.         di "`l'"
{txt}  3{com}.     
.         di "DayDeaMeRaA00S00"
{txt}  4{com}.         summ DayDeaMeRaA00S00 if loc_grand_name == "`l'"
{txt}  5{com}.         gen DayDeMMeRaA00S00_`l' = r(mean)
{txt}  6{com}.         label var DayDeMMeRaA00S00_`l' "Daily deaths mean JOHN DayDeM"
{txt}  7{com}.         di "                            "
{txt}  8{com}. 
.         di "DayCasMeRaA00S00"
{txt}  9{com}.         summ DayCasMeRaA00S00 if loc_grand_name == "`l'"
{txt} 10{com}.         gen DayCaMMeRaA00S00_`l' = r(mean)
{txt} 11{com}.         label var DayCaMMeRaA00S00_`l' "Daily cases mean JOHN DayCaM"
{txt} 12{com}.         di "                            "
{txt} 13{com}. 
.         di "DayCbDMeRaA00S00_(location)"
{txt} 14{com}.         gen DayCbDMeRaA00S00_`l' = DayCaMMeRaA00S00_`l' / DayDeMMeRaA00S00_`l'
{txt} 15{com}.         label var DayCbDMeRaA00S00_`l' "Daily cases mean div by daily deaths mean JOHN DayCbD"
{txt} 16{com}.         summ DayCbDMeRaA00S00_`l' if loc_grand_name == "`l'"
{txt} 17{com}.         di "                            "
{txt} 18{com}. 
.         di "DayDea_multip_(location)"
{txt} 19{com}.         gen DayDea_multip_`l' = DayDeaMeRaA00S00 * DayCbDMeRaA00S00_`l' if loc_grand_name == "`l'"
{txt} 20{com}.     label var DayDea_multip_`l' "Daily deaths scaled (times means of cases by deaths) only for visualization JOHN"
{txt} 21{com}.         summ DayDea_multip_`l' if loc_grand_name == "`l'"
{txt} 22{com}.         di "                            "
{txt} 23{com}.         
.         di "divider---------------------"
{txt} 24{com}.         di "                            "
{txt} 25{com}. 
. {c )-}
1_Global
DayDeaMeRaA00S00

{txt}    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayDeaMeR~00 {c |}{res}        491    7125.138    4299.909          1      17906
                            
DayCasMeRaA00S00

{txt}    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayCasMeR~00 {c |}{res}        491    342991.3    255554.1         98    1498213
                            
DayCbDMeRaA00S00_(location)

{txt}    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayCbDMeRa~l {c |}{res}        491    48.13819           0   48.13819   48.13819
                            
DayDea_multip_(location)
{txt}(9,329 missing values generated)

    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayDea_mul~l {c |}{res}        491    342991.3    206989.8   48.13819   861962.4
                            
divider---------------------
                            
2_EMR
DayDeaMeRaA00S00

{txt}    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayDeaMeR~00 {c |}{res}        491    347.0998    204.6597          0        850
                            
DayCasMeRaA00S00

{txt}    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayCasMeR~00 {c |}{res}        491    18478.01     12406.4          0      51903
                            
DayCbDMeRaA00S00_(location)

{txt}    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayCbDMeRa~R {c |}{res}        491    53.23544           0   53.23544   53.23544
                            
DayDea_multip_(location)
{txt}(9,329 missing values generated)

    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayDea_mul~R {c |}{res}        491    18478.01    10895.15          0   45250.13
                            
divider---------------------
                            
Algeria
DayDeaMeRaA00S00

{txt}    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayDeaMeR~00 {c |}{res}        491     7.00611    5.014058          0         30
                            
DayCasMeRaA00S00

{txt}    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayCasMeR~00 {c |}{res}        491    259.9715     231.282          0       1133
                            
DayCbDMeRaA00S00_(location)

{txt}    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayCbDMeRa~a {c |}{res}        491     37.1064           0    37.1064    37.1064
                            
DayDea_multip_(location)
{txt}(9,329 missing values generated)

    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayDea_mul~a {c |}{res}        491    259.9715    186.0536          0   1113.192
                            
divider---------------------
                            
Bahrain
DayDeaMeRaA00S00

{txt}    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayDeaMeR~00 {c |}{res}        491    1.796334    2.744803          0         28
                            
DayCasMeRaA00S00

{txt}    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayCasMeR~00 {c |}{res}        491    461.1324    470.3657          0       3177
                            
DayCbDMeRaA00S00_(location)

{txt}    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayCbDMeRa~n {c |}{res}        491    256.7075           0   256.7075   256.7075
                            
DayDea_multip_(location)
{txt}(9,329 missing values generated)

    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayDea_mul~n {c |}{res}        491    461.1324    704.6116          0    7187.81
                            
divider---------------------
                            
Djibouti
DayDeaMeRaA00S00

{txt}    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayDeaMeR~00 {c |}{res}        491     .311609    .9382178          0          9
                            
DayCasMeRaA00S00

{txt}    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayCasMeR~00 {c |}{res}        491     23.4501    50.09875          0        415
                            
DayCbDMeRaA00S00_(location)

{txt}    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayCbDMeRa~i {c |}{res}        491     75.2549           0    75.2549    75.2549
                            
DayDea_multip_(location)
{txt}(9,329 missing values generated)

    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayDea_mul~i {c |}{res}        491     23.4501    70.60549          0   677.2941
                            
divider---------------------
                            
Egypt
DayDeaMeRaA00S00

{txt}    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayDeaMeR~00 {c |}{res}        491     30.2444    23.51147          0         97
                            
DayCasMeRaA00S00

{txt}    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayCasMeR~00 {c |}{res}        491    523.9817    449.2359          0       1774
                            
DayCbDMeRaA00S00_(location)

{txt}    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayCbDMeRa~t {c |}{res}        491    17.32492           0   17.32492   17.32492
                            
DayDea_multip_(location)
{txt}(9,329 missing values generated)

    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayDea_mul~t {c |}{res}        491    523.9817    407.3342          0   1680.517
                            
divider---------------------
                            
Iran
DayDeaMeRaA00S00

{txt}    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayDeaMeR~00 {c |}{res}        491    161.3422    123.0396          0        496
                            
DayCasMeRaA00S00

{txt}    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayCasMeR~00 {c |}{res}        491     5836.79    5608.355          0      25582
                            
DayCbDMeRaA00S00_(location)

{txt}    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayCbDMeR~an {c |}{res}        491    36.17647           0   36.17647   36.17647
                            
DayDea_multip_(location)
{txt}(9,329 missing values generated)

    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayDea_mu~an {c |}{res}        491     5836.79    4451.137          0   17943.53
                            
divider---------------------
                            
Iraq
DayDeaMeRaA00S00

{txt}    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayDeaMeR~00 {c |}{res}        491    33.13035    30.64569          0        122
                            
DayCasMeRaA00S00

{txt}    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayCasMeR~00 {c |}{res}        491    2406.717    2128.878          0       8696
                            
DayCbDMeRaA00S00_(location)

{txt}    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayCbDMeRa~q {c |}{res}        491    72.64388           0   72.64388   72.64388
                            
DayDea_multip_(location)
{txt}(9,329 missing values generated)

    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayDea_mul~q {c |}{res}        491    2406.717    2226.222          0   8862.554
                            
divider---------------------
                            
Israel
DayDeaMeRaA00S00

{txt}    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayDeaMeR~00 {c |}{res}        491    13.04684    15.67879         -4        101
                            
DayCasMeRaA00S00

{txt}    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayCasMeR~00 {c |}{res}        491    1709.589    2300.977        -53      11934
                            
DayCbDMeRaA00S00_(location)

{txt}    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayCbDMeR~el {c |}{res}        491    131.0347           0   131.0347   131.0347
                            
DayDea_multip_(location)
{txt}(9,329 missing values generated)

    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayDea_mu~el {c |}{res}        491    1709.589    2054.464  -524.1386    13234.5
                            
divider---------------------
                            
Jordan
DayDeaMeRaA00S00

{txt}    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayDeaMeR~00 {c |}{res}        491    19.11202    27.32282          0        111
                            
DayCasMeRaA00S00

{txt}    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayCasMeR~00 {c |}{res}        491    1489.686     2186.61       -110       9535
                            
DayCbDMeRaA00S00_(location)

{txt}    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayCbDMe~dan {c |}{res}        491    77.94501           0   77.94501   77.94501
                            
DayDea_multip_(location)
{txt}(9,329 missing values generated)

    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayDea_m~dan {c |}{res}        491    1489.686    2129.678          0   8651.896
                            
divider---------------------
                            
Kuwait
DayDeaMeRaA00S00

{txt}    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayDeaMeR~00 {c |}{res}        491    3.566191    3.219392          0         14
                            
DayCasMeRaA00S00

{txt}    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayCasMeR~00 {c |}{res}        491    617.1874    430.0546          0       1716
                            
DayCbDMeRaA00S00_(location)

{txt}    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayCbDMeR~it {c |}{res}        491    173.0663           0   173.0663   173.0663
                            
DayDea_multip_(location)
{txt}(9,329 missing values generated)

    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayDea_mu~it {c |}{res}        491    617.1874    557.1682          0   2422.927
                            
divider---------------------
                            
Lebanon
DayDeaMeRaA00S00

{txt}    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayDeaMeR~00 {c |}{res}        491    15.67617    25.41386          0        351
                            
DayCasMeRaA00S00

{txt}    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayCasMeR~00 {c |}{res}        491    1098.312    1284.792          0       6154
                            
DayCbDMeRaA00S00_(location)

{txt}    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayCbDMeR~on {c |}{res}        491    70.06249           0   70.06249   70.06249
                            
DayDea_multip_(location)
{txt}(9,329 missing values generated)

    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayDea_mu~on {c |}{res}        491    1098.312    1780.558          0   24591.94
                            
divider---------------------
                            
Libya
DayDeaMeRaA00S00

{txt}    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayDeaMeR~00 {c |}{res}        491    6.344196    8.548163         -3         53
                            
DayCasMeRaA00S00

{txt}    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayCasMeR~00 {c |}{res}        491     375.053    384.2408          0       1639
                            
DayCbDMeRaA00S00_(location)

{txt}    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayCbDMeR~ya {c |}{res}        491     59.1175           0    59.1175    59.1175
                            
DayDea_multip_(location)
{txt}(9,329 missing values generated)

    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayDea_mu~ya {c |}{res}        491     375.053     505.346  -177.3525   3133.227
                            
divider---------------------
                            
Oman
DayDeaMeRaA00S00

{txt}    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayDeaMeR~00 {c |}{res}        491    4.670061     7.79489          0         67
                            
DayCasMeRaA00S00

{txt}    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayCasMeR~00 {c |}{res}        491     433.613    579.6435          0       3544
                            
DayCbDMeRaA00S00_(location)

{txt}    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayCbDMe~man {c |}{res}        491    92.84954           0   92.84954   92.84954
                            
DayDea_multip_(location)
{txt}(9,329 missing values generated)

    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayDea_m~man {c |}{res}        491     433.613    723.7519          0   6220.919
                            
divider---------------------
                            
Qatar
DayDeaMeRaA00S00

{txt}    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayDeaMeR~00 {c |}{res}        491    1.124236    1.844695          0         10
                            
DayCasMeRaA00S00

{txt}    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayCasMeR~00 {c |}{res}        491    440.7271    434.5498          0       2355
                            
DayCbDMeRaA00S00_(location)

{txt}    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayCbDMeRa~r {c |}{res}        491    392.0236           0   392.0236   392.0236
                            
DayDea_multip_(location)
{txt}(9,329 missing values generated)

    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayDea_mul~r {c |}{res}        491    440.7271    723.1641          0   3920.236
                            
divider---------------------
                            
Saudi_Arabia
DayDeaMeRaA00S00

{txt}    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayDeaMeR~00 {c |}{res}        491    14.85743    13.40241          0         58
                            
DayCasMeRaA00S00

{txt}    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayCasMeR~00 {c |}{res}        491    905.8656    1038.451          0       4919
                            
DayCbDMeRaA00S00_(location)

{txt}    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayCbDMe~bia {c |}{res}        491    60.97053           0   60.97053   60.97053
                            
DayDea_multip_(location)
{txt}(9,329 missing values generated)

    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayDea_m~bia {c |}{res}        491    905.8656    817.1519          0   3536.291
                            
divider---------------------
                            
Syria
DayDeaMeRaA00S00

{txt}    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayDeaMeR~00 {c |}{res}        491    3.564155    3.822791          0         20
                            
DayCasMeRaA00S00

{txt}    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayCasMeR~00 {c |}{res}        491    49.52138     45.3661          0        172
                            
DayCbDMeRaA00S00_(location)

{txt}    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayCbDM~yria {c |}{res}        491    13.89429           0   13.89429   13.89429
                            
DayDea_multip_(location)
{txt}(9,329 missing values generated)

    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayDea_~yria {c |}{res}        491    49.52138    53.11495          0   277.8857
                            
divider---------------------
                            
Tunisia
DayDeaMeRaA00S00

{txt}    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayDeaMeR~00 {c |}{res}        491    25.25051    33.05753          0        217
                            
DayCasMeRaA00S00

{txt}    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayCasMeR~00 {c |}{res}        491    690.1283    889.1216          0       5752
                            
DayCbDMeRaA00S00_(location)

{txt}    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayCbDMe~sia {c |}{res}        491    27.33126           0   27.33126   27.33126
                            
DayDea_multip_(location)
{txt}(9,329 missing values generated)

    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayDea_m~sia {c |}{res}        491    690.1283    903.5041          0   5930.884
                            
divider---------------------
                            
UAE
DayDeaMeRaA00S00

{txt}    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayDeaMeR~00 {c |}{res}        491    3.382892     3.87878          0         20
                            
DayCasMeRaA00S00

{txt}    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayCasMeR~00 {c |}{res}        491    1142.664    1001.368          0       3977
                            
DayCbDMeRaA00S00_(location)

{txt}    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayCbDMeRa~E {c |}{res}        491    337.7772           0   337.7772   337.7772
                            
DayDea_multip_(location)
{txt}(9,329 missing values generated)

    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayDea_mul~E {c |}{res}        491    1142.664    1310.163          0   6755.544
                            
divider---------------------
                            
Yemen
DayDeaMeRaA00S00

{txt}    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayDeaMeR~00 {c |}{res}        491    2.674134    5.241876          0         52
                            
DayCasMeRaA00S00

{txt}    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayCasMeR~00 {c |}{res}        491    13.62118    25.11019         -1        174
                            
DayCbDMeRaA00S00_(location)

{txt}    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayCbDMeR~en {c |}{res}        491    5.093678           0   5.093678   5.093678
                            
DayDea_multip_(location)
{txt}(9,329 missing values generated)

    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayDea_mu~en {c |}{res}        491    13.62118    26.70043          0   264.8713
                            
divider---------------------
                            
{txt}
{com}. *
. 
. 
. * gen CFR
. 
. gen DayCfrMeRaA00S00 = 100 * DayDeaMeRaA00S00 / DayCasMeRaA00S00
{txt}(1,366 missing values generated)

{com}. 
. label var DayCfrMeRaA00S00 "Daily CFR JOHN"
{txt}
{com}. 
. di in red "negative CFR values:"
{res}{err}negative CFR values:
{txt}
{com}. 
. list date loc_grand_name DayDeaMeRaA00S00 DayCasMeRaA00S00 DayCfrMeRaA00S00 if DayCfrMeRaA00S00 < 0
{txt}
      {c TLC}{hline 11}{c -}{hline 10}{c -}{hline 10}{c -}{hline 10}{c -}{hline 11}{c TRC}
      {c |} {res}     date   loc_gr~e   DayDe~00   DayCa~00   DayCfr~00 {txt}{c |}
      {c LT}{hline 11}{c -}{hline 10}{c -}{hline 10}{c -}{hline 10}{c -}{hline 11}{c RT}
3871. {c |} {res}30mar2021     Israel         -4        514   -.7782101 {txt}{c |}
3889. {c |} {res}17apr2021     Israel         15        -53   -28.30189 {txt}{c |}
5592. {c |} {res}30jul2020      Libya         -3        216   -1.388889 {txt}{c |}
9041. {c |} {res}11aug2020      Yemen          5         -1        -500 {txt}{c |}
      {c BLC}{hline 11}{c -}{hline 10}{c -}{hline 10}{c -}{hline 10}{c -}{hline 11}{c BRC}

{com}. 
. 
. * describe CFR
. 
. levelsof loc_grand_name, local(levels)
{txt}`"1_Global"' `"2_EMR"' `"Algeria"' `"Bahrain"' `"Djibouti"' `"Egypt"' `"Iran"' `"Iraq"' `"Israel"' `"Jordan"' `"Kuwait"' `"Lebanon"' `"Libya"' `"Oman"' `"Qatar"' `"Saudi_Arabia"' `"Syria"' `"Tunisia"' `"UAE"' `"Yemen"'

{com}. 
. foreach l of local levels {c -(}
{txt}  2{com}. 
.         di "`l'"
{txt}  3{com}. 
.         tabstat DayCfrMeRaA00S00 if loc_grand_name == "`l'" & DayCfrMeRaA00S00 >= 0, stat(p25 p50 p75 iqr mean min max) varwidth(32)
{txt}  4{com}. 
.         di "divider---------------------"
{txt}  5{com}.         di "                            "
{txt}  6{com}. 
. {c )-}
1_Global

{txt}{ralign 32:variable} {...}
{c |}       p25       p50       p75       iqr      mean       min       max
{hline 33}{c +}{hline 70}
{ralign 32:DayCfrMeRaA00S00} {...}
{c |}{...}
 {res} 1.736501   2.15482  3.201208  1.464707  3.007015  .3395586  28.36879
{txt}{hline 33}{c BT}{hline 70}
divider---------------------
                            
2_EMR

{ralign 32:variable} {...}
{c |}       p25       p50       p75       iqr      mean       min       max
{hline 33}{c +}{hline 70}
{ralign 32:DayCfrMeRaA00S00} {...}
{c |}{...}
 {res} 1.372213  2.054296  2.779953   1.40774   2.64715         0       100
{txt}{hline 33}{c BT}{hline 70}
divider---------------------
                            
Algeria

{ralign 32:variable} {...}
{c |}       p25       p50       p75       iqr      mean       min       max
{hline 33}{c +}{hline 70}
{ralign 32:DayCfrMeRaA00S00} {...}
{c |}{...}
 {res} 1.897983  2.534562  3.940887  2.042903    4.1157         0  66.66666
{txt}{hline 33}{c BT}{hline 70}
divider---------------------
                            
Bahrain

{ralign 32:variable} {...}
{c |}       p25       p50       p75       iqr      mean       min       max
{hline 33}{c +}{hline 70}
{ralign 32:DayCfrMeRaA00S00} {...}
{c |}{...}
 {res}        0  .2610984  .5191436  .5191436  .3534431         0  6.666667
{txt}{hline 33}{c BT}{hline 70}
divider---------------------
                            
Djibouti

{ralign 32:variable} {...}
{c |}       p25       p50       p75       iqr      mean       min       max
{hline 33}{c +}{hline 70}
{ralign 32:DayCfrMeRaA00S00} {...}
{c |}{...}
 {res}        0         0         0         0  2.060128         0       100
{txt}{hline 33}{c BT}{hline 70}
divider---------------------
                            
Egypt

{ralign 32:variable} {...}
{c |}       p25       p50       p75       iqr      mean       min       max
{hline 33}{c +}{hline 70}
{ralign 32:DayCfrMeRaA00S00} {...}
{c |}{...}
 {res} 4.580482  6.062962  8.400558  3.820075  6.861011         0  22.22222
{txt}{hline 33}{c BT}{hline 70}
divider---------------------
                            
Iran

{ralign 32:variable} {...}
{c |}       p25       p50       p75       iqr      mean       min       max
{hline 33}{c +}{hline 70}
{ralign 32:DayCfrMeRaA00S00} {...}
{c |}{...}
 {res} 1.707196  3.612368  6.050695  4.343499  4.391364         0       100
{txt}{hline 33}{c BT}{hline 70}
divider---------------------
                            
Iraq

{ralign 32:variable} {...}
{c |}       p25       p50       p75       iqr      mean       min       max
{hline 33}{c +}{hline 70}
{ralign 32:DayCfrMeRaA00S00} {...}
{c |}{...}
 {res} .6532806  1.515611  2.467107  1.813826  2.317234         0  66.66666
{txt}{hline 33}{c BT}{hline 70}
divider---------------------
                            
Israel

{ralign 32:variable} {...}
{c |}       p25       p50       p75       iqr      mean       min       max
{hline 33}{c +}{hline 70}
{ralign 32:DayCfrMeRaA00S00} {...}
{c |}{...}
 {res} .4371585  .7778408  1.886792  1.449634  2.275056         0       100
{txt}{hline 33}{c BT}{hline 70}
divider---------------------
                            
Jordan

{ralign 32:variable} {...}
{c |}       p25       p50       p75       iqr      mean       min       max
{hline 33}{c +}{hline 70}
{ralign 32:DayCfrMeRaA00S00} {...}
{c |}{...}
 {res}        0   .769823  1.470588  1.470588  1.347644         0       100
{txt}{hline 33}{c BT}{hline 70}
divider---------------------
                            
Kuwait

{ralign 32:variable} {...}
{c |}       p25       p50       p75       iqr      mean       min       max
{hline 33}{c +}{hline 70}
{ralign 32:DayCfrMeRaA00S00} {...}
{c |}{...}
 {res} .2801121  .5084746  .7513661  .4712541   .551164         0  2.608696
{txt}{hline 33}{c BT}{hline 70}
divider---------------------
                            
Lebanon

{ralign 32:variable} {...}
{c |}       p25       p50       p75       iqr      mean       min       max
{hline 33}{c +}{hline 70}
{ralign 32:DayCfrMeRaA00S00} {...}
{c |}{...}
 {res} .0735294  .9084027  1.857585  1.784056  1.738608         0        25
{txt}{hline 33}{c BT}{hline 70}
divider---------------------
                            
Libya

{ralign 32:variable} {...}
{c |}       p25       p50       p75       iqr      mean       min       max
{hline 33}{c +}{hline 70}
{ralign 32:DayCfrMeRaA00S00} {...}
{c |}{...}
 {res} .7092199  1.349831  2.162162  1.452942  2.328692         0       100
{txt}{hline 33}{c BT}{hline 70}
divider---------------------
                            
Oman

{ralign 32:variable} {...}
{c |}       p25       p50       p75       iqr      mean       min       max
{hline 33}{c +}{hline 70}
{ralign 32:DayCfrMeRaA00S00} {...}
{c |}{...}
 {res} .2967359  .7978724  1.608292  1.311556  1.172657         0  11.42857
{txt}{hline 33}{c BT}{hline 70}
divider---------------------
                            
Qatar

{ralign 32:variable} {...}
{c |}       p25       p50       p75       iqr      mean       min       max
{hline 33}{c +}{hline 70}
{ralign 32:DayCfrMeRaA00S00} {...}
{c |}{...}
 {res}        0         0  .4329004  .4329004  .2906076         0  16.66667
{txt}{hline 33}{c BT}{hline 70}
divider---------------------
                            
Saudi_Arabia

{ralign 32:variable} {...}
{c |}       p25       p50       p75       iqr      mean       min       max
{hline 33}{c +}{hline 70}
{ralign 32:DayCfrMeRaA00S00} {...}
{c |}{...}
 {res} 1.042654  1.511335  4.016913  2.974259  2.527462         0   10.6383
{txt}{hline 33}{c BT}{hline 70}
divider---------------------
                            
Syria

{ralign 32:variable} {...}
{c |}       p25       p50       p75       iqr      mean       min       max
{hline 33}{c +}{hline 70}
{ralign 32:DayCfrMeRaA00S00} {...}
{c |}{...}
 {res} 4.938272  6.666667  8.333333  3.395061  7.558166         0       100
{txt}{hline 33}{c BT}{hline 70}
divider---------------------
                            
Tunisia

{ralign 32:variable} {...}
{c |}       p25       p50       p75       iqr      mean       min       max
{hline 33}{c +}{hline 70}
{ralign 32:DayCfrMeRaA00S00} {...}
{c |}{...}
 {res}        0  2.881291  4.685212  4.685212  4.072549         0       100
{txt}{hline 33}{c BT}{hline 70}
divider---------------------
                            
UAE

{ralign 32:variable} {...}
{c |}       p25       p50       p75       iqr      mean       min       max
{hline 33}{c +}{hline 70}
{ralign 32:DayCfrMeRaA00S00} {...}
{c |}{...}
 {res}  .147167  .2392344  .4149378  .2677707  .3368787         0  4.878049
{txt}{hline 33}{c BT}{hline 70}
divider---------------------
                            
Yemen

{ralign 32:variable} {...}
{c |}       p25       p50       p75       iqr      mean       min       max
{hline 33}{c +}{hline 70}
{ralign 32:DayCfrMeRaA00S00} {...}
{c |}{...}
 {res}        0  14.28571        28        28  24.79391         0       400
{txt}{hline 33}{c BT}{hline 70}
divider---------------------
                            

{com}. *
. 
. 
. 
. * gen Cases to deaths ratio (CTD)
. 
. gen DayCTDMeRaA00S00 =  DayCasMeRaA00S00 / DayDeaMeRaA00S00
{txt}(2,898 missing values generated)

{com}. label var DayCTDMeRaA00S00  "Daily Cases to Deaths S0 JOHN"
{txt}
{com}.         
. gen TotCTDMeRaA00S00 =  TotCasMeRaA00S00 / TotDeaMeRaA00S00
{txt}(1,120 missing values generated)

{com}. label var TotCTDMeRaA00S00  "Total Cases to Deaths S0 JOHN"
{txt}
{com}. 
. 
. 
. 
. * describe Cases to deaths ratio (CTD)
. 
. levelsof loc_grand_name, local(levels)
{txt}`"1_Global"' `"2_EMR"' `"Algeria"' `"Bahrain"' `"Djibouti"' `"Egypt"' `"Iran"' `"Iraq"' `"Israel"' `"Jordan"' `"Kuwait"' `"Lebanon"' `"Libya"' `"Oman"' `"Qatar"' `"Saudi_Arabia"' `"Syria"' `"Tunisia"' `"UAE"' `"Yemen"'

{com}. 
. foreach l of local levels {c -(}
{txt}  2{com}. 
.         di "`l'"
{txt}  3{com}. 
.         tabstat DayCTDMeRaA00S00 if loc_grand_name == "`l'", stat(p25 p50 p75 iqr mean min max) varwidth(32)
{txt}  4{com}.         
.         tabstat TotCTDMeRaA00S00 if loc_grand_name == "`l'", stat(p25 p50 p75 iqr mean min max) varwidth(32)
{txt}  5{com}.         
. 
.         di "divider---------------------"
{txt}  6{com}.         di "                            "
{txt}  7{com}. 
. {c )-}
1_Global

{txt}{ralign 32:variable} {...}
{c |}       p25       p50       p75       iqr      mean       min       max
{hline 33}{c +}{hline 70}
{ralign 32:DayCTDMeRaA00S00} {...}
{c |}{...}
 {res}  31.2382   46.4076  57.58705  26.34885  45.49136     3.525     294.5
{txt}{hline 33}{c BT}{hline 70}

{ralign 32:variable} {...}
{c |}       p25       p50       p75       iqr      mean       min       max
{hline 33}{c +}{hline 70}
{ralign 32:TotCTDMeRaA00S00} {...}
{c |}{...}
 {res} 24.25119  35.95015  45.48508  21.23389  34.29382  13.80244  49.01241
{txt}{hline 33}{c BT}{hline 70}
divider---------------------
                            
2_EMR

{ralign 32:variable} {...}
{c |}       p25       p50       p75       iqr      mean       min       max
{hline 33}{c +}{hline 70}
{ralign 32:DayCTDMeRaA00S00} {...}
{c |}{...}
 {res} 35.69466  47.78589      71.1  35.40534  52.51754         1  107.1461
{txt}{hline 33}{c BT}{hline 70}

{ralign 32:variable} {...}
{c |}       p25       p50       p75       iqr      mean       min       max
{hline 33}{c +}{hline 70}
{ralign 32:TotCTDMeRaA00S00} {...}
{c |}{...}
 {res} 37.67788  40.24506  44.47192  6.794044  39.05484         6  53.23544
{txt}{hline 33}{c BT}{hline 70}
divider---------------------
                            
Algeria

{ralign 32:variable} {...}
{c |}       p25       p50       p75       iqr      mean       min       max
{hline 33}{c +}{hline 70}
{ralign 32:DayCTDMeRaA00S00} {...}
{c |}{...}
 {res}       25  38.03846  51.33333  26.33333   39.6216       1.5     137.5
{txt}{hline 33}{c BT}{hline 70}

{ralign 32:variable} {...}
{c |}       p25       p50       p75       iqr      mean       min       max
{hline 33}{c +}{hline 70}
{ralign 32:TotCTDMeRaA00S00} {...}
{c |}{...}
 {res} 16.27273  29.77839   37.1064  20.83367  27.54177  6.335463  37.99706
{txt}{hline 33}{c BT}{hline 70}
divider---------------------
                            
Bahrain

{ralign 32:variable} {...}
{c |}       p25       p50       p75       iqr      mean       min       max
{hline 33}{c +}{hline 70}
{ralign 32:DayCTDMeRaA00S00} {...}
{c |}{...}
 {res}      162       227  360.3333  198.3333  281.8401         0      1206
{txt}{hline 33}{c BT}{hline 70}

{ralign 32:variable} {...}
{c |}       p25       p50       p75       iqr      mean       min       max
{hline 33}{c +}{hline 70}
{ralign 32:TotCTDMeRaA00S00} {...}
{c |}{...}
 {res} 263.9574  274.6758   284.467  20.50958  301.8265    104.75  701.1667
{txt}{hline 33}{c BT}{hline 70}
divider---------------------
                            
Djibouti

{ralign 32:variable} {...}
{c |}       p25       p50       p75       iqr      mean       min       max
{hline 33}{c +}{hline 70}
{ralign 32:DayCTDMeRaA00S00} {...}
{c |}{...}
 {res} 12.20833    28.625     73.25  61.04167    54.049         1       251
{txt}{hline 33}{c BT}{hline 70}

{ralign 32:variable} {...}
{c |}       p25       p50       p75       iqr      mean       min       max
{hline 33}{c +}{hline 70}
{ralign 32:TotCTDMeRaA00S00} {...}
{c |}{...}
 {res} 88.92993  93.43405  99.11111  10.18118  125.3398  75.11765       560
{txt}{hline 33}{c BT}{hline 70}
divider---------------------
                            
Egypt

{ralign 32:variable} {...}
{c |}       p25       p50       p75       iqr      mean       min       max
{hline 33}{c +}{hline 70}
{ralign 32:DayCTDMeRaA00S00} {...}
{c |}{...}
 {res} 11.82353  16.26829  21.16216  9.338634  17.65713         0  71.18182
{txt}{hline 33}{c BT}{hline 70}

{ralign 32:variable} {...}
{c |}       p25       p50       p75       iqr      mean       min       max
{hline 33}{c +}{hline 70}
{ralign 32:TotCTDMeRaA00S00} {...}
{c |}{...}
 {res} 17.06811  17.50785   18.7783  1.710184  19.34058  12.98742        75
{txt}{hline 33}{c BT}{hline 70}
divider---------------------
                            
Iran

{ralign 32:variable} {...}
{c |}       p25       p50       p75       iqr      mean       min       max
{hline 33}{c +}{hline 70}
{ralign 32:DayCTDMeRaA00S00} {...}
{c |}{...}
 {res} 16.52703   27.5941  58.43137  41.90435  40.83186         1  152.6038
{txt}{hline 33}{c BT}{hline 70}

{ralign 32:variable} {...}
{c |}       p25       p50       p75       iqr      mean       min       max
{hline 33}{c +}{hline 70}
{ralign 32:TotCTDMeRaA00S00} {...}
{c |}{...}
 {res} 17.41613  19.92419  25.26901  7.852882  21.67972         1  40.15862
{txt}{hline 33}{c BT}{hline 70}
divider---------------------
                            
Iraq

{ralign 32:variable} {...}
{c |}       p25       p50       p75       iqr      mean       min       max
{hline 33}{c +}{hline 70}
{ralign 32:DayCTDMeRaA00S00} {...}
{c |}{...}
 {res} 37.93939  62.92308  132.4595  94.52007  91.28415         0    592.25
{txt}{hline 33}{c BT}{hline 70}

{ralign 32:variable} {...}
{c |}       p25       p50       p75       iqr      mean       min       max
{hline 33}{c +}{hline 70}
{ralign 32:TotCTDMeRaA00S00} {...}
{c |}{...}
 {res} 26.96599  41.23491  47.63911  20.67313  39.73126     8.875  72.64388
{txt}{hline 33}{c BT}{hline 70}
divider---------------------
                            
Israel

{ralign 32:variable} {...}
{c |}       p25       p50       p75       iqr      mean       min       max
{hline 33}{c +}{hline 70}
{ralign 32:DayCTDMeRaA00S00} {...}
{c |}{...}
 {res}       45  112.9857  181.0714  136.0714  137.9415    -128.5      1146
{txt}{hline 33}{c BT}{hline 70}

{ralign 32:variable} {...}
{c |}       p25       p50       p75       iqr      mean       min       max
{hline 33}{c +}{hline 70}
{ralign 32:TotCTDMeRaA00S00} {...}
{c |}{...}
 {res} 117.3476  127.2968  134.9174  17.56985  129.3993  58.64685      1249
{txt}{hline 33}{c BT}{hline 70}
divider---------------------
                            
Jordan

{ralign 32:variable} {...}
{c |}       p25       p50       p75       iqr      mean       min       max
{hline 33}{c +}{hline 70}
{ralign 32:DayCTDMeRaA00S00} {...}
{c |}{...}
 {res}     54.9     75.25       117      62.1  93.04945         0       634
{txt}{hline 33}{c BT}{hline 70}

{ralign 32:variable} {...}
{c |}       p25       p50       p75       iqr      mean       min       max
{hline 33}{c +}{hline 70}
{ralign 32:TotCTDMeRaA00S00} {...}
{c |}{...}
 {res} 77.12016  84.01211  111.1818  34.06166  94.50717  51.11111       246
{txt}{hline 33}{c BT}{hline 70}
divider---------------------
                            
Kuwait

{ralign 32:variable} {...}
{c |}       p25       p50       p75       iqr      mean       min       max
{hline 33}{c +}{hline 70}
{ralign 32:DayCTDMeRaA00S00} {...}
{c |}{...}
 {res}      122    173.75       247       125  217.4204  38.33333       919
{txt}{hline 33}{c BT}{hline 70}

{ralign 32:variable} {...}
{c |}       p25       p50       p75       iqr      mean       min       max
{hline 33}{c +}{hline 70}
{ralign 32:TotCTDMeRaA00S00} {...}
{c |}{...}
 {res}  152.002  163.3003  174.7648  22.76274  179.6247  120.6364      1234
{txt}{hline 33}{c BT}{hline 70}
divider---------------------
                            
Lebanon

{ralign 32:variable} {...}
{c |}       p25       p50       p75       iqr      mean       min       max
{hline 33}{c +}{hline 70}
{ralign 32:DayCTDMeRaA00S00} {...}
{c |}{...}
 {res} 45.46154  70.59143  132.3333  86.87179  106.4128         4      1360
{txt}{hline 33}{c BT}{hline 70}

{ralign 32:variable} {...}
{c |}       p25       p50       p75       iqr      mean       min       max
{hline 33}{c +}{hline 70}
{ralign 32:TotCTDMeRaA00S00} {...}
{c |}{...}
 {res} 52.29412  78.02937  113.4587  61.16456  82.22437  20.33333  136.5479
{txt}{hline 33}{c BT}{hline 70}
divider---------------------
                            
Libya

{ralign 32:variable} {...}
{c |}       p25       p50       p75       iqr      mean       min       max
{hline 33}{c +}{hline 70}
{ralign 32:DayCTDMeRaA00S00} {...}
{c |}{...}
 {res} 41.61111  64.92222     100.2  58.58889  81.71308       -72       622
{txt}{hline 33}{c BT}{hline 70}

{ralign 32:variable} {...}
{c |}       p25       p50       p75       iqr      mean       min       max
{hline 33}{c +}{hline 70}
{ralign 32:TotCTDMeRaA00S00} {...}
{c |}{...}
 {res} 47.26394  60.00982   65.3895  18.12556  55.16497        11      78.6
{txt}{hline 33}{c BT}{hline 70}
divider---------------------
                            
Oman

{ralign 32:variable} {...}
{c |}       p25       p50       p75       iqr      mean       min       max
{hline 33}{c +}{hline 70}
{ralign 32:DayCTDMeRaA00S00} {...}
{c |}{...}
 {res}       53  97.11111  172.1429  119.1429   141.748      8.75      1082
{txt}{hline 33}{c BT}{hline 70}

{ralign 32:variable} {...}
{c |}       p25       p50       p75       iqr      mean       min       max
{hline 33}{c +}{hline 70}
{ralign 32:TotCTDMeRaA00S00} {...}
{c |}{...}
 {res} 90.00512  97.01702  190.6667  100.6616   132.525  85.65003    254.75
{txt}{hline 33}{c BT}{hline 70}
divider---------------------
                            
Qatar

{ralign 32:variable} {...}
{c |}       p25       p50       p75       iqr      mean       min       max
{hline 33}{c +}{hline 70}
{ralign 32:DayCTDMeRaA00S00} {...}
{c |}{...}
 {res}   139.25       230       456    316.75  324.9127         6      1554
{txt}{hline 33}{c BT}{hline 70}

{ralign 32:variable} {...}
{c |}       p25       p50       p75       iqr      mean       min       max
{hline 33}{c +}{hline 70}
{ralign 32:TotCTDMeRaA00S00} {...}
{c |}{...}
 {res} 582.5021   598.687  640.0451  57.54297  712.2621  316.3333  2373.733
{txt}{hline 33}{c BT}{hline 70}
divider---------------------
                            
Saudi_Arabia

{ralign 32:variable} {...}
{c |}       p25       p50       p75       iqr      mean       min       max
{hline 33}{c +}{hline 70}
{ralign 32:DayCTDMeRaA00S00} {...}
{c |}{...}
 {res}       24  64.35897        89        65  71.56449       9.4  407.6667
{txt}{hline 33}{c BT}{hline 70}

{ralign 32:variable} {...}
{c |}       p25       p50       p75       iqr      mean       min       max
{hline 33}{c +}{hline 70}
{ralign 32:TotCTDMeRaA00S00} {...}
{c |}{...}
 {res} 58.86284  65.24371  97.43986  38.57701  87.00103  57.66693       767
{txt}{hline 33}{c BT}{hline 70}
divider---------------------
                            
Syria

{ralign 32:variable} {...}
{c |}       p25       p50       p75       iqr      mean       min       max
{hline 33}{c +}{hline 70}
{ralign 32:DayCTDMeRaA00S00} {...}
{c |}{...}
 {res}     11.5      14.2      17.4       5.9  15.23624         0        72
{txt}{hline 33}{c BT}{hline 70}

{ralign 32:variable} {...}
{c |}       p25       p50       p75       iqr      mean       min       max
{hline 33}{c +}{hline 70}
{ralign 32:TotCTDMeRaA00S00} {...}
{c |}{...}
 {res} 14.98161   17.2196  21.15955  6.177941  18.54456         5  34.66667
{txt}{hline 33}{c BT}{hline 70}
divider---------------------
                            
Tunisia

{ralign 32:variable} {...}
{c |}       p25       p50       p75       iqr      mean       min       max
{hline 33}{c +}{hline 70}
{ralign 32:DayCTDMeRaA00S00} {...}
{c |}{...}
 {res} 17.98611  25.87234        40  22.01389    34.922         0     244.6
{txt}{hline 33}{c BT}{hline 70}

{ralign 32:variable} {...}
{c |}       p25       p50       p75       iqr      mean       min       max
{hline 33}{c +}{hline 70}
{ralign 32:TotCTDMeRaA00S00} {...}
{c |}{...}
 {res} 27.40642  29.22514  33.42454  6.018118   33.9524  21.35294  75.88406
{txt}{hline 33}{c BT}{hline 70}
divider---------------------
                            
UAE

{ralign 32:variable} {...}
{c |}       p25       p50       p75       iqr      mean       min       max
{hline 33}{c +}{hline 70}
{ralign 32:DayCTDMeRaA00S00} {...}
{c |}{...}
 {res}      230     374.8     578.5     348.5  429.6947         0      1563
{txt}{hline 33}{c BT}{hline 70}

{ralign 32:variable} {...}
{c |}       p25       p50       p75       iqr      mean       min       max
{hline 33}{c +}{hline 70}
{ralign 32:TotCTDMeRaA00S00} {...}
{c |}{...}
 {res} 168.8129  254.6624  314.0074  145.1945  241.0312        70  359.5811
{txt}{hline 33}{c BT}{hline 70}
divider---------------------
                            
Yemen

{ralign 32:variable} {...}
{c |}       p25       p50       p75       iqr      mean       min       max
{hline 33}{c +}{hline 70}
{ralign 32:DayCTDMeRaA00S00} {...}
{c |}{...}
 {res}        2   4.68421       7.5       5.5  5.850571       -.2        41
{txt}{hline 33}{c BT}{hline 70}

{ralign 32:variable} {...}
{c |}       p25       p50       p75       iqr      mean       min       max
{hline 33}{c +}{hline 70}
{ralign 32:TotCTDMeRaA00S00} {...}
{c |}{...}
 {res} 3.447261   3.50153  4.433798  .9865364  3.984497         3  7.083333
{txt}{hline 33}{c BT}{hline 70}
divider---------------------
                            

{com}. *
. 
. 
. 
. 
. 
. 
. 
. 
. * smooth 
. 
. encode loc_grand_name, gen(loc_grand_name_numeric)
{txt}
{com}. 
. tsset loc_grand_name_numeric date, daily   
{res}{txt}{col 8}panel variable:  {res}loc_grand_name_numeric (strongly balanced)
{txt}{col 9}time variable:  {res}{col 25}date, 22jan2020 to 26may2021
{txt}{col 17}delta:  {res}1 day
{txt}
{com}. 
. 
. tssmooth ma DayDeaMeRaA00S00_window = DayDeaMeRaA00S00 if DayDeaMeRaA00S00 >= 0, window(3 1 3)
{txt}The smoother applied was
{res}{p 5 5 5} by loc_grand_name_numeric : (1/7)*[x(t-3) + x(t-2) + x(t-1) + 1*x(t) + x(t+1) + x(t+2) + x(t+3)]; x(t)= DayDeaMeRaA00S00 {p_end}
{txt}
{com}. 
. tssmooth ma DayDeaMeSmA00S00 = DayDeaMeRaA00S00_window, weights( 1 2 3 <4> 3 2 1) replace
{txt}The smoother applied was
{res}{p 5 5 5} by loc_grand_name_numeric : (1/16)*[1*x(t-3) + 2*x(t-2) + 3*x(t-1) + 4*x(t) + 3*x(t+1) + 2*x(t+2) + ...; x(t)= DayDeaMeRaA00S00_window
{txt}
{smcl}
{com}. 
. label var DayDeaMeSmA00S00 "Daily deaths mean smooth JOHN"
{txt}
{com}. 
. drop DayDeaMeRaA00S00_window
{txt}
{com}. 
. 
. tssmooth ma DayCasMeRaA00S00_window = DayCasMeRaA00S00 if DayCasMeRaA00S00 >= 0, window(3 1 3)
{txt}The smoother applied was
{res}{p 5 5 5} by loc_grand_name_numeric : (1/7)*[x(t-3) + x(t-2) + x(t-1) + 1*x(t) + x(t+1) + x(t+2) + x(t+3)]; x(t)= DayCasMeRaA00S00 {p_end}
{txt}
{com}. 
. tssmooth ma DayCasMeSmA00S00 = DayCasMeRaA00S00_window, weights( 1 2 3 <4> 3 2 1) replace
{txt}The smoother applied was
{res}{p 5 5 5} by loc_grand_name_numeric : (1/16)*[1*x(t-3) + 2*x(t-2) + 3*x(t-1) + 4*x(t) + 3*x(t+1) + 2*x(t+2) + ...; x(t)= DayCasMeRaA00S00_window
{txt}
{smcl}
{com}. 
. label var DayCasMeSmA00S00 "Daily cases mean smooth JOHN"
{txt}
{com}. 
. drop DayCasMeRaA00S00_window
{txt}
{com}. 
. 
. tssmooth ma DayCfrMeRaA00S00_window = DayCfrMeRaA00S00 if DayCfrMeRaA00S00 >= 0, window(3 1 3)
{txt}The smoother applied was
{res}{p 5 5 5} by loc_grand_name_numeric : (1/7)*[x(t-3) + x(t-2) + x(t-1) + 1*x(t) + x(t+1) + x(t+2) + x(t+3)]; x(t)= DayCfrMeRaA00S00 {p_end}
{txt}
{com}. 
. tssmooth ma DayCfrMeSmA00S00 = DayCfrMeRaA00S00_window, weights( 1 2 3 <4> 3 2 1) replace
{txt}The smoother applied was
{res}{p 5 5 5} by loc_grand_name_numeric : (1/16)*[1*x(t-3) + 2*x(t-2) + 3*x(t-1) + 4*x(t) + 3*x(t+1) + 2*x(t+2) + ...; x(t)= DayCfrMeRaA00S00_window
{txt}
{smcl}
{com}. 
. label var DayCfrMeSmA00S00 "Daily CFR mean smooth JOHN"
{txt}
{com}. 
. drop DayCfrMeRaA00S00_window
{txt}
{com}. 
. 
. tssmooth ma DayCTDMeRaA00S00_window = DayCTDMeRaA00S00 if DayCTDMeRaA00S00 >= 0, window(3 1 3)
{txt}The smoother applied was
{res}{p 5 5 5} by loc_grand_name_numeric : (1/7)*[x(t-3) + x(t-2) + x(t-1) + 1*x(t) + x(t+1) + x(t+2) + x(t+3)]; x(t)= DayCTDMeRaA00S00 {p_end}
{txt}
{com}. 
. tssmooth ma DayCTDMeSmA00S00 = DayCTDMeRaA00S00_window, weights( 1 2 3 <4> 3 2 1) replace
{txt}The smoother applied was
{res}{p 5 5 5} by loc_grand_name_numeric : (1/16)*[1*x(t-3) + 2*x(t-2) + 3*x(t-1) + 4*x(t) + 3*x(t+1) + 2*x(t+2) + ...; x(t)= DayCTDMeRaA00S00_window
{txt}
{smcl}
{com}. 
. label var DayCTDMeSmA00S00 "Daily CTD mean smooth JOHN"
{txt}
{com}. 
. drop DayCTDMeRaA00S00_window
{txt}
{com}. 
. 
. 
. tssmooth ma TotCTDMeRaA00S00_window = TotCTDMeRaA00S00 if TotCTDMeRaA00S00 >= 0, window(3 1 3)
{txt}The smoother applied was
{res}{p 5 5 5} by loc_grand_name_numeric : (1/7)*[x(t-3) + x(t-2) + x(t-1) + 1*x(t) + x(t+1) + x(t+2) + x(t+3)]; x(t)= TotCTDMeRaA00S00 {p_end}
{txt}
{com}. 
. tssmooth ma TotCTDMeSmA00S00 = TotCTDMeRaA00S00_window, weights( 1 2 3 <4> 3 2 1) replace
{txt}The smoother applied was
{res}{p 5 5 5} by loc_grand_name_numeric : (1/16)*[1*x(t-3) + 2*x(t-2) + 3*x(t-1) + 4*x(t) + 3*x(t+1) + 2*x(t+2) + ...; x(t)= TotCTDMeRaA00S00_window
{txt}
{smcl}
{com}. 
. label var TotCTDMeSmA00S00 "Total CTD mean smooth JOHN"
{txt}
{com}. 
. drop TotCTDMeRaA00S00_window
{txt}
{com}. 
. 
. 
. 
. levelsof loc_grand_name, local(levels)
{txt}`"1_Global"' `"2_EMR"' `"Algeria"' `"Bahrain"' `"Djibouti"' `"Egypt"' `"Iran"' `"Iraq"' `"Israel"' `"Jordan"' `"Kuwait"' `"Lebanon"' `"Libya"' `"Oman"' `"Qatar"' `"Saudi_Arabia"' `"Syria"' `"Tunisia"' `"UAE"' `"Yemen"'

{com}. 
. foreach l of local levels {c -(}
{txt}  2{com}. 
.         tssmooth ma DayDea_multip_`l'_w = DayDea_multip_`l' if (DayDea_multip_`l' >= 0) & (loc_grand_name == "`l'"), window(3 1 3)
{txt}  3{com}. 
.         tssmooth ma DayDea_multip_`l'_sm = DayDea_multip_`l'_w if (loc_grand_name == "`l'"), weights( 1 2 3 <4> 3 2 1) replace
{txt}  4{com}. 
.         label var DayDea_multip_`l'_w "Daily deaths scaled smooth only for visualization JOHN"
{txt}  5{com}. 
.         drop DayDea_multip_`l'_w 
{txt}  6{com}. {c )-}
{txt}The smoother applied was
{res}{p 5 5 5}(1/7)*[x(t-3) + x(t-2) + x(t-1) + 1*x(t) + x(t+1) + x(t+2) + x(t+3)]; x(t)= DayDea_multip_1_Global {p_end}
{txt}The smoother applied was
{res}{p 5 5 5}(1/16)*[1*x(t-3) + 2*x(t-2) + 3*x(t-1) + 4*x(t) + 3*x(t+1) + 2*x(t+2) + ...; x(t)= DayDea_multip_1_Global_w 
{txt}The smoother applied was
{res}{p 5 5 5}(1/7)*[x(t-3) + x(t-2) + x(t-1) + 1*x(t) + x(t+1) + x(t+2) + x(t+3)]; x(t)= DayDea_multip_2_EMR {p_end}
{txt}The smoother applied was
{res}{p 5 5 5}(1/16)*[1*x(t-3) + 2*x(t-2) + 3*x(t-1) + 4*x(t) + 3*x(t+1) + 2*x(t+2) + ...; x(t)= DayDea_multip_2_EMR_w 
{txt}The smoother applied was
{res}{p 5 5 5}(1/7)*[x(t-3) + x(t-2) + x(t-1) + 1*x(t) + x(t+1) + x(t+2) + x(t+3)]; x(t)= DayDea_multip_Algeria {p_end}
{txt}The smoother applied was
{res}{p 5 5 5}(1/16)*[1*x(t-3) + 2*x(t-2) + 3*x(t-1) + 4*x(t) + 3*x(t+1) + 2*x(t+2) + ...; x(t)= DayDea_multip_Algeria_w 
{txt}The smoother applied was
{res}{p 5 5 5}(1/7)*[x(t-3) + x(t-2) + x(t-1) + 1*x(t) + x(t+1) + x(t+2) + x(t+3)]; x(t)= DayDea_multip_Bahrain {p_end}
{txt}The smoother applied was
{res}{p 5 5 5}(1/16)*[1*x(t-3) + 2*x(t-2) + 3*x(t-1) + 4*x(t) + 3*x(t+1) + 2*x(t+2) + ...; x(t)= DayDea_multip_Bahrain_w 
{txt}The smoother applied was
{res}{p 5 5 5}(1/7)*[x(t-3) + x(t-2) + x(t-1) + 1*x(t) + x(t+1) + x(t+2) + x(t+3)]; x(t)= DayDea_multip_Djibouti {p_end}
{txt}The smoother applied was
{res}{p 5 5 5}(1/16)*[1*x(t-3) + 2*x(t-2) + 3*x(t-1) + 4*x(t) + 3*x(t+1) + 2*x(t+2) + ...; x(t)= DayDea_multip_Djibouti_w 
{txt}The smoother applied was
{res}{p 5 5 5}(1/7)*[x(t-3) + x(t-2) + x(t-1) + 1*x(t) + x(t+1) + x(t+2) + x(t+3)]; x(t)= DayDea_multip_Egypt {p_end}
{txt}The smoother applied was
{res}{p 5 5 5}(1/16)*[1*x(t-3) + 2*x(t-2) + 3*x(t-1) + 4*x(t) + 3*x(t+1) + 2*x(t+2) + ...; x(t)= DayDea_multip_Egypt_w 
{txt}The smoother applied was
{res}{p 5 5 5}(1/7)*[x(t-3) + x(t-2) + x(t-1) + 1*x(t) + x(t+1) + x(t+2) + x(t+3)]; x(t)= DayDea_multip_Iran {p_end}
{txt}The smoother applied was
{res}{p 5 5 5}(1/16)*[1*x(t-3) + 2*x(t-2) + 3*x(t-1) + 4*x(t) + 3*x(t+1) + 2*x(t+2) + ...; x(t)= DayDea_multip_Iran_w 
{txt}The smoother applied was
{res}{p 5 5 5}(1/7)*[x(t-3) + x(t-2) + x(t-1) + 1*x(t) + x(t+1) + x(t+2) + x(t+3)]; x(t)= DayDea_multip_Iraq {p_end}
{txt}The smoother applied was
{res}{p 5 5 5}(1/16)*[1*x(t-3) + 2*x(t-2) + 3*x(t-1) + 4*x(t) + 3*x(t+1) + 2*x(t+2) + ...; x(t)= DayDea_multip_Iraq_w 
{txt}The smoother applied was
{res}{p 5 5 5}(1/7)*[x(t-3) + x(t-2) + x(t-1) + 1*x(t) + x(t+1) + x(t+2) + x(t+3)]; x(t)= DayDea_multip_Israel {p_end}
{txt}The smoother applied was
{res}{p 5 5 5}(1/16)*[1*x(t-3) + 2*x(t-2) + 3*x(t-1) + 4*x(t) + 3*x(t+1) + 2*x(t+2) + ...; x(t)= DayDea_multip_Israel_w 
{txt}The smoother applied was
{res}{p 5 5 5}(1/7)*[x(t-3) + x(t-2) + x(t-1) + 1*x(t) + x(t+1) + x(t+2) + x(t+3)]; x(t)= DayDea_multip_Jordan {p_end}
{txt}The smoother applied was
{res}{p 5 5 5}(1/16)*[1*x(t-3) + 2*x(t-2) + 3*x(t-1) + 4*x(t) + 3*x(t+1) + 2*x(t+2) + ...; x(t)= DayDea_multip_Jordan_w 
{txt}The smoother applied was
{res}{p 5 5 5}(1/7)*[x(t-3) + x(t-2) + x(t-1) + 1*x(t) + x(t+1) + x(t+2) + x(t+3)]; x(t)= DayDea_multip_Kuwait {p_end}
{txt}The smoother applied was
{res}{p 5 5 5}(1/16)*[1*x(t-3) + 2*x(t-2) + 3*x(t-1) + 4*x(t) + 3*x(t+1) + 2*x(t+2) + ...; x(t)= DayDea_multip_Kuwait_w 
{txt}The smoother applied was
{res}{p 5 5 5}(1/7)*[x(t-3) + x(t-2) + x(t-1) + 1*x(t) + x(t+1) + x(t+2) + x(t+3)]; x(t)= DayDea_multip_Lebanon {p_end}
{txt}The smoother applied was
{res}{p 5 5 5}(1/16)*[1*x(t-3) + 2*x(t-2) + 3*x(t-1) + 4*x(t) + 3*x(t+1) + 2*x(t+2) + ...; x(t)= DayDea_multip_Lebanon_w 
{txt}The smoother applied was
{res}{p 5 5 5}(1/7)*[x(t-3) + x(t-2) + x(t-1) + 1*x(t) + x(t+1) + x(t+2) + x(t+3)]; x(t)= DayDea_multip_Libya {p_end}
{txt}The smoother applied was
{res}{p 5 5 5}(1/16)*[1*x(t-3) + 2*x(t-2) + 3*x(t-1) + 4*x(t) + 3*x(t+1) + 2*x(t+2) + ...; x(t)= DayDea_multip_Libya_w 
{txt}The smoother applied was
{res}{p 5 5 5}(1/7)*[x(t-3) + x(t-2) + x(t-1) + 1*x(t) + x(t+1) + x(t+2) + x(t+3)]; x(t)= DayDea_multip_Oman {p_end}
{txt}The smoother applied was
{res}{p 5 5 5}(1/16)*[1*x(t-3) + 2*x(t-2) + 3*x(t-1) + 4*x(t) + 3*x(t+1) + 2*x(t+2) + ...; x(t)= DayDea_multip_Oman_w 
{txt}The smoother applied was
{res}{p 5 5 5}(1/7)*[x(t-3) + x(t-2) + x(t-1) + 1*x(t) + x(t+1) + x(t+2) + x(t+3)]; x(t)= DayDea_multip_Qatar {p_end}
{txt}The smoother applied was
{res}{p 5 5 5}(1/16)*[1*x(t-3) + 2*x(t-2) + 3*x(t-1) + 4*x(t) + 3*x(t+1) + 2*x(t+2) + ...; x(t)= DayDea_multip_Qatar_w 
{txt}The smoother applied was
{res}{p 5 5 5}(1/7)*[x(t-3) + x(t-2) + x(t-1) + 1*x(t) + x(t+1) + x(t+2) + x(t+3)]; x(t)= DayDea_multip_Saudi_Arabia {p_end}
{txt}The smoother applied was
{res}{p 5 5 5}(1/16)*[1*x(t-3) + 2*x(t-2) + 3*x(t-1) + 4*x(t) + 3*x(t+1) + 2*x(t+2) + ...; x(t)= DayDea_multip_Saudi_Arabia_w 
{txt}The smoother applied was
{res}{p 5 5 5}(1/7)*[x(t-3) + x(t-2) + x(t-1) + 1*x(t) + x(t+1) + x(t+2) + x(t+3)]; x(t)= DayDea_multip_Syria {p_end}
{txt}The smoother applied was
{res}{p 5 5 5}(1/16)*[1*x(t-3) + 2*x(t-2) + 3*x(t-1) + 4*x(t) + 3*x(t+1) + 2*x(t+2) + ...; x(t)= DayDea_multip_Syria_w 
{txt}The smoother applied was
{res}{p 5 5 5}(1/7)*[x(t-3) + x(t-2) + x(t-1) + 1*x(t) + x(t+1) + x(t+2) + x(t+3)]; x(t)= DayDea_multip_Tunisia {p_end}
{txt}The smoother applied was
{res}{p 5 5 5}(1/16)*[1*x(t-3) + 2*x(t-2) + 3*x(t-1) + 4*x(t) + 3*x(t+1) + 2*x(t+2) + ...; x(t)= DayDea_multip_Tunisia_w 
{txt}The smoother applied was
{res}{p 5 5 5}(1/7)*[x(t-3) + x(t-2) + x(t-1) + 1*x(t) + x(t+1) + x(t+2) + x(t+3)]; x(t)= DayDea_multip_UAE {p_end}
{txt}The smoother applied was
{res}{p 5 5 5}(1/16)*[1*x(t-3) + 2*x(t-2) + 3*x(t-1) + 4*x(t) + 3*x(t+1) + 2*x(t+2) + ...; x(t)= DayDea_multip_UAE_w 
{txt}The smoother applied was
{res}{p 5 5 5}(1/7)*[x(t-3) + x(t-2) + x(t-1) + 1*x(t) + x(t+1) + x(t+2) + x(t+3)]; x(t)= DayDea_multip_Yemen {p_end}
{txt}The smoother applied was
{res}{p 5 5 5}(1/16)*[1*x(t-3) + 2*x(t-2) + 3*x(t-1) + 4*x(t) + 3*x(t+1) + 2*x(t+2) + ...; x(t)= DayDea_multip_Yemen_w 
{txt}
{smcl}
{com}. * 
. 
. 
. * 
. 
. tsset, clear
{txt}
{com}. 
. 
. 
. sort date loc_grand_name
{txt}
{com}. 
. qui compress
{txt}
{com}. 
. 
. 
. save "EMR JOHN.dta", replace
{txt}(note: file EMR JOHN.dta not found)
file EMR JOHN.dta saved

{com}. 
. 
. 
. 
. 
. 
. 
. **************
. 
. * graphs
. 
. ssc install grstyle, replace
{txt}checking {hilite:grstyle} consistency and verifying not already installed...
all files already exist and are up to date.

{com}. 
. grstyle init
{res}{txt}
{com}. 
. grstyle color background white
{txt}
{com}. 
. 
. 
. 
. 
. 
. 
. * adjust x axis ticks from Jan 2020 to this month and avoid globals
. forval i = 1(1)12 {c -(}
{txt}  2{com}.         local date2020 = mdy(`i', 1, 2020)
{txt}  3{com}.         local dates2020 `dates2020' `date2020'
{txt}  4{com}. {c )-}
{txt}
{com}. local wanted : di %tdNN daily("$S_DATE", "DMY")
{res}{txt}
{com}. forval i = 1(1)`wanted' {c -(}
{txt}  2{com}.         local date2021 = mdy(`i', 1, 2021)
{txt}  3{com}.         local dates2021 `dates2021' `date2021'
{txt}  4{com}. {c )-}
{txt}
{com}. *
. 
. 
. 
. 
. levelsof loc_grand_name, local(levels)
{txt}`"1_Global"' `"2_EMR"' `"Algeria"' `"Bahrain"' `"Djibouti"' `"Egypt"' `"Iran"' `"Iraq"' `"Israel"' `"Jordan"' `"Kuwait"' `"Lebanon"' `"Libya"' `"Oman"' `"Qatar"' `"Saudi_Arabia"' `"Syria"' `"Tunisia"' `"UAE"' `"Yemen"'

{com}. 
. foreach l of local levels {c -(}
{txt}  2{com}. 
. 
. 
. ** DayCas DayDea DayDea_multip
. 
. 
. * DayCas DayDea DayDea_multip, all raw
. 
. twoway ///
> (line DayCasMeRaA00S00 date, sort lcolor(blue)) ///
> (line DayDeaMeRaA00S00 date, sort lcolor(red)) ///
> (line DayDea_multip_`l' date, sort lpattern(dot) lcolor(red)) ///
> if date > td(01jan2020) & loc_grand_name == "`l'" ///
> , xtitle(Date) xlabel(`dates2020' `dates2021', format(%tdYY-NN-DD) labsize(small)) xlabel(, grid) xlabel(, grid) ///
> xlabel(, angle(forty_five)) ylabel(, format(%12.0fc) labsize(small)) ylabel(, labsize(small) angle(horizontal)) ///
> ytitle(Daily cases and deaths) title("COVID-19 daily cases and deaths, `l', Johns Hopkins", size(medium)) ///
> xscale(lwidth(vthin) lcolor(gray*.2)) yscale(lwidth(vthin) lcolor(gray*.2)) yscale(titlegap(4)) legend(region(lcolor(none)))  ///
> legend(order(1 "Daily cases" 2 "Daily deaths" 3 "Daily deaths scaled for visualization") size(small)) ///
> subtitle("Daily deaths, scaled = times (means of cases divided by deaths) for visualization only", size(small))
{txt}  3{com}. 
. qui graph save "graph 1 COVID-19 daily deaths and cases `l' Johns Hopkins.gph", replace
{txt}  4{com}. qui graph export "graph 1 COVID-19 daily deaths and cases `l' Johns Hopkins.pdf", replace
{txt}  5{com}. 
. 
. 
. 
. 
. * DayCas DayDea DayDea_multip, all smooth
. 
. twoway ///
> (line DayCasMeSmA00S00 date, sort lcolor(blue)) ///
> (line DayDeaMeSmA00S00 date, sort lcolor(red)) ///
> (line DayDea_multip_`l'_sm date, sort lpattern(dot) lcolor(red)) ///
> if date > td(01jan2020) & loc_grand_name == "`l'" ///
> , xtitle(Date) xlabel(`dates2020' `dates2021', format(%tdYY-NN-DD) labsize(small)) xlabel(, grid) xlabel(, grid) ///
> xlabel(, angle(forty_five)) ylabel(, format(%12.0fc) labsize(small)) ylabel(, labsize(small) angle(horizontal)) ///
> ytitle(Daily cases and deaths smoothed) title("COVID-19 daily cases and deaths smoothed, `l', Johns Hopkins", size(medium)) ///
> xscale(lwidth(vthin) lcolor(gray*.2)) yscale(lwidth(vthin) lcolor(gray*.2)) yscale(titlegap(4)) legend(region(lcolor(none)))  ///
> legend(order(1 "Daily cases smoothed" 2 "Daily deaths smoothed" 3 "Daily deaths scaled for visualization, smoothed") size(small)) ///
> subtitle("Daily deaths, scaled = times (means of cases divided by deaths) for visualization only, smoothed", size(small))
{txt}  6{com}. 
. qui graph save "graph 2 COVID-19 daily deaths and cases smoothed `l' Johns Hopkins.gph", replace
{txt}  7{com}. qui graph export "graph 2 COVID-19 daily deaths and cases smoothed `l' Johns Hopkins.pdf", replace
{txt}  8{com}. 
. 
. 
. 
. 
. ** DayDea
. 
. * DayDea, raw and smooth 
. 
. 
. twoway ///
> (line DayDeaMeRaA00S00 date, sort lcolor(gray)) ///
> (line DayDeaMeSmA00S00 date, sort lwidth(thick) lcolor(red)) ///
> if date > td(01jan2020) & loc_grand_name == "`l'" ///
> , xtitle(Date) xlabel(`dates2020' `dates2021', format(%tdYY-NN-DD) labsize(small)) xlabel(, grid) xlabel(, grid) ///
> xlabel(, angle(forty_five)) ylabel(, format(%12.0fc) labsize(small)) ylabel(, labsize(small) angle(horizontal)) ///
> ytitle(Daily deaths) title("COVID-19 daily deaths, `l', Johns Hopkins", size(medium)) ///
> xscale(lwidth(vthin) lcolor(gray*.2)) yscale(lwidth(vthin) lcolor(gray*.2)) yscale(titlegap(4)) legend(region(lcolor(none)))  ///
> legend(order(1 "Raw" 2 "Smoothed") size(small)) 
{txt}  9{com}. 
. qui graph save "graph 3 COVID-19 daily deaths `l' Johns Hopkins.gph", replace
{txt} 10{com}. qui graph export "graph 3 COVID-19 daily deaths `l' Johns Hopkins.pdf", replace
{txt} 11{com}. 
. 
. 
. ** Day CFR
. 
. * Day CFR raw
. 
. twoway ///
> (line DayCfrMeRaA00S00 date, sort lcolor(black)) ///
> if date > td(01jan2020) & loc_grand_name == "`l'" ///
> , xtitle(Date) xlabel(`dates2020' `dates2021', format(%tdYY-NN-DD) labsize(small)) xlabel(, grid) xlabel(, grid) ///
> xlabel(, angle(forty_five)) ylabel(, format(%9.2fc) labsize(small))  ylabel(, labsize(small) angle(horizontal)) ///
> ytitle(Daily CFR) title("COVID-19 daily CFR, `l', Johns Hopkins", size(medium)) ///
> xscale(lwidth(vthin) lcolor(gray*.2)) yscale(lwidth(vthin) lcolor(gray*.2)) legend(region(lcolor(none))) legend(bexpand) 
{txt} 12{com}. 
. qui graph save "graph 4 COVID-19 daily CFR, `l', Johns Hopkins.gph", replace
{txt} 13{com}. qui graph export "graph 4 COVID-19 daily CFR, `l', Johns Hopkins.pdf", replace
{txt} 14{com}. 
. 
. 
. * Day CFR smoothed
. 
. twoway ///
> (line DayCfrMeSmA00S00 date, sort lcolor(black)) ///
> if date > td(01jan2020) & loc_grand_name == "`l'" ///
> , xtitle(Date) xlabel(`dates2020' `dates2021', format(%tdYY-NN-DD) labsize(small)) xlabel(, grid) xlabel(, grid) ///
> xlabel(, angle(forty_five)) ylabel(, format(%9.2fc) labsize(small))  ylabel(, labsize(small) angle(horizontal)) ///
> ytitle(Daily CFR smoothed) title("COVID-19 daily CFR, smoothed, `l', Johns Hopkins", size(medium)) ///
> xscale(lwidth(vthin) lcolor(gray*.2)) yscale(lwidth(vthin) lcolor(gray*.2)) legend(region(lcolor(none))) legend(bexpand) 
{txt} 15{com}. 
. qui graph save "graph 5 COVID-19 daily CFR, smoothed `l', Johns Hopkins.gph", replace
{txt} 16{com}. qui graph export "graph 5 COVID-19 daily CFR, smoothed `l', Johns Hopkins.pdf", replace
{txt} 17{com}. 
. 
. 
. 
. * Day CFR raw and smoothed
. 
. twoway ///
> (line DayCfrMeRaA00S00 date, sort lcolor(gray)) ///
> (line DayCfrMeSmA00S00 date, sort lwidth(thick) lcolor(red)) ///
> if date > td(01jan2020) & loc_grand_name == "`l'" ///
> , xtitle(Date) xlabel(`dates2020' `dates2021', format(%tdYY-NN-DD) labsize(small)) xlabel(, grid) xlabel(, grid) ///
> xlabel(, angle(forty_five)) ylabel(, format(%9.2fc) labsize(small))  ylabel(, labsize(small) angle(horizontal)) ///
> ytitle(Daily CFR) title("COVID-19 daily CFR, `l', Johns Hopkins", size(medium)) ///
> xscale(lwidth(vthin) lcolor(gray*.2)) yscale(lwidth(vthin) lcolor(gray*.2)) legend(region(lcolor(none))) legend(bexpand) ///
> legend(order(1 "Raw" 2 "Smoothed") size(small)) ///
> 
{txt} 18{com}. qui graph save "graph 6 COVID-19 daily CFR, raw and smoothed, `l', Johns Hopkins.gph", replace
{txt} 19{com}. qui graph export "graph 6 COVID-19 daily CFR, raw and smoothed, `l', Johns Hopkins.pdf", replace
{txt} 20{com}. 
. 
. 
. 
. ** Cases to deaths ratio (CTD)
. 
. 
. * Day CTD raw and smoothed
. 
. twoway ///
> (line DayCTDMeRaA00S00 date, sort lcolor(gray)) ///
> (line DayCTDMeSmA00S00 date, sort lwidth(thick) lcolor(red)) ///
> if date > td(01jan2020) & loc_grand_name == "`l'" ///
> , xtitle(Date) xlabel(`dates2020' `dates2021', format(%tdYY-NN-DD) labsize(small)) xlabel(, grid) xlabel(, grid) ///
> xlabel(, angle(forty_five)) ylabel(, format(%9.2fc) labsize(small))  ylabel(, labsize(small) angle(horizontal)) ///
> ytitle(Daily Cases to deaths ratio) title("COVID-19 daily cases to deaths ratio, `l', Johns Hopkins", size(medium)) ///
> xscale(lwidth(vthin) lcolor(gray*.2)) yscale(lwidth(vthin) lcolor(gray*.2)) legend(region(lcolor(none))) legend(bexpand) ///
> legend(order(1 "Raw" 2 "Smoothed") size(small)) ///
> 
{txt} 21{com}. qui graph save "graph 7 COVID-19 daily CTD, raw and smoothed, `l', Johns Hopkins.gph", replace
{txt} 22{com}. qui graph export "graph 7 COVID-19 daily CTD, raw and smoothed, `l', Johns Hopkins.pdf", replace
{txt} 23{com}. 
. 
. 
. 
. * Tot CTD raw and smoothed
. 
. twoway ///
> (line TotCTDMeRaA00S00 date, sort lcolor(gray)) ///
> (line TotCTDMeSmA00S00 date, sort lwidth(thick) lcolor(red)) ///
> if date > td(01jan2020) & loc_grand_name == "`l'" ///
> , xtitle(Date) xlabel(`dates2020' `dates2021', format(%tdYY-NN-DD) labsize(small)) xlabel(, grid) xlabel(, grid) ///
> xlabel(, angle(forty_five)) ylabel(, format(%9.2fc) labsize(small))  ylabel(, labsize(small) angle(horizontal)) ///
> ytitle(Total Cases to deaths ratio) title("COVID-19 total cases to deaths ratio, `l', Johns Hopkins", size(medium)) ///
> xscale(lwidth(vthin) lcolor(gray*.2)) yscale(lwidth(vthin) lcolor(gray*.2)) legend(region(lcolor(none))) legend(bexpand) ///
> legend(order(1 "Raw" 2 "Smoothed") size(small)) ///
> 
{txt} 24{com}. qui graph save "graph 8 COVID-19 total CTD, raw and smoothed, `l', Johns Hopkins.gph", replace
{txt} 25{com}. qui graph export "graph 8 COVID-19 total CTD, raw and smoothed, `l', Johns Hopkins.pdf", replace
{txt} 26{com}. 
. 
. 
. {c )-}
{res}{txt}
{com}. *
. 
. 
. 
. 
. 
. 
. 
. 
. view "log EMR JOHN.smcl"
{txt}
{com}. 
. log close
      {txt}name:  {res}<unnamed>
       {txt}log:  {res}/Users/farshadpourmalek/Downloads/covir2-main/20210522/code/JOHNEMR/log EMR JOHN.smcl
  {txt}log type:  {res}smcl
 {txt}closed on:  {res}27 May 2021, 02:26:02
{txt}{.-}
{smcl}
{txt}{sf}{ul off}