{smcl}
{txt}{sf}{ul off}{.-}
      name:  {res}<unnamed>
       {txt}log:  {res}/Users/farshadpourmalek/Downloads/covir2-main/20210515/code/IHME/log Iran IHME.smcl
  {txt}log type:  {res}smcl
 {txt}opened on:  {res}19 May 2021, 06:59:46
{txt}
{com}. 
. ***************************************************************************
. * This is "do Iran IHME.do"
. 
. * Project: COVID-19 Iran Review No 2
. * Person: Farshad Pourmalek pourmalek_farshad@yahoo.com
. * Time (initial): 2021-02-10
. 
. * OBJECTIVE: Get and prepare IHME study estimates for Iran
. ***************************************************************************
. 
. 
. clear 
{txt}
{com}.  
. *****************************
. 
. * get IHME estimates
. 
. copy https://ihmecovid19storage.blob.core.windows.net/latest/ihme-covid19.zip ihme-covid19.zip
{txt}
{com}. unzipfile ihme-covid19.zip, replace
{res}{txt}    inflating: best_masks_hospitalization_all_locs.csv
    inflating: IHME_COVID_19_Data_Release_Information_Sheet.pdf
    inflating: reference_hospitalization_all_locs.csv
    inflating: Summary_stats_all_locs.csv
    inflating: worse_hospitalization_all_locs.csv
successfully unzipped ihme-covid19.zip to current directory

{com}. erase ihme-covid19.zip
{txt}
{com}. 
. /* The following URL contains the latest IHME updates:
> copy https://ihmecovid19storage.blob.core.windows.net/latest/ihme-covid19.zip ihme-covid19.zip
> unzipfile ihme-covid19.zip, replace
> erase ihme-covid19.zip */
. 
. 
. ******************************
. 
. * import csv files
. 
. // cd ihme-covid19 // similar code used to work before; does not work now; still do not know why.
. 
. import delimited using reference_hospitalization_all_locs.csv, clear varnames(1)
{res}{text}(88 vars, 216,793 obs)

{com}. save Reference_hospitalization_all_locs.dta, replace
{txt}(note: file Reference_hospitalization_all_locs.dta not found)
file Reference_hospitalization_all_locs.dta saved

{com}.         
. import delimited using best_masks_hospitalization_all_locs.csv, clear varnames(1)
{res}{text}(75 vars, 216,793 obs)

{com}. save Best_masks_hospitalization_all_locs.dta, replace
{txt}(note: file Best_masks_hospitalization_all_locs.dta not found)
file Best_masks_hospitalization_all_locs.dta saved

{com}.         
. import delimited using worse_hospitalization_all_locs.csv, clear varnames(1)
{res}{text}(75 vars, 216,793 obs)

{com}. save Worse_hospitalization_all_locs.dta, replace
{txt}(note: file Worse_hospitalization_all_locs.dta not found)
file Worse_hospitalization_all_locs.dta saved

{com}. 
. 
. 
. ******************************
. 
. * read scenario files
. 
. 
. **********************
. 
. * S1 Reference
. 
. use "Reference_hospitalization_all_locs.dta", clear
{txt}
{com}. 
. keep if strpos(location_name, "Iran")
{txt}(216,217 observations deleted)

{com}. 
. 
. * rename variables
. 
. * Total Deaths not smoothed
. rename totdea_mean  TotDeaMeRaA02S01
{res}{txt}
{com}. rename totdea_lower TotDeaLoRaA02S01
{res}{txt}
{com}. rename totdea_upper TotDeaUpRaA02S01
{res}{txt}
{com}. label var TotDeaMeRaA02S01 "Total Deaths Mean not smoothed IHME S1"
{txt}
{com}. label var TotDeaLoRaA02S01 "Total Deaths Lower not smoothed IHME S1"
{txt}
{com}. label var TotDeaUpRaA02S01 "Total Deaths Upper not smoothed IHME S1"
{txt}
{com}. 
. * Daily Deaths not smoothed
. rename deaths_mean  DayDeaMeRaA02S01
{res}{txt}
{com}. rename deaths_lower DayDeaLoRaA02S01
{res}{txt}
{com}. rename deaths_upper DayDeaUpRaA02S01
{res}{txt}
{com}. label var DayDeaMeRaA02S01 "Daily Deaths Mean not smoothed IHME S1"
{txt}
{com}. label var DayDeaLoRaA02S01 "Daily Deaths Lower not smoothed IHME S1"
{txt}
{com}. label var DayDeaUpRaA02S01 "Daily Deaths Upper not smoothed IHME S1"
{txt}
{com}.         
. * Total Cases not smoothed
. rename inf_cuml_mean  TotCasMeRaA02S01
{res}{txt}
{com}. rename inf_cuml_lower TotCasLoRaA02S01
{res}{txt}
{com}. rename inf_cuml_upper TotCasUpRaA02S01
{res}{txt}
{com}. label var TotCasMeRaA02S01 "Total Cases Mean not smoothed IHME S1"
{txt}
{com}. label var TotCasLoRaA02S01 "Total Cases Lower not smoothed IHME S1"
{txt}
{com}. label var TotCasUpRaA02S01 "Total Cases Upper not smoothed IHME S1"
{txt}
{com}. 
. * Daily Cases not smoothed
. rename est_infections_mean  DayCasMeRaA02S01
{res}{txt}
{com}. rename est_infections_lower DayCasLoRaA02S01
{res}{txt}
{com}. rename est_infections_upper DayCasUpRaA02S01
{res}{txt}
{com}. label var DayCasMeRaA02S01 "Daily Cases Mean not smoothed IHME S1"
{txt}
{com}. label var DayCasLoRaA02S01 "Daily Cases Lower not smoothed IHME S1"
{txt}
{com}. label var DayCasUpRaA02S01 "Daily Cases Upper not smoothed IHME S1"
{txt}
{com}. 
. * Total Deaths smoothed
. rename totdea_mean_smoothed   TotDeaMeSmA02S01
{res}{txt}
{com}. rename totdea_lower_smoothed  TotDeaLoSmA02S01
{res}{txt}
{com}. rename totdea_upper_smoothed  TotDeaUpSmA02S01
{res}{txt}
{com}. label var TotDeaMeSmA02S01 "Total Deaths Mean smoothed IHME S1"
{txt}
{com}. label var TotDeaLoSmA02S01 "Total Deaths Lower smoothed IHME S1"
{txt}
{com}. label var TotDeaUpSmA02S01 "Total Deaths Upper smoothed IHME S1"
{txt}
{com}. 
. * Daily Deaths smoothed
. rename deaths_mean_smoothed  DayDeaMeSmA02S01           
{res}{txt}
{com}. rename deaths_lower_smoothed DayDeaLoSmA02S01           
{res}{txt}
{com}. rename deaths_upper_smoothed DayDeaUpSmA02S01  
{res}{txt}
{com}. label var DayDeaMeSmA02S01 "Daily Deaths Mean smoothed IHME S1"
{txt}
{com}. label var DayDeaLoSmA02S01 "Daily Deaths Lower smoothed IHME S1"
{txt}
{com}. label var DayDeaUpSmA02S01 "Daily Deaths Upper smoothed IHME S1"
{txt}
{com}. 
. 
. 
. 
. 
. 
. 
. 
. * other outcomes 
. 
. /*
> allbed_mean             Mean covid beds needed by day
> allbed_lower    Lower uncertainty bound of covid beds needed by day
> allbed_upper    Upper uncertainty bound of covid beds needed by day
> icubed_mean             Mean ICU covid beds needed by day
> icubed_lower    Lower uncertainty bound of ICU covid beds needed by day
> icubed_upper    Upper uncertainty bound of ICU covid beds needed by day
> invven_mean             Mean invasive ventilation needed by day
> invven_lower    Lower uncertainty bound of invasive ventilation needed by day
> invven_upper    Upper uncertainty bound of invasive ventilation needed by day
> admis_mean              Mean hospital admissions by day
> admis_lower             Lower uncertainty bound of hospital admissions by day
> admis_upper             Upper uncertainty bound of hospital admissions by day
> newicu_mean             Mean number of new people going to the ICU by day
> newicu_lower    Lower uncertainty bound of the number of new people going to the ICU by day
> newicu_upper    Upper uncertainty bound of the number of new people going to the ICU by day
> bedover_mean    [covid all beds needed] - ([total bed capacity] - [average all bed usage])
> bedover_lower   Lower uncertainty bound of bedover (above)
> bedover_upper   Upper uncertainty bound of bedover (above)
> icuover_mean    [covid ICU beds needed] - ([total ICU capacity] - [average ICU bed usage])
> icuover_lower   Lower uncertainty bound of icuover (above)
> icuover_upper   Upper uncertainty bound of icuover (above)
> 
> total_tests             Total tests
> 
> seroprev_mean
> seroprev_lower
> seroprev_upper  
> 
> 
> ***********************
> * rename convention
> 
> allbed          Bed     covid beds needed by day
> icubed          Icu     ICU covid beds needed by day
> invven          Ven     invasive ventilation needed by day
> admis           Adm     hospital admissions by day
> newicu          Icn             number of new people going to the ICU by day
> bedover         Beo             [covid all beds needed] - ([total bed capacity] - [average all bed usage])
> icuover         Ico             [covid ICU beds needed] - ([total ICU capacity] - [average ICU bed usage])
> 
> total_tests             Tes     tests
> 
> seroprev_mean   Ser seroprevalence 
> 
> */
. 
. 
. rename allbed_mean              DayBedMeSmA02S01
{res}{txt}
{com}. rename allbed_lower             DayBedLoSmA02S01
{res}{txt}
{com}. rename allbed_upper             DayBedUpSmA02S01
{res}{txt}
{com}. 
. label var DayBedMeSmA02S01 "Daily Beds needed Mean IHME S1"
{txt}
{com}. label var DayBedLoSmA02S01 "Daily Beds needed Lower IHME S1"
{txt}
{com}. label var DayBedUpSmA02S01 "Daily Beds needed Upper IHME S1"
{txt}
{com}. 
. 
. 
. rename icubed_mean              DayIcuMeSmA02S01
{res}{txt}
{com}. rename icubed_lower             DayIcuLoSmA02S01
{res}{txt}
{com}. rename icubed_upper             DayIcuUpSmA02S01
{res}{txt}
{com}. 
. label var DayIcuMeSmA02S01 "Daily ICU beds needed Mean IHME S1"
{txt}
{com}. label var DayIcuLoSmA02S01 "Daily ICU beds needed Lower IHME S1"
{txt}
{com}. label var DayIcuUpSmA02S01 "Daily ICU beds needed Upper IHME S1"
{txt}
{com}. 
. 
. /* 
> rename invven_mean              DayVenMeSmA02S01
> rename invven_lower             DayVenLoSmA02S01
> rename invven_upper             DayVenUpSmA02S01
> 
> label var DayVenMeSmA02S01 "Daily invasive Ventilation needed Mean IHME S1"
> label var DayVenLoSmA02S01 "Daily invasive Ventilation needed Lower IHME S1"
> label var DayVenUpSmA02S01 "Daily invasive Ventilation needed Upper IHME S1"
> */ 
. 
. 
. rename admis_mean               DayAdmMeSmA02S01
{res}{txt}
{com}. rename admis_lower              DayAdmLoSmA02S01
{res}{txt}
{com}. rename admis_upper              DayAdmUpSmA02S01
{res}{txt}
{com}. 
. label var DayAdmMeSmA02S01 "Daily hospital admissions Mean IHME S1"
{txt}
{com}. label var DayAdmLoSmA02S01 "Daily hospital admissions Lower IHME S1"
{txt}
{com}. label var DayAdmUpSmA02S01 "Daily hospital admissions Upper IHME S1"
{txt}
{com}. 
. 
. 
. rename newicu_mean              DayIcnMeSmA02S01
{res}{txt}
{com}. rename newicu_lower             DayIcnLoSmA02S01
{res}{txt}
{com}. rename newicu_upper             DayIcnUpSmA02S01
{res}{txt}
{com}. 
. label var DayIcnMeSmA02S01 "Daily new people going to ICU Mean IHME S1"
{txt}
{com}. label var DayIcnLoSmA02S01 "Daily new people going to ICU Lower IHME S1"
{txt}
{com}. label var DayIcnUpSmA02S01 "Daily new people going to ICU Upper IHME S1"
{txt}
{com}. 
. 
. /* vars bedover and icuover seem to have been retired?
> 
> rename bedover_mean                     DayBeoMeSmA02S01
> rename bedover_lower            DayBeoLoSmA02S01
> rename bedover_upper            DayBeoUpSmA02S01
> 
> label var DayBeoMeSmA02S01 "Daily bedover [covid all beds needed] - ([total bed capacity] - [average all bed usage]) Mean IHME S1"
> label var DayBeoLoSmA02S01 "Daily bedover [covid all beds needed] - ([total bed capacity] - [average all bed usage]) Lower IHME S1"
> label var DayBeoUpSmA02S01 "Daily bedover [covid all beds needed] - ([total bed capacity] - [average all bed usage]) Upper IHME S1"
> 
> 
> 
> rename icuover_mean                     DayIcoMeSmA02S01
> rename icuover_lower            DayIcoLoSmA02S01
> rename icuover_upper            DayIcoUpSmA02S01
> 
> label var DayIcoMeSmA02S01 "Daily icuover [covid ICU beds needed] - ([total ICU capacity] - [average ICU bed usage]) Mean IHME S1"
> label var DayIcoLoSmA02S01 "Daily icuover [covid ICU beds needed] - ([total ICU capacity] - [average ICU bed usage]) Lower IHME S1"
> label var DayIcoUpSmA02S01 "Daily icuover [covid ICU beds needed] - ([total ICU capacity] - [average ICU bed usage]) Upper IHME S1"
> */ 
. 
. 
. rename total_tests TotTesMeSmA02S01
{res}{txt}
{com}. 
. label var TotTesMeSmA02S01 "Total Tests Mean IHME S1"
{txt}
{com}. 
. 
. 
. rename seroprev_mean            TotSerMeSmA02S01
{res}{txt}
{com}. rename seroprev_upper           TotSerLoSmA02S01
{res}{txt}
{com}. rename seroprev_lower           TotSerUpSmA02S01
{res}{txt}
{com}. 
. label var TotSerMeSmA02S01 "Total seroprevalence Mean IHME S1"
{txt}
{com}. label var TotSerLoSmA02S01 "Total seroprevalence Lower IHME S1"
{txt}
{com}. label var TotSerUpSmA02S01 "Total seroprevalence Upper IHME S1"
{txt}
{com}. 
. 
. save "Reference Iran.dta", replace
{txt}(note: file Reference Iran.dta not found)
file Reference Iran.dta saved

{com}. 
. 
. 
. 
. 
. 
. 
. **********************
. 
. * S2 Best
. 
. use "Best_masks_hospitalization_all_locs.dta", clear
{txt}
{com}. 
. keep if strpos(location_name, "Iran")
{txt}(216,217 observations deleted)

{com}. 
. 
. * rename variables
. 
. 
. * Total Deaths not smoothed
. rename totdea_mean  TotDeaMeRaA02S02V04
{res}{txt}
{com}. rename totdea_lower TotDeaLoRaA02S02V04
{res}{txt}
{com}. rename totdea_upper TotDeaUpRaA02S02V04
{res}{txt}
{com}. label var TotDeaMeRaA02S02V04 "Total Deaths Mean not smoothed IHME S2"
{txt}
{com}. label var TotDeaLoRaA02S02V04 "Total Deaths Lower not smoothed IHME S2"
{txt}
{com}. label var TotDeaUpRaA02S02V04 "Total Deaths Upper not smoothed IHME S2"
{txt}
{com}. 
. * Daily Deaths not smoothed
. rename deaths_mean  DayDeaMeRaA02S02V04
{res}{txt}
{com}. rename deaths_lower DayDeaLoRaA02S02V04
{res}{txt}
{com}. rename deaths_upper DayDeaUpRaA02S02V04
{res}{txt}
{com}. label var DayDeaMeRaA02S02V04 "Daily Deaths Mean not smoothed IHME S2"
{txt}
{com}. label var DayDeaLoRaA02S02V04 "Daily Deaths Lower not smoothed IHME S2"
{txt}
{com}. label var DayDeaUpRaA02S02V04 "Daily Deaths Upper not smoothed IHME S2"
{txt}
{com}.         
. * Total Cases not smoothed
. rename inf_cuml_mean  TotCasMeRaA02S02V04
{res}{txt}
{com}. rename inf_cuml_lower TotCasLoRaA02S02V04
{res}{txt}
{com}. rename inf_cuml_upper TotCasUpRaA02S02V04
{res}{txt}
{com}. label var TotCasMeRaA02S02V04 "Total Cases Mean not smoothed IHME S2"
{txt}
{com}. label var TotCasLoRaA02S02V04 "Total Cases Lower not smoothed IHME S2"
{txt}
{com}. label var TotCasUpRaA02S02V04 "Total Cases Upper not smoothed IHME S2"
{txt}
{com}. 
. * Daily Cases not smoothed
. rename est_infections_mean  DayCasMeRaA02S02V04
{res}{txt}
{com}. rename est_infections_lower DayCasLoRaA02S02V04
{res}{txt}
{com}. rename est_infections_upper DayCasUpRaA02S02V04
{res}{txt}
{com}. label var DayCasMeRaA02S02V04 "Daily Cases Mean not smoothed IHME S2"
{txt}
{com}. label var DayCasLoRaA02S02V04 "Daily Cases Lower not smoothed IHME S2"
{txt}
{com}. label var DayCasUpRaA02S02V04 "Daily Cases Upper not smoothed IHME S2"
{txt}
{com}. 
. * Total Deaths smoothed
. rename totdea_mean_smoothed   TotDeaMeSmA02S02V04
{res}{txt}
{com}. rename totdea_lower_smoothed  TotDeaLoSmA02S02V04
{res}{txt}
{com}. rename totdea_upper_smoothed  TotDeaUpSmA02S02V04
{res}{txt}
{com}. label var TotDeaMeSmA02S02V04 "Total Deaths Mean smoothed IHME S2"
{txt}
{com}. label var TotDeaLoSmA02S02V04 "Total Deaths Lower smoothed IHME S2"
{txt}
{com}. label var TotDeaUpSmA02S02V04 "Total Deaths Upper smoothed IHME S2"
{txt}
{com}. 
. * Daily Deaths smoothed
. rename deaths_mean_smoothed  DayDeaMeSmA02S02V04        
{res}{txt}
{com}. rename deaths_lower_smoothed DayDeaLoSmA02S02V04        
{res}{txt}
{com}. rename deaths_upper_smoothed DayDeaUpSmA02S02V04  
{res}{txt}
{com}. label var DayDeaMeSmA02S02V04 "Daily Deaths Mean smoothed IHME S2"
{txt}
{com}. label var DayDeaLoSmA02S02V04 "Daily Deaths Lower smoothed IHME S2"
{txt}
{com}. label var DayDeaUpSmA02S02V04 "Daily Deaths Upper smoothed IHME S2"
{txt}
{com}. 
. 
. 
. 
. * other outcomes
. 
. 
. rename total_tests TotTesMeSmA02S02V04
{res}{txt}
{com}. 
. label var TotTesMeSmA02S02V04 "Total Tests Mean IHME S2"
{txt}
{com}. 
. 
. 
. rename seroprev_mean            TotSerMeSmA02S02V04
{res}{txt}
{com}. rename seroprev_upper           TotSerLoSmA02S02V04
{res}{txt}
{com}. rename seroprev_lower           TotSerUpSmA02S02V04
{res}{txt}
{com}. 
. label var TotSerMeSmA02S02V04 "Total seroprevalence Mean IHME S2"
{txt}
{com}. label var TotSerLoSmA02S02V04 "Total seroprevalence Lower IHME S2"
{txt}
{com}. label var TotSerUpSmA02S02V04 "Total seroprevalence Upper IHME S2"
{txt}
{com}. 
. 
. save "Best Iran.dta", replace
{txt}(note: file Best Iran.dta not found)
file Best Iran.dta saved

{com}. 
. 
. 
. 
. 
. 
. 
. 
. **********************
. 
. * S3 Worse
. 
. use "Worse_hospitalization_all_locs.dta", clear
{txt}
{com}. 
. keep if strpos(location_name, "Iran")
{txt}(216,217 observations deleted)

{com}. 
. 
. 
. * Total Deaths not smoothed
. rename totdea_mean  TotDeaMeRaA02S03V04
{res}{txt}
{com}. rename totdea_lower TotDeaLoRaA02S03V04
{res}{txt}
{com}. rename totdea_upper TotDeaUpRaA02S03V04
{res}{txt}
{com}. label var TotDeaMeRaA02S03V04 "Total Deaths Mean not smoothed IHME S3"
{txt}
{com}. label var TotDeaLoRaA02S03V04 "Total Deaths Lower not smoothed IHME S3"
{txt}
{com}. label var TotDeaUpRaA02S03V04 "Total Deaths Upper not smoothed IHME S3"
{txt}
{com}. 
. * Daily Deaths not smoothed
. rename deaths_mean  DayDeaMeRaA02S03V04
{res}{txt}
{com}. rename deaths_lower DayDeaLoRaA02S03V04
{res}{txt}
{com}. rename deaths_upper DayDeaUpRaA02S03V04
{res}{txt}
{com}. label var DayDeaMeRaA02S03V04 "Daily Deaths Mean not smoothed IHME S3"
{txt}
{com}. label var DayDeaLoRaA02S03V04 "Daily Deaths Lower not smoothed IHME S3"
{txt}
{com}. label var DayDeaUpRaA02S03V04 "Daily Deaths Upper not smoothed IHME S3"
{txt}
{com}.         
. * Total Cases not smoothed
. rename inf_cuml_mean  TotCasMeRaA02S03V04
{res}{txt}
{com}. rename inf_cuml_lower TotCasLoRaA02S03V04
{res}{txt}
{com}. rename inf_cuml_upper TotCasUpRaA02S03V04
{res}{txt}
{com}. label var TotCasMeRaA02S03V04 "Total Cases Mean not smoothed IHME S3"
{txt}
{com}. label var TotCasLoRaA02S03V04 "Total Cases Lower not smoothed IHME S3"
{txt}
{com}. label var TotCasUpRaA02S03V04 "Total Cases Upper not smoothed IHME S3"
{txt}
{com}. 
. * Daily Cases not smoothed
. rename est_infections_mean  DayCasMeRaA02S03V04
{res}{txt}
{com}. rename est_infections_lower DayCasLoRaA02S03V04
{res}{txt}
{com}. rename est_infections_upper DayCasUpRaA02S03V04
{res}{txt}
{com}. label var DayCasMeRaA02S03V04 "Daily Cases Mean not smoothed IHME S3"
{txt}
{com}. label var DayCasLoRaA02S03V04 "Daily Cases Lower not smoothed IHME S3"
{txt}
{com}. label var DayCasUpRaA02S03V04 "Daily Cases Upper not smoothed IHME S3"
{txt}
{com}. 
. * Total Deaths smoothed
. rename totdea_mean_smoothed   TotDeaMeSmA02S03V04
{res}{txt}
{com}. rename totdea_lower_smoothed  TotDeaLoSmA02S03V04
{res}{txt}
{com}. rename totdea_upper_smoothed  TotDeaUpSmA02S03V04
{res}{txt}
{com}. label var TotDeaMeSmA02S03V04 "Total Deaths Mean smoothed IHME S3"
{txt}
{com}. label var TotDeaLoSmA02S03V04 "Total Deaths Lower smoothed IHME S3"
{txt}
{com}. label var TotDeaUpSmA02S03V04 "Total Deaths Upper smoothed IHME S3"
{txt}
{com}. 
. * Daily Deaths smoothed
. rename deaths_mean_smoothed  DayDeaMeSmA02S03V04        
{res}{txt}
{com}. rename deaths_lower_smoothed DayDeaLoSmA02S03V04        
{res}{txt}
{com}. rename deaths_upper_smoothed DayDeaUpSmA02S03V04  
{res}{txt}
{com}. label var DayDeaMeSmA02S03V04 "Daily Deaths Mean smoothed IHME S3"
{txt}
{com}. label var DayDeaLoSmA02S03V04 "Daily Deaths Lower smoothed IHME S3"
{txt}
{com}. label var DayDeaUpSmA02S03V04 "Daily Deaths Upper smoothed IHME S3"
{txt}
{com}. 
. 
. * other outcomes
. 
. rename total_tests TotTesMeSmA02S03V04
{res}{txt}
{com}. 
. label var TotTesMeSmA02S03V04 "Total Tests Mean IHME S3"
{txt}
{com}. 
. 
. 
. rename seroprev_mean            TotSerMeSmA02S03V04
{res}{txt}
{com}. rename seroprev_upper           TotSerLoSmA02S03V04
{res}{txt}
{com}. rename seroprev_lower           TotSerUpSmA02S03V04
{res}{txt}
{com}. 
. label var TotSerMeSmA02S03V04 "Total seroprevalence Mean IHME S3"
{txt}
{com}. label var TotSerLoSmA02S03V04 "Total seroprevalence Lower IHME S3"
{txt}
{com}. label var TotSerUpSmA02S03V04 "Total seroprevalence Upper IHME S3"
{txt}
{com}. 
. 
. 
. save "Worse Iran.dta", replace
{txt}(note: file Worse Iran.dta not found)
file Worse Iran.dta saved

{com}. 
. 
.  
.  
.  
. **********************
. 
.  
. * merge scenario files
. 
. 
. use "Reference Iran.dta", clear
{txt}
{com}. merge 1:1 location_name date using "Best Iran.dta"
{res}
{txt}{col 5}Result{col 38}# of obs.
{col 5}{hline 41}
{col 5}not matched{col 30}{res}               0
{txt}{col 5}matched{col 30}{res}             576{txt}  (_merge==3)
{col 5}{hline 41}

{com}. drop _merge
{txt}
{com}. merge 1:1 location_name date using "Worse Iran.dta"
{res}
{txt}{col 5}Result{col 38}# of obs.
{col 5}{hline 41}
{col 5}not matched{col 30}{res}               0
{txt}{col 5}matched{col 30}{res}             576{txt}  (_merge==3)
{col 5}{hline 41}

{com}. drop _merge
{txt}
{com}. 
. 
. rename date date_original
{res}{txt}
{com}. gen year = substr(date_original,1,4) 
{txt}
{com}. gen month = substr(date_original,6,2) 
{txt}
{com}. gen day = substr(date_original,9,2) 
{txt}
{com}. egen date2 = concat(day month year)
{txt}
{com}. gen date = date(date2, "DMY", 2050)
{txt}
{com}. format date %tdDDMonCCYY
{txt}
{com}. codebook date

{txt}{hline}
{res}date{right:(unlabeled)}
{txt}{hline}

{col 19}type:  numeric daily date ({res}float{txt})

{col 18}range:  [{res}21949{txt},{res}22524{txt}]{col 55}units:  {res}1
{col 8}{txt}or equivalently:  [{res}04feb2020{txt},{res}01sep2021{txt}]{col 55}units:  {res}days
{col 10}{txt}unique values:  {res}576{col 51}{txt}missing .:  {res}0{txt}/{res}576

{txt}{col 19}mean:{res}{col 26} 22236.5{txt} = {res}17nov2020{txt} (+ 12 hours)
{col 15}std. dev:{res}{col 26} 166.421

{txt}{col 12}percentiles:{col 32}10%{col 42}25%{col 52}50%{col 62}75%{col 72}90%
{res}{col 27}   22006{col 37} 22092.5{col 47} 22236.5{col 57} 22380.5{col 67}   22467
{col 26}01apr2020{col 36}26jun2020{col 46}17nov2020{col 56}10apr2021{col 66}06jul2021
{txt}
{com}. drop year month day date2
{txt}
{com}. 
. 
. 
. rename location_name loc_grand_name
{res}{txt}
{com}. 
. replace loc_grand_name = "Iran"
{txt}(576 real changes made)

{com}. 
. 
. 
. 
. drop date_original v1 hosp_data_type deaths_data_type ///
> mobility_data_type mobility_composite ///
> confirmed_infections_data_type confirmed_infections est_infections_data_type ///
> total_pop seroprev_data_type
{txt}
{com}. 
. order deaths_mean_p100k_rate-est_infections_upper_p100k_rate, last
{txt}
{com}. 
. 
. sort date
{txt}
{com}. 
. compress
  {txt}variable {bf}location_id{sf} was {bf}{res}long{sf}{txt} now {bf}{res}int{sf}
  {txt}variable {bf}date{sf} was {bf}{res}float{sf}{txt} now {bf}{res}int{sf}
  {txt}variable {bf}loc_grand_name{sf} was {bf}{res}str48{sf}{txt} now {bf}{res}str4{sf}
{txt}  (27,648 bytes saved)

{com}. 
. 
. 
. * gen cfr
. 
. gen DayCfrMeRaA02S01 = 100 * DayDeaMeRaA02S01 / DayCasMeRaA02S01
{txt}
{com}. gen DayCfrLoRaA02S01 = 100 * DayDeaLoRaA02S01 / DayCasLoRaA02S01
{txt}(461 missing values generated)

{com}. gen DayCfrUpRaA02S01 = 100 * DayDeaUpRaA02S01 / DayCasUpRaA02S01
{txt}(461 missing values generated)

{com}. gen DayCfrMeRaA02S02V04 = 100 * DayDeaMeRaA02S02V04 / DayCasMeRaA02S02V04
{txt}(461 missing values generated)

{com}. gen DayCfrLoRaA02S02V04 = 100 * DayDeaLoRaA02S02V04 / DayCasLoRaA02S02V04
{txt}(461 missing values generated)

{com}. gen DayCfrUpRaA02S02V04 = 100 * DayDeaUpRaA02S02V04 / DayCasUpRaA02S02V04
{txt}(461 missing values generated)

{com}. gen DayCfrMeRaA02S03V04 = 100 * DayDeaMeRaA02S03V04 / DayCasMeRaA02S03V04
{txt}(461 missing values generated)

{com}. gen DayCfrLoRaA02S03V04 = 100 * DayDeaLoRaA02S03V04 / DayCasLoRaA02S03V04
{txt}(461 missing values generated)

{com}. gen DayCfrUpRaA02S03V04 = 100 * DayDeaUpRaA02S03V04 / DayCasUpRaA02S03V04
{txt}(461 missing values generated)

{com}. 
. label var DayCfrMeRaA02S01 "Daily CFR Mean Raw IHME S1" 
{txt}
{com}. label var DayCfrLoRaA02S01 "Daily CFR Lower Raw IHME S1" 
{txt}
{com}. label var DayCfrUpRaA02S01 "Daily CFR Upper Raw IHME S1" 
{txt}
{com}. label var DayCfrMeRaA02S02V04 "Daily CFR Mean Raw IHME S2" 
{txt}
{com}. label var DayCfrLoRaA02S02V04 "Daily CFR Lower Raw IHME S2" 
{txt}
{com}. label var DayCfrUpRaA02S02V04 "Daily CFR Upper Raw IHME S2" 
{txt}
{com}. label var DayCfrMeRaA02S03V04 "Daily CFR Mean Raw IHME S3" 
{txt}
{com}. label var DayCfrLoRaA02S03V04 "Daily CFR Lower Raw IHME S3" 
{txt}
{com}. label var DayCfrUpRaA02S03V04 "Daily CFR Upper Raw IHME S3" 
{txt}
{com}. 
. 
. 
. 
. 
. 
. 
. label var deaths_mean_p100k_rate "Daily deaths mean raw per 100k rate IHME"
{txt}
{com}. 
. label var deaths_lower_p100k_rate "Daily deaths lower raw per 100k rate IHME"
{txt}
{com}. 
. label var deaths_upper_p100k_rate "Daily deaths upper raw per 100k rate IHME"
{txt}
{com}. 
. label var totdea_mean_p100k_rate "Total deaths mean per raw 100k rate IHME"
{txt}
{com}. 
. label var totdea_lower_p100k_rate "Total deaths mean per raw 100k rate IHME"
{txt}
{com}. 
. label var totdea_upper_p100k_rate "Total deaths upper per raw 100k rate IHME"
{txt}
{com}. 
. label var deaths_mean_smoothed_p100k_rate "Daily deaths mean smoothed per 100k rate IHME"
{txt}
{com}. 
. label var deaths_lower_smoothed_p100k_rate "Daily deaths lower smoothed per 100k rate IHME"
{txt}
{com}. 
. label var deaths_upper_smoothed_p100k_rate "Daily deaths upper smoothed per 100k rate IHME"
{txt}
{com}. 
. label var totdea_mean_smoothed_p100k_rate "Total deaths mean smoothed per 100k rate IHME"
{txt}
{com}. 
. label var totdea_lower_smoothed_p100k_rate "Total deaths lower smoothed per 100k rate IHME"
{txt}
{com}. 
. label var totdea_upper_smoothed_p100k_rate "Total deaths upper smoothed per 100k rate IHME"
{txt}
{com}. 
. label var confirmed_infections_p100k_rate  "confirmed infections per 100k rate IHME"
{txt}
{com}. 
. label var est_infections_mean_p100k_rate "estimated infections mean per 100k rate IHME"
{txt}
{com}. 
. label var est_infections_lower_p100k_rate "estimated infections lower per 100k rate IHME"
{txt}
{com}. 
. label var est_infections_upper_p100k_rate "estimated infections upper per 100k rate IHME"
{txt}
{com}. 
. 
. 
. 
. *
. 
. 
. 
. * gen "Daily cases mean div by daily deaths mean IHME DayCbD" for visulization of temporal relation of deaths and cases peaks 
. 
. 
. summ DayDeaMeSmA02S01 

{txt}    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayDeaMeS~01 {c |}{res}        576    387.4865    275.6355          0   1131.955
{txt}
{com}. gen DayDeMMeSmA02S01 = r(mean)
{txt}
{com}. label var DayDeMMeSmA02S01 "Daily deaths mean IHME DayDeM"
{txt}
{com}. 
. summ DayCasMeRaA02S01 

{txt}    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayCasMeR~01 {c |}{res}        576    72209.29    39266.65   901.0286   171225.9
{txt}
{com}. gen DayCaMMeRaA02S01 = r(mean)
{txt}
{com}. label var DayCaMMeRaA02S01 "Daily cases mean IHME DayCaM"
{txt}
{com}.                            
. gen DayCbDMeRaA02S01 = DayCaMMeRaA02S01 / DayDeMMeSmA02S01
{txt}
{com}. label var DayCbDMeRaA02S01 "Daily cases mean div by daily deaths mean IHME DayCbD"
{txt}
{com}. summ DayCbDMeRaA02S01

{txt}    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayCbDMeR~01 {c |}{res}        576     186.353           0    186.353    186.353
{txt}
{com}.                                               
. gen DayDMuMeRaA02S01 = DayDeaMeRaA02S01 * DayCbDMeRaA02S01
{txt}
{com}. label var DayDMuMeRaA02S01 "Daily deaths scaled (times means of cases by deaths) IHME"
{txt}
{com}. summ DayDMuMeRaA02S01

{txt}    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayDMuMeR~01 {c |}{res}        576    71986.26    51474.79          0   220823.9
{txt}
{com}. 
. 
. 
. 
. 
. 
. ***********************
. 
. 
. * graphs
. 
. 
. grstyle init
{res}{txt}
{com}. 
. grstyle color background white
{txt}
{com}. 
. 
. summ date

{txt}    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
{space 8}date {c |}{res}        576     22236.5    166.4212      21949      22524
{txt}
{com}. 
. local xticks = ceil( ( r(max) - r(min) ) / 30 )
{txt}
{com}. 
. di `xticks'
{res}20
{txt}
{com}. 
. 
. 
. * daily deaths
. 
. 
. * daily deaths, medain scenario = S1       
.            
. twoway (rarea DayDeaLoSmA02S01 DayDeaUpSmA02S01 date, sort color(black*.2)) ///
> (line DayDeaMeSmA02S01 date, sort lcolor(black)) ///
> , xtitle(Date) xlabel(#`xticks', format(%tdYY-NN-DD) labsize(small)) xlabel(, grid) xlabel(, grid) ///
> xlabel(, angle(forty_five)) ylabel(, format(%9.0fc) labsize(small))  ylabel(, labsize(small) angle(horizontal)) ///
> ytitle(Daily deaths) title("COVID-19 daily deaths, Iran, IHME, reference scenario", size(medium)) ///
> xscale(lwidth(vthin) lcolor(gray*.2)) yscale(lwidth(vthin) lcolor(gray*.2)) legend(off) 
{res}{txt}
{com}.            
. graph save "graph 1 COVID-19 daily deaths, reference scenario, Iran, IHME.gph", replace
{txt}(note: file graph 1 COVID-19 daily deaths, reference scenario, Iran, IHME.gph not found)
{res}{txt}(file graph 1 COVID-19 daily deaths, reference scenario, Iran, IHME.gph saved)

{com}. graph export "graph 1 COVID-19 daily deaths, reference scenario, Iran, IHME.pdf", replace
{txt}(file /Users/farshadpourmalek/Downloads/covir2-main/20210515/code/IHME/graph 1 COVID-19 daily deaths, reference scenario, Iran, IHME.pdf written in PDF format)

{com}. 
. 
. 
. 
. * daily deaths, 3 scenarios  
.   
. twoway ///
> (line DayDeaMeSmA02S01 date, sort lcolor(black) lwidth(vthick) lpattern(tight_dot)) ///
> (line DayDeaMeSmA02S02V04 date, sort lcolor(green)) ///
> (line DayDeaMeSmA02S03V04 date, sort lcolor(red)) ///
> , xtitle(Date) xlabel(#`xticks', format(%tdYY-NN-DD) labsize(small)) xlabel(, grid) xlabel(, grid) ///
> xlabel(, angle(forty_five)) ylabel(, format(%9.0fc) labsize(small))  ylabel(, labsize(small) angle(horizontal)) ///
> ytitle(Daily deaths) title("COVID-19 daily deaths, Iran, IHME, 3 scenarios", size(medium)) ///
> xscale(lwidth(vthin) lcolor(gray*.2)) yscale(lwidth(vthin) lcolor(gray*.2)) legend(region(lcolor(none))) legend(bexpand) ///
> legend(order(1 "S1" 2 "S2" 3 "S3") rows(1))
{res}{txt}
{com}. 
. graph save "graph 2 COVID-19 daily deaths, Iran 3 scenarios, IHME.gph", replace
{txt}(note: file graph 2 COVID-19 daily deaths, Iran 3 scenarios, IHME.gph not found)
{res}{txt}(file graph 2 COVID-19 daily deaths, Iran 3 scenarios, IHME.gph saved)

{com}. graph export "graph 2 COVID-19 daily deaths, Iran 3 scenarios, IHME.pdf", replace
{txt}(file /Users/farshadpourmalek/Downloads/covir2-main/20210515/code/IHME/graph 2 COVID-19 daily deaths, Iran 3 scenarios, IHME.pdf written in PDF format)

{com}. 
. 
. 
. 
. * daily deaths, medain scenario = S1, CI
.   
. twoway ///
> (line DayDeaMeSmA02S01 date, sort lcolor(black)) ///
> (line DayDeaLoSmA02S01 date, sort lcolor(green)) ///
> (line DayDeaUpSmA02S01 date, sort lcolor(red)) ///
> , xtitle(Date) xlabel(#`xticks', format(%tdYY-NN-DD) labsize(small)) xlabel(, grid) xlabel(, grid) ///
> xlabel(, angle(forty_five)) ylabel(, format(%9.0fc) labsize(small))  ylabel(, labsize(small) angle(horizontal)) ///
> ytitle(Daily deaths) title("COVID-19 daily deaths, Iran, IHME, median scenario", size(medium)) ///
> xscale(lwidth(vthin) lcolor(gray*.2)) yscale(lwidth(vthin) lcolor(gray*.2)) legend(region(lcolor(none))) legend(bexpand) ///
> legend(order(1 "Mean" 2 "Lower" 3 "Upper") rows(1))
{res}{txt}
{com}. 
. graph save "graph 3 COVID-19 daily deaths, Iran median scenario CI, IHME.gph", replace
{txt}(note: file graph 3 COVID-19 daily deaths, Iran median scenario CI, IHME.gph not found)
{res}{txt}(file graph 3 COVID-19 daily deaths, Iran median scenario CI, IHME.gph saved)

{com}. graph export "graph 3 COVID-19 daily deaths, Iran median scenario CI, IHME.pdf", replace
{txt}(file /Users/farshadpourmalek/Downloads/covir2-main/20210515/code/IHME/graph 3 COVID-19 daily deaths, Iran median scenario CI, IHME.pdf written in PDF format)

{com}. 
. 
. 
. 
. * daily deaths, best scenario = S2, CI
.   
. twoway ///
> (line DayDeaMeSmA02S02V04 date, sort lcolor(black)) ///
> (line DayDeaLoSmA02S02V04 date, sort lcolor(green)) ///
> (line DayDeaUpSmA02S02V04 date, sort lcolor(red)) ///
> , xtitle(Date) xlabel(#`xticks', format(%tdYY-NN-DD) labsize(small)) xlabel(, grid) xlabel(, grid) ///
> xlabel(, angle(forty_five)) ylabel(, format(%9.0fc) labsize(small))  ylabel(, labsize(small) angle(horizontal)) ///
> ytitle(Daily deaths) title("COVID-19 daily deaths, Iran, IHME, best scenario", size(medium)) ///
> xscale(lwidth(vthin) lcolor(gray*.2)) yscale(lwidth(vthin) lcolor(gray*.2)) legend(region(lcolor(none))) legend(bexpand) ///
> legend(order(1 "Mean" 2 "Lower" 3 "Upper") rows(1))
{res}{txt}
{com}. 
. graph save "graph 4 COVID-19 daily deaths, Iran best scenario CI, IHME.gph", replace
{txt}(note: file graph 4 COVID-19 daily deaths, Iran best scenario CI, IHME.gph not found)
{res}{txt}(file graph 4 COVID-19 daily deaths, Iran best scenario CI, IHME.gph saved)

{com}. graph export "graph 4 COVID-19 daily deaths, Iran best scenario CI, IHME.pdf", replace
{txt}(file /Users/farshadpourmalek/Downloads/covir2-main/20210515/code/IHME/graph 4 COVID-19 daily deaths, Iran best scenario CI, IHME.pdf written in PDF format)

{com}. 
. 
. 
. 
. * daily deaths, worst scenario = S3, CI
.   
. twoway ///
> (line DayDeaMeSmA02S03V04 date, sort lcolor(black)) ///
> (line DayDeaLoSmA02S03V04 date, sort lcolor(green)) ///
> (line DayDeaUpSmA02S03V04 date, sort lcolor(red)) ///
> , xtitle(Date) xlabel(#`xticks', format(%tdYY-NN-DD) labsize(small)) xlabel(, grid) xlabel(, grid) ///
> xlabel(, angle(forty_five)) ylabel(, format(%9.0fc) labsize(small))  ylabel(, labsize(small) angle(horizontal)) ///
> ytitle(Daily deaths) title("COVID-19 daily deaths, Iran, IHME, worst scenario", size(medium)) ///
> xscale(lwidth(vthin) lcolor(gray*.2)) yscale(lwidth(vthin) lcolor(gray*.2)) legend(region(lcolor(none))) legend(bexpand) ///
> legend(order(1 "Mean" 2 "Lower" 3 "Upper") rows(1))
{res}{txt}
{com}. 
. graph save "graph 5 COVID-19 daily deaths, Iran worst scenario CI, IHME.gph", replace
{txt}(note: file graph 5 COVID-19 daily deaths, Iran worst scenario CI, IHME.gph not found)
{res}{txt}(file graph 5 COVID-19 daily deaths, Iran worst scenario CI, IHME.gph saved)

{com}. graph export "graph 5 COVID-19 daily deaths, Iran worst scenario CI, IHME.pdf", replace
{txt}(file /Users/farshadpourmalek/Downloads/covir2-main/20210515/code/IHME/graph 5 COVID-19 daily deaths, Iran worst scenario CI, IHME.pdf written in PDF format)

{com}. 
. 
. 
. 
. * daily cases
. 
. 
. * daily cases, medain scenario = S1        
.            
. twoway (rarea DayCasLoRaA02S01 DayCasUpRaA02S01 date, sort color(black*.2)) ///
> (line DayCasMeRaA02S01 date, sort lcolor(black)) ///
> , xtitle(Date) xlabel(#`xticks', format(%tdYY-NN-DD) labsize(small)) xlabel(, grid) xlabel(, grid) ///
> xlabel(, angle(forty_five)) ylabel(, format(%9.0fc) labsize(small))  ylabel(, labsize(small) angle(horizontal)) ///
> ytitle(Daily cases) title("COVID-19 daily cases, Iran, IHME, reference scenario", size(medium)) ///
> xscale(lwidth(vthin) lcolor(gray*.2)) yscale(lwidth(vthin) lcolor(gray*.2)) legend(off) 
{res}{txt}
{com}.            
. graph save "graph 6 COVID-19 daily cases, reference scenario, Iran, IHME.gph", replace
{txt}(note: file graph 6 COVID-19 daily cases, reference scenario, Iran, IHME.gph not found)
{res}{txt}(file graph 6 COVID-19 daily cases, reference scenario, Iran, IHME.gph saved)

{com}. graph export "graph 6 COVID-19 daily cases, reference scenario, Iran, IHME.pdf", replace
{txt}(file /Users/farshadpourmalek/Downloads/covir2-main/20210515/code/IHME/graph 6 COVID-19 daily cases, reference scenario, Iran, IHME.pdf written in PDF format)

{com}. 
. 
. 
. 
. * daily cases, 3 scenarios  
.   
. twoway ///
> (line DayCasMeRaA02S01 date, sort lcolor(black) lwidth(vthick) lpattern(tight_dot)) ///
> (line DayCasMeRaA02S02V04 date, sort lcolor(green)) ///
> (line DayCasMeRaA02S03V04 date, sort lcolor(red)) ///
> , xtitle(Date) xlabel(#`xticks', format(%tdYY-NN-DD) labsize(small)) xlabel(, grid) xlabel(, grid) ///
> xlabel(, angle(forty_five)) ylabel(, format(%9.0fc) labsize(small))  ylabel(, labsize(small) angle(horizontal)) ///
> ytitle(Daily cases) title("COVID-19 daily cases, Iran, IHME, 3 scenarios", size(medium)) ///
> xscale(lwidth(vthin) lcolor(gray*.2)) yscale(lwidth(vthin) lcolor(gray*.2)) legend(region(lcolor(none))) legend(bexpand) ///
> legend(order(1 "S1" 2 "S2" 3 "S3") rows(1))
{res}{txt}
{com}. 
. graph save "graph 7 COVID-19 daily cases, Iran 3 scenarios, IHME.gph", replace
{txt}(note: file graph 7 COVID-19 daily cases, Iran 3 scenarios, IHME.gph not found)
{res}{txt}(file graph 7 COVID-19 daily cases, Iran 3 scenarios, IHME.gph saved)

{com}. graph export "graph 7 COVID-19 daily cases, Iran 3 scenarios, IHME.pdf", replace
{txt}(file /Users/farshadpourmalek/Downloads/covir2-main/20210515/code/IHME/graph 7 COVID-19 daily cases, Iran 3 scenarios, IHME.pdf written in PDF format)

{com}. 
. 
. 
. 
. * daily cases, medain scenario = S1, CI
.   
. twoway ///
> (line DayCasMeRaA02S01 date, sort lcolor(black)) ///
> (line DayCasLoRaA02S01 date, sort lcolor(green)) ///
> (line DayCasUpRaA02S01 date, sort lcolor(red)) ///
> , xtitle(Date) xlabel(#`xticks', format(%tdYY-NN-DD) labsize(small)) xlabel(, grid) xlabel(, grid) ///
> xlabel(, angle(forty_five)) ylabel(, format(%9.0fc) labsize(small))  ylabel(, labsize(small) angle(horizontal)) ///
> ytitle(Daily cases) title("COVID-19 daily cases, Iran, IHME, median scenario", size(medium)) ///
> xscale(lwidth(vthin) lcolor(gray*.2)) yscale(lwidth(vthin) lcolor(gray*.2)) legend(region(lcolor(none))) legend(bexpand) ///
> legend(order(1 "Mean" 2 "Lower" 3 "Upper") rows(1))
{res}{txt}
{com}. 
. graph save "graph 8 COVID-19 daily cases, Iran median scenario CI, IHME.gph", replace
{txt}(note: file graph 8 COVID-19 daily cases, Iran median scenario CI, IHME.gph not found)
{res}{txt}(file graph 8 COVID-19 daily cases, Iran median scenario CI, IHME.gph saved)

{com}. graph export "graph 8 COVID-19 daily cases, Iran median scenario CI, IHME.pdf", replace
{txt}(file /Users/farshadpourmalek/Downloads/covir2-main/20210515/code/IHME/graph 8 COVID-19 daily cases, Iran median scenario CI, IHME.pdf written in PDF format)

{com}. 
. 
. 
. 
. * daily cases, best scenario = S2, CI
.   
. twoway ///
> (line DayCasMeRaA02S02V04 date, sort lcolor(black)) ///
> (line DayCasLoRaA02S02V04 date, sort lcolor(green)) ///
> (line DayCasUpRaA02S02V04 date, sort lcolor(red)) ///
> , xtitle(Date) xlabel(#`xticks', format(%tdYY-NN-DD) labsize(small)) xlabel(, grid) xlabel(, grid) ///
> xlabel(, angle(forty_five)) ylabel(, format(%9.0fc) labsize(small))  ylabel(, labsize(small) angle(horizontal)) ///
> ytitle(Daily cases) title("COVID-19 daily cases, Iran, IHME, best scenario", size(medium)) ///
> xscale(lwidth(vthin) lcolor(gray*.2)) yscale(lwidth(vthin) lcolor(gray*.2)) legend(region(lcolor(none))) legend(bexpand) ///
> legend(order(1 "Mean" 2 "Lower" 3 "Upper") rows(1))
{res}{txt}
{com}. 
. graph save "graph 9 COVID-19 daily cases, Iran best scenario CI, IHME.gph", replace
{txt}(note: file graph 9 COVID-19 daily cases, Iran best scenario CI, IHME.gph not found)
{res}{txt}(file graph 9 COVID-19 daily cases, Iran best scenario CI, IHME.gph saved)

{com}. graph export "graph 9 COVID-19 daily cases, Iran best scenario CI, IHME.pdf", replace
{txt}(file /Users/farshadpourmalek/Downloads/covir2-main/20210515/code/IHME/graph 9 COVID-19 daily cases, Iran best scenario CI, IHME.pdf written in PDF format)

{com}. 
. 
. 
. 
. * daily cases, worst scenario = S3, CI
.   
. twoway ///
> (line DayCasMeRaA02S03V04 date, sort lcolor(black)) ///
> (line DayCasLoRaA02S03V04 date, sort lcolor(green)) ///
> (line DayCasUpRaA02S03V04 date, sort lcolor(red)) ///
> , xtitle(Date) xlabel(#`xticks', format(%tdYY-NN-DD) labsize(small)) xlabel(, grid) xlabel(, grid) ///
> xlabel(, angle(forty_five)) ylabel(, format(%9.0fc) labsize(small))  ylabel(, labsize(small) angle(horizontal)) ///
> ytitle(Daily cases) title("COVID-19 daily cases, Iran, IHME, worst scenario", size(medium)) ///
> xscale(lwidth(vthin) lcolor(gray*.2)) yscale(lwidth(vthin) lcolor(gray*.2)) legend(region(lcolor(none))) legend(bexpand) ///
> legend(order(1 "Mean" 2 "Lower" 3 "Upper") rows(1))
{res}{txt}
{com}. 
. graph save "graph 10 COVID-19 daily cases, Iran worst scenario CI, IHME.gph", replace
{txt}(note: file graph 10 COVID-19 daily cases, Iran worst scenario CI, IHME.gph not found)
{res}{txt}(file graph 10 COVID-19 daily cases, Iran worst scenario CI, IHME.gph saved)

{com}. graph export "graph 10 COVID-19 daily cases, Iran worst scenario CI, IHME.pdf", replace
{txt}(file /Users/farshadpourmalek/Downloads/covir2-main/20210515/code/IHME/graph 10 COVID-19 daily cases, Iran worst scenario CI, IHME.pdf written in PDF format)

{com}. 
. 
. 
. 
. * total deaths
. 
. 
. * total deaths, medain scenario = S1       
.            
. twoway (rarea TotDeaLoSmA02S01 TotDeaUpSmA02S01 date, sort color(black*.2)) ///
> (line TotDeaMeSmA02S01 date, sort lcolor(black)) ///
> , xtitle(Date) xlabel(#`xticks', format(%tdYY-NN-DD) labsize(small)) xlabel(, grid) xlabel(, grid) ///
> xlabel(, angle(forty_five)) ylabel(, format(%9.0fc) labsize(small))  ylabel(, labsize(small) angle(horizontal)) ///
> ytitle(Total deaths) title("COVID-19 total deaths, Iran, IHME, reference scenario", size(medium)) ///
> xscale(lwidth(vthin) lcolor(gray*.2)) yscale(lwidth(vthin) lcolor(gray*.2)) legend(off) 
{res}{txt}
{com}.            
. graph save "graph 11 COVID-19 total deaths, reference scenario, Iran, IHME.gph", replace
{txt}(note: file graph 11 COVID-19 total deaths, reference scenario, Iran, IHME.gph not found)
{res}{txt}(file graph 11 COVID-19 total deaths, reference scenario, Iran, IHME.gph saved)

{com}. graph export "graph 11 COVID-19 total deaths, reference scenario, Iran, IHME.pdf", replace
{txt}(file /Users/farshadpourmalek/Downloads/covir2-main/20210515/code/IHME/graph 11 COVID-19 total deaths, reference scenario, Iran, IHME.pdf written in PDF format)

{com}. 
. 
. 
. 
. * total deaths, 3 scenarios  
.   
. twoway ///
> (line TotDeaMeSmA02S01 date, sort lcolor(black) lwidth(vthick) lpattern(tight_dot)) ///
> (line TotDeaMeSmA02S02V04 date, sort lcolor(green)) ///
> (line TotDeaMeSmA02S03V04 date, sort lcolor(red)) ///
> , xtitle(Date) xlabel(#`xticks', format(%tdYY-NN-DD) labsize(small)) xlabel(, grid) xlabel(, grid) ///
> xlabel(, angle(forty_five)) ylabel(, format(%9.0fc) labsize(small))  ylabel(, labsize(small) angle(horizontal)) ///
> ytitle(Total deaths) title("COVID-19 total deaths, Iran, IHME, 3 scenarios", size(medium)) ///
> xscale(lwidth(vthin) lcolor(gray*.2)) yscale(lwidth(vthin) lcolor(gray*.2)) legend(region(lcolor(none))) legend(bexpand) ///
> legend(order(1 "S1" 2 "S2" 3 "S3") rows(1))
{res}{txt}
{com}. 
. graph save "graph 12 COVID-19 total deaths, Iran 3 scenarios, IHME.gph", replace
{txt}(note: file graph 12 COVID-19 total deaths, Iran 3 scenarios, IHME.gph not found)
{res}{txt}(file graph 12 COVID-19 total deaths, Iran 3 scenarios, IHME.gph saved)

{com}. graph export "graph 12 COVID-19 total deaths, Iran 3 scenarios, IHME.pdf", replace
{txt}(file /Users/farshadpourmalek/Downloads/covir2-main/20210515/code/IHME/graph 12 COVID-19 total deaths, Iran 3 scenarios, IHME.pdf written in PDF format)

{com}. 
. 
. 
. 
. * total deaths, medain scenario = S1, CI
.   
. twoway ///
> (line TotDeaMeSmA02S01 date, sort lcolor(black)) ///
> (line TotDeaLoSmA02S01 date, sort lcolor(green)) ///
> (line TotDeaUpSmA02S01 date, sort lcolor(red)) ///
> , xtitle(Date) xlabel(#`xticks', format(%tdYY-NN-DD) labsize(small)) xlabel(, grid) xlabel(, grid) ///
> xlabel(, angle(forty_five)) ylabel(, format(%9.0fc) labsize(small))  ylabel(, labsize(small) angle(horizontal)) ///
> ytitle(Total deaths) title("COVID-19 total deaths, Iran, IHME, median scenario", size(medium)) ///
> xscale(lwidth(vthin) lcolor(gray*.2)) yscale(lwidth(vthin) lcolor(gray*.2)) legend(region(lcolor(none))) legend(bexpand) ///
> legend(order(1 "Mean" 2 "Lower" 3 "Upper") rows(1))
{res}{txt}
{com}. 
. graph save "graph 13 COVID-19 total deaths, Iran median scenario CI, IHME.gph", replace
{txt}(note: file graph 13 COVID-19 total deaths, Iran median scenario CI, IHME.gph not found)
{res}{txt}(file graph 13 COVID-19 total deaths, Iran median scenario CI, IHME.gph saved)

{com}. graph export "graph 13 COVID-19 total deaths, Iran median scenario CI, IHME.pdf", replace
{txt}(file /Users/farshadpourmalek/Downloads/covir2-main/20210515/code/IHME/graph 13 COVID-19 total deaths, Iran median scenario CI, IHME.pdf written in PDF format)

{com}. 
. 
. 
. 
. * total deaths, best scenario = S2, CI
.   
. twoway ///
> (line TotDeaMeSmA02S02V04 date, sort lcolor(black)) ///
> (line TotDeaLoSmA02S02V04 date, sort lcolor(green)) ///
> (line TotDeaUpSmA02S02V04 date, sort lcolor(red)) ///
> , xtitle(Date) xlabel(#`xticks', format(%tdYY-NN-DD) labsize(small)) xlabel(, grid) xlabel(, grid) ///
> xlabel(, angle(forty_five)) ylabel(, format(%9.0fc) labsize(small))  ylabel(, labsize(small) angle(horizontal)) ///
> ytitle(Total deaths) title("COVID-19 total deaths, Iran, IHME, best scenario", size(medium)) ///
> xscale(lwidth(vthin) lcolor(gray*.2)) yscale(lwidth(vthin) lcolor(gray*.2)) legend(region(lcolor(none))) legend(bexpand) ///
> legend(order(1 "Mean" 2 "Lower" 3 "Upper") rows(1))
{res}{txt}
{com}. 
. graph save "graph 14 COVID-19 total deaths, Iran best scenario CI, IHME.gph", replace
{txt}(note: file graph 14 COVID-19 total deaths, Iran best scenario CI, IHME.gph not found)
{res}{txt}(file graph 14 COVID-19 total deaths, Iran best scenario CI, IHME.gph saved)

{com}. graph export "graph 14 COVID-19 total deaths, Iran best scenario CI, IHME.pdf", replace
{txt}(file /Users/farshadpourmalek/Downloads/covir2-main/20210515/code/IHME/graph 14 COVID-19 total deaths, Iran best scenario CI, IHME.pdf written in PDF format)

{com}. 
. 
. 
. 
. * total deaths, worst scenario = S3, CI
.   
. twoway ///
> (line TotDeaMeSmA02S03V04 date, sort lcolor(black)) ///
> (line TotDeaLoSmA02S03V04 date, sort lcolor(green)) ///
> (line TotDeaUpSmA02S03V04 date, sort lcolor(red)) ///
> , xtitle(Date) xlabel(#`xticks', format(%tdYY-NN-DD) labsize(small)) xlabel(, grid) xlabel(, grid) ///
> xlabel(, angle(forty_five)) ylabel(, format(%9.0fc) labsize(small))  ylabel(, labsize(small) angle(horizontal)) ///
> ytitle(Total deaths) title("COVID-19 total deaths, Iran, IHME, worst scenario", size(medium)) ///
> xscale(lwidth(vthin) lcolor(gray*.2)) yscale(lwidth(vthin) lcolor(gray*.2)) legend(region(lcolor(none))) legend(bexpand) ///
> legend(order(1 "Mean" 2 "Lower" 3 "Upper") rows(1))
{res}{txt}
{com}. 
. graph save "graph 15 COVID-19 total deaths, Iran worst scenario CI, IHME.gph", replace
{txt}(note: file graph 15 COVID-19 total deaths, Iran worst scenario CI, IHME.gph not found)
{res}{txt}(file graph 15 COVID-19 total deaths, Iran worst scenario CI, IHME.gph saved)

{com}. graph export "graph 15 COVID-19 total deaths, Iran worst scenario CI, IHME.pdf", replace
{txt}(file /Users/farshadpourmalek/Downloads/covir2-main/20210515/code/IHME/graph 15 COVID-19 total deaths, Iran worst scenario CI, IHME.pdf written in PDF format)

{com}. 
. 
. 
. 
. * total cases
. 
. 
. * total cases, medain scenario = S1        
.            
. twoway (rarea TotCasLoRaA02S01 TotCasUpRaA02S01 date, sort color(black*.2)) ///
> (line TotCasMeRaA02S01 date, sort lcolor(black)) ///
> , xtitle(Date) xlabel(#`xticks', format(%tdYY-NN-DD) labsize(small)) xlabel(, grid) xlabel(, grid) ///
> xlabel(, angle(forty_five)) ylabel(, format(%12.0fc) labsize(small))  ylabel(, labsize(small) angle(horizontal)) ///
> ytitle(Total cases) title("COVID-19 total cases, Iran, IHME, reference scenario", size(medium)) ///
> xscale(lwidth(vthin) lcolor(gray*.2)) yscale(lwidth(vthin) lcolor(gray*.2)) legend(off) 
{res}{txt}
{com}.            
. graph save "graph 16 COVID-19 total cases, reference scenario, Iran, IHME.gph", replace
{txt}(note: file graph 16 COVID-19 total cases, reference scenario, Iran, IHME.gph not found)
{res}{txt}(file graph 16 COVID-19 total cases, reference scenario, Iran, IHME.gph saved)

{com}. graph export "graph 16 COVID-19 total cases, reference scenario, Iran, IHME.pdf", replace
{txt}(file /Users/farshadpourmalek/Downloads/covir2-main/20210515/code/IHME/graph 16 COVID-19 total cases, reference scenario, Iran, IHME.pdf written in PDF format)

{com}. 
. 
. 
. 
. 
. * total cases, medain scenario = S1, CI
.   
. twoway ///
> (line TotCasMeRaA02S01 date, sort lcolor(black)) ///
> (line TotCasLoRaA02S01 date, sort lcolor(green)) ///
> (line TotCasUpRaA02S01 date, sort lcolor(red)) ///
> , xtitle(Date) xlabel(#`xticks', format(%tdYY-NN-DD) labsize(small)) xlabel(, grid) xlabel(, grid) ///
> xlabel(, angle(forty_five)) ylabel(, format(%12.0fc) labsize(small))  ylabel(, labsize(small) angle(horizontal)) ///
> ytitle(Total cases) title("COVID-19 total cases, Iran, IHME, median scenario", size(medium)) ///
> xscale(lwidth(vthin) lcolor(gray*.2)) yscale(lwidth(vthin) lcolor(gray*.2)) legend(region(lcolor(none))) legend(bexpand) ///
> legend(order(1 "Mean" 2 "Lower" 3 "Upper") rows(1))
{res}{txt}
{com}. 
. graph save "graph 18 COVID-19 total cases, Iran median scenario CI, IHME.gph", replace
{txt}(note: file graph 18 COVID-19 total cases, Iran median scenario CI, IHME.gph not found)
{res}{txt}(file graph 18 COVID-19 total cases, Iran median scenario CI, IHME.gph saved)

{com}. graph export "graph 18 COVID-19 total cases, Iran median scenario CI, IHME.pdf", replace
{txt}(file /Users/farshadpourmalek/Downloads/covir2-main/20210515/code/IHME/graph 18 COVID-19 total cases, Iran median scenario CI, IHME.pdf written in PDF format)

{com}. 
. 
. 
. 
. * total cases, best scenario = S2, CI, not available
.  
. 
. * total cases, worst scenario = S3, CI, not available
.   
.   
. 
. 
. * cfr
. 
. 
. * daily cfr, 3 scenarios  
.   
. twoway ///
> (line DayCfrMeRaA02S01 date, sort lcolor(black) lwidth(vthick) lpattern(tight_dot)) ///
> (line DayCfrMeRaA02S02V04 date, sort lcolor(green)) ///
> (line DayCfrMeRaA02S03V04 date, sort lcolor(red)) ///
> , xtitle(Date) xlabel(#`xticks', format(%tdYY-NN-DD) labsize(small)) xlabel(, grid) xlabel(, grid) ///
> xlabel(, angle(forty_five)) ylabel(, format(%9.2fc) labsize(small))  ylabel(, labsize(small) angle(horizontal)) ///
> ytitle(Daily CFR) title("COVID-19 daily CFR, Iran, IHME, 3 scenarios", size(medium)) ///
> xscale(lwidth(vthin) lcolor(gray*.2)) yscale(lwidth(vthin) lcolor(gray*.2)) legend(region(lcolor(none))) legend(bexpand) ///
> legend(order(1 "S1" 2 "S2" 3 "S3") rows(1))
{res}{txt}
{com}. 
. graph save "graph 21 COVID-19 daily CFR, Iran 3 scenarios, IHME.gph", replace
{txt}(note: file graph 21 COVID-19 daily CFR, Iran 3 scenarios, IHME.gph not found)
{res}{txt}(file graph 21 COVID-19 daily CFR, Iran 3 scenarios, IHME.gph saved)

{com}. graph export "graph 21 COVID-19 daily CFR, Iran 3 scenarios, IHME.pdf", replace
{txt}(file /Users/farshadpourmalek/Downloads/covir2-main/20210515/code/IHME/graph 21 COVID-19 daily CFR, Iran 3 scenarios, IHME.pdf written in PDF format)

{com}. 
. 
. 
. 
. * other outcomes 
. 
. 
. * daily beds needed, only in S1
. 
. twoway (rarea DayBedLoSmA02S01 DayBedUpSmA02S01 date, sort color(black*.2)) ///
> (line DayBedMeSmA02S01 date, sort lcolor(black)) ///
> , xtitle(Date) xlabel(#`xticks', format(%tdYY-NN-DD) labsize(small)) xlabel(, grid) xlabel(, grid) ///
> xlabel(, angle(forty_five)) ylabel(, format(%9.0fc) labsize(small))  ylabel(, labsize(small) angle(horizontal)) ///
> ytitle(Daily beds needed) title("COVID-19 daily beds needed, Iran, IHME, reference scenario", size(medium)) ///
> xscale(lwidth(vthin) lcolor(gray*.2)) yscale(lwidth(vthin) lcolor(gray*.2)) legend(off) 
{res}{txt}
{com}. 
. graph save "graph 22 COVID-19 daily beds needed, Iran 3 scenarios, IHME.gph", replace
{txt}(note: file graph 22 COVID-19 daily beds needed, Iran 3 scenarios, IHME.gph not found)
{res}{txt}(file graph 22 COVID-19 daily beds needed, Iran 3 scenarios, IHME.gph saved)

{com}. graph export "graph 22 COVID-19 daily beds needed, Iran 3 scenarios, IHME.pdf", replace
{txt}(file /Users/farshadpourmalek/Downloads/covir2-main/20210515/code/IHME/graph 22 COVID-19 daily beds needed, Iran 3 scenarios, IHME.pdf written in PDF format)

{com}. 
. 
. 
. 
. * ICU beds needed, only in S1
. 
. twoway (rarea DayIcuLoSmA02S01 DayIcuUpSmA02S01 date, sort color(black*.2)) ///
> (line DayIcuMeSmA02S01 date, sort lcolor(black)) ///
> , xtitle(Date) xlabel(#`xticks', format(%tdYY-NN-DD) labsize(small)) xlabel(, grid) xlabel(, grid) ///
> xlabel(, angle(forty_five)) ylabel(, format(%9.0fc) labsize(small))  ylabel(, labsize(small) angle(horizontal)) ///
> ytitle(ICU beds needed) title("COVID-19 daily ICU beds needed, Iran, IHME, reference scenario", size(medium)) ///
> xscale(lwidth(vthin) lcolor(gray*.2)) yscale(lwidth(vthin) lcolor(gray*.2)) legend(off) 
{res}{txt}
{com}.            
. graph save "graph 23 COVID-19 daily ICU beds needed, Iran 3 scenarios, IHME.gph", replace
{txt}(note: file graph 23 COVID-19 daily ICU beds needed, Iran 3 scenarios, IHME.gph not found)
{res}{txt}(file graph 23 COVID-19 daily ICU beds needed, Iran 3 scenarios, IHME.gph saved)

{com}. graph export "graph 23 COVID-19 daily ICU beds needed, Iran 3 scenarios, IHME.pdf", replace
{txt}(file /Users/farshadpourmalek/Downloads/covir2-main/20210515/code/IHME/graph 23 COVID-19 daily ICU beds needed, Iran 3 scenarios, IHME.pdf written in PDF format)

{com}. 
. 
. 
. /*
> * daily invasive ventilation needed, only in S1
> 
> twoway (rarea DayVenLoSmA02S01 DayVenUpSmA02S01 date, sort color(black*.2)) ///
> (line DayVenMeSmA02S01 date, sort lcolor(black)) ///
> , xtitle(Date) xlabel(#`xticks', format(%tdYY-NN-DD) labsize(small)) xlabel(, grid) xlabel(, grid) ///
> xlabel(, angle(forty_five)) ylabel(, format(%9.0fc) labsize(small))  ylabel(, labsize(small) angle(horizontal)) ///
> ytitle(Daily invasive ventilation needed) title("COVID-19 daily invasive ventilation Iran, IHME, reference scenario", size(medium)) ///
> xscale(lwidth(vthin) lcolor(gray*.2)) yscale(lwidth(vthin) lcolor(gray*.2)) legend(off) 
>           
> graph save "graph 24 COVID-19 daily invasive ventilation needed, Iran 3 scenarios, IHME.gph", replace
> graph export "graph 24 COVID-19 daily invasive ventilation needed, Iran 3 scenarios, IHME.pdf", replace
> */
. 
. 
. 
. * daily hospital admissions, only in S1
. 
. twoway (rarea DayAdmLoSmA02S01 DayAdmUpSmA02S01 date, sort color(black*.2)) ///
> (line DayAdmMeSmA02S01 date, sort lcolor(black)) ///
> , xtitle(Date) xlabel(#`xticks', format(%tdYY-NN-DD) labsize(small)) xlabel(, grid) xlabel(, grid) ///
> xlabel(, angle(forty_five)) ylabel(, format(%9.0fc) labsize(small))  ylabel(, labsize(small) angle(horizontal)) ///
> ytitle(Daily hospital admissions) title("COVID-19 daily hospital admissions Iran, IHME, reference scenario", size(medium)) ///
> xscale(lwidth(vthin) lcolor(gray*.2)) yscale(lwidth(vthin) lcolor(gray*.2)) legend(off) 
{res}{txt}
{com}.            
. graph save "graph 25 COVID-19 daily hospital admissions, Iran 3 scenarios, IHME.gph", replace
{txt}(note: file graph 25 COVID-19 daily hospital admissions, Iran 3 scenarios, IHME.gph not found)
{res}{txt}(file graph 25 COVID-19 daily hospital admissions, Iran 3 scenarios, IHME.gph saved)

{com}. graph export "graph 26 COVID-19 daily hospital admissions, Iran 3 scenarios, IHME.pdf", replace
{txt}(file /Users/farshadpourmalek/Downloads/covir2-main/20210515/code/IHME/graph 26 COVID-19 daily hospital admissions, Iran 3 scenarios, IHME.pdf written in PDF format)

{com}. 
. 
. 
. 
. * daily new people going to ICU
. 
. twoway (rarea DayIcnLoSmA02S01 DayIcnUpSmA02S01 date, sort color(black*.2)) ///
> (line DayIcnMeSmA02S01 date, sort lcolor(black)) ///
> , xtitle(Date) xlabel(#`xticks', format(%tdYY-NN-DD) labsize(small)) xlabel(, grid) xlabel(, grid) ///
> xlabel(, angle(forty_five)) ylabel(, format(%9.0fc) labsize(small))  ylabel(, labsize(small) angle(horizontal)) ///
> ytitle(Daily new people going to ICU) title("COVID-19 daily new people going to ICU Iran, IHME, reference scenario", size(medium)) ///
> xscale(lwidth(vthin) lcolor(gray*.2)) yscale(lwidth(vthin) lcolor(gray*.2)) legend(off) 
{res}{txt}
{com}.            
. graph save "graph 26 COVID-19 daily new people going to ICU, Iran 3 scenarios, IHME.gph", replace
{txt}(note: file graph 26 COVID-19 daily new people going to ICU, Iran 3 scenarios, IHME.gph not found)
{res}{txt}(file graph 26 COVID-19 daily new people going to ICU, Iran 3 scenarios, IHME.gph saved)

{com}. graph export "graph 26 COVID-19 daily new people going to ICU, Iran 3 scenarios, IHME.pdf", replace
{txt}(file /Users/farshadpourmalek/Downloads/covir2-main/20210515/code/IHME/graph 26 COVID-19 daily new people going to ICU, Iran 3 scenarios, IHME.pdf written in PDF format)

{com}. 
. 
. 
. 
. 
. /*
> * daily bed over 
> 
> 
> twoway (rarea DayBeoLoSmA02S01 DayBeoUpSmA02S01 date, sort color(black*.2)) ///
> (line DayBeoMeSmA02S01 date, sort lcolor(black)) ///
> , xtitle(Date) xlabel(#`xticks', format(%tdYY-NN-DD) labsize(small)) xlabel(, grid) xlabel(, grid) ///
> xlabel(, angle(forty_five)) ylabel(, format(%9.0fc) labsize(small))  ylabel(, labsize(small) angle(horizontal)) ///
> ytitle(Daily bed over) title("COVID-19 daily bed over, IHME, reference scenario", size(medium)) ///
> xscale(lwidth(vthin) lcolor(gray*.2)) yscale(lwidth(vthin) lcolor(gray*.2)) legend(off) 
>            
> 
> 
> graph save "graph 27 COVID-19 daily bed over, Iran 3 scenarios, IHME.gph", replace
> graph export "graph 27 COVID-19 daily bed over, Iran 3 scenarios, IHME.pdf", replace
> 
> 
> 
> 
> * daily ICU over (has same values as bed over)
> 
> 
> twoway (rarea DayIcoLoSmA02S01 DayIcoUpSmA02S01 date, sort color(black*.2)) ///
> (line DayIcoMeSmA02S01 date, sort lcolor(black)) ///
> , xtitle(Date) xlabel(#`xticks', format(%tdYY-NN-DD) labsize(small)) xlabel(, grid) xlabel(, grid) ///
> xlabel(, angle(forty_five)) ylabel(, format(%9.0fc) labsize(small))  ylabel(, labsize(small) angle(horizontal)) ///
> ytitle(Daily ICU over) title("COVID-19 daily ICU over, IHME, reference scenario", size(medium)) ///
> xscale(lwidth(vthin) lcolor(gray*.2)) yscale(lwidth(vthin) lcolor(gray*.2)) legend(off) 
>            
> 
> graph save "graph 28 COVID-19 ICU over, Iran 3 scenarios, IHME.gph", replace
> graph export "graph 28 COVID-19 ICU over Iran 3 scenarios, IHME.pdf", replace
> */
. 
. 
. 
. * total tests
. 
. twoway ///
> (line TotTesMeSmA02S01 date, sort lcolor(black)) ///
> (line TotTesMeSmA02S02V04 date, sort lcolor(green)) ///
> (line TotTesMeSmA02S03V04 date, sort lcolor(red)) ///
> , xtitle(Date) xlabel(#`xticks', format(%tdYY-NN-DD) labsize(small)) xlabel(, grid) xlabel(, grid) ///
> xlabel(, angle(forty_five)) ylabel(, format(%12.4fc) labsize(small))  ylabel(, labsize(small) angle(horizontal)) ///
> ytitle(Total tests) title("COVID-19 total tests, Iran, IHME, 3 scenarios", size(medium)) ///
> xscale(lwidth(vthin) lcolor(gray*.2)) yscale(lwidth(vthin) lcolor(gray*.2)) legend(region(lcolor(none))) legend(bexpand) ///
> legend(order(1 "S1" 2 "S2" 3 "S3") rows(1))
{res}{txt}
{com}. 
. graph save "graph 29 COVID-19 total tests, Iran 3 scenarios, IHME.gph", replace
{txt}(note: file graph 29 COVID-19 total tests, Iran 3 scenarios, IHME.gph not found)
{res}{txt}(file graph 29 COVID-19 total tests, Iran 3 scenarios, IHME.gph saved)

{com}. graph export "graph 29 COVID-19 total tests, Iran 3 scenarios, IHME.pdf", replace
{txt}(file /Users/farshadpourmalek/Downloads/covir2-main/20210515/code/IHME/graph 29 COVID-19 total tests, Iran 3 scenarios, IHME.pdf written in PDF format)

{com}. 
. 
. 
. * seroprevalence
. 
. twoway ///
> (line TotSerMeSmA02S01 date, sort lcolor(black)) ///
> (line TotSerMeSmA02S02V04 date, sort lcolor(green)) ///
> (line TotSerMeSmA02S03V04 date, sort lcolor(red)) ///
> , xtitle(Date) xlabel(#`xticks', format(%tdYY-NN-DD) labsize(small)) xlabel(, grid) xlabel(, grid) ///
> xlabel(, angle(forty_five)) ylabel(, format(%9.5fc) labsize(small))  ylabel(, labsize(small) angle(horizontal)) ///
> ytitle(Total seroprevalence) title("COVID-19 total seroprevalence, Iran, IHME, median scenario", size(medium)) ///
> xscale(lwidth(vthin) lcolor(gray*.2)) yscale(lwidth(vthin) lcolor(gray*.2)) legend(region(lcolor(none))) legend(bexpand) ///
> legend(order(1 "S1" 2 "S2" 3 "S3") rows(1))
{res}{txt}
{com}. 
. graph save "graph 30 COVID-19 total seroprevalence, Iran 3 scenarios, IHME.gph", replace
{txt}(note: file graph 30 COVID-19 total seroprevalence, Iran 3 scenarios, IHME.gph not found)
{res}{txt}(file graph 30 COVID-19 total seroprevalence, Iran 3 scenarios, IHME.gph saved)

{com}. graph export "graph 30 COVID-19 total seroprevalence, Iran 3 scenarios, IHME.pdf", replace
{txt}(file /Users/farshadpourmalek/Downloads/covir2-main/20210515/code/IHME/graph 30 COVID-19 total seroprevalence, Iran 3 scenarios, IHME.pdf written in PDF format)

{com}. 
. 
. 
. 
. 
. * daily hospital-related outcomes
. 
. /*
> twoway ///
> (line DayBedMeSmA02S01 date, sort lcolor(black)) /// 1 "Bed"
> (line DayIcuMeSmA02S01 date, sort lcolor(green)) /// 2 "ICU"
> (line DayVenMeSmA02S01 date, sort lcolor(red)) /// 3 "Vent"
> (line DayAdmMeSmA02S01 date, sort lcolor(yellow)) /// 4 "Adm"
> (line DayIcnMeSmA02S01 date, sort lcolor(blue)) /// 5 "ICU new"
> , xtitle(Date) xlabel(#`xticks', format(%tdYY-NN-DD) labsize(small)) xlabel(, grid) xlabel(, grid) ///
> xlabel(, angle(forty_five)) ylabel(, format(%9.0fc) labsize(small))  ylabel(, labsize(small) angle(horizontal)) ///
> ytitle(Daily outcomes) title("COVID-19 daily hospital-related outcomes Iran, IHME, median scenario", size(medium)) ///
> xscale(lwidth(vthin) lcolor(gray*.2)) yscale(lwidth(vthin) lcolor(gray*.2)) legend(region(lcolor(none))) legend(bexpand) ///
> legend(order(1 "Bed" 2 "ICU" 3 "Vent" 4 "Adm" 5 "ICU new") rows(2))
> 
> graph save "graph 31 COVID-19 daily hospital-related outcomes, Iran median scenario, IHME.gph", replace
> graph export "graph 31 COVID-19 daily hospital-related outcomes, Iran median scenario, IHME.pdf", replace
> */
. 
. 
. twoway ///
> (line DayBedMeSmA02S01 date, sort lcolor(black)) /// 1 "Bed"
> (line DayIcuMeSmA02S01 date, sort lcolor(green)) /// 2 "ICU"
> (line DayAdmMeSmA02S01 date, sort lcolor(yellow)) /// 3 "Adm"
> (line DayIcnMeSmA02S01 date, sort lcolor(blue)) /// 4 "ICU new"
> , xtitle(Date) xlabel(#`xticks', format(%tdYY-NN-DD) labsize(small)) xlabel(, grid) xlabel(, grid) ///
> xlabel(, angle(forty_five)) ylabel(, format(%9.0fc) labsize(small))  ylabel(, labsize(small) angle(horizontal)) ///
> ytitle(Daily outcomes) title("COVID-19 daily hospital-related outcomes Iran, IHME, median scenario", size(medium)) ///
> xscale(lwidth(vthin) lcolor(gray*.2)) yscale(lwidth(vthin) lcolor(gray*.2)) legend(region(lcolor(none))) legend(bexpand) ///
> legend(order(1 "Bed" 2 "ICU" 3 "Adm" 4 "ICU new") rows(2))
{res}{txt}
{com}. 
. graph save "graph 31 COVID-19 daily hospital-related outcomes, Iran median scenario, IHME.gph", replace
{txt}(note: file graph 31 COVID-19 daily hospital-related outcomes, Iran median scenario, IHME.gph not found)
{res}{txt}(file graph 31 COVID-19 daily hospital-related outcomes, Iran median scenario, IHME.gph saved)

{com}. graph export "graph 31 COVID-19 daily hospital-related outcomes, Iran median scenario, IHME.pdf", replace
{txt}(file /Users/farshadpourmalek/Downloads/covir2-main/20210515/code/IHME/graph 31 COVID-19 daily hospital-related outcomes, Iran median scenario, IHME.pdf written in PDF format)

{com}. 
. 
. 
. 
. * daily hospital-related outcomes, wo beds needed 
. /*
> twoway ///
> (line DayIcuMeSmA02S01 date, sort lcolor(green)) /// 1 "ICU"
> (line DayVenMeSmA02S01 date, sort lcolor(red)) /// 2 Vent"
> (line DayAdmMeSmA02S01 date, sort lcolor(yellow)) /// 3 "Adm"
> (line DayIcnMeSmA02S01 date, sort lcolor(blue)) /// 4 "ICU new"
> , xtitle(Date) xlabel(#`xticks', format(%tdYY-NN-DD) labsize(small)) xlabel(, grid) xlabel(, grid) ///
> xlabel(, angle(forty_five)) ylabel(, format(%9.0fc) labsize(small))  ylabel(, labsize(small) angle(horizontal)) ///
> ytitle(Daily outcomes) title("COVID-19 daily hospital-related outcomes Iran, IHME, median scenario", size(medium)) ///
> xscale(lwidth(vthin) lcolor(gray*.2)) yscale(lwidth(vthin) lcolor(gray*.2)) legend(region(lcolor(none))) legend(bexpand) ///
> legend(order(1 "ICU" 2 "Vent" 3 "Adm" 4 "ICU new") rows(1)) ///
> subtitle("without beds needed", size(small))
> 
> graph save "graph 32 COVID-19 daily hospital-related outcomes, Iran median scenario, IHME, wo beds needed.gph", replace
> graph export "graph 32 COVID-19 daily hospital-related outcomes, Iran median scenario, IHME, wo beds needed.pdf", replace
> */
. 
. 
. twoway ///
> (line DayIcuMeSmA02S01 date, sort lcolor(green)) /// 1 "ICU"
> (line DayAdmMeSmA02S01 date, sort lcolor(yellow)) /// 2 "Adm"
> (line DayIcnMeSmA02S01 date, sort lcolor(blue)) /// 3 "ICU new"
> , xtitle(Date) xlabel(#`xticks', format(%tdYY-NN-DD) labsize(small)) xlabel(, grid) xlabel(, grid) ///
> xlabel(, angle(forty_five)) ylabel(, format(%9.0fc) labsize(small))  ylabel(, labsize(small) angle(horizontal)) ///
> ytitle(Daily outcomes) title("COVID-19 daily hospital-related outcomes Iran, IHME, median scenario", size(medium)) ///
> xscale(lwidth(vthin) lcolor(gray*.2)) yscale(lwidth(vthin) lcolor(gray*.2)) legend(region(lcolor(none))) legend(bexpand) ///
> legend(order(1 "ICU" 2 "Adm" 3 "ICU new") rows(1)) ///
> subtitle("without beds needed", size(small))
{res}{txt}
{com}. 
. graph save "graph 32 COVID-19 daily hospital-related outcomes, Iran median scenario, IHME, wo beds needed.gph", replace
{txt}(note: file graph 32 COVID-19 daily hospital-related outcomes, Iran median scenario, IHME, wo beds needed.gph not found)
{res}{txt}(file graph 32 COVID-19 daily hospital-related outcomes, Iran median scenario, IHME, wo beds needed.gph saved)

{com}. graph export "graph 32 COVID-19 daily hospital-related outcomes, Iran median scenario, IHME, wo beds needed.pdf", replace
{txt}(file /Users/farshadpourmalek/Downloads/covir2-main/20210515/code/IHME/graph 32 COVID-19 daily hospital-related outcomes, Iran median scenario, IHME, wo beds needed.pdf written in PDF format)

{com}. 
. 
. 
. * rates
. 
. * daily deaths raw per 100k rate
. 
. twoway ///
> (line deaths_mean_p100k_rate date, sort lcolor(black)) ///
> (line deaths_lower_p100k_rate date, sort lcolor(green)) ///
> (line deaths_upper_p100k_rate date, sort lcolor(red)) ///
> , xtitle(Date) xlabel(#`xticks', format(%tdYY-NN-DD) labsize(small)) xlabel(, grid) xlabel(, grid) ///
> xlabel(, angle(forty_five)) ylabel(, format(%9.2fc) labsize(small))  ylabel(, labsize(small) angle(horizontal)) ///
> ytitle(Daily deaths per 100k rate) title("COVID-19 daily deaths raw per 100k rate, Iran, IHME", size(medium)) ///
> xscale(lwidth(vthin) lcolor(gray*.2)) yscale(lwidth(vthin) lcolor(gray*.2)) legend(region(lcolor(none))) legend(bexpand) ///
> legend(order(1 "Mean" 2 "Lower" 3 "Upper") rows(1))
{res}{txt}
{com}. 
. graph save "graph 40 COVID-19 daily deaths raw per 100k rate, Iran, IHME.gph", replace
{txt}(note: file graph 40 COVID-19 daily deaths raw per 100k rate, Iran, IHME.gph not found)
{res}{txt}(file graph 40 COVID-19 daily deaths raw per 100k rate, Iran, IHME.gph saved)

{com}. graph export "graph 40 COVID-19 daily deaths raw per 100k rate, Iran, IHME.pdf", replace
{txt}(file /Users/farshadpourmalek/Downloads/covir2-main/20210515/code/IHME/graph 40 COVID-19 daily deaths raw per 100k rate, Iran, IHME.pdf written in PDF format)

{com}. 
. 
. 
. 
. * daily deaths smoothed per 100k rate
. 
. twoway ///
> (line deaths_mean_smoothed_p100k_rate date, sort lcolor(black)) ///
> (line deaths_lower_smoothed_p100k_rate date, sort lcolor(green)) ///
> (line deaths_upper_smoothed_p100k_rate date, sort lcolor(red)) ///
> , xtitle(Date) xlabel(#`xticks', format(%tdYY-NN-DD) labsize(small)) xlabel(, grid) xlabel(, grid) ///
> xlabel(, angle(forty_five)) ylabel(, format(%9.2fc) labsize(small))  ylabel(, labsize(small) angle(horizontal)) ///
> ytitle(Daily deaths per 100k rate) title("COVID-19 daily deaths smoothed per 100k rate, Iran, IHME", size(medium)) ///
> xscale(lwidth(vthin) lcolor(gray*.2)) yscale(lwidth(vthin) lcolor(gray*.2)) legend(region(lcolor(none))) legend(bexpand) ///
> legend(order(1 "Mean" 2 "Lower" 3 "Upper") rows(1))
{res}{txt}
{com}. 
. graph save "graph 41 COVID-19 daily deaths smoothed per 100k rate, Iran, IHME.gph", replace
{txt}(note: file graph 41 COVID-19 daily deaths smoothed per 100k rate, Iran, IHME.gph not found)
{res}{txt}(file graph 41 COVID-19 daily deaths smoothed per 100k rate, Iran, IHME.gph saved)

{com}. graph export "graph 41 COVID-19 daily deaths smoothed per 100k rate, Iran, IHME.pdf", replace
{txt}(file /Users/farshadpourmalek/Downloads/covir2-main/20210515/code/IHME/graph 41 COVID-19 daily deaths smoothed per 100k rate, Iran, IHME.pdf written in PDF format)

{com}. 
. 
. 
. 
. 
. * total deaths raw per 100k rate
. 
. twoway ///
> (line totdea_mean_p100k_rate date, sort lcolor(black)) ///
> (line totdea_lower_p100k_rate date, sort lcolor(green)) ///
> (line totdea_upper_p100k_rate date, sort lcolor(red)) ///
> , xtitle(Date) xlabel(#`xticks', format(%tdYY-NN-DD) labsize(small)) xlabel(, grid) xlabel(, grid) ///
> xlabel(, angle(forty_five)) ylabel(, format(%9.0fc) labsize(small))  ylabel(, labsize(small) angle(horizontal)) ///
> ytitle(Total deaths per 100k rate) title("COVID-19 total deaths raw per 100k rate, Iran, IHME", size(medium)) ///
> xscale(lwidth(vthin) lcolor(gray*.2)) yscale(lwidth(vthin) lcolor(gray*.2)) legend(region(lcolor(none))) legend(bexpand) ///
> legend(order(1 "Mean" 2 "Lower" 3 "Upper") rows(1))
{res}{txt}
{com}. 
. graph save "graph 42 COVID-19 total deaths raw per 100k rate, Iran, IHME.gph", replace
{txt}(note: file graph 42 COVID-19 total deaths raw per 100k rate, Iran, IHME.gph not found)
{res}{txt}(file graph 42 COVID-19 total deaths raw per 100k rate, Iran, IHME.gph saved)

{com}. graph export "graph 42 COVID-19 total deaths raw per 100k rate, Iran, IHME.pdf", replace
{txt}(file /Users/farshadpourmalek/Downloads/covir2-main/20210515/code/IHME/graph 42 COVID-19 total deaths raw per 100k rate, Iran, IHME.pdf written in PDF format)

{com}. 
. 
. 
. 
. 
. * total deaths smoothed per 100k rate
. 
. twoway ///
> (line totdea_mean_smoothed_p100k_rate date, sort lcolor(black)) ///
> (line totdea_lower_smoothed_p100k_rate date, sort lcolor(green)) ///
> (line totdea_upper_smoothed_p100k_rate date, sort lcolor(red)) ///
> , xtitle(Date) xlabel(#`xticks', format(%tdYY-NN-DD) labsize(small)) xlabel(, grid) xlabel(, grid) ///
> xlabel(, angle(forty_five)) ylabel(, format(%9.0fc) labsize(small))  ylabel(, labsize(small) angle(horizontal)) ///
> ytitle(Total deaths per 100k rate) title("COVID-19 total deaths smoothed per 100k rate, Iran, IHME", size(medium)) ///
> xscale(lwidth(vthin) lcolor(gray*.2)) yscale(lwidth(vthin) lcolor(gray*.2)) legend(region(lcolor(none))) legend(bexpand) ///
> legend(order(1 "Mean" 2 "Lower" 3 "Upper") rows(1))
{res}{txt}
{com}. 
. graph save "graph 43 COVID-19 total deaths smoothed per 100k rate, Iran, IHME.gph", replace
{txt}(note: file graph 43 COVID-19 total deaths smoothed per 100k rate, Iran, IHME.gph not found)
{res}{txt}(file graph 43 COVID-19 total deaths smoothed per 100k rate, Iran, IHME.gph saved)

{com}. graph export "graph 43 COVID-19 total deaths smoothed per 100k rate, Iran, IHME.pdf", replace
{txt}(file /Users/farshadpourmalek/Downloads/covir2-main/20210515/code/IHME/graph 43 COVID-19 total deaths smoothed per 100k rate, Iran, IHME.pdf written in PDF format)

{com}. 
. 
. 
. 
. * estimated infections per 100k rate
. 
. twoway ///
> (line est_infections_mean_p100k_rate date, sort lcolor(black)) ///
> (line est_infections_lower_p100k_rate date, sort lcolor(green)) ///
> (line est_infections_upper_p100k_rate date, sort lcolor(red)) ///
> , xtitle(Date) xlabel(#`xticks', format(%tdYY-NN-DD) labsize(small)) xlabel(, grid) xlabel(, grid) ///
> xlabel(, angle(forty_five)) ylabel(, format(%9.0fc) labsize(small))  ylabel(, labsize(small) angle(horizontal)) ///
> ytitle(Estimated infections per 100k rate) title("COVID-19 estimated infections per 100k rate, Iran, IHME", size(medium)) ///
> xscale(lwidth(vthin) lcolor(gray*.2)) yscale(lwidth(vthin) lcolor(gray*.2)) legend(region(lcolor(none))) legend(bexpand) ///
> legend(order(1 "Mean" 2 "Lower" 3 "Upper") rows(1))
{res}{txt}
{com}. 
. graph save "graph 44 COVID-19 estimated infections per 100k rate, Iran, IHME.gph", replace
{txt}(note: file graph 44 COVID-19 estimated infections per 100k rate, Iran, IHME.gph not found)
{res}{txt}(file graph 44 COVID-19 estimated infections per 100k rate, Iran, IHME.gph saved)

{com}. graph export "graph 44 COVID-19 estimated infections per 100k rate, Iran, IHME.pdf", replace
{txt}(file /Users/farshadpourmalek/Downloads/covir2-main/20210515/code/IHME/graph 44 COVID-19 estimated infections per 100k rate, Iran, IHME.pdf written in PDF format)

{com}. 
. 
. 
. 
. 
. * confirmed infections per 100k rate
. 
. twoway ///
> (line confirmed_infections_p100k_rate date, sort lcolor(black)) ///
> , xtitle(Date) xlabel(#`xticks', format(%tdYY-NN-DD) labsize(small)) xlabel(, grid) xlabel(, grid) ///
> xlabel(, angle(forty_five)) ylabel(, format(%9.0fc) labsize(small))  ylabel(, labsize(small) angle(horizontal)) ///
> ytitle(Confirmed infections per 100k rate) title("COVID-19 confirmed infections per 100k rate, Iran, IHME", size(medium)) ///
> xscale(lwidth(vthin) lcolor(gray*.2)) yscale(lwidth(vthin) lcolor(gray*.2)) legend(region(lcolor(none))) legend(bexpand) ///
> legend(off)
{res}{txt}
{com}. 
. graph save "graph 44 COVID-19 confirmed per 100k rate, Iran, IHME.gph", replace
{txt}(note: file graph 44 COVID-19 confirmed per 100k rate, Iran, IHME.gph not found)
{res}{txt}(file graph 44 COVID-19 confirmed per 100k rate, Iran, IHME.gph saved)

{com}. graph export "graph 44 COVID-19 confirmed per 100k rate, Iran, IHME.pdf", replace
{txt}(file /Users/farshadpourmalek/Downloads/covir2-main/20210515/code/IHME/graph 44 COVID-19 confirmed per 100k rate, Iran, IHME.pdf written in PDF format)

{com}. 
. 
. 
. 
. 
. * DayCas Day Dea_multip
. 
. twoway ///
> (line DayCasMeRaA02S01 date, sort lcolor(blue)) ///
> (line DayDeaMeRaA02S01 date, sort lcolor(red)) ///
> (line DayDMuMeRaA02S01 date, sort lpattern(dot) lcolor(red)) ///
> , xtitle(Date) xlabel(#`xticks', format(%tdYY-NN-DD) labsize(small)) xlabel(, grid) xlabel(, grid) ///
> xlabel(, angle(forty_five)) ylabel(, format(%12.0fc) labsize(small)) ylabel(, labsize(small) angle(horizontal)) ///
> ytitle(Daily cases and deaths) title("COVID-19 daily cases and deaths, Iran, IHME", size(medium)) ///
> xscale(lwidth(vthin) lcolor(gray*.2)) yscale(lwidth(vthin) lcolor(gray*.2)) yscale(titlegap(4)) legend(region(lcolor(none)))  ///
> legend(order(1 "Daily cases" 2 "Daily deaths" 3 "Daily deaths scaled for visualization") size(small)) ///
> subtitle("Daily deaths, scaled = times (means of cases divided by deaths) for visualization only", size(small)) ///
> note("Current scenario, mean estimate")
{res}{txt}
{com}. 
. qui graph save "graph 45 COVID-19 daily deaths and cases Iran, IHME.gph", replace
{txt}
{com}. qui graph export "graph 45 COVID-19 daily deaths and cases Iran, IHME.pdf", replace
{txt}
{com}. 
. ***
. 
. 
. drop location_id total_tests_data_type
{txt}
{com}. 
. 
. 
. sort date loc_grand_name
{txt}
{com}. 
. qui compress
{txt}
{com}. 
. // cd ..
. 
. save "Iran IHME.dta", replace
{txt}(note: file Iran IHME.dta not found)
file Iran IHME.dta saved

{com}. 
. 
. 
. 
. view "log Iran IHME.smcl"
{txt}
{com}. 
. log close
      {txt}name:  {res}<unnamed>
       {txt}log:  {res}/Users/farshadpourmalek/Downloads/covir2-main/20210515/code/IHME/log Iran IHME.smcl
  {txt}log type:  {res}smcl
 {txt}closed on:  {res}19 May 2021, 07:01:16
{txt}{.-}
{smcl}
{txt}{sf}{ul off}