{smcl}
{com}{sf}{ul off}{txt}{.-}
      name:  {res}<unnamed>
       {txt}log:  {res}/Users/farshadpourmalek/Downloads/covir2-main/20210405/code/SRIV/log Iran SRIV win.smcl
  {txt}log type:  {res}smcl
 {txt}opened on:  {res}15 Apr 2021, 09:48:15
{txt}
{com}. 
. ***************************************************************************
. * This is "do Iran SRIV win.do"
. 
. * Project: Rapid review of estimates of COVID Iran - No 2
. * Person: Farshad Pourmalek pourmalek_farshad@yahoo.com
. * Time (initial): 2021-02-10
. 
. * OBJECTIVE: Get and prepare SRIV data for Iran, Locate peak dates and values
. ***************************************************************************
. 
. 
. * Get SRIV estimates 
. 
. copy https://raw.githubusercontent.com/scc-usc/ReCOVER-COVID-19/master/results/historical_forecasts/2021-04-04/global_forecasts_deaths.csv global_forecasts_deaths.csv
{txt}
{com}. copy https://raw.githubusercontent.com/scc-usc/ReCOVER-COVID-19/master/results/historical_forecasts/2021-04-04/global_forecasts_deaths_lb.csv global_forecasts_deaths_lb.csv
{txt}
{com}. copy https://raw.githubusercontent.com/scc-usc/ReCOVER-COVID-19/master/results/historical_forecasts/2021-04-04/global_forecasts_deaths_ub.csv global_forecasts_deaths_ub.csv
{txt}
{com}. copy https://raw.githubusercontent.com/scc-usc/ReCOVER-COVID-19/master/results/historical_forecasts/2021-04-04/global_forecasts_cases.csv global_forecasts_cases.csv
{txt}
{com}. copy https://raw.githubusercontent.com/scc-usc/ReCOVER-COVID-19/master/results/historical_forecasts/2021-04-04/global_forecasts_cases_lb.csv global_forecasts_cases_lb.csv
{txt}
{com}. copy https://raw.githubusercontent.com/scc-usc/ReCOVER-COVID-19/master/results/historical_forecasts/2021-04-04/global_forecasts_cases_ub.csv global_forecasts_cases_ub.csv
{txt}
{com}. 
. 
. 
. local list ///
> global_forecasts_deaths global_forecasts_deaths_lb global_forecasts_deaths_ub ///
> global_forecasts_cases global_forecasts_cases_lb global_forecasts_cases_ub
{txt}
{com}. 
. foreach l of local list {c -(}
{txt}  2{com}.         import delimited "`l'.csv", clear varnames(1)
{txt}  3{com}.         keep if strpos(country, "Iran")
{txt}  4{com}.         drop id country
{txt}  5{com}.         
.         gen i = _n
{txt}  6{com}.         reshape long v, i(i) j(j)
{txt}  7{com}.         rename v `l'
{txt}  8{com}.         rename j date
{txt}  9{com}.         drop i
{txt} 10{com}. 
.         save "`l'.dta", replace 
{txt} 11{com}. {c )-}
{res}{text}(104 vars, 184 obs)
(183 observations deleted)
(note: j = 3 4 5 6 7 8 9 10 11 12 13 14 15 16 17 18 19 20 21 22 23 24 25 26 27 28 29 30 31 32 33 34 35 36 37 38 39 40 41 42 43 44 45 46 47 48 49 50 51 52 53 54 55 56 57 58 59 60 61 62 63 64 65 66 67 68 69 70 71 72 73 74 75 76 77 78 79 80 81 82 83 84 85 86 87 88 89 90 91 92 93 94 95 96 97 98 99 100 101 102 103 104)

Data{col 36}wide{col 43}->{col 48}long
{hline 77}
Number of obs.                 {res}       1   {txt}->{res}     102
{txt}Number of variables            {res}     103   {txt}->{res}       3
{txt}j variable (102 values)                   ->   {res}j
{txt}xij variables:
                         {res}v3 v4 ... v104   {txt}->   {res}v
{txt}{hline 77}
{res}{txt}file global_forecasts_deaths.dta saved
{res}{text}(98 vars, 184 obs)
(183 observations deleted)
(note: j = 3 4 5 6 7 8 9 10 11 12 13 14 15 16 17 18 19 20 21 22 23 24 25 26 27 28 29 30 31 32 33 34 35 36 37 38 39 40 41 42 43 44 45 46 47 48 49 50 51 52 53 54 55 56 57 58 59 60 61 62 63 64 65 66 67 68 69 70 71 72 73 74 75 76 77 78 79 80 81 82 83 84 85 86 87 88 89 90 91 92 93 94 95 96 97 98)

Data{col 36}wide{col 43}->{col 48}long
{hline 77}
Number of obs.                 {res}       1   {txt}->{res}      96
{txt}Number of variables            {res}      97   {txt}->{res}       3
{txt}j variable (96 values)                    ->   {res}j
{txt}xij variables:
                          {res}v3 v4 ... v98   {txt}->   {res}v
{txt}{hline 77}
{res}{txt}file global_forecasts_deaths_lb.dta saved
{res}{text}(98 vars, 184 obs)
(183 observations deleted)
(note: j = 3 4 5 6 7 8 9 10 11 12 13 14 15 16 17 18 19 20 21 22 23 24 25 26 27 28 29 30 31 32 33 34 35 36 37 38 39 40 41 42 43 44 45 46 47 48 49 50 51 52 53 54 55 56 57 58 59 60 61 62 63 64 65 66 67 68 69 70 71 72 73 74 75 76 77 78 79 80 81 82 83 84 85 86 87 88 89 90 91 92 93 94 95 96 97 98)

Data{col 36}wide{col 43}->{col 48}long
{hline 77}
Number of obs.                 {res}       1   {txt}->{res}      96
{txt}Number of variables            {res}      97   {txt}->{res}       3
{txt}j variable (96 values)                    ->   {res}j
{txt}xij variables:
                          {res}v3 v4 ... v98   {txt}->   {res}v
{txt}{hline 77}
{res}{txt}file global_forecasts_deaths_ub.dta saved
{res}{text}(103 vars, 184 obs)
(183 observations deleted)
(note: j = 3 4 5 6 7 8 9 10 11 12 13 14 15 16 17 18 19 20 21 22 23 24 25 26 27 28 29 30 31 32 33 34 35 36 37 38 39 40 41 42 43 44 45 46 47 48 49 50 51 52 53 54 55 56 57 58 59 60 61 62 63 64 65 66 67 68 69 70 71 72 73 74 75 76 77 78 79 80 81 82 83 84 85 86 87 88 89 90 91 92 93 94 95 96 97 98 99 100 101 102 103)

Data{col 36}wide{col 43}->{col 48}long
{hline 77}
Number of obs.                 {res}       1   {txt}->{res}     101
{txt}Number of variables            {res}     102   {txt}->{res}       3
{txt}j variable (101 values)                   ->   {res}j
{txt}xij variables:
                         {res}v3 v4 ... v103   {txt}->   {res}v
{txt}{hline 77}
{res}{txt}file global_forecasts_cases.dta saved
{res}{text}(98 vars, 184 obs)
(183 observations deleted)
(note: j = 3 4 5 6 7 8 9 10 11 12 13 14 15 16 17 18 19 20 21 22 23 24 25 26 27 28 29 30 31 32 33 34 35 36 37 38 39 40 41 42 43 44 45 46 47 48 49 50 51 52 53 54 55 56 57 58 59 60 61 62 63 64 65 66 67 68 69 70 71 72 73 74 75 76 77 78 79 80 81 82 83 84 85 86 87 88 89 90 91 92 93 94 95 96 97 98)

Data{col 36}wide{col 43}->{col 48}long
{hline 77}
Number of obs.                 {res}       1   {txt}->{res}      96
{txt}Number of variables            {res}      97   {txt}->{res}       3
{txt}j variable (96 values)                    ->   {res}j
{txt}xij variables:
                          {res}v3 v4 ... v98   {txt}->   {res}v
{txt}{hline 77}
{res}{txt}file global_forecasts_cases_lb.dta saved
{res}{text}(98 vars, 184 obs)
(183 observations deleted)
(note: j = 3 4 5 6 7 8 9 10 11 12 13 14 15 16 17 18 19 20 21 22 23 24 25 26 27 28 29 30 31 32 33 34 35 36 37 38 39 40 41 42 43 44 45 46 47 48 49 50 51 52 53 54 55 56 57 58 59 60 61 62 63 64 65 66 67 68 69 70 71 72 73 74 75 76 77 78 79 80 81 82 83 84 85 86 87 88 89 90 91 92 93 94 95 96 97 98)

Data{col 36}wide{col 43}->{col 48}long
{hline 77}
Number of obs.                 {res}       1   {txt}->{res}      96
{txt}Number of variables            {res}      97   {txt}->{res}       3
{txt}j variable (96 values)                    ->   {res}j
{txt}xij variables:
                          {res}v3 v4 ... v98   {txt}->   {res}v
{txt}{hline 77}
{res}{txt}file global_forecasts_cases_ub.dta saved

{com}. *
. 
. foreach l of local list {c -(}
{txt}  2{com}.         merge 1:1 date using "`l'.dta"
{txt}  3{com}.         drop _merge
{txt}  4{com}. {c )-}
{res}{txt}{p 0 7 2}
(note: variable
date was 
byte, now int to accommodate using data's values)
{p_end}

{col 5}Result{col 38}# of obs.
{col 5}{hline 41}
{col 5}not matched{col 30}{res}               6
{txt}{col 9}from master{col 30}{res}               0{txt}  (_merge==1)
{col 9}from using{col 30}{res}               6{txt}  (_merge==2)

{col 5}matched{col 30}{res}              96{txt}  (_merge==3)
{col 5}{hline 41}
{res}
{txt}{col 5}Result{col 38}# of obs.
{col 5}{hline 41}
{col 5}not matched{col 30}{res}               6
{txt}{col 9}from master{col 30}{res}               6{txt}  (_merge==1)
{col 9}from using{col 30}{res}               0{txt}  (_merge==2)

{col 5}matched{col 30}{res}              96{txt}  (_merge==3)
{col 5}{hline 41}
{res}
{txt}{col 5}Result{col 38}# of obs.
{col 5}{hline 41}
{col 5}not matched{col 30}{res}               6
{txt}{col 9}from master{col 30}{res}               6{txt}  (_merge==1)
{col 9}from using{col 30}{res}               0{txt}  (_merge==2)

{col 5}matched{col 30}{res}              96{txt}  (_merge==3)
{col 5}{hline 41}
{res}
{txt}{col 5}Result{col 38}# of obs.
{col 5}{hline 41}
{col 5}not matched{col 30}{res}               1
{txt}{col 9}from master{col 30}{res}               1{txt}  (_merge==1)
{col 9}from using{col 30}{res}               0{txt}  (_merge==2)

{col 5}matched{col 30}{res}             101{txt}  (_merge==3)
{col 5}{hline 41}
{res}
{txt}{col 5}Result{col 38}# of obs.
{col 5}{hline 41}
{col 5}not matched{col 30}{res}               6
{txt}{col 9}from master{col 30}{res}               6{txt}  (_merge==1)
{col 9}from using{col 30}{res}               0{txt}  (_merge==2)

{col 5}matched{col 30}{res}              96{txt}  (_merge==3)
{col 5}{hline 41}
{res}
{txt}{col 5}Result{col 38}# of obs.
{col 5}{hline 41}
{col 5}not matched{col 30}{res}               6
{txt}{col 9}from master{col 30}{res}               6{txt}  (_merge==1)
{col 9}from using{col 30}{res}               0{txt}  (_merge==2)

{col 5}matched{col 30}{res}              96{txt}  (_merge==3)
{col 5}{hline 41}

{com}. *
. 
. rename global_forecasts_deaths_lb TotDeaLoRaA05S00V02   
{res}{txt}
{com}. rename global_forecasts_deaths_ub TotDeaUpRaA05S00V02   
{res}{txt}
{com}. rename global_forecasts_deaths    TotDeaMeRaA05S00V02
{res}{txt}
{com}. rename global_forecasts_cases_lb  TotCasLoRaA05S00V02
{res}{txt}
{com}. rename global_forecasts_cases_ub  TotCasUpRaA05S00V02   
{res}{txt}
{com}. rename global_forecasts_cases     TotCasMeRaA05S00V02
{res}{txt}
{com}. 
. label var TotDeaMeRaA05S00V02 "Total Deaths Mean SRIV"
{txt}
{com}. label var TotDeaLoRaA05S00V02 "Total Deaths Lower SRIV"
{txt}
{com}. label var TotDeaUpRaA05S00V02 "Total Deaths Upper SRIV"
{txt}
{com}. label var TotCasMeRaA05S00V02 "Total Cases Mean SRIV"
{txt}
{com}. label var TotCasLoRaA05S00V02 "Total Cases Lower SRIV"
{txt}
{com}. label var TotCasUpRaA05S00V02 "Total Cases Upper SRIV"
{txt}
{com}. 
. 
. * first date in csv files 2021-04-03    
. 
. rename date date_original
{res}{txt}
{com}. gen date = .
{txt}(102 missing values generated)

{com}. replace date = td(03mar2021) in 1
{txt}(1 real change made)

{com}. replace date = date[_n-1] + 1 in 2/l
{txt}(101 real changes made)

{com}. format date %tdDDMonCCYY
{txt}
{com}. codebook date

{txt}{hline}
{res}date{right:(unlabeled)}
{txt}{hline}

{col 19}type:  numeric daily date ({res}float{txt})

{col 18}range:  [{res}22342{txt},{res}22443{txt}]{col 55}units:  {res}1
{col 8}{txt}or equivalently:  [{res}03mar2021{txt},{res}12jun2021{txt}]{col 55}units:  {res}days
{col 10}{txt}unique values:  {res}102{col 51}{txt}missing .:  {res}0{txt}/{res}102

{txt}{col 19}mean:{res}{col 26} 22392.5{txt} = {res}22apr2021{txt} (+ 12 hours)
{col 15}std. dev:{res}{col 26} 29.5888

{txt}{col 12}percentiles:{col 32}10%{col 42}25%{col 52}50%{col 62}75%{col 72}90%
{res}{col 27}   22352{col 37}   22367{col 47} 22392.5{col 57}   22418{col 67}   22433
{col 26}13mar2021{col 36}28mar2021{col 46}22apr2021{col 56}18may2021{col 66}02jun2021
{txt}
{com}. drop date_original
{txt}
{com}. 
. sort date
{txt}
{com}. 
. local list ///
> DeaMeRaA05S00V02 DeaLoRaA05S00V02 DeaUpRaA05S00V02 ///
> CasMeRaA05S00V02 CasLoRaA05S00V02 CasUpRaA05S00V02 
{txt}
{com}. 
. foreach l of local list {c -(}
{txt}  2{com}.         gen Day`l' =  Tot`l'[_n] - Tot`l'[_n-1]
{txt}  3{com}. {c )-}
{txt}(1 missing value generated)
(7 missing values generated)
(7 missing values generated)
(2 missing values generated)
(7 missing values generated)
(7 missing values generated)

{com}. *
. 
. 
. label var DayDeaMeRaA05S00V02 "Daily Deaths Mean SRIV"
{txt}
{com}. label var DayDeaLoRaA05S00V02 "Daily Deaths Lower SRIV"
{txt}
{com}. label var DayDeaUpRaA05S00V02 "Daily Deaths Upper SRIV"
{txt}
{com}. label var DayCasMeRaA05S00V02 "Daily Cases Mean SRIV"
{txt}
{com}. label var DayCasLoRaA05S00V02 "Daily Cases Lower SRIV"
{txt}
{com}. label var DayCasUpRaA05S00V02 "Daily Cases Upper SRIV"
{txt}
{com}. 
. gen loc_grand_name = "Iran"
{txt}
{com}. 
. order date loc_grand_name
{txt}
{com}. 
. * gen cfr 
. 
. gen DayCfrMeRaA05S00V02 = 100 * DayDeaMeRaA05S00V02 / DayCasMeRaA05S00V02
{txt}(2 missing values generated)

{com}. gen DayCfrLoRaA05S00V02 = 100 * DayDeaLoRaA05S00V02 / DayCasLoRaA05S00V02
{txt}(7 missing values generated)

{com}. gen DayCfrUpRaA05S00V02 = 100 * DayDeaUpRaA05S00V02 / DayCasUpRaA05S00V02
{txt}(7 missing values generated)

{com}. 
. label var DayCfrMeRaA05S00V02 "Daily CFR Mean SRIV"
{txt}
{com}. label var DayCfrLoRaA05S00V02 "Daily CFR Lower SRIV"
{txt}
{com}. label var DayCfrUpRaA05S00V02 "Daily CFR Upper SRIV"
{txt}
{com}. 
. 
. 
. 
. 
. * gen "Daily cases mean div by daily deaths mean SRIV  DayCbD" for visulization of temporal relation of deaths and cases peaks 
. 
. 
.         summ DayDeaMeRaA05S00V02 

{txt}    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayDeaMeR~02 {c |}{res}        101    245.0396    123.3702         87        487
{txt}
{com}.         gen DayDeMMeRaA05S00V02   = r(mean)
{txt}
{com}.         label var DayDeMMeRaA05S00V02   "Daily deaths mean SRIV  DayDeM"
{txt}
{com}. 
.         summ DayCasMeRaA05S00V02   

{txt}    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayCasMeR~02 {c |}{res}        100    28686.56    12493.22      10416      50550
{txt}
{com}.         gen DayCaMMeRaA05S00V02   = r(mean)
{txt}
{com}.         label var DayCaMMeRaA05S00V02   "Daily cases mean SRIV  DayCaM"
{txt}
{com}.                            
.         gen DayCbDMeRaA05S00V02   = DayCaMMeRaA05S00V02   / DayDeMMeRaA05S00V02  
{txt}
{com}.         label var DayCbDMeRaA05S00V02   "Daily cases mean div by daily deaths mean SRIV  DayCbD"
{txt}
{com}.         summ DayCbDMeRaA05S00V02  

{txt}    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayCbDMeR~02 {c |}{res}        102    117.0691           0   117.0691   117.0691
{txt}
{com}.                                               
.         gen DayDMuMeRaA05S00V02   = DayDeaMeRaA05S00V02   * DayCbDMeRaA05S00V02  
{txt}(1 missing value generated)

{com}.     label var DayDMuMeRaA05S00V02   "Daily deaths scaled (times means of cases by deaths) SRIV "
{txt}
{com}.         summ DayDMuMeRaA05S00V02  

{txt}    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayDMuMeR~02 {c |}{res}        101    28686.56    14442.83   10185.01   57012.64
{txt}
{com}.         
. 
. 
. 
. 
. ****************************
. 
. * graphs 
. 
. grstyle init
{res}{txt}
{com}. 
. grstyle color background white
{txt}
{com}. 
. 
. 
. * daily deaths 
. 
. twoway ///
> (line DayDeaMeRaA05S00V02 date, sort lcolor(black)) ///
> , xtitle(Date) xlabel(#5, format(%tdYY-NN-DD) labsize(small)) xlabel(, grid) xlabel(, grid) ///
> xlabel(, angle(forty_five)) ylabel(, format(%9.0fc) labsize(small))  ylabel(, labsize(small) angle(horizontal)) ///
> ytitle(Daily deaths) title("COVID-19 daily deaths, Iran, SRIV, default scenario", size(medium)) ///
> xscale(lwidth(vthin) lcolor(gray*.2)) yscale(lwidth(vthin) lcolor(gray*.2)) 
{res}{txt}
{com}. 
. graph save "graph 1 COVID-19 daily deaths, default scenario, Iran, SRIV.gph", replace
{res}{txt}(file graph 1 COVID-19 daily deaths, default scenario, Iran, SRIV.gph saved)

{com}. graph export "graph 1 COVID-19 daily deaths, default scenario, Iran, SRIV.pdf", replace
{txt}(file /Users/farshadpourmalek/Downloads/covir2-main/20210405/code/SRIV/graph 1 COVID-19 daily deaths, default scenario, Iran, SRIV.pdf written in PDF format)

{com}. 
. 
. * daily deaths CI
. 
. twoway ///
> (rarea DayDeaLoRaA05S00V02 DayDeaUpRaA05S00V02 date, sort color(black*.2)) ///
> (line DayDeaMeRaA05S00V02 date, sort lcolor(black)) ///
> , xtitle(Date) xlabel(#5, format(%tdYY-NN-DD) labsize(small)) xlabel(, grid) xlabel(, grid) ///
> xlabel(, angle(forty_five)) ylabel(, format(%9.0fc) labsize(small))  ylabel(, labsize(small) angle(horizontal)) ///
> ytitle(Daily deaths) title("COVID-19 daily deaths, Iran, SRIV, default scenario", size(medium)) ///
> xscale(lwidth(vthin) lcolor(gray*.2)) yscale(lwidth(vthin) lcolor(gray*.2)) legend(off) ///
> subtitle("with confidence limits", size(small))
{res}{txt}
{com}. 
. graph save "graph 2 COVID-19 daily deaths, default scenario, Iran, SRIV.gph", replace
{res}{txt}(file graph 2 COVID-19 daily deaths, default scenario, Iran, SRIV.gph saved)

{com}. graph export "graph 2 COVID-19 daily deaths, default scenario, Iran, SRIV.pdf", replace
{txt}(file /Users/farshadpourmalek/Downloads/covir2-main/20210405/code/SRIV/graph 2 COVID-19 daily deaths, default scenario, Iran, SRIV.pdf written in PDF format)

{com}. 
. 
. 
. 
. * daily cases 
. 
. twoway ///
> (line DayCasMeRaA05S00V02 date, sort lcolor(black)) ///
> , xtitle(Date) xlabel(#5, format(%tdYY-NN-DD) labsize(small)) xlabel(, grid) xlabel(, grid) ///
> xlabel(, angle(forty_five)) ylabel(, format(%9.0fc) labsize(small))  ylabel(, labsize(small) angle(horizontal)) ///
> ytitle(Daily cases) title("COVID-19 daily cases, Iran, SRIV, default scenario", size(medium)) ///
> xscale(lwidth(vthin) lcolor(gray*.2)) yscale(lwidth(vthin) lcolor(gray*.2)) 
{res}{txt}
{com}. 
. graph save "graph 3 COVID-19 daily cases, default scenario, Iran, SRIV.gph", replace
{res}{txt}(file graph 3 COVID-19 daily cases, default scenario, Iran, SRIV.gph saved)

{com}. graph export "graph 3 COVID-19 daily cases, default scenario, Iran, SRIV.pdf", replace
{txt}(file /Users/farshadpourmalek/Downloads/covir2-main/20210405/code/SRIV/graph 3 COVID-19 daily cases, default scenario, Iran, SRIV.pdf written in PDF format)

{com}. 
. 
. 
. * daily cases CI
. 
. twoway ///
> (rarea DayCasLoRaA05S00V02 DayCasUpRaA05S00V02 date, sort color(black*.2)) ///
> (line DayCasMeRaA05S00V02 date, sort lcolor(black)) ///
> , xtitle(Date) xlabel(#5, format(%tdYY-NN-DD) labsize(small)) xlabel(, grid) xlabel(, grid) ///
> xlabel(, angle(forty_five)) ylabel(, format(%9.0fc) labsize(small))  ylabel(, labsize(small) angle(horizontal)) ///
> ytitle(Daily cases) title("COVID-19 daily cases, Iran, SRIV, default scenario", size(medium)) ///
> xscale(lwidth(vthin) lcolor(gray*.2)) yscale(lwidth(vthin) lcolor(gray*.2)) legend(off) ///
> subtitle("with confidence limits", size(small))
{res}{txt}
{com}. 
. graph save "graph 4 COVID-19 daily cases, default scenario, Iran, SRIV.gph", replace
{res}{txt}(file graph 4 COVID-19 daily cases, default scenario, Iran, SRIV.gph saved)

{com}. graph export "graph 4 COVID-19 daily cases, default scenario, Iran, SRIV.pdf", replace
{txt}(file /Users/farshadpourmalek/Downloads/covir2-main/20210405/code/SRIV/graph 4 COVID-19 daily cases, default scenario, Iran, SRIV.pdf written in PDF format)

{com}. 
. 
. 
. 
. 
. * total deaths 
. 
. twoway ///
> (line TotDeaMeRaA05S00V02 date, sort lcolor(black)) ///
> , xtitle(Date) xlabel(#5, format(%tdYY-NN-DD) labsize(small)) xlabel(, grid) xlabel(, grid) ///
> xlabel(, angle(forty_five)) ylabel(, format(%9.0fc) labsize(small))  ylabel(, labsize(small) angle(horizontal)) ///
> ytitle(Total deaths) title("COVID-19 total deaths, Iran, SRIV, default scenario", size(medium)) ///
> xscale(lwidth(vthin) lcolor(gray*.2)) yscale(lwidth(vthin) lcolor(gray*.2)) 
{res}{txt}
{com}. 
. graph save "graph 5 COVID-19 total deaths, default scenario, Iran, SRIV.gph", replace
{res}{txt}(file graph 5 COVID-19 total deaths, default scenario, Iran, SRIV.gph saved)

{com}. graph export "graph 5 COVID-19 total deaths, default scenario, Iran, SRIV.pdf", replace
{txt}(file /Users/farshadpourmalek/Downloads/covir2-main/20210405/code/SRIV/graph 5 COVID-19 total deaths, default scenario, Iran, SRIV.pdf written in PDF format)

{com}. 
. 
. * total deaths CI
. 
. twoway ///
> (rarea TotDeaLoRaA05S00V02 TotDeaUpRaA05S00V02 date, sort color(black*.2)) ///
> (line TotDeaMeRaA05S00V02 date, sort lcolor(black)) ///
> , xtitle(Date) xlabel(#5, format(%tdYY-NN-DD) labsize(small)) xlabel(, grid) xlabel(, grid) ///
> xlabel(, angle(forty_five)) ylabel(, format(%9.0fc) labsize(small))  ylabel(, labsize(small) angle(horizontal)) ///
> ytitle(Total deaths) title("COVID-19 total deaths, Iran, SRIV, default scenario", size(medium)) ///
> xscale(lwidth(vthin) lcolor(gray*.2)) yscale(lwidth(vthin) lcolor(gray*.2)) legend(off) ///
> subtitle("with confidence limits", size(small))
{res}{txt}
{com}. 
. graph save "graph 6 COVID-19 total deaths, default scenario, Iran, SRIV.gph", replace
{res}{txt}(file graph 6 COVID-19 total deaths, default scenario, Iran, SRIV.gph saved)

{com}. graph export "graph 6 COVID-19 total deaths, default scenario, Iran, SRIV.pdf", replace
{txt}(file /Users/farshadpourmalek/Downloads/covir2-main/20210405/code/SRIV/graph 6 COVID-19 total deaths, default scenario, Iran, SRIV.pdf written in PDF format)

{com}. 
. 
. 
. 
. * total cases 
. 
. twoway ///
> (line TotCasMeRaA05S00V02 date, sort lcolor(black)) ///
> , xtitle(Date) xlabel(#5, format(%tdYY-NN-DD) labsize(small)) xlabel(, grid) xlabel(, grid) ///
> xlabel(, angle(forty_five)) ylabel(, format(%9.0fc) labsize(small))  ylabel(, labsize(small) angle(horizontal)) ///
> ytitle(Total cases) title("COVID-19 total cases, Iran, SRIV, default scenario", size(medium)) ///
> xscale(lwidth(vthin) lcolor(gray*.2)) yscale(lwidth(vthin) lcolor(gray*.2)) 
{res}{txt}
{com}. 
. graph save "graph 7 COVID-19 total cases, default scenario, Iran, SRIV.gph", replace
{res}{txt}(file graph 7 COVID-19 total cases, default scenario, Iran, SRIV.gph saved)

{com}. graph export "graph 7 COVID-19 total cases, default scenario, Iran, SRIV.pdf", replace
{txt}(file /Users/farshadpourmalek/Downloads/covir2-main/20210405/code/SRIV/graph 7 COVID-19 total cases, default scenario, Iran, SRIV.pdf written in PDF format)

{com}. 
. 
. * total cases CI
. 
. twoway ///
> (rarea TotCasLoRaA05S00V02 TotCasUpRaA05S00V02 date, sort color(black*.2)) ///
> (line TotCasMeRaA05S00V02 date, sort lcolor(black)) ///
> , xtitle(Date) xlabel(#5, format(%tdYY-NN-DD) labsize(small)) xlabel(, grid) xlabel(, grid) ///
> xlabel(, angle(forty_five)) ylabel(, format(%9.0fc) labsize(small))  ylabel(, labsize(small) angle(horizontal)) ///
> ytitle(Total cases) title("COVID-19 total cases, Iran, SRIV, default scenario", size(medium)) ///
> xscale(lwidth(vthin) lcolor(gray*.2)) yscale(lwidth(vthin) lcolor(gray*.2)) legend(off) ///
> subtitle("with confidence limits", size(small))
{res}{txt}
{com}. 
. graph save "graph 8 COVID-19 total cases, default scenario, Iran, SRIV.gph", replace
{res}{txt}(file graph 8 COVID-19 total cases, default scenario, Iran, SRIV.gph saved)

{com}. graph export "graph 8 COVID-19 total cases, default scenario, Iran, SRIV.pdf", replace
{txt}(file /Users/farshadpourmalek/Downloads/covir2-main/20210405/code/SRIV/graph 8 COVID-19 total cases, default scenario, Iran, SRIV.pdf written in PDF format)

{com}. 
. 
. 
. 
. 
. 
. * daily CFR 
. 
. twoway ///
> (line DayCfrMeRaA05S00V02 date, sort lcolor(black)) ///
> , xtitle(Date) xlabel(#5, format(%tdYY-NN-DD) labsize(small)) xlabel(, grid) xlabel(, grid) ///
> xlabel(, angle(forty_five)) ylabel(, format(%9.2fc) labsize(small))  ylabel(, labsize(small) angle(horizontal)) ///
> ytitle(Daily CFR) title("COVID-19 daily CFR, Iran, SRIV, default scenario", size(medium)) ///
> xscale(lwidth(vthin) lcolor(gray*.2)) yscale(lwidth(vthin) lcolor(gray*.2)) 
{res}{txt}
{com}. 
. graph save "graph 9 COVID-19 daily CFR, default scenario, Iran, SRIV.gph", replace
{res}{txt}(file graph 9 COVID-19 daily CFR, default scenario, Iran, SRIV.gph saved)

{com}. graph export "graph 9 COVID-19 daily CFR, default scenario, Iran, SRIV.pdf", replace
{txt}(file /Users/farshadpourmalek/Downloads/covir2-main/20210405/code/SRIV/graph 9 COVID-19 daily CFR, default scenario, Iran, SRIV.pdf written in PDF format)

{com}. 
. 
. * daily CFR CI
. 
. twoway ///
> (rarea DayCfrLoRaA05S00V02 DayCfrUpRaA05S00V02 date, sort color(black*.2)) ///
> (line DayCfrMeRaA05S00V02 date, sort lcolor(black)) ///
> , xtitle(Date) xlabel(#5, format(%tdYY-NN-DD) labsize(small)) xlabel(, grid) xlabel(, grid) ///
> xlabel(, angle(forty_five)) ylabel(, format(%9.2fc) labsize(small))  ylabel(, labsize(small) angle(horizontal)) ///
> ytitle(Daily CFR) title("COVID-19 daily CFR, Iran, SRIV, default scenario", size(medium)) ///
> xscale(lwidth(vthin) lcolor(gray*.2)) yscale(lwidth(vthin) lcolor(gray*.2)) legend(off) ///
> subtitle("with confidence limits", size(small))
{res}{txt}
{com}. 
. graph save "graph 10 COVID-19 daily CFR, default scenario, Iran, SRIV.gph", replace
{res}{txt}(file graph 10 COVID-19 daily CFR, default scenario, Iran, SRIV.gph saved)

{com}. graph export "graph 10 COVID-19 daily CFR, default scenario, Iran, SRIV.pdf", replace
{txt}(file /Users/farshadpourmalek/Downloads/covir2-main/20210405/code/SRIV/graph 10 COVID-19 daily CFR, default scenario, Iran, SRIV.pdf written in PDF format)

{com}. 
. 
. 
. 
. * DayCas DayDeaDay Dea_multip
. 
. twoway ///
> (line DayCasMeRaA05S00V02 date, sort lcolor(blue)) ///
> (line DayDeaMeRaA05S00V02 date, sort lcolor(red)) ///
> (line DayDMuMeRaA05S00V02 date, sort lpattern(dot) lcolor(red)) ///
> if date > td(01jan2020) ///
> , xtitle(Date) xlabel(, format(%tdYY-NN-DD) labsize(small)) xlabel(, grid) xlabel(, grid) ///
> xlabel(, angle(forty_five)) ylabel(, format(%12.0fc) labsize(small)) ylabel(, labsize(small) angle(horizontal)) ///
> ytitle(Daily cases and deaths) title("COVID-19 daily cases and deaths, Iran, SRIV ", size(medium)) ///
> xscale(lwidth(vthin) lcolor(gray*.2)) yscale(lwidth(vthin) lcolor(gray*.2)) yscale(titlegap(4)) legend(region(lcolor(none)))  ///
> legend(order(1 "Daily cases" 2 "Daily deaths" 3 "Daily deaths scaled for visualization") size(small)) ///
> subtitle("Daily deaths, scaled = times (means of cases divided by deaths) for visualization only", size(small)) ///
> note("Current scenario, mean estimate")
{res}{txt}
{com}. 
. qui graph save "graph 10 COVID-19 daily deaths and cases Iran, SRIV .gph", replace
{txt}
{com}. qui graph export "graph 10 COVID-19 daily deaths and cases Iran, SRIV .pdf", replace
{txt}
{com}. 
. 
. 
. 
. 
. *************************************************************************
. 
. * Locate peak dates and values - deaths 
. 
. 
. * start value 
. 
. gen DayDeaMeRaA05S00V02P7D = td(04Mar2021) // all estimates non-missing
{txt}
{com}. 
. label var DayDeaMeRaA05S00V02P7D "DayDeaMeRaA05S00V02 start Date"
{txt}
{com}. 
. format DayDeaMeRaA05S00V02P7D %tdDDMonCCYY
{txt}
{com}. 
. 
. summ DayDeaMeRaA05S00V02 if date == DayDeaMeRaA05S00V02P7D

{txt}    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayDeaMeR~02 {c |}{res}          1          89           .         89         89
{txt}
{com}. 
. gen DayDeaMeRaA05S00V02P7V = r(max)
{txt}
{com}. 
. label var DayDeaMeRaA05S00V02P7V "DayDeaMeRaA05S00V02 start Value"
{txt}
{com}. 
. 
. summ DayDeaLoRaA05S00V02 if date == DayDeaMeRaA05S00V02P7D

{txt}    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayDeaLoR~02 {c |}{res}          1          85           .         85         85
{txt}
{com}. 
. gen DayDeaLoRaA05S00V02P7V = r(max)
{txt}
{com}. 
. label var DayDeaLoRaA05S00V02P7V "DayDeaLoRaA05S00V02 start Value"
{txt}
{com}. 
. 
. summ DayDeaUpRaA05S00V02 if date == DayDeaMeRaA05S00V02P7D

{txt}    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayDeaUpR~02 {c |}{res}          1          99           .         99         99
{txt}
{com}. 
. gen DayDeaUpRaA05S00V02P7V = r(max)
{txt}
{com}. 
. label var DayDeaUpRaA05S00V02P7V "DayDeaUpRaA05S00V02 start Value"
{txt}
{com}. 
. format DayDeaMeRaA05S00V02P7D %tdDDMonCCYY
{txt}
{com}. 
. tab1 DayDeaMeRaA05S00V02P7V DayDeaLoRaA05S00V02P7V DayDeaUpRaA05S00V02P7V DayDeaMeRaA05S00V02P7D

{res}-> tabulation of DayDeaMeRaA05S00V02P7V  

{txt}DayDeaMeRaA {c |}
   05S00V02 {c |}
start Value {c |}      Freq.     Percent        Cum.
{hline 12}{c +}{hline 35}
         89 {c |}{res}        102      100.00      100.00
{txt}{hline 12}{c +}{hline 35}
      Total {c |}{res}        102      100.00

-> tabulation of DayDeaLoRaA05S00V02P7V  

{txt}DayDeaLoRaA {c |}
   05S00V02 {c |}
start Value {c |}      Freq.     Percent        Cum.
{hline 12}{c +}{hline 35}
         85 {c |}{res}        102      100.00      100.00
{txt}{hline 12}{c +}{hline 35}
      Total {c |}{res}        102      100.00

-> tabulation of DayDeaUpRaA05S00V02P7V  

{txt}DayDeaUpRaA {c |}
   05S00V02 {c |}
start Value {c |}      Freq.     Percent        Cum.
{hline 12}{c +}{hline 35}
         99 {c |}{res}        102      100.00      100.00
{txt}{hline 12}{c +}{hline 35}
      Total {c |}{res}        102      100.00

-> tabulation of DayDeaMeRaA05S00V02P7D  

{txt}DayDeaMeRaA {c |}
   05S00V02 {c |}
 start Date {c |}      Freq.     Percent        Cum.
{hline 12}{c +}{hline 35}
  04Mar2021 {c |}{res}        102      100.00      100.00
{txt}{hline 12}{c +}{hline 35}
      Total {c |}{res}        102      100.00
{txt}
{com}. 
. 
. 
. 
. 
. 
. 
. * end value 
. 
. gen DayDeaMeRaA05S00V02P8D = td(06Jun2021) // all estimates non-missing
{txt}
{com}. 
. label var DayDeaMeRaA05S00V02P8D "DayDeaMeRaA05S00V02 end Date"
{txt}
{com}. 
. format DayDeaMeRaA05S00V02P8D %tdDDMonCCYY
{txt}
{com}. 
. 
. summ DayDeaMeRaA05S00V02 if date == DayDeaMeRaA05S00V02P8D

{txt}    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayDeaMeR~02 {c |}{res}          1         453           .        453        453
{txt}
{com}. 
. gen DayDeaMeRaA05S00V02P8V = r(max)
{txt}
{com}. 
. label var DayDeaMeRaA05S00V02P8V "DayDeaMeRaA05S00V02 end Value"
{txt}
{com}. 
. 
. summ DayDeaLoRaA05S00V02 if date == DayDeaMeRaA05S00V02P8D

{txt}    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayDeaLoR~02 {c |}{res}          1         432           .        432        432
{txt}
{com}. 
. gen DayDeaLoRaA05S00V02P8V = r(max)
{txt}
{com}. 
. label var DayDeaLoRaA05S00V02P8V "DayDeaLoRaA05S00V02 end Value"
{txt}
{com}. 
. 
. summ DayDeaUpRaA05S00V02 if date == DayDeaMeRaA05S00V02P8D

{txt}    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayDeaUpR~02 {c |}{res}          1         848           .        848        848
{txt}
{com}. 
. gen DayDeaUpRaA05S00V02P8V = r(max)
{txt}
{com}. 
. label var DayDeaUpRaA05S00V02P8V "DayDeaUpRaA05S00V02 end Value"
{txt}
{com}. 
. format DayDeaMeRaA05S00V02P8D %tdDDMonCCYY
{txt}
{com}. 
. tab1 DayDeaMeRaA05S00V02P8V DayDeaLoRaA05S00V02P8V DayDeaUpRaA05S00V02P8V DayDeaMeRaA05S00V02P8D

{res}-> tabulation of DayDeaMeRaA05S00V02P8V  

{txt}DayDeaMeRaA {c |}
   05S00V02 {c |}
  end Value {c |}      Freq.     Percent        Cum.
{hline 12}{c +}{hline 35}
        453 {c |}{res}        102      100.00      100.00
{txt}{hline 12}{c +}{hline 35}
      Total {c |}{res}        102      100.00

-> tabulation of DayDeaLoRaA05S00V02P8V  

{txt}DayDeaLoRaA {c |}
   05S00V02 {c |}
  end Value {c |}      Freq.     Percent        Cum.
{hline 12}{c +}{hline 35}
        432 {c |}{res}        102      100.00      100.00
{txt}{hline 12}{c +}{hline 35}
      Total {c |}{res}        102      100.00

-> tabulation of DayDeaUpRaA05S00V02P8V  

{txt}DayDeaUpRaA {c |}
   05S00V02 {c |}
  end Value {c |}      Freq.     Percent        Cum.
{hline 12}{c +}{hline 35}
        848 {c |}{res}        102      100.00      100.00
{txt}{hline 12}{c +}{hline 35}
      Total {c |}{res}        102      100.00

-> tabulation of DayDeaMeRaA05S00V02P8D  

{txt}DayDeaMeRaA {c |}
   05S00V02 {c |}
   end Date {c |}      Freq.     Percent        Cum.
{hline 12}{c +}{hline 35}
  06Jun2021 {c |}{res}        102      100.00      100.00
{txt}{hline 12}{c +}{hline 35}
      Total {c |}{res}        102      100.00
{txt}
{com}. 
. 
. 
. *************************************************************************
. 
. * Locate peak dates and values - cases
. 
. 
. 
. 
. * start value
. 
. gen DayCasMeRaA05S00V02P7D = td(04Mar2021) // all estimates non-missing
{txt}
{com}. 
. label var DayCasMeRaA05S00V02P7D "DayCasMeRaA05S00V02 start Date"
{txt}
{com}. 
. format DayCasMeRaA05S00V02P7D %tdDDMonCCYY
{txt}
{com}. 
. 
. summ DayCasMeRaA05S00V02 if date == DayCasMeRaA05S00V02P7D

{txt}    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayCasMeR~02 {c |}{res}          1       10416           .      10416      10416
{txt}
{com}. 
. gen DayCasMeRaA05S00V02P7V = r(max)
{txt}
{com}. 
. label var DayCasMeRaA05S00V02P7V "DayCasMeRaA05S00V02 start Value"
{txt}
{com}. 
. 
. summ DayCasLoRaA05S00V02 if date == DayCasMeRaA05S00V02P7D

{txt}    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayCasLoR~02 {c |}{res}          1        9865           .       9865       9865
{txt}
{com}. 
. gen DayCasLoRaA05S00V02P7V = r(max)
{txt}
{com}. 
. label var DayCasLoRaA05S00V02P7V "DayCasLoRaA05S00V02 start Value"
{txt}
{com}. 
. 
. summ DayCasUpRaA05S00V02 if date == DayCasMeRaA05S00V02P7D

{txt}    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayCasUpR~02 {c |}{res}          1       13283           .      13283      13283
{txt}
{com}. 
. gen DayCasUpRaA05S00V02P7V = r(max)
{txt}
{com}. 
. label var DayCasUpRaA05S00V02P7V "DayCasUpRaA05S00V02 start Value"
{txt}
{com}. 
. format DayCasMeRaA05S00V02P7D %tdDDMonCCYY
{txt}
{com}. 
. tab1 DayCasMeRaA05S00V02P7V DayCasLoRaA05S00V02P7V DayCasUpRaA05S00V02P7V DayCasMeRaA05S00V02P7D

{res}-> tabulation of DayCasMeRaA05S00V02P7V  

{txt}DayCasMeRaA {c |}
   05S00V02 {c |}
start Value {c |}      Freq.     Percent        Cum.
{hline 12}{c +}{hline 35}
      10416 {c |}{res}        102      100.00      100.00
{txt}{hline 12}{c +}{hline 35}
      Total {c |}{res}        102      100.00

-> tabulation of DayCasLoRaA05S00V02P7V  

{txt}DayCasLoRaA {c |}
   05S00V02 {c |}
start Value {c |}      Freq.     Percent        Cum.
{hline 12}{c +}{hline 35}
       9865 {c |}{res}        102      100.00      100.00
{txt}{hline 12}{c +}{hline 35}
      Total {c |}{res}        102      100.00

-> tabulation of DayCasUpRaA05S00V02P7V  

{txt}DayCasUpRaA {c |}
   05S00V02 {c |}
start Value {c |}      Freq.     Percent        Cum.
{hline 12}{c +}{hline 35}
      13283 {c |}{res}        102      100.00      100.00
{txt}{hline 12}{c +}{hline 35}
      Total {c |}{res}        102      100.00

-> tabulation of DayCasMeRaA05S00V02P7D  

{txt}DayCasMeRaA {c |}
   05S00V02 {c |}
 start Date {c |}      Freq.     Percent        Cum.
{hline 12}{c +}{hline 35}
  04Mar2021 {c |}{res}        102      100.00      100.00
{txt}{hline 12}{c +}{hline 35}
      Total {c |}{res}        102      100.00
{txt}
{com}. 
. 
. 
. 
. 
. 
. 
. * end value
. 
. gen DayCasMeRaA05S00V02P8D = td(06Jun2021) // all estimates non-missing
{txt}
{com}. 
. label var DayCasMeRaA05S00V02P8D "DayCasMeRaA05S00V02 end Date"
{txt}
{com}. 
. format DayCasMeRaA05S00V02P8D %tdDDMonCCYY
{txt}
{com}. 
. 
. summ DayCasMeRaA05S00V02 if date == DayCasMeRaA05S00V02P8D

{txt}    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayCasMeR~02 {c |}{res}          1       48715           .      48715      48715
{txt}
{com}. 
. gen DayCasMeRaA05S00V02P8V = r(max)
{txt}
{com}. 
. label var DayCasMeRaA05S00V02P8V "DayCasMeRaA05S00V02 end Value"
{txt}
{com}. 
. 
. summ DayCasLoRaA05S00V02 if date == DayCasMeRaA05S00V02P8D

{txt}    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayCasLoR~02 {c |}{res}          1       47105           .      47105      47105
{txt}
{com}. 
. gen DayCasLoRaA05S00V02P8V = r(max)
{txt}
{com}. 
. label var DayCasLoRaA05S00V02P8V "DayCasLoRaA05S00V02 end Value"
{txt}
{com}. 
. 
. summ DayCasUpRaA05S00V02 if date == DayCasMeRaA05S00V02P8D

{txt}    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayCasUpR~02 {c |}{res}          1       92197           .      92197      92197
{txt}
{com}. 
. gen DayCasUpRaA05S00V02P8V = r(max)
{txt}
{com}. 
. label var DayCasUpRaA05S00V02P8V "DayCasUpRaA05S00V02 end Value"
{txt}
{com}. 
. format DayCasMeRaA05S00V02P8D %tdDDMonCCYY
{txt}
{com}. 
. tab1 DayCasMeRaA05S00V02P8V DayCasLoRaA05S00V02P8V DayCasUpRaA05S00V02P8V DayCasMeRaA05S00V02P8D

{res}-> tabulation of DayCasMeRaA05S00V02P8V  

{txt}DayCasMeRaA {c |}
   05S00V02 {c |}
  end Value {c |}      Freq.     Percent        Cum.
{hline 12}{c +}{hline 35}
      48715 {c |}{res}        102      100.00      100.00
{txt}{hline 12}{c +}{hline 35}
      Total {c |}{res}        102      100.00

-> tabulation of DayCasLoRaA05S00V02P8V  

{txt}DayCasLoRaA {c |}
   05S00V02 {c |}
  end Value {c |}      Freq.     Percent        Cum.
{hline 12}{c +}{hline 35}
      47105 {c |}{res}        102      100.00      100.00
{txt}{hline 12}{c +}{hline 35}
      Total {c |}{res}        102      100.00

-> tabulation of DayCasUpRaA05S00V02P8V  

{txt}DayCasUpRaA {c |}
   05S00V02 {c |}
  end Value {c |}      Freq.     Percent        Cum.
{hline 12}{c +}{hline 35}
      92197 {c |}{res}        102      100.00      100.00
{txt}{hline 12}{c +}{hline 35}
      Total {c |}{res}        102      100.00

-> tabulation of DayCasMeRaA05S00V02P8D  

{txt}DayCasMeRaA {c |}
   05S00V02 {c |}
   end Date {c |}      Freq.     Percent        Cum.
{hline 12}{c +}{hline 35}
  06Jun2021 {c |}{res}        102      100.00      100.00
{txt}{hline 12}{c +}{hline 35}
      Total {c |}{res}        102      100.00
{txt}
{com}. 
. 
. 
. 
. qui compress
{txt}
{com}. 
. 
. 
. save "Iran SRIV.dta", replace
{txt}file Iran SRIV.dta saved

{com}.  
. 
. 
. 
. 
. 
. capture shell mv -f "ReCOVER-COVID-19-master" ~/.Trash
{txt}
{com}. 
. 
. 
. 
. 
. view "log Iran SRIV win.smcl"
{txt}
{com}. 
. log close
      {txt}name:  {res}<unnamed>
       {txt}log:  {res}/Users/farshadpourmalek/Downloads/covir2-main/20210405/code/SRIV/log Iran SRIV win.smcl
  {txt}log type:  {res}smcl
 {txt}closed on:  {res}15 Apr 2021, 09:48:49
{txt}{.-}
{smcl}
{txt}{sf}{ul off}