{smcl}
{com}{sf}{ul off}{txt}{.-}
      name:  {res}<unnamed>
       {txt}log:  {res}/Users/farshadpourmalek/Downloads/covir2-main/20220204/code/merge/log country merge.smcl
  {txt}log type:  {res}smcl
 {txt}opened on:  {res} 5 Feb 2022, 19:46:05
{txt}
{com}. 
. 
. ***************************************************************************
. * This is "do country merge.do"
. 
. * Project: CovidVisualized country - countries without subnational estimates
. * Person: Farshad Pourmalek pourmalek_farshad at yahoo dot com
. * Time (initial): 2021-02-10
. 
. * OBJECTIVE: Merge component studies' estimates for country, graphs
. ***************************************************************************
. 
. 
. /* 
> 
> List of component studies:
> 
> JOHN A00
> 
> DELP A01
> IHME A02
> IMPE A03 // IMPE 2022-01-02_v9.csv.zip is > one month old
> LANL A04 // The LANL COVID-19 Team made its last real-time forecast on September 27th, 2021. [for 20210926]. This is more than two weeks old and will not be used. 
> SRIV A05 // Highly implausibly high estimates.   
> 
> */
. 
. 
. clear 
{txt}
{com}. 
. * JOHN
. 
. if regexm(c(os),"Mac") == 1 {c -(}
. 
.         use "$pathcovir2/JOHN/country JOHN.dta", clear 
. {c )-}
{txt}
{com}. else if regexm(c(os),"Windows") == 1 use "$pathcovir2\JOHN\country JOHN.dta", clear 
{txt}
{com}. 
. 
. 
. * DELP 
. 
. if regexm(c(os),"Mac") == 1 {c -(}
. 
.         merge 1:1 date using "$pathcovir2/DELP/country DELP.dta"
{res}
{txt}{col 5}Result{col 38}# of obs.
{col 5}{hline 41}
{col 5}not matched{col 30}{res}             677
{txt}{col 9}from master{col 30}{res}             638{txt}  (_merge==1)
{col 9}from using{col 30}{res}              39{txt}  (_merge==2)

{col 5}matched{col 30}{res}             128{txt}  (_merge==3)
{col 5}{hline 41}
{com}. {c )-}
{txt}
{com}. else if regexm(c(os),"Windows") == 1 merge 1:1 date using "$pathcovir2\DELP\country DELP.dta"
{txt}
{com}. 
. drop _merge
{txt}
{com}. 
. 
. 
. * IHME
. 
. if regexm(c(os),"Mac") == 1 {c -(}
. 
.         merge 1:1 date using "$pathcovir2/IHME/country IHME.dta"
{res}
{txt}{col 5}Result{col 38}# of obs.
{col 5}{hline 41}
{col 5}not matched{col 30}{res}             112
{txt}{col 9}from master{col 30}{res}              34{txt}  (_merge==1)
{col 9}from using{col 30}{res}              78{txt}  (_merge==2)

{col 5}matched{col 30}{res}             771{txt}  (_merge==3)
{col 5}{hline 41}
{com}. {c )-}
{txt}
{com}. else if regexm(c(os),"Windows") == 1 merge 1:1 date using "$pathcovir2\IHME\country IHME.dta"
{txt}
{com}. 
. drop _merge
{txt}
{com}. 
. 
. /*
> * IMPE
> 
> if regexm(c(os),"Mac") == 1 {c -(}
> 
>         merge 1:1 date using "$pathcovir2/IMPE/country IMPE.dta"
> {c )-}
> else if regexm(c(os),"Windows") == 1 merge 1:1 date using "$pathcovir2\IMPE\country IMPE.dta"
> 
> drop _merge
> */
. 
. 
. /* LANL
> 
> if regexm(c(os),"Mac") == 1 {c -(}
> 
>         merge 1:1 date using "$pathcovir2/LANL/country LANL.dta"
> {c )-}
> else if regexm(c(os),"Windows") == 1 merge 1:1 date using "$pathcovir2\LANL\country LANL.dta"
> 
> drop _merge */
. 
. 
. /* SRIV
> 
> if regexm(c(os),"Mac") == 1 {c -(}
> 
>         merge 1:1 date using "$pathcovir2/SRIV/country SRIV.dta"
> {c )-}
> else if regexm(c(os),"Windows") == 1 merge 1:1 date using "$pathcovir2\SRIV\country SRIV.dta"
> 
> drop _merge
> 
> */
. 
. 
. * 
. 
. label var loc_grand_name "Location"
{txt}
{com}. 
. 
. 
. 
. 
. 
. 
. *************************************
. 
. 
. * cases or infections to deaths ratio
. 
. 
. gen DayCTDMeRaA00S00 =  DayCasMeRaA00S00 / DayDeaMeRaA00S00
{txt}(167 missing values generated)

{com}. 
. label var DayCTDMeRaA00S00  "Daily Cases to Deaths S0 JOHN"
{txt}
{com}. 
. gen TotCTDMeRaA00S00 =  TotCasMeRaA00S00 / TotDeaMeRaA00S00
{txt}(166 missing values generated)

{com}. 
. label var TotCTDMeRaA00S00  "Total Cases to Deaths S0 JOHN"
{txt}
{com}. 
. 
. 
. 
. gen DayCTDMeRaA01S00 =  DayCasMeRaA01S00 / DayDeaMeRaA01S00
{txt}(719 missing values generated)

{com}. 
. label var DayCTDMeRaA01S00  "Daily Cases to Deaths S0 DELP"
{txt}
{com}. 
. gen TotCTDMeRaA01S00 =  TotCasMeRaA01S00 / TotDeaMeRaA01S00
{txt}(716 missing values generated)

{com}. 
. label var TotCTDMeRaA01S00  "Total Cases to Deaths S0 DELP"  
{txt}
{com}. 
. 
. 
. 
. 
. gen DayITDMeRaA02S01  =  DayINFMeSmA02S01  / DayDeaMeSmA02S01 
{txt}(53 missing values generated)

{com}. 
. label var DayITDMeRaA02S01   "Daily Infections to Deaths S1 IHME"
{txt}
{com}. 
. gen TotITDMeRaA02S01  =  TotINFMeSmA02S01  / TotDeaMeSmA02S01 
{txt}(53 missing values generated)

{com}. 
. label var TotITDMeRaA02S01   "Total Infections to Deaths S1 IHME"
{txt}
{com}. 
. 
. 
. 
. gen DayITDMeRaA02S02 = DayINFMeSmA02S02 / DayDeaMeSmA02S02  
{txt}(53 missing values generated)

{com}. 
. label var DayITDMeRaA02S02 "Daily Infections to Deaths S2 IHME"
{txt}
{com}. 
. gen TotITDMeRaA02S02 = TotINFMeSmA02S02 / TotDeaMeSmA02S02  
{txt}(53 missing values generated)

{com}. 
. label var TotITDMeRaA02S02 "Total Infections to Deaths S2 IHME"
{txt}
{com}. 
. 
. 
. 
. 
. 
. 
. 
. 
. 
. ***********************
. 
. * daily deaths estimated to reported  
. 
.     
. gen DayDERMeRaA00S00 = DayDeaMeRaA00S00 / DayDeaMeRaA00S00
{txt}(167 missing values generated)

{com}. 
. label var DayDERMeRaA00S00 "Daily Deaths estim to reported JOHN = 1" 
{txt}
{com}. 
. 
. gen DayDERMeRaA01S00 = DayDeaMeRaA01S00 / DayDeaMeRaA00S00
{txt}(756 missing values generated)

{com}. 
. label var DayDERMeRaA01S00 "Daily Deaths estim to reported Mean DELP S0"
{txt}
{com}. 
. 
. 
. 
. gen DayDERMeRaA02S01 = DayDeaMeSmA02S01 / DayDeaMeRaA00S00
{txt}(167 missing values generated)

{com}. 
. label var DayDERMeRaA02S01 "Daily Deaths estim to reported Mean not smoothed IHME S1"
{txt}
{com}. 
. 
. gen DayDERMeRaA02S02 = DayDeaMeSmA02S02 / DayDeaMeRaA00S00
{txt}(167 missing values generated)

{com}. 
. label var DayDERMeRaA02S02 "Daily Deaths estim to reported Mean not smoothed IHME S2"
{txt}
{com}. 
. 
. 
. 
. 
. 
. 
. * daily cases or infections estimated to reported  
. 
. 
. gen DayCERMeRaA00S00 = DayCasMeRaA00S00 / DayCasMeRaA00S00
{txt}(166 missing values generated)

{com}. 
. label var DayCERMeRaA00S00 "Daily Cases estim to reported JOHN = 1" 
{txt}
{com}. 
. 
. 
. gen DayCERMeRaA01S00 = DayCasMeRaA01S00 / DayCasMeRaA00S00
{txt}(756 missing values generated)

{com}. 
. label var DayCERMeRaA01S00 "Daily Cases estim to reported Mean DELP S0"
{txt}
{com}. 
. 
. 
. 
. 
. 
. gen DayIERMeRaA02S01 = DayINFMeSmA02S01 / DayCasMeRaA00S00
{txt}(166 missing values generated)

{com}. 
. label var DayIERMeRaA02S01 "Daily Infections estim to reported Mean not smoothed IHME S1"
{txt}
{com}. 
. 
. gen DayIERMeRaA02S02 = DayINFMeSmA02S02 / DayCasMeRaA00S00
{txt}(166 missing values generated)

{com}. 
. label var DayIERMeRaA02S02 "Daily Infections estim to reported Mean not smoothed IHME S2"
{txt}
{com}. 
. 
. 
. 
. 
. * Total deaths estimated to reported  
. 
. 
. gen TotDERMeRaA00S00 = TotDeaMeRaA00S00 / TotDeaMeRaA00S00
{txt}(166 missing values generated)

{com}. 
. label var TotDERMeRaA00S00 "Total Deaths estim to reported JOHN = 1" 
{txt}
{com}. 
. 
. 
. gen TotDERMeRaA01S00 = TotDeaMeRaA01S00 / TotDeaMeRaA00S00
{txt}(755 missing values generated)

{com}. 
. label var TotDERMeRaA01S00 "Total Deaths estim to reported Mean DELP S0"
{txt}
{com}. 
. 
. 
. gen TotDERMeRaA02S01 = TotDeaMeSmA02S01 / TotDeaMeRaA00S00
{txt}(166 missing values generated)

{com}. 
. label var TotDERMeRaA02S01 "Total Deaths estim to reported Mean not smoothed IHME S1"
{txt}
{com}. 
. 
. gen TotDERMeRaA02S02 = TotDeaMeSmA02S02 / TotDeaMeRaA00S00
{txt}(166 missing values generated)

{com}. 
. label var TotDERMeRaA02S02 "Total Deaths estim to reported Mean not smoothed IHME S2"
{txt}
{com}. 
. 
. 
. 
. 
. 
. 
. * Total cases or infections estimated to reported  
. 
. 
. gen TotCERMeRaA00S00 = TotCasMeRaA00S00 / TotCasMeRaA00S00
{txt}(166 missing values generated)

{com}. 
. label var TotCERMeRaA00S00 "Total Cases estim to reported JOHN = 1" 
{txt}
{com}. 
. 
. gen TotCERMeRaA01S00 = TotCasMeRaA01S00 / TotCasMeRaA00S00
{txt}(755 missing values generated)

{com}. 
. label var TotCERMeRaA01S00 "Total Cases estim to reported Mean DELP S0"
{txt}
{com}. 
. 
. 
. gen TotIERMeRaA02S01 = TotINFMeSmA02S01 / TotCasMeRaA00S00
{txt}(166 missing values generated)

{com}. 
. label var TotIERMeRaA02S01 "Total Infections estim to reported Mean not smoothed IHME S1"
{txt}
{com}. 
. 
. gen TotIERMeRaA02S02 = TotINFMeSmA02S02 / TotCasMeRaA00S00
{txt}(166 missing values generated)

{com}. 
. label var TotIERMeRaA02S02 "Total Infections estim to reported Mean not smoothed IHME S2"
{txt}
{com}. 
. 
. 
. *
. 
. di in red "********* Description of vars in final combined file country.dta *********" 
{res}{err}********* Description of vars in final combined file country.dta *********
{txt}
{com}. 
. 
. desc, fullnames

{txt}Contains data from {res}/Users/farshadpourmalek/Downloads/covir2-main/20220204/code/JOHN/country JOHN.dta
{txt}  obs:{res}           883                          
{txt} vars:{res}           296                          5 Feb 2022 19:23
{txt} size:{res}     1,048,121                          
{txt}{hline}
              storage   display    value
variable name   type    format     label      variable label
{hline}
{p 0 48}{res}{bind:date           }{txt}{bind: int     }{bind:{txt}%td..     }{space 1}{bind:         }{bind:  }{res}{res}{p_end}
{p 0 48}{bind:loc_grand_name }{txt}{bind: str4    }{bind:{txt}%9s       }{space 1}{bind:         }{bind:  }{res}{res}Location{p_end}
{p 0 48}DayDeaMeRaA00S00{p_end}
{p 0 48}{space 15}{txt}{bind: int     }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Daily Deaths JOHN{p_end}
{p 0 48}TotDeaMeRaA00S00{p_end}
{p 0 48}{space 15}{txt}{bind: long    }{bind:{txt}%10.0g    }{space 1}{bind:         }{bind:  }{res}{res}Total Deaths JOHN{p_end}
{p 0 48}DayDeaMeRaA00S00_CF2{p_end}
{p 0 48}{space 15}{txt}{bind: int     }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Daily Deaths JOHN correction factor 2{p_end}
{p 0 48}DayDeaMeRaA00S00_CF5{p_end}
{p 0 48}{space 15}{txt}{bind: int     }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Daily Deaths JOHN correction factor 5{p_end}
{p 0 48}TotDeaMeRaA00S00_CF2{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Total Deaths JOHN correction factor 2{p_end}
{p 0 48}TotDeaMeRaA00S00_CF5{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Total Deaths JOHN correction factor 5{p_end}
{p 0 48}DayCasMeRaA00S00{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Daily Cases JOHN{p_end}
{p 0 48}TotCasMeRaA00S00{p_end}
{p 0 48}{space 15}{txt}{bind: long    }{bind:{txt}%10.0g    }{space 1}{bind:         }{bind:  }{res}{res}Total Cases JOHN{p_end}
{p 0 48}DayCasMeRaA00S00_CF2{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Daily Cases JOHN correction factor 2{p_end}
{p 0 48}DayCasMeRaA00S00_CF5{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Daily Cases JOHN correction factor 5{p_end}
{p 0 48}TotCasMeRaA00S00_CF2{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Total Cases JOHN correction factor 2{p_end}
{p 0 48}TotCasMeRaA00S00_CF5{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Total Cases JOHN correction factor 5{p_end}
{p 0 48}TotRecMeRaA00S00{p_end}
{p 0 48}{space 15}{txt}{bind: long    }{bind:{txt}%10.0g    }{space 1}{bind:         }{bind:  }{res}{res}Total RECovered JOHN{p_end}
{p 0 48}DayRecMeRaA00S00{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Daily RECovered JOHN{p_end}
{p 0 48}DayCfrMeRaA00S00{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Daily CFR JOHN{p_end}
{p 0 48}DayActMeRaA00S00{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Daily Active JOHN{p_end}
{p 0 48}DayDeaMeSmA00S00{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Daily deaths smooth A00 JOHN{p_end}
{p 0 48}DayCasMeSmA00S00{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Daily cases smooth A00 JOHN{p_end}
{p 0 48}DayDeaMeSmA00S00P1V{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Daily deaths smooth JOHN Peak 1 Value{p_end}
{p 0 48}DayDeaMeSmA00S00P1D{p_end}
{p 0 48}{space 15}{txt}{bind: int     }{bind:{txt}%td..     }{space 1}{bind:         }{bind:  }{res}{res}Daily deaths smooth JOHN Peak 1 Date{p_end}
{p 0 48}DayDeaMeSmA00S00P2V{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Daily deaths smooth JOHN Peak 2 Value{p_end}
{p 0 48}DayDeaMeSmA00S00P2D{p_end}
{p 0 48}{space 15}{txt}{bind: int     }{bind:{txt}%td..     }{space 1}{bind:         }{bind:  }{res}{res}Daily deaths smooth JOHN Peak 2 Date{p_end}
{p 0 48}DayDeaMeSmA00S00P3V{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Daily deaths smooth JOHN Peak 3 Value{p_end}
{p 0 48}DayDeaMeSmA00S00P3D{p_end}
{p 0 48}{space 15}{txt}{bind: int     }{bind:{txt}%td..     }{space 1}{bind:         }{bind:  }{res}{res}Daily deaths smooth JOHN Peak 3 Date{p_end}
{p 0 48}DayDeaMeSmA00S00P4V{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Daily deaths smooth JOHN Peak 4 Value{p_end}
{p 0 48}DayDeaMeSmA00S00P4D{p_end}
{p 0 48}{space 15}{txt}{bind: int     }{bind:{txt}%td..     }{space 1}{bind:         }{bind:  }{res}{res}Daily deaths smooth JOHN Peak 4 Date{p_end}
{p 0 48}DayDeaMeSmA00S00P5V{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Daily deaths smooth JOHN Peak 5 Value{p_end}
{p 0 48}DayDeaMeSmA00S00P5D{p_end}
{p 0 48}{space 15}{txt}{bind: int     }{bind:{txt}%td..     }{space 1}{bind:         }{bind:  }{res}{res}Daily deaths smooth JOHN Peak 5 Date{p_end}
{p 0 48}DayDeaMeSmA00S00PP1V{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Daily deaths smooth JOHN POST Peak 1 Value{p_end}
{p 0 48}DayDeaMeSmA00S00PP1D{p_end}
{p 0 48}{space 15}{txt}{bind: int     }{bind:{txt}%td..     }{space 1}{bind:         }{bind:  }{res}{res}Daily deaths smooth JOHN POST Peak 1 Date{p_end}
{p 0 48}DayDeaMeSmA00S00PP2V{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Daily deaths smooth JOHN POST Peak 2 Value{p_end}
{p 0 48}DayDeaMeSmA00S00PP2D{p_end}
{p 0 48}{space 15}{txt}{bind: int     }{bind:{txt}%td..     }{space 1}{bind:         }{bind:  }{res}{res}Daily deaths smooth JOHN POST Peak 2 Date{p_end}
{p 0 48}DayDeaMeSmA00S00PP3V{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Daily deaths smooth JOHN POST Peak 3 Value{p_end}
{p 0 48}DayDeaMeSmA00S00PP3D{p_end}
{p 0 48}{space 15}{txt}{bind: int     }{bind:{txt}%td..     }{space 1}{bind:         }{bind:  }{res}{res}Daily deaths smooth JOHN POST Peak 3 Date{p_end}
{p 0 48}DayDeaMeSmA00S00PP4V{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Daily deaths smooth JOHN POST Peak 4 Value{p_end}
{p 0 48}DayDeaMeSmA00S00PP4D{p_end}
{p 0 48}{space 15}{txt}{bind: int     }{bind:{txt}%td..     }{space 1}{bind:         }{bind:  }{res}{res}Daily deaths smooth JOHN POST Peak 4 Date{p_end}
{p 0 48}DayDeaMeSmA00S00PP5V{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Daily deaths smooth JOHN Peak 5 Value{p_end}
{p 0 48}DayDeaMeSmA00S00PP5D{p_end}
{p 0 48}{space 15}{txt}{bind: byte    }{bind:{txt}%td..     }{space 1}{bind:         }{bind:  }{res}{res}Daily deaths smooth JOHN Peak 5 Date{p_end}
{p 0 48}DayDeaMeSmA00S00PD{p_end}
{p 0 48}{space 15}{txt}{bind: int     }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Daily deaths smooth JOHN Peak Dates{p_end}
{p 0 48}DayDeaMeSmA00S00PV{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Daily deaths smooth JOHN Peak Values{p_end}
{p 0 48}DayDeaMeSmA00S00PPD{p_end}
{p 0 48}{space 15}{txt}{bind: int     }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Daily deaths smooth JOHN POST Peak Dates{p_end}
{p 0 48}DayDeaMeSmA00S00PPV{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Daily deaths smooth JOHN POST Peak Values{p_end}
{p 0 48}DayCasMeSmA00S00P1V{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Daily cases smooth JOHN Peak 1 Value{p_end}
{p 0 48}DayCasMeSmA00S00P1D{p_end}
{p 0 48}{space 15}{txt}{bind: int     }{bind:{txt}%td..     }{space 1}{bind:         }{bind:  }{res}{res}Daily cases smooth JOHN Peak 1 Date{p_end}
{p 0 48}DayCasMeSmA00S00P2V{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Daily cases smooth JOHN Peak 2 Value{p_end}
{p 0 48}DayCasMeSmA00S00P2D{p_end}
{p 0 48}{space 15}{txt}{bind: int     }{bind:{txt}%td..     }{space 1}{bind:         }{bind:  }{res}{res}Daily cases smooth JOHN Peak 2 Date{p_end}
{p 0 48}DayCasMeSmA00S00P3V{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Daily cases smooth JOHN Peak 3 Value{p_end}
{p 0 48}DayCasMeSmA00S00P3D{p_end}
{p 0 48}{space 15}{txt}{bind: int     }{bind:{txt}%td..     }{space 1}{bind:         }{bind:  }{res}{res}Daily cases smooth JOHN Peak 3 Date{p_end}
{p 0 48}DayCasMeSmA00S00P4V{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Daily cases smooth JOHN Peak 4 Value{p_end}
{p 0 48}DayCasMeSmA00S00P4D{p_end}
{p 0 48}{space 15}{txt}{bind: int     }{bind:{txt}%td..     }{space 1}{bind:         }{bind:  }{res}{res}Daily cases smooth JOHN Peak 4 Date{p_end}
{p 0 48}DayCasMeSmA00S00P5V{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Daily cases smooth JOHN Peak 5 Value{p_end}
{p 0 48}DayCasMeSmA00S00P5D{p_end}
{p 0 48}{space 15}{txt}{bind: int     }{bind:{txt}%td..     }{space 1}{bind:         }{bind:  }{res}{res}Daily cases smooth JOHN Peak 5 Date{p_end}
{p 0 48}DayCasMeSmA00S00PP1V{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Daily cases smooth JOHN POST Peak 1 Value{p_end}
{p 0 48}DayCasMeSmA00S00PP1D{p_end}
{p 0 48}{space 15}{txt}{bind: int     }{bind:{txt}%td..     }{space 1}{bind:         }{bind:  }{res}{res}Daily cases smooth JOHN POST Peak 1 Date{p_end}
{p 0 48}DayCasMeSmA00S00PP2V{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Daily cases smooth JOHN POST Peak 2 Value{p_end}
{p 0 48}DayCasMeSmA00S00PP2D{p_end}
{p 0 48}{space 15}{txt}{bind: int     }{bind:{txt}%td..     }{space 1}{bind:         }{bind:  }{res}{res}Daily cases smooth JOHN POST Peak 2 Date{p_end}
{p 0 48}DayCasMeSmA00S00PP3V{p_end}
{p 0 48}{space 15}{txt}{bind: int     }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Daily cases smooth JOHN POST Peak 3 Value{p_end}
{p 0 48}DayCasMeSmA00S00PP3D{p_end}
{p 0 48}{space 15}{txt}{bind: int     }{bind:{txt}%td..     }{space 1}{bind:         }{bind:  }{res}{res}Daily cases smooth JOHN POST Peak 3 Date{p_end}
{p 0 48}DayCasMeSmA00S00PP4V{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Daily cases smooth JOHN POST Peak 4 Value{p_end}
{p 0 48}DayCasMeSmA00S00PP4D{p_end}
{p 0 48}{space 15}{txt}{bind: int     }{bind:{txt}%td..     }{space 1}{bind:         }{bind:  }{res}{res}Daily cases smooth JOHN POST Peak 4 Date{p_end}
{p 0 48}DayCasMeSmA00S00PP5V{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Daily cases smooth JOHN Peak 5 Value{p_end}
{p 0 48}DayCasMeSmA00S00PP5D{p_end}
{p 0 48}{space 15}{txt}{bind: byte    }{bind:{txt}%td..     }{space 1}{bind:         }{bind:  }{res}{res}Daily cases smooth JOHN Peak 5 Date{p_end}
{p 0 48}DayCasMeSmA00S00PD{p_end}
{p 0 48}{space 15}{txt}{bind: int     }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Daily cases smooth JOHN Peak Dates{p_end}
{p 0 48}DayCasMeSmA00S00PV{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Daily cases smooth JOHN Peak Values{p_end}
{p 0 48}DayCasMeSmA00S00PPD{p_end}
{p 0 48}{space 15}{txt}{bind: int     }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Daily cases smooth JOHN POST Peak Dates{p_end}
{p 0 48}DayCasMeSmA00S00PPV{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Daily cases smooth JOHN POST Peak Values{p_end}
{p 0 48}TotDeaMeRaA01S00{p_end}
{p 0 48}{space 15}{txt}{bind: long    }{bind:{txt}%8.0g     }{space 1}{bind:         }{bind:  }{res}{res}Total Deaths Mean DELP S0{p_end}
{p 0 48}TotDeaLoRaA01S00{p_end}
{p 0 48}{space 15}{txt}{bind: long    }{bind:{txt}%8.0g     }{space 1}{bind:         }{bind:  }{res}{res}Total Deaths Lower DELP S0{p_end}
{p 0 48}TotDeaUpRaA01S00{p_end}
{p 0 48}{space 15}{txt}{bind: long    }{bind:{txt}%8.0g     }{space 1}{bind:         }{bind:  }{res}{res}Total Deaths Upper DELP S0{p_end}
{p 0 48}DayDeaMeRaA01S00{p_end}
{p 0 48}{space 15}{txt}{bind: int     }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Daily Deaths Mean DELP S0{p_end}
{p 0 48}DayDeaLoRaA01S00{p_end}
{p 0 48}{space 15}{txt}{bind: int     }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Daily Deaths Lower DELP S0{p_end}
{p 0 48}DayDeaUpRaA01S00{p_end}
{p 0 48}{space 15}{txt}{bind: int     }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Daily Deaths Upper DELP S0{p_end}
{p 0 48}TotCasMeRaA01S00{p_end}
{p 0 48}{space 15}{txt}{bind: long    }{bind:{txt}%12.0g    }{space 1}{bind:         }{bind:  }{res}{res}Total Cases Mean DELP S0{p_end}
{p 0 48}TotCasLoRaA01S00{p_end}
{p 0 48}{space 15}{txt}{bind: long    }{bind:{txt}%12.0g    }{space 1}{bind:         }{bind:  }{res}{res}Total Cases Lower DELP S0{p_end}
{p 0 48}TotCasUpRaA01S00{p_end}
{p 0 48}{space 15}{txt}{bind: long    }{bind:{txt}%12.0g    }{space 1}{bind:         }{bind:  }{res}{res}Total Cases Upper DELP S0{p_end}
{p 0 48}DayCasMeRaA01S00{p_end}
{p 0 48}{space 15}{txt}{bind: int     }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Daily Cases Mean DELP S0{p_end}
{p 0 48}DayCasLoRaA01S00{p_end}
{p 0 48}{space 15}{txt}{bind: int     }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Daily Cases Lower DELP S0{p_end}
{p 0 48}DayCasUpRaA01S00{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Daily Cases Upper DELP S0{p_end}
{p 0 48}DayActMeRaA01S00{p_end}
{p 0 48}{space 15}{txt}{bind: long    }{bind:{txt}%12.0g    }{space 1}{bind:         }{bind:  }{res}{res}Daily Cases Active Mean DELP S0{p_end}
{p 0 48}DayHosMeRaA01S00{p_end}
{p 0 48}{space 15}{txt}{bind: int     }{bind:{txt}%8.0g     }{space 1}{bind:         }{bind:  }{res}{res}Daily Cases Active Hospitalized Mean DELP S0{p_end}
{p 0 48}DayVenMeRaA01S00{p_end}
{p 0 48}{space 15}{txt}{bind: int     }{bind:{txt}%8.0g     }{space 1}{bind:         }{bind:  }{res}{res}Daily Cases Active Ventilated Mean DELP S0{p_end}
{p 0 48}TotHosMeRaA01S00{p_end}
{p 0 48}{space 15}{txt}{bind: int     }{bind:{txt}%8.0g     }{space 1}{bind:         }{bind:  }{res}{res}Total Cases Active Mean DELP S0{p_end}
{p 0 48}DayCfrMeRaA01S00{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Daily CFR Mean DELP S0 V4{p_end}
{p 0 48}DayCfrLoRaA01S00{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Daily CFR Lower DELP S0 V4{p_end}
{p 0 48}DayCfrUpRaA01S00{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Daily CFR Upper DELP S0 V4{p_end}
{p 0 48}DayDeMMeRaA01S00{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Daily deaths mean DELP DayDeM{p_end}
{p 0 48}DayCaMMeRaA01S00{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Daily cases mean DELP DayCaM{p_end}
{p 0 48}DayCbDMeRaA01S00{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Daily cases mean div by daily deaths mean DELP DayCbD{p_end}
{p 0 48}DayDMuMeRaA01S00{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Daily deaths scaled (times means of cases by deaths) only for visualization DELP{p_end}
{p 0 48}DayINFMeSmA02S01{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Daily infections Mean smoothed IHME S1{p_end}
{p 0 48}DayINFUpSmA02S01{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Daily infections Upper smoothed IHME S1{p_end}
{p 0 48}DayINFLoSmA02S01{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Daily infections Lower smoothed IHME S1{p_end}
{p 0 48}TotDeXMeSmA02S01{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Total Excess Deaths Mean smoothed IHME S1{p_end}
{p 0 48}TotDeXLoSmA02S01{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Total Excess Deaths Lower smoothed IHME S1{p_end}
{p 0 48}TotDeXUpSmA02S01{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Total Excess Deaths Upper smoothed IHME S1{p_end}
{p 0 48}TotINFMeSmA02S01{p_end}
{p 0 48}{space 15}{txt}{bind: double  }{bind:{txt}%10.0g    }{space 1}{bind:         }{bind:  }{res}{res}Total infections Mean smoothed IHME S1{p_end}
{p 0 48}TotINFLoSmA02S01{p_end}
{p 0 48}{space 15}{txt}{bind: double  }{bind:{txt}%10.0g    }{space 1}{bind:         }{bind:  }{res}{res}Total infections Lower smoothed IHME S1{p_end}
{p 0 48}TotINFUpSmA02S01{p_end}
{p 0 48}{space 15}{txt}{bind: double  }{bind:{txt}%10.0g    }{space 1}{bind:         }{bind:  }{res}{res}Total infections Upper smoothed IHME S1{p_end}
{p 0 48}DayDeXMeSmA02S01{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Daily Excess Deaths Mean smoothed IHME S1{p_end}
{p 0 48}DayDeXLoSmA02S01{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Daily Excess Deaths Lower smoothed IHME S1{p_end}
{p 0 48}DayDeXUpSmA02S01{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Daily Excess Deaths Upper smoothed IHME S1{p_end}
{p 0 48}DayDeaMeSmA02S01{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Daily Reported Deaths Mean smoothed IHME S1{p_end}
{p 0 48}DayDeaLoSmA02S01{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Daily Reported Deaths Lower smoothed IHME S1{p_end}
{p 0 48}DayDeaUpSmA02S01{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Daily Reported Deaths Upper smoothed IHME S1{p_end}
{p 0 48}TotDeaMeSmA02S01{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Total Reported Deaths Mean smoothed IHME S1{p_end}
{p 0 48}TotDeaLoSmA02S01{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Total Reported Deaths Lower smoothed IHME S1{p_end}
{p 0 48}TotDeaUpSmA02S01{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Total Reported Deaths Upper smoothed IHME S1{p_end}
{p 0 48}{bind:cases_mean     }{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}{p_end}
{p 0 48}{bind:cases_lower    }{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}{p_end}
{p 0 48}{bind:cases_upper    }{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}{p_end}
{p 0 48}reff_mean_A02S01{p_end}
{p 0 48}{space 15}{txt}{bind: double  }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}IHME R effective (mean estimate) S1{p_end}
{p 0 48}reff_lower_A02S01{p_end}
{p 0 48}{space 15}{txt}{bind: double  }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}IHME R effective (lower 95% confidence interval) S1{p_end}
{p 0 48}reff_upper_A02S01{p_end}
{p 0 48}{space 15}{txt}{bind: double  }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}IHME R effective (upper 95% confidence interval) S1{p_end}
{p 0 48}inf_cuml_mean_vax{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}{p_end}
{p 0 48}inf_cuml_lower_vax{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}{p_end}
{p 0 48}inf_cuml_upper_vax{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}{p_end}
{p 0 48}inf_cuml_mean_unvax{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}{p_end}
{p 0 48}inf_cuml_lower_unvax{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}{p_end}
{p 0 48}inf_cuml_upper_unvax{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}{p_end}
{p 0 48}{bind:inf_mean_vax   }{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}{p_end}
{p 0 48}{bind:inf_lower_vax  }{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}{p_end}
{p 0 48}{bind:inf_upper_vax  }{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}{p_end}
{p 0 48}{bind:inf_mean_unvax }{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}{p_end}
{p 0 48}{bind:inf_lower_unvax}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}{p_end}
{p 0 48}{bind:inf_upper_unvax}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}{p_end}
{p 0 48}cumulative_deaths_A02S01{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}IHME Cumulative deaths (raw data with excess mortality scalar applied) S1{p_end}
{p 0 48}daily_deaths_A02S01{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}IHME Daily deaths (raw data with excess mortality scalar applied) S1{p_end}
{p 0 48}cumulative_cases_A02S01{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}IHME Cumulative cases (raw data) S1{p_end}
{p 0 48}cumulative_hosp_A02S01{p_end}
{p 0 48}{space 15}{txt}{bind: byte    }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}IHME Cumulative hospitalizations (raw data) S1{p_end}
{p 0 48}cumul_deaths_unscaled_A02S01{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}IHME umulative deaths (raw data without excess mortality scalar applied) S1{p_end}
{p 0 48}dai_dea_unscaled_A02S01{p_end}
{p 0 48}{space 15}{txt}{bind: int     }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}IHME Daily deaths (raw data without excess mortality scalar applied) S1{p_end}
{p 0 48}{bind:daily_cases    }{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}{p_end}
{p 0 48}{bind:population     }{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}IHME Population size{p_end}
{p 0 48}mobility_mean_A02S01{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}IHME Percent change in mobility from baseline (mean)  S1{p_end}
{p 0 48}{bind:mobility_obs   }{txt}{bind: byte    }{bind:{txt}%8.0g     }{space 1}{bind:         }{bind:  }{res}{res}IHME Indicator for whether mobility estimate comes from observed data (1) or mod{p_end}
{p 0 48}{bind:testing_mean   }{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}IHME Tests per 100,000 (mean estimate){p_end}
{p 0 48}{bind:testing_lower  }{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}IHME Tests per 100,000 (lower 95% confidence interval){p_end}
{p 0 48}{bind:testing_upper  }{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}IHME Tests per 100,000 (upper 95% confidence interval){p_end}
{p 0 48}{bind:testing_obs    }{txt}{bind: byte    }{bind:{txt}%8.0g     }{space 1}{bind:         }{bind:  }{res}{res}IHME Indicator for whether testing estimate comes from observed data (1) or mode{p_end}
{p 0 48}{bind:pneumonia_mean }{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}IHME Ratio of pneumonia deaths in a given week to the average weekly pneumonia d{p_end}
{p 0 48}{bind:pneumonia_obs  }{txt}{bind: byte    }{bind:{txt}%8.0g     }{space 1}{bind:         }{bind:  }{res}{res}IHME Indicator for whether pneumonia estimate comes from observed data (1) or mo{p_end}
{p 0 48}mask_use_mean_A02S01{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}IHME Percent of population reporting always wearing a mask when leaving home  S1{p_end}
{p 0 48}{bind:mask_use_obs   }{txt}{bind: byte    }{bind:{txt}%8.0g     }{space 1}{bind:         }{bind:  }{res}{res}IHME Indicator for whether mask estimate comes from observed data (1) or modelle{p_end}
{p 0 48}cumulative_all_vaccinated{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}IHME Initially vaccinated (one dose of two doses){p_end}
{p 0 48}cumulative_all_fully_vaccinated{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}IHME Fully vaccinated (one of one and†two†of two doses){p_end}
{p 0 48}cumulative_all_effectively_vacci{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}IHME Effectively vaccinated (one and two dose with efficacy){p_end}
{p 0 48}DayBedMeSmA02S01{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}IHME Daily COVID-19 hospital beds needed (mean estimate) S1{p_end}
{p 0 48}DayBedLoSmA02S01{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}IHME Daily COVID-19 hospital beds needed (upper 95% confidence interval) S1{p_end}
{p 0 48}DayBedUpSmA02S01{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}IHME Daily COVID-19 hospital beds needed (lower 95% confidence interval) S1{p_end}
{p 0 48}DayIcuMeSmA02S01{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}IHME Daily COVID-19 ICU beds needed (mean estimate) S1{p_end}
{p 0 48}DayIcuUpSmA02S01{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}IHME Daily COVID-19 ICU beds needed (lower 95% confidence interval) S1{p_end}
{p 0 48}DayIcuLoSmA02S01{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}IHME Daily COVID-19 ICU beds needed (upper 95% confidence interval) S1{p_end}
{p 0 48}DayAdmMeSmA02S01{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}IHME Daily COVID-19 hospital admissions (mean estimate) S1{p_end}
{p 0 48}DayAdmUpSmA02S01{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}IHME Daily COVID-19 hospital admissions (mean estimate) S1{p_end}
{p 0 48}DayAdmLoSmA02S01{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}IHME Daily COVID-19 hospital admissions (mean estimate) S1{p_end}
{p 0 48}{bind:admis_mean_vax }{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}{p_end}
{p 0 48}{bind:admis_upper_vax}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}{p_end}
{p 0 48}{bind:admis_lower_vax}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}{p_end}
{p 0 48}admis_mean_unvax{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}{p_end}
{p 0 48}admis_upper_unvax{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}{p_end}
{p 0 48}admis_lower_unvax{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}{p_end}
{p 0 48}{bind:DayBEDMeSmA02  }{txt}{bind: long    }{bind:{txt}%12.0g    }{space 1}{bind:         }{bind:  }{res}{res}IHME Total number of beds that exist at a location{p_end}
{p 0 48}{bind:DayICUMeSmA02  }{txt}{bind: int     }{bind:{txt}%12.0g    }{space 1}{bind:         }{bind:  }{res}{res}IHME Total number of ICU beds that exist at a location{p_end}
{p 0 48}infection_fatality_A02S01{p_end}
{p 0 48}{space 15}{txt}{bind: double  }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}IHME Infection fatality ratio S1{p_end}
{p 0 48}infection_detection_A02S01{p_end}
{p 0 48}{space 15}{txt}{bind: double  }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}IHME Infection detection ratio S1{p_end}
{p 0 48}infection_hospitalization_A02S01{p_end}
{p 0 48}{space 15}{txt}{bind: double  }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}IHME Infection hospitalization ratio S1{p_end}
{p 0 48}DayINFMeSmA02S02{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Daily infections Mean smoothed IHME S2{p_end}
{p 0 48}DayINFUpSmA02S02{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Daily infections Upper smoothed IHME S2{p_end}
{p 0 48}DayINFLoSmA02S02{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Daily infections Lower smoothed IHME S2{p_end}
{p 0 48}TotDeXMeSmA02S02{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Total Excess Deaths Mean smoothed IHME S2{p_end}
{p 0 48}TotDeXLoSmA02S02{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Total Excess Deaths Lower smoothed IHME S2{p_end}
{p 0 48}TotDeXUpSmA02S02{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Total Excess Deaths Upper smoothed IHME S2{p_end}
{p 0 48}TotINFMeSmA02S02{p_end}
{p 0 48}{space 15}{txt}{bind: double  }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Total infections Mean smoothed IHME S2{p_end}
{p 0 48}TotINFLoSmA02S02{p_end}
{p 0 48}{space 15}{txt}{bind: double  }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Total infections Lower smoothed IHME S2{p_end}
{p 0 48}TotINFUpSmA02S02{p_end}
{p 0 48}{space 15}{txt}{bind: double  }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Total infections Upper smoothed IHME S2{p_end}
{p 0 48}DayDeXMeSmA02S02{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Daily Excess Deaths Mean smoothed IHME S2{p_end}
{p 0 48}DayDeXLoSmA02S02{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Daily Excess Deaths Lower smoothed IHME S2{p_end}
{p 0 48}DayDeXUpSmA02S02{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Daily Excess Deaths Upper smoothed IHME S2{p_end}
{p 0 48}DayDeaMeSmA02S02{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Daily Reported Deaths Mean smoothed IHME S2{p_end}
{p 0 48}DayDeaLoSmA02S02{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Daily Reported Deaths Lower smoothed IHME S2{p_end}
{p 0 48}DayDeaUpSmA02S02{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Daily Reported Deaths Upper smoothed IHME S2{p_end}
{p 0 48}TotDeaMeSmA02S02{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Total Reported Deaths Mean smoothed IHME S2{p_end}
{p 0 48}TotDeaLoSmA02S02{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Total Reported Deaths Lower smoothed IHME S2{p_end}
{p 0 48}TotDeaUpSmA02S02{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Total Reported Deaths Upper smoothed IHME S2{p_end}
{p 0 48}reff_mean_A02S02{p_end}
{p 0 48}{space 15}{txt}{bind: double  }{bind:{txt}%10.0g    }{space 1}{bind:         }{bind:  }{res}{res}IHME R effective (mean estimate) S2{p_end}
{p 0 48}reff_lower_A02S02{p_end}
{p 0 48}{space 15}{txt}{bind: double  }{bind:{txt}%10.0g    }{space 1}{bind:         }{bind:  }{res}{res}IHME R effective (lower 95% confidence interval) S2{p_end}
{p 0 48}reff_upper_A02S02{p_end}
{p 0 48}{space 15}{txt}{bind: double  }{bind:{txt}%10.0g    }{space 1}{bind:         }{bind:  }{res}{res}IHME R effective (upper 95% confidence interval) S2{p_end}
{p 0 48}cumulative_deaths_A02S02{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}IHME Cumulative deaths (raw data with excess mortality scalar applied) S2{p_end}
{p 0 48}daily_deaths_A02S02{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}IHME Daily deaths (raw data with excess mortality scalar applied) S2{p_end}
{p 0 48}cumulative_cases_A02S02{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}IHME Cumulative cases (raw data) S2{p_end}
{p 0 48}cumulative_hosp_A02S02{p_end}
{p 0 48}{space 15}{txt}{bind: byte    }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}IHME Cumulative hospitalizations (raw data) S2{p_end}
{p 0 48}cumul_deaths_unscaled_A02S02{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}IHME umulative deaths (raw data without excess mortality scalar applied) S2{p_end}
{p 0 48}dai_dea_unscaled_A02S02{p_end}
{p 0 48}{space 15}{txt}{bind: int     }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}IHME Daily deaths (raw data without excess mortality scalar applied) S2{p_end}
{p 0 48}mobility_mean_A02S02{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}IHME Percent change in mobility from baseline (mean)  S2{p_end}
{p 0 48}mask_use_mean_A02S02{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}IHME Percent of population reporting always wearing a mask when leaving home  S2{p_end}
{p 0 48}DayBedMeSmA02S02{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}IHME Daily COVID-19 hospital beds needed (mean estimate) S2{p_end}
{p 0 48}DayBedLoSmA02S02{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}IHME Daily COVID-19 hospital beds needed (upper 95% confidence interval) S2{p_end}
{p 0 48}DayBedUpSmA02S02{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}IHME Daily COVID-19 hospital beds needed (lower 95% confidence interval) S2{p_end}
{p 0 48}DayIcuMeSmA02S02{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}IHME Daily COVID-19 ICU beds needed (mean estimate) S2{p_end}
{p 0 48}DayIcuUpSmA02S02{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}IHME Daily COVID-19 ICU beds needed (lower 95% confidence interval) S2{p_end}
{p 0 48}DayIcuLoSmA02S02{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}IHME Daily COVID-19 ICU beds needed (upper 95% confidence interval) S2{p_end}
{p 0 48}DayAdmMeSmA02S02{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}IHME Daily COVID-19 hospital admissions (mean estimate) S2{p_end}
{p 0 48}DayAdmUpSmA02S02{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}IHME Daily COVID-19 hospital admissions (mean estimate) S2{p_end}
{p 0 48}DayAdmLoSmA02S02{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}IHME Daily COVID-19 hospital admissions (mean estimate) S2{p_end}
{p 0 48}infection_fatality_A02S02{p_end}
{p 0 48}{space 15}{txt}{bind: double  }{bind:{txt}%10.0g    }{space 1}{bind:         }{bind:  }{res}{res}IHME Infection fatality ratio S2{p_end}
{p 0 48}infection_detection_A02S02{p_end}
{p 0 48}{space 15}{txt}{bind: double  }{bind:{txt}%10.0g    }{space 1}{bind:         }{bind:  }{res}{res}IHME Infection detection ratio S2{p_end}
{p 0 48}infection_hospitalization_A02S02{p_end}
{p 0 48}{space 15}{txt}{bind: double  }{bind:{txt}%10.0g    }{space 1}{bind:         }{bind:  }{res}{res}IHME Infection hospitalization ratio S2{p_end}
{p 0 48}DayINFMeSmA02S03{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Daily infections Mean smoothed IHME S3{p_end}
{p 0 48}DayINFUpSmA02S03{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Daily infections Upper smoothed IHME S3{p_end}
{p 0 48}DayINFLoSmA02S03{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Daily infections Lower smoothed IHME S3{p_end}
{p 0 48}TotDeXMeSmA02S03{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Total Excess Deaths Mean smoothed IHME S3{p_end}
{p 0 48}TotDeXLoSmA02S03{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Total Excess Deaths Lower smoothed IHME S3{p_end}
{p 0 48}TotDeXUpSmA02S03{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Total Excess Deaths Upper smoothed IHME S3{p_end}
{p 0 48}TotINFMeSmA02S03{p_end}
{p 0 48}{space 15}{txt}{bind: double  }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Total infections Mean smoothed IHME S3{p_end}
{p 0 48}TotINFLoSmA02S03{p_end}
{p 0 48}{space 15}{txt}{bind: double  }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Total infections Lower smoothed IHME S3{p_end}
{p 0 48}TotINFUpSmA02S03{p_end}
{p 0 48}{space 15}{txt}{bind: double  }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Total infections Upper smoothed IHME S3{p_end}
{p 0 48}DayDeXMeSmA02S03{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Daily Excess Deaths Mean smoothed IHME S3{p_end}
{p 0 48}DayDeXLoSmA02S03{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Daily Excess Deaths Lower smoothed IHME S3{p_end}
{p 0 48}DayDeXUpSmA02S03{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Daily Excess Deaths Upper smoothed IHME S3{p_end}
{p 0 48}DayDeaMeSmA02S03{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Daily Reported Deaths Mean smoothed IHME S3{p_end}
{p 0 48}DayDeaLoSmA02S03{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Daily Reported Deaths Lower smoothed IHME S3{p_end}
{p 0 48}DayDeaUpSmA02S03{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Daily Reported Deaths Upper smoothed IHME S3{p_end}
{p 0 48}TotDeaMeSmA02S03{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Total Reported Deaths Mean smoothed IHME S3{p_end}
{p 0 48}TotDeaLoSmA02S03{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Total Reported Deaths Lower smoothed IHME S3{p_end}
{p 0 48}TotDeaUpSmA02S03{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Total Reported Deaths Upper smoothed IHME S3{p_end}
{p 0 48}reff_mean_A02S03{p_end}
{p 0 48}{space 15}{txt}{bind: double  }{bind:{txt}%10.0g    }{space 1}{bind:         }{bind:  }{res}{res}IHME R effective (mean estimate) S3{p_end}
{p 0 48}reff_lower_A02S03{p_end}
{p 0 48}{space 15}{txt}{bind: double  }{bind:{txt}%10.0g    }{space 1}{bind:         }{bind:  }{res}{res}IHME R effective (lower 95% confidence interval) S3{p_end}
{p 0 48}reff_upper_A02S03{p_end}
{p 0 48}{space 15}{txt}{bind: double  }{bind:{txt}%10.0g    }{space 1}{bind:         }{bind:  }{res}{res}IHME R effective (upper 95% confidence interval) S3{p_end}
{p 0 48}cumulative_deaths_A02S03{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}IHME Cumulative deaths (raw data with excess mortality scalar applied) S3{p_end}
{p 0 48}daily_deaths_A02S03{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}IHME Daily deaths (raw data with excess mortality scalar applied) S3{p_end}
{p 0 48}cumulative_cases_A02S03{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}IHME Cumulative cases (raw data) S3{p_end}
{p 0 48}cumulative_hosp_A02S03{p_end}
{p 0 48}{space 15}{txt}{bind: byte    }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}IHME Cumulative hospitalizations (raw data) S3{p_end}
{p 0 48}cumul_deaths_unscaled_A02S03{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}IHME umulative deaths (raw data without excess mortality scalar applied) S3{p_end}
{p 0 48}dai_dea_unscaled_A02S03{p_end}
{p 0 48}{space 15}{txt}{bind: int     }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}IHME Daily deaths (raw data without excess mortality scalar applied) S3{p_end}
{p 0 48}mobility_mean_A02S03{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}IHME Percent change in mobility from baseline (mean)  S3{p_end}
{p 0 48}mask_use_mean_A02S03{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}IHME Percent of population reporting always wearing a mask when leaving home  S3{p_end}
{p 0 48}DayBedMeSmA02S03{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}IHME Daily COVID-19 hospital beds needed (mean estimate) S3{p_end}
{p 0 48}DayBedLoSmA02S03{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}IHME Daily COVID-19 hospital beds needed (upper 95% confidence interval) S3{p_end}
{p 0 48}DayBedUpSmA02S03{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}IHME Daily COVID-19 hospital beds needed (lower 95% confidence interval) S3{p_end}
{p 0 48}DayIcuMeSmA02S03{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}IHME Daily COVID-19 ICU beds needed (mean estimate) S3{p_end}
{p 0 48}DayIcuUpSmA02S03{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}IHME Daily COVID-19 ICU beds needed (lower 95% confidence interval) S3{p_end}
{p 0 48}DayIcuLoSmA02S03{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}IHME Daily COVID-19 ICU beds needed (upper 95% confidence interval) S3{p_end}
{p 0 48}DayAdmMeSmA02S03{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}IHME Daily COVID-19 hospital admissions (mean estimate) S3{p_end}
{p 0 48}DayAdmUpSmA02S03{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}IHME Daily COVID-19 hospital admissions (mean estimate) S3{p_end}
{p 0 48}DayAdmLoSmA02S03{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}IHME Daily COVID-19 hospital admissions (mean estimate) S3{p_end}
{p 0 48}infection_fatality_A02S03{p_end}
{p 0 48}{space 15}{txt}{bind: double  }{bind:{txt}%10.0g    }{space 1}{bind:         }{bind:  }{res}{res}IHME Infection fatality ratio S3{p_end}
{p 0 48}infection_detection_A02S03{p_end}
{p 0 48}{space 15}{txt}{bind: double  }{bind:{txt}%10.0g    }{space 1}{bind:         }{bind:  }{res}{res}IHME Infection detection ratio S3{p_end}
{p 0 48}infection_hospitalization_A02S03{p_end}
{p 0 48}{space 15}{txt}{bind: double  }{bind:{txt}%10.0g    }{space 1}{bind:         }{bind:  }{res}{res}IHME Infection hospitalization ratio S3{p_end}
{p 0 48}DayDeMMeSmA02S01{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Daily deaths mean IHME DayDeM{p_end}
{p 0 48}DayCaMMeSmA02S01{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Daily infections mean IHME DayCaM{p_end}
{p 0 48}DayCbDMeSmA02S01{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Daily infections mean div by daily deaths mean IHME DayCbD{p_end}
{p 0 48}DayDMuMeSmA02S01{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Daily deaths scaled (times means of infections by deaths) IHME{p_end}
{p 0 48}cumulative_all_vaccin_pct{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}% population IHME Initially vaccinated (one dose of two doses){p_end}
{p 0 48}cumul_all_effect_vacci_pct{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}% population IHME Effectively vaccinated (one and two dose with efficacy){p_end}
{p 0 48}cumul_all_fully_vacci_pct{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}% population IHME Fully vaccinated (one of one and two of two doses){p_end}
{p 0 48}daily_all_vaccinated{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Daily population IHME Initially vaccinated (one dose of two doses){p_end}
{p 0 48}daily_all_effectively_vacci{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Daily population IHME Effectively vaccinated (one and two dose with efficacy){p_end}
{p 0 48}daily_all_fully_vaccinated{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Daily population IHME Fully vaccinated (one of one and two of two doses){p_end}
{p 0 48}daily_all_vaccin_pct{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}% Daily population IHME Initially vaccinated (one dose of two doses){p_end}
{p 0 48}daily_all_effect_vacci_pct{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}% Daily population IHME Effectively vaccinated (one and two dose with efficacy){p_end}
{p 0 48}daily_all_fully_vacci_pct{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}% Daily population IHME Fully vaccinated (one of one and two of two doses){p_end}
{p 0 48}DayINFDetMeSmA02S01{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Daily Detected Infections Mean smoothed IHME S1{p_end}
{p 0 48}DayINFDetLoSmA02S01{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Daily Detected Infections Lower smoothed IHME S1{p_end}
{p 0 48}DayINFDetUpSmA02S01{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Daily Detected Infections Upper smoothed IHME S1{p_end}
{p 0 48}DayINFHosMeSmA02S01{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Daily Hospitalized Infections Mean smoothed IHME S1{p_end}
{p 0 48}DayINFHosLoSmA02S01{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Daily Hospitalized Infections Lower smoothed IHME S1{p_end}
{p 0 48}DayINFHosUpSmA02S01{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Daily Hospitalized Infections Upper smoothed IHME S1{p_end}
{p 0 48}DayINFFatMeSmA02S01{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Daily Fatal Infections Mean smoothed IHME S1{p_end}
{p 0 48}DayINFFatLoSmA02S01{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Daily Fatal Infections Lower smoothed IHME S1{p_end}
{p 0 48}DayINFFatUpSmA02S01{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Daily Fatal Infections Upper smoothed IHME S1{p_end}
{p 0 48}DayCTDMeRaA00S00{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Daily Cases to Deaths S0 JOHN{p_end}
{p 0 48}TotCTDMeRaA00S00{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Total Cases to Deaths S0 JOHN{p_end}
{p 0 48}DayCTDMeRaA01S00{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Daily Cases to Deaths S0 DELP{p_end}
{p 0 48}TotCTDMeRaA01S00{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Total Cases to Deaths S0 DELP{p_end}
{p 0 48}DayITDMeRaA02S01{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Daily Infections to Deaths S1 IHME{p_end}
{p 0 48}TotITDMeRaA02S01{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Total Infections to Deaths S1 IHME{p_end}
{p 0 48}DayITDMeRaA02S02{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Daily Infections to Deaths S2 IHME{p_end}
{p 0 48}TotITDMeRaA02S02{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Total Infections to Deaths S2 IHME{p_end}
{p 0 48}DayDERMeRaA00S00{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Daily Deaths estim to reported JOHN = 1{p_end}
{p 0 48}DayDERMeRaA01S00{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Daily Deaths estim to reported Mean DELP S0{p_end}
{p 0 48}DayDERMeRaA02S01{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Daily Deaths estim to reported Mean not smoothed IHME S1{p_end}
{p 0 48}DayDERMeRaA02S02{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Daily Deaths estim to reported Mean not smoothed IHME S2{p_end}
{p 0 48}DayCERMeRaA00S00{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Daily Cases estim to reported JOHN = 1{p_end}
{p 0 48}DayCERMeRaA01S00{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Daily Cases estim to reported Mean DELP S0{p_end}
{p 0 48}DayIERMeRaA02S01{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Daily Infections estim to reported Mean not smoothed IHME S1{p_end}
{p 0 48}DayIERMeRaA02S02{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Daily Infections estim to reported Mean not smoothed IHME S2{p_end}
{p 0 48}TotDERMeRaA00S00{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Total Deaths estim to reported JOHN = 1{p_end}
{p 0 48}TotDERMeRaA01S00{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Total Deaths estim to reported Mean DELP S0{p_end}
{p 0 48}TotDERMeRaA02S01{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Total Deaths estim to reported Mean not smoothed IHME S1{p_end}
{p 0 48}TotDERMeRaA02S02{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Total Deaths estim to reported Mean not smoothed IHME S2{p_end}
{p 0 48}TotCERMeRaA00S00{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Total Cases estim to reported JOHN = 1{p_end}
{p 0 48}TotCERMeRaA01S00{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Total Cases estim to reported Mean DELP S0{p_end}
{p 0 48}TotIERMeRaA02S01{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Total Infections estim to reported Mean not smoothed IHME S1{p_end}
{p 0 48}TotIERMeRaA02S02{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Total Infections estim to reported Mean not smoothed IHME S2{p_end}
{txt}{hline}
Sorted by: 
{res}     Note: Dataset has changed since last saved.
{txt}
{com}.  
.  
. *
. 
. sort date
{txt}
{com}. 
. qui compress
{txt}
{com}. 
. save "country.dta", replace
{txt}file country.dta saved

{com}. 
. export delimited using "country.csv", replace 
{res}{txt}file country.csv saved

{com}. 
. 
. *
. 
. 
. 
. 
. 
. ***************
. 
. * graphs 
. 
. 
. grstyle init
{res}{txt}
{com}. 
. grstyle color background white
{txt}
{com}. 
. 
. 
. 
. 
. 
. 
. **********
. 
. * gen monthspast vars for #thicknumber of graphs
. 
. 
. summ date

{txt}    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
{space 8}date {c |}{res}        883       22356    255.0444      21915      22797
{txt}
{com}. 
. gen mergemaxdate = r(max)
{txt}
{com}. 
. 
. gen monthspast01jan2020merge = ((mergemaxdate - td(01jan2020)) / 30)
{txt}
{com}. 
. replace monthspast01jan2020merge = round(monthspast01jan2020merge)
{txt}(883 real changes made)

{com}. 
. global monthspast01jan2020merge = monthspast01jan2020merge
{txt}
{com}. 
. di $monthspast01jan2020merge
{res}29
{txt}
{com}. 
. 
. 
. gen monthspast01jan2021merge = ((mergemaxdate - td(01jan2021)) / 30)
{txt}
{com}. 
. replace monthspast01jan2021merge = round(monthspast01jan2021merge)
{txt}(883 real changes made)

{com}. 
. global monthspast01jan2021merge = monthspast01jan2021merge
{txt}
{com}. 
. di $monthspast01jan2021merge
{res}17
{txt}
{com}. 
. 
. 
. gen monthspast01jan2022merge = ((mergemaxdate - td(01jan2022)) / 30)
{txt}
{com}. 
. replace monthspast01jan2022merge = round(monthspast01jan2022merge)
{txt}(883 real changes made)

{com}. 
. global monthspast01jan2022merge = monthspast01jan2022merge
{txt}
{com}. 
. di $monthspast01jan2022merge
{res}5
{txt}
{com}. 
. 
. 
. 
. 
. ******************
. 
. 
. 
. * daily deaths (graph numbers start with 11)
. 
. 
. ****
. * daily deaths, reference scenario, all time
. 
. twoway ///
> (line DayDeaMeSmA00S00 date, sort lcolor(cyan*1.2) lwidth(vthick)) /// 1 "JOHN smooth"
> (line DayDeaMeRaA01S00 date, sort lcolor(red)) /// 2 "DELP"
> (line DayDeaMeSmA02S01 date, sort lcolor(black)) /// 3 "IHME"
> (line DayDeXMeSmA02S01 date, sort lcolor(black) lpattern(dash)) /// 4 "IHME"
> if date >= td(01jan2020) ///
> , xtitle(Date) xlabel(#$monthspast01jan2020merge, format(%tdYY-NN-DD) labsize(small)) xlabel(, grid) ///
> xlabel(, angle(forty_five)) ylabel(, format(%9.0fc) labsize(small)) ylabel(, labsize(small) angle(horizontal)) ///
> ytitle(Daily deaths) title("COVID-19 daily deaths, $country", size(medium)) /// 
> xscale(lwidth(vthin) lcolor(gray*.2)) yscale(lwidth(vthin) lcolor(gray*.2)) legend(region(lcolor(none))) legend(bexpand) ///
> legend(order(1 "JOHN" 2 "DELP" 3 "IHME" 4 "IHME excess") size(small) row(1)) ///
> subtitle("reference scenarios", size(small)) xline(22424, lcolor(red) lwidth(thick))  ///
> note("- Red line: 20210424 online meeting; The estimated probability, timing, dimensions, drivers, and preventive measures of" ///
> "    the FIFTH wave and Delta were discussed with MOH." , size(vsmall))
{res}{txt}
{com}. 
. graph save "graph 11 COVID-19 daily deaths, $country, reference scenarios, all time.gph", replace
{res}{txt}(file graph 11 COVID-19 daily deaths, Iran, reference scenarios, all time.gph saved)

{com}. graph export "graph 11 COVID-19 daily deaths, $country, reference scenarios, all time.pdf", replace
{txt}(file /Users/farshadpourmalek/Downloads/covir2-main/20220204/code/merge/graph 11 COVID-19 daily deaths, Iran, reference scenarios, all time.pdf written in PDF format)

{com}. 
. 
. 
. ****
. * daily deaths, reference scenario, 2021
. 
. twoway ///
> (line DayDeaMeSmA00S00 date, sort lcolor(cyan*1.2) lwidth(vthick)) /// 1 "JOHN smooth"
> (line DayDeaMeRaA01S00 date, sort lcolor(red)) /// 2 "DELP"
> (line DayDeaMeSmA02S01 date, sort lcolor(black)) /// 3 "IHME"
> (line DayDeXMeSmA02S01 date, sort lcolor(black) lpattern(dash)) /// 4 "IHME"
> if date >= td(01jan2021) ///
> , xtitle(Date) xlabel(#$monthspast01jan2021merge, format(%tdYY-NN-DD) labsize(small)) xlabel(, grid) ///
> xlabel(, angle(forty_five)) ylabel(, format(%9.0fc) labsize(small))  ylabel(, labsize(small) angle(horizontal)) ///
> ytitle(Daily deaths) title("COVID-19 daily deaths, $country", size(medium)) /// 
> xscale(lwidth(vthin) lcolor(gray*.2)) yscale(lwidth(vthin) lcolor(gray*.2)) legend(region(lcolor(none))) legend(bexpand) ///
> legend(order(1 "JOHN" 2 "DELP" 3 "IHME" 4 "IHME excess") size(small) row(1)) ///
> subtitle("2021 on, reference scenarios", size(small)) xline(22424, lcolor(red) lwidth(thick))  ///
> note("- Red line: 20210424 online meeting; The estimated probability, timing, dimensions, drivers, and preventive measures of" ///
> "    the FIFTH wave and Delta were discussed with MOH." , size(vsmall))
{res}{txt}
{com}. 
. graph save "graph 12 COVID-19 daily deaths, $country, reference scenarios.gph", replace
{res}{txt}(file graph 12 COVID-19 daily deaths, Iran, reference scenarios.gph saved)

{com}. graph export "graph 12 COVID-19 daily deaths, $country, reference scenarios.pdf", replace
{txt}(file /Users/farshadpourmalek/Downloads/covir2-main/20220204/code/merge/graph 12 COVID-19 daily deaths, Iran, reference scenarios.pdf written in PDF format)

{com}. 
. 
. 
. 
. ****
. * daily deaths, reference scenario, 2021, CI
. 
. twoway ///
> (line DayDeaMeSmA00S00 date, sort lcolor(cyan*1.2) lwidth(vthick)) /// 1 "JOHN smooth"
> (line DayDeaMeRaA01S00 date, sort lcolor(red)) /// 2 "DELP" mean
> (line DayDeaLoRaA01S00 date, sort lcolor(red) lpattern(dash)) /// 3 "DELP" lower
> (line DayDeaUpRaA01S00 date, sort lcolor(red) lpattern(dash)) /// 4 "DELP" upper
> (line DayDeaMeSmA02S01 date, sort lcolor(black)) /// 5 IHME mean
> (line DayDeaLoSmA02S01 date, sort lcolor(black) lpattern(dash)) /// 6 IHME lower
> (line DayDeaUpSmA02S01 date, sort lcolor(black) lpattern(dash)) /// 7 IHME upper
> if date >= td(01jan2021) ///
> , xtitle(Date) xlabel(#$monthspast01jan2021merge, format(%tdYY-NN-DD) labsize(small)) xlabel(, grid)  ///
> xlabel(, angle(forty_five)) ylabel(, format(%9.0fc) labsize(small))  ylabel(, labsize(small) angle(horizontal)) ///
> ytitle(Daily deaths) title("COVID-19 daily deaths, $country", size(medium)) ///
> xscale(lwidth(vthin) lcolor(gray*.2)) yscale(lwidth(vthin) lcolor(gray*.2)) legend(region(lcolor(none))) legend(bexpand) ///
> legend(order(1 "JOHN" 2 "DELP" 5 "IHME") size(small) row(1)) ///
> subtitle("2021 on, reference scenarios with uncertainty", size(small)) xline(22424, lcolor(red) lwidth(thick))  ///
> note("- Uncertainty limits: dashed curves" ///
> "- Red line: 20210424 online meeting; The estimated probability, timing, dimensions, drivers, and preventive measures of" ///
> "    the FIFTH wave and Delta were discussed with MOH.", size(vsmall))
{res}{txt}
{com}. 
. graph save "graph 13 COVID-19 daily deaths, $country, reference scenarios, CI.gph", replace
{res}{txt}(file graph 13 COVID-19 daily deaths, Iran, reference scenarios, CI.gph saved)

{com}. graph export "graph 13 COVID-19 daily deaths, $country, reference scenarios, CI.pdf", replace
{txt}(file /Users/farshadpourmalek/Downloads/covir2-main/20220204/code/merge/graph 13 COVID-19 daily deaths, Iran, reference scenarios, CI.pdf written in PDF format)

{com}. 
. 
. 
. 
. ****
. * daily deaths, reference scenario with uncertainty, IHME, 2021 
. 
. twoway ///
> (line DayDeaMeRaA00S00 date, sort lcolor(cyan) lwidth(medium)) /// 1 "JOHN raw"
> (line DayDeaMeSmA00S00 date, sort lcolor(cyan*1.2) lwidth(vthick)) /// 2 "JOHN smooth"
> (line DayDeaMeSmA02S01 date, sort lcolor(black)) /// 3 IHME reference mean
> (line DayDeaLoSmA02S01 date, sort lcolor(green) lpattern(dash)) /// 4 IHME reference lower
> (line DayDeaUpSmA02S01 date, sort lcolor(red) lpattern(dash)) /// 5 IHME reference upper
> (line DayDeXLoSmA02S01 date, sort lcolor(green) lpattern(dash_dot)) /// 6 "IHME excess lower"
> (line DayDeXUpSmA02S01 date, sort lcolor(red) lpattern(dash_dot)) /// 7 "IHME excess upper"
> (line DayDeXMeSmA02S01 date, sort lcolor(black) lpattern(dash_dot) lwidth(medthick)) /// 8 "IHME excess mean"
> if date >= td(01jan2021) ///
> , xtitle(Date) xlabel(#$monthspast01jan2021merge, format(%tdYY-NN-DD) labsize(small)) xlabel(, grid) ///
> xlabel(, angle(forty_five)) ylabel(, format(%9.0fc) labsize(small)) ylabel(, labsize(small) angle(horizontal)) ///
> ytitle(Daily deaths) title("COVID-19 daily deaths, $country, IHME", size(medium)) ///
> xscale(lwidth(vthin) lcolor(gray*.2)) yscale(lwidth(vthin) lcolor(gray*.2)) legend(region(lcolor(none))) legend(bexpand) ///
> legend(order(1 "JOHN raw" 2 "JOHN smooth" 3 "IHME reference scenario, mean" ///
> 4 "IHME reference scenario, lower" 5 "IHME reference scenario, upper" 6 "IHME excess lower" ///
> 7 "IHME excess upper" 8 "IHME excess mean") size(small) row(4)) ///
> subtitle("2021 on, reference scenario with uncertainty", size(small)) xline(22424, lcolor(red) lwidth(thick))  ///
> note("- Uncertainty limits: dashed (– – –) curves" ///
> "- Red line: 20210424 online meeting; The estimated probability, timing, dimensions, drivers, and preventive measures of" ///
> "    the FIFTH wave and Delta were discussed with MOH.", size(vsmall)) 
{res}{txt}
{com}. 
. graph save "graph 14 COVID-19 daily deaths, $country, reference scenario with uncertainty, IHME.gph", replace
{res}{txt}(file graph 14 COVID-19 daily deaths, Iran, reference scenario with uncertainty, IHME.gph saved)

{com}. graph export "graph 14 COVID-19 daily deaths, $country, reference scenario with uncertainty, IHME.pdf", replace
{txt}(file /Users/farshadpourmalek/Downloads/covir2-main/20220204/code/merge/graph 14 COVID-19 daily deaths, Iran, reference scenario with uncertainty, IHME.pdf written in PDF format)

{com}. 
. 
. 
. ****
. * daily deaths, all scenarios, IHME, 2021
. 
. twoway ///
> (line DayDeaMeSmA02S01 date, sort lcolor(black) lwidth(medthick)) ///
> (line DayDeaMeSmA02S02 date, sort lcolor(blue)) ///
> (line DayDeaMeSmA02S03 date, sort lcolor(green)) /// 
> if date >= td(01jan2021) ///
> , xtitle(Date) xlabel(#$monthspast01jan2021merge, format(%tdYY-NN-DD) labsize(small)) xlabel(, grid) xlabel(, grid) ///
> xlabel(, angle(forty_five)) ylabel(, format(%12.0fc) labsize(small))  ylabel(, labsize(small) angle(horizontal)) ///
> ytitle(Daily reported deaths) title("COVID-19 daily reported deaths, $country, IHME, all scenarios", size(medium)) ///
> xscale(lwidth(vthin) lcolor(gray*.2)) yscale(lwidth(vthin) lcolor(gray*.2)) legend(region(lcolor(none))) legend(bexpand) ///
> legend(order(1 "Reference" 2 "Masks" 3 "Third dose") rows(1)) 
{res}{txt}
{com}. 
. graph save "graph 15 COVID-19 daily deaths, $country, all scenarios, IHME.gph", replace
{res}{txt}(file graph 15 COVID-19 daily deaths, Iran, all scenarios, IHME.gph saved)

{com}. graph export "graph 15 COVID-19 daily deaths, $country, all scenarios, IHME.pdf", replace
{txt}(file /Users/farshadpourmalek/Downloads/covir2-main/20220204/code/merge/graph 15 COVID-19 daily deaths, Iran, all scenarios, IHME.pdf written in PDF format)

{com}. 
. 
. 
. ***********************
. 
. * daily cases or infections (graph numbers start with 21)
. 
. twoway ///
> (line DayCasMeRaA00S00 date, sort lcolor(cyan*1.2)) /// 1 "JOHN"
> (line DayCasMeRaA01S00 date, sort lcolor(red)) /// 2 "DELP"
> (line DayINFMeSmA02S01 date, sort lcolor(black)) /// 3 "IHME"
> if date >= td(01jan2020) ///
> , xtitle(Date) xlabel(#$monthspast01jan2020merge, format(%tdYY-NN-DD) labsize(small)) xlabel(, grid)  ///
> xlabel(, angle(forty_five)) ylabel(, format(%9.0fc) labsize(small)) ylabel(, labsize(small) angle(horizontal)) ///
> ytitle(Daily cases or infections) title("COVID-19 daily cases or infections, $country", size(medium)) /// 
> xscale(lwidth(vthin) lcolor(gray*.2)) yscale(lwidth(vthin) lcolor(gray*.2)) legend(region(lcolor(none))) legend(bexpand) ///
> legend(order(1 "JOHN cases" 2 "DELP cases" 3 "IHME infections") size(small) row(2)) ///
> subtitle("reference scenarios", size(small)) xline(22424, lcolor(red) lwidth(thick))  ///
> note("- Red line: 20210424 online meeting; The estimated probability, timing, dimensions, drivers, and preventive measures of" ///
> "    the FIFTH wave and Delta were discussed with MOH.", size(vsmall))
{res}{txt}
{com}. 
. graph save "graph 21 COVID-19 daily cases, $country, reference scenarios, all time.gph", replace
{res}{txt}(file graph 21 COVID-19 daily cases, Iran, reference scenarios, all time.gph saved)

{com}. graph export "graph 21 COVID-19 daily cases, $country, reference scenarios, all time.pdf", replace
{txt}(file /Users/farshadpourmalek/Downloads/covir2-main/20220204/code/merge/graph 21 COVID-19 daily cases, Iran, reference scenarios, all time.pdf written in PDF format)

{com}. 
. 
. 
. ****
. * daily cases or infections, reference scenario, 2021
. 
. twoway ///
> (line DayCasMeRaA00S00 date, sort lcolor(cyan*1.2)) /// 1 "JOHN"
> (line DayCasMeRaA01S00 date, sort lcolor(red)) /// 2 "DELP"
> (line DayINFMeSmA02S01 date, sort lcolor(black)) /// 3 "IHME"
> if date >= td(01jan2021) ///
> , xtitle(Date) xlabel(#$monthspast01jan2021merge, format(%tdYY-NN-DD) labsize(small)) xlabel(, grid) ///
> xlabel(, angle(forty_five)) ylabel(, format(%9.0fc) labsize(small))  ylabel(, labsize(small) angle(horizontal)) ///
> ytitle(Daily cases or infections) title("COVID-19 daily cases or infections, $country", size(medium)) /// 
> xscale(lwidth(vthin) lcolor(gray*.2)) yscale(lwidth(vthin) lcolor(gray*.2)) legend(region(lcolor(none))) legend(bexpand) ///
> legend(order(1 "JOHN cases" 2 "DELP cases" 3 "IHME infections") size(small) row(2)) ///
> subtitle("2021 on, reference scenarios", size(small)) xline(22424, lcolor(red) lwidth(thick))  ///
> note("- Red line: 20210424 online meeting; The estimated probability, timing, dimensions, drivers, and preventive measures of" ///
> "    the FIFTH wave and Delta were discussed with MOH.", size(vsmall))
{res}{txt}
{com}. 
. graph save "graph 22 COVID-19 daily cases, $country, reference scenarios.gph", replace
{res}{txt}(file graph 22 COVID-19 daily cases, Iran, reference scenarios.gph saved)

{com}. graph export "graph 22 COVID-19 daily cases, $country, reference scenarios.pdf", replace
{txt}(file /Users/farshadpourmalek/Downloads/covir2-main/20220204/code/merge/graph 22 COVID-19 daily cases, Iran, reference scenarios.pdf written in PDF format)

{com}. 
. 
. 
. ****
. * daily cases, reference scenario, 2021
. 
. twoway ///
> (line DayCasMeRaA00S00 date, sort lcolor(cyan) lwidth(medium)) /// 1 "JOHN"
> (line DayCasMeSmA00S00 date, sort lcolor(cyan*1.2) lwidth(vthick)) /// 2 "JOHN"
> (line DayCasMeRaA01S00 date, sort lcolor(red)) /// 3 "DELP"
> if date >= td(01jan2021) ///
> , xtitle(Date) xlabel(#$monthspast01jan2021merge, format(%tdYY-NN-DD) labsize(small)) xlabel(, grid) ///
> xlabel(, angle(forty_five)) ylabel(, format(%9.0fc) labsize(small))  ylabel(, labsize(small) angle(horizontal)) ///
> ytitle(Daily cases) title("COVID-19 daily cases, $country", size(medium)) /// 
> xscale(lwidth(vthin) lcolor(gray*.2)) yscale(lwidth(vthin) lcolor(gray*.2)) legend(region(lcolor(none))) legend(bexpand) ///
> legend(order(1 "JOHN cases raw" 2 "JOHN cases smooth" 3 "DELP cases") size(small) row(2)) ///
> subtitle("2021 on, reference scenarios", size(small)) xline(22424, lcolor(red) lwidth(thick))  ///
> note("- Red line: 20210424 online meeting; The estimated probability, timing, dimensions, drivers, and preventive measures of" ///
> "    the FIFTH wave and Delta were discussed with MOH.", size(vsmall))
{res}{txt}
{com}. 
. graph save "graph 22b COVID-19 daily cases, $country, reference scenarios.gph", replace
{res}{txt}(file graph 22b COVID-19 daily cases, Iran, reference scenarios.gph saved)

{com}. graph export "graph 22b COVID-19 daily cases, $country, reference scenarios.pdf", replace
{txt}(file /Users/farshadpourmalek/Downloads/covir2-main/20220204/code/merge/graph 22b COVID-19 daily cases, Iran, reference scenarios.pdf written in PDF format)

{com}. 
. 
. 
. ****
. * daily cases or infections, reference scenarios, 2021, CI
. 
. twoway ///
> (line DayCasMeRaA00S00 date, sort lcolor(cyan*1.2) lwidth(thick)) /// 1 JOHN
> (line DayCasMeRaA01S00 date, sort lcolor(red)) /// 2 "DELP" mean
> (line DayCasLoRaA01S00 date, sort lcolor(red) lpattern(dash)) /// 3 "DELP" lower
> (line DayCasUpRaA01S00 date, sort lcolor(red) lpattern(dash)) /// 4 "DELP" upper
> (line DayINFMeSmA02S01 date, sort lcolor(black)) /// 5 IHME mean
> (line DayINFLoSmA02S01 date, sort lcolor(black) lpattern(dash)) /// 6 IHME lower
> (line DayINFUpSmA02S01 date, sort lcolor(black) lpattern(dash)) /// 7 IHME upper
> if date >= td(01jan2021) ///
> , xtitle(Date) xlabel(#$monthspast01jan2021merge, format(%tdYY-NN-DD) labsize(small)) xlabel(, grid) ///
> xlabel(, angle(forty_five)) ylabel(, format(%9.0fc) labsize(small)) ylabel(, labsize(small) angle(horizontal)) ///
> ytitle(Daily cases or infections) title("COVID-19 daily cases or infections, $country", size(medium)) ///
> xscale(lwidth(vthin) lcolor(gray*.2)) yscale(lwidth(vthin) lcolor(gray*.2)) legend(region(lcolor(none))) legend(bexpand) ///
> legend(order(1 "JOHN cases" 2 "DELP cases" 5 "IHME infections") size(small) row(2)) /// 
> subtitle("2021 on, reference scenarios with uncertainty", size(small)) xline(22424, lcolor(red) lwidth(thick))  ///
> note("- Red line: 20210424 online meeting; The estimated probability, timing, dimensions, drivers, and preventive measures of" ///
> "    the FIFTH wave and Delta were discussed with MOH.", size(vsmall))
{res}{txt}
{com}. 
. graph save "graph 23 COVID-19 daily cases, $country, reference scenarios, CI.gph", replace
{res}{txt}(file graph 23 COVID-19 daily cases, Iran, reference scenarios, CI.gph saved)

{com}. graph export "graph 23 COVID-19 daily cases, $country, reference scenarios, CI.pdf", replace
{txt}(file /Users/farshadpourmalek/Downloads/covir2-main/20220204/code/merge/graph 23 COVID-19 daily cases, Iran, reference scenarios, CI.pdf written in PDF format)

{com}. 
. 
. 
. ****
. * daily cases or infections, full scenarios, with uncertainty, 2021
. 
. twoway ///
> (line DayCasMeRaA00S00 date, sort lcolor(cyan*1.2) lwidth(thick)) /// 1 JOHN
> (line DayCasMeRaA01S00 date, sort lcolor(red)) /// 2 "DELP" mean
> (line DayCasLoRaA01S00 date, sort lcolor(red) lpattern(dash)) /// 3 "DELP" lower
> (line DayCasUpRaA01S00 date, sort lcolor(red) lpattern(dash)) /// 4 "DELP" upper
> (line DayINFMeSmA02S01 date, sort lcolor(black)) /// 5 IHME reference mean
> (line DayINFLoSmA02S01 date, sort lcolor(black) lpattern(dash)) /// 6 IHME reference lower
> (line DayINFUpSmA02S01 date, sort lcolor(black) lpattern(dash)) /// 7 IHME reference upper
> (line DayINFMeSmA02S02 date, sort lcolor(black) lwidth(thick) lpattern(tight_dot)) /// 8 IHME better mean
> if date >= td(01jan2021) ///
> , xtitle(Date) xlabel(#$monthspast01jan2021merge, format(%tdYY-NN-DD) labsize(small)) xlabel(, grid) ///
> xlabel(, angle(forty_five)) ylabel(, format(%9.0fc) labsize(small)) ylabel(, labsize(small) angle(horizontal)) ///
> ytitle(Daily cases or infections) title("COVID-19 daily cases or infections, $country", size(medium)) ///
> xscale(lwidth(vthin) lcolor(gray*.2)) yscale(lwidth(vthin) lcolor(gray*.2)) legend(region(lcolor(none))) legend(bexpand) ///
> legend(order(1 "JOHN cases" 2 "DELP cases" 5 "IHME reference, mean" ///
> 6 "IHME ref, uncertainty" 8 "IHME better") size(small) row(4)) ///
> subtitle("2021 on, full scenarios, with uncertainty; IHME: infections", size(small)) xline(22424, lcolor(red) lwidth(thick))  ///
> note("- Uncertainty limits: dashed (– – –) curves; Better and worse scenarios: tight dot (|||||) curves." ///
> "- Red line: 20210424 online meeting; The estimated probability, timing, dimensions, drivers, and preventive measures of" ///
> "    the FIFTH wave and Delta were discussed with MOH.", size(vsmall))
{res}{txt}
{com}. 
. graph save "graph 23 COVID-19 daily cases, $country, full scenarios, CI.gph", replace
{res}{txt}(file graph 23 COVID-19 daily cases, Iran, full scenarios, CI.gph saved)

{com}. graph export "graph 23 COVID-19 daily cases, $country, full scenarios, CI.pdf", replace
{txt}(file /Users/farshadpourmalek/Downloads/covir2-main/20220204/code/merge/graph 23 COVID-19 daily cases, Iran, full scenarios, CI.pdf written in PDF format)

{com}. 
. 
. 
. ****
. * daily infections, reference scenario with uncertainty, IHME, 2021
. 
. twoway ///
> (line DayCasMeRaA00S00 date, sort lcolor(cyan*1.2) lwidth(thick)) /// 1 JOHN
> (line DayINFMeSmA02S01 date, sort lcolor(black)) /// 2 IHME reference mean
> (line DayINFLoSmA02S01 date, sort lcolor(green) lpattern(dash)) /// 3 IHME reference lower
> (line DayINFUpSmA02S01 date, sort lcolor(red) lpattern(dash)) /// 4 IHME reference upper
> if date >= td(01jan2021) ///
> , xtitle(Date) xlabel(#$monthspast01jan2021merge, format(%tdYY-NN-DD) labsize(small)) xlabel(, grid) ///
> xlabel(, angle(forty_five)) ylabel(, format(%9.0fc) labsize(small)) ylabel(, labsize(small) angle(horizontal)) ///
> ytitle(Daily cases or infections) title("COVID-19 daily cases JOHN, and infections IHME, $country", size(medium)) ///
> xscale(lwidth(vthin) lcolor(gray*.2)) yscale(lwidth(vthin) lcolor(gray*.2)) legend(region(lcolor(none))) legend(bexpand) ///
> legend(order(1 "JOHN cases" 2 "IHME reference, mean" 3 "IHME reference, lower" 4 "IHME reference, upper") size(small) row(2)) ///
> subtitle("2021 on, IHME infections reference scenario with uncertainty", size(small)) xline(22424, lcolor(red) lwidth(thick))  ///
> note("- Uncertainty limits: dashed (– – –) curves." ///
> "- Red line: 20210424 online meeting; The estimated probability, timing, dimensions, drivers, and preventive measures of" ///
> "    the FIFTH wave and Delta were discussed with MOH.", size(vsmall))
{res}{txt}
{com}. 
. graph save "graph 24 COVID-19 daily cases, $country, reference scenario with uncertainty, IHME.gph", replace
{res}{txt}(file graph 24 COVID-19 daily cases, Iran, reference scenario with uncertainty, IHME.gph saved)

{com}. graph export "graph 24 COVID-19 daily cases, $country, reference scenario with uncertainty, IHME.pdf", replace
{txt}(file /Users/farshadpourmalek/Downloads/covir2-main/20220204/code/merge/graph 24 COVID-19 daily cases, Iran, reference scenario with uncertainty, IHME.pdf written in PDF format)

{com}. 
. 
. 
. 
. ****
. * daily infections, all scenarios, IHME, 2021
. 
. twoway ///
> (line DayINFMeSmA02S01 date, sort lcolor(black) lwidth(medthick)) ///
> (line DayINFMeSmA02S02 date, sort lcolor(blue)) ///
> (line DayINFMeSmA02S03 date, sort lcolor(green)) /// 
> if date >= td(01jan2021) ///
> , xtitle(Date) xlabel(#$monthspast01jan2021merge, format(%tdYY-NN-DD) labsize(small)) xlabel(, grid) xlabel(, grid) ///
> xlabel(, angle(forty_five)) ylabel(, format(%12.0fc) labsize(small))  ylabel(, labsize(small) angle(horizontal)) ///
> ytitle(Daily infections) title("COVID-19 daily infections, $country, IHME, all scenarios", size(medium)) ///
> xscale(lwidth(vthin) lcolor(gray*.2)) yscale(lwidth(vthin) lcolor(gray*.2)) legend(region(lcolor(none))) legend(bexpand) ///
> legend(order(1 "Reference" 2 "Masks" 3 "Third dose") rows(1))
{res}{txt}
{com}. 
. graph save "graph 25 1 COVID-19 daily cases, $country, all scenarios, IHME.gph", replace
{res}{txt}(file graph 25 1 COVID-19 daily cases, Iran, all scenarios, IHME.gph saved)

{com}. graph export "graph 25 1 COVID-19 daily cases, $country, all scenarios, IHME.pdf", replace
{txt}(file /Users/farshadpourmalek/Downloads/covir2-main/20220204/code/merge/graph 25 1 COVID-19 daily cases, Iran, all scenarios, IHME.pdf written in PDF format)

{com}. 
. 
. 
. 
. 
. ****
. * daily estimated infections to reported cases IHME, all time
. 
. 
. gen DayITCMeSmA02S01 =  DayINFMeSmA02S01 / DayCasMeRaA00S00
{txt}(166 missing values generated)

{com}. 
. label var DayITCMeSmA02S01  "Daily Infections IHME to cases JOHN"
{txt}
{com}. 
. 
. twoway ///
> (line DayITCMeSmA02S01 date, sort lcolor(black)) /// 1 "IHME"
> if date >= td(01jan2020) ///
> , xtitle(Date) xlabel(#$monthspast01jan2020merge, format(%tdYY-NN-DD) labsize(small)) xlabel(, grid) xlabel(, grid) ///
> xlabel(, angle(forty_five)) ylabel(, format(%15.0fc) labsize(small))  ylabel(, labsize(small) angle(horizontal)) ///
> ytitle(Daily estimated infections to reported cases) title("COVID-19 daily estimated infections to reported cases, $country", size(medium)) /// 
> xscale(lwidth(vthin) lcolor(gray*.2)) yscale(lwidth(vthin) lcolor(gray*.2)) legend(region(lcolor(none))) legend(bexpand) ///
> legend(order(1 "IHME") size(small) row(1)) ///
> subtitle("reference scenarios", size(small)) 
{res}{txt}
{com}. 
. graph save "graph 28 C19 daily estimated infections to reported cases, $country, reference scenarios.gph", replace
{res}{txt}(file graph 28 C19 daily estimated infections to reported cases, Iran, reference scenarios.gph saved)

{com}. graph export "graph 28 C19 daily estimated infections to reported cases, $country, reference scenarios.pdf", replace
{txt}(file /Users/farshadpourmalek/Downloads/covir2-main/20220204/code/merge/graph 28 C19 daily estimated infections to reported cases, Iran, reference scenarios.pdf written in PDF format)

{com}. 
. 
. 
. 
. ****
. * daily estimated infections to reported cases IHME, 2021
. 
. 
. * smooth Infections to cases ratio of IHME
. 
. tsset date, daily   
{res}{txt}{col 9}time variable:  {res}{col 25}date, 01Jan2020 to 01Jun2022
{txt}{col 17}delta:  {res}1 day
{txt}
{com}. 
. 
. foreach var of varlist ///
> DayITCMeSmA02S01  {c -(}
{txt}  2{com}. 
. 
. tssmooth ma `var'_window = `var', window(3 1 3)
{txt}  3{com}. 
. tssmooth ma `var'sm = `var'_window, weights( 1 2 3 <4> 3 2 1) replace
{txt}  4{com}. 
. drop `var'_window
{txt}  5{com}. 
. {c )-}
{txt}The smoother applied was
{res}{p 5 5 5}(1/7)*[x(t-3) + x(t-2) + x(t-1) + 1*x(t) + x(t+1) + x(t+2) + x(t+3)]; x(t)= DayITCMeSmA02S01{p_end}
{txt}The smoother applied was
{res}{p 5 5 5}(1/16)*[1*x(t-3) + 2*x(t-2) + 3*x(t-1) + 4*x(t) + 3*x(t+1) + 2*x(t+2) + ...; x(t)= DayITCMeSmA02S01_window
{txt}
{smcl}
{com}. *
. 
. tsset, clear
{txt}
{com}. 
. ssc install labutil2
{txt}checking {hilite:labutil2} consistency and verifying not already installed...
all files already exist and are up to date.

{com}. 
. 
.           
. qui summ DayITCMeSmA02S01sm if date >= td(01jan2021) , detail
{txt}
{com}. 
. gen DayITCMeSmA02S01sm_median = r(p50)
{txt}
{com}. 
. replace DayITCMeSmA02S01sm_median = round(DayITCMeSmA02S01sm_median)
{txt}(883 real changes made)

{com}. 
. local DayITCMeSmA02S01sm_median = DayITCMeSmA02S01sm_median
{txt}
{com}. 
. 
. twoway ///
> (line DayITCMeSmA02S01 date, sort lcolor(black*0.2)) /// 1 "IHME"
> (line DayITCMeSmA02S01sm date, sort lcolor(black) lwidth(thick)) /// 2 "IHME"
> (line DayITCMeSmA02S01sm_median date, sort lcolor(black) lwidth(thin) lpattern(dash)) /// 3 "IHME"
> if date >= td(01jan2021) ///
> , xtitle(Date) xlabel(#$monthspast01jan2021merge, format(%tdYY-NN-DD) labsize(small)) xlabel(, grid) xlabel(, grid) ///
> xlabel(, angle(forty_five)) ylabel(, format(%15.0fc) labsize(small))  ylabel(, labsize(small) angle(horizontal)) ///
> ytitle(Daily estimated infections to reported cases) title("COVID-19 daily estimated infections to reported cases, $country", size(medium)) /// 
> xscale(lwidth(vthin) lcolor(gray*.2)) yscale(lwidth(vthin) lcolor(gray*.2)) legend(region(lcolor(none))) legend(bexpand) ///
> legend(order(1 "IHME" 2 "IHME smooth" 3 "IHME smooth meadian") size(small) row(2)) ///
> subtitle("reference scenarios", size(small)) ///
> note("IHME smooth median 2021 on = `DayITCMeSmA02S01sm_median'")
{res}{txt}
{com}. 
. graph save "graph 29 C19 daily estimated infections to reported cases, $country, reference scenarios 2021.gph", replace
{res}{txt}(file graph 29 C19 daily estimated infections to reported cases, Iran, reference scenarios 2021.gph saved)

{com}. graph export "graph 29 C19 daily estimated infections to reported cases, $country, reference scenarios 2021.pdf", replace
{txt}(file /Users/farshadpourmalek/Downloads/covir2-main/20220204/code/merge/graph 29 C19 daily estimated infections to reported cases, Iran, reference scenarios 2021.pdf written in PDF format)

{com}. 
. 
. 
. 
. 
. 
. *****************
. 
. * total deaths (graph numbers start with 31)
. 
. 
. ****
. * total deaths, reference scenario, all time
. 
. twoway ///
> (line TotDeaMeRaA00S00 date, sort lcolor(cyan*1.2) lwidth(vthick)) /// 1 "JOHN"
> (line TotDeaMeRaA01S00 date, sort lcolor(red)) /// 2 "DELP"
> (line TotDeaMeSmA02S01 date, sort lcolor(black)) /// 3 "IHME"
> if date >= td(01jan2020) ///
> , xtitle(Date) xlabel(#$monthspast01jan2020merge, format(%tdYY-NN-DD) labsize(small)) xlabel(, grid) ///
> xlabel(, angle(forty_five)) ylabel(, format(%9.0fc) labsize(small))  ylabel(, labsize(small) angle(horizontal)) ///
> ytitle(Total deaths) title("COVID-19 total deaths, $country", size(medium)) /// 
> xscale(lwidth(vthin) lcolor(gray*.2)) yscale(lwidth(vthin) lcolor(gray*.2)) legend(region(lcolor(none))) legend(bexpand) ///
> legend(order(1 "JOHN" 2 "DELP" 3 "IHME") size(small) row(1)) ///
> subtitle("reference scenarios", size(small)) xline(22424, lcolor(red) lwidth(thick))  ///
> note("- Red line: 20210424 online meeting; The estimated probability, timing, dimensions, drivers, and preventive measures of" ///
> "    the FIFTH wave and Delta were discussed with MOH.", size(vsmall))
{res}{txt}
{com}. 
. graph save "graph 31a COVID-19 total deaths, $country, reference scenarios, all time.gph", replace
{res}{txt}(file graph 31a COVID-19 total deaths, Iran, reference scenarios, all time.gph saved)

{com}. graph export "graph 31a COVID-19 total deaths, $country, reference scenarios, all time.pdf", replace
{txt}(file /Users/farshadpourmalek/Downloads/covir2-main/20220204/code/merge/graph 31a COVID-19 total deaths, Iran, reference scenarios, all time.pdf written in PDF format)

{com}. 
. 
. 
. ****
. * total deaths, reference scenario, all time, with IHME excess mortality 
. 
. twoway ///
> (line TotDeaMeRaA00S00 date, sort lcolor(cyan*1.2) lwidth(vthick)) /// 1 "JOHN"
> (line TotDeaMeRaA01S00 date, sort lcolor(red)) /// 2 "DELP"
> (line TotDeaMeSmA02S01 date, sort lcolor(black)) /// 3 "IHME"
> (line TotDeXMeSmA02S01 date, sort lcolor(black) lpattern(dash)) /// 4 "IHME excess"
> if date >= td(01jan2020) ///
> , xtitle(Date) xlabel(#$monthspast01jan2020merge, format(%tdYY-NN-DD) labsize(small)) xlabel(, grid) ///
> xlabel(, angle(forty_five)) ylabel(, format(%9.0fc) labsize(small))  ylabel(, labsize(small) angle(horizontal)) ///
> ytitle(Total deaths) title("COVID-19 total deaths, $country", size(medium)) /// 
> xscale(lwidth(vthin) lcolor(gray*.2)) yscale(lwidth(vthin) lcolor(gray*.2)) legend(region(lcolor(none))) legend(bexpand) ///
> legend(order(1 "JOHN" 2 "DELP" 3 "IHME" 4 "IHME excess") size(small) row(1)) ///
> subtitle("reference scenarios", size(small)) xline(22424, lcolor(red) lwidth(thick))  ///
> note("- Red line: 20210424 online meeting; The estimated probability, timing, dimensions, drivers, and preventive measures of" ///
> "    the FIFTH wave and Delta were discussed with MOH.", size(vsmall))
{res}{txt}
{com}. 
. graph save "graph 31b COVID-19 total deaths, $country, reference scenarios, all time.gph", replace
{res}{txt}(file graph 31b COVID-19 total deaths, Iran, reference scenarios, all time.gph saved)

{com}. graph export "graph 31b COVID-19 total deaths, $country, reference scenarios, all time.pdf", replace
{txt}(file /Users/farshadpourmalek/Downloads/covir2-main/20220204/code/merge/graph 31b COVID-19 total deaths, Iran, reference scenarios, all time.pdf written in PDF format)

{com}. 
. 
. 
. ****
. * total deaths, reference scenario, 2021
. 
. twoway ///
> (line TotDeaMeRaA00S00 date, sort lcolor(cyan*1.2) lwidth(vthick)) /// 1 "JOHN"
> (line TotDeaMeRaA01S00 date, sort lcolor(red)) /// 2 "DELP"
> (line TotDeaMeSmA02S01 date, sort lcolor(black)) /// 3 "IHME"
> if date >= td(01jan2021) ///
> , xtitle(Date) xlabel(#$monthspast01jan2021merge, format(%tdYY-NN-DD) labsize(small)) xlabel(, grid) ///
> xlabel(, angle(forty_five)) ylabel(, format(%9.0fc) labsize(small)) ylabel(, labsize(small) angle(horizontal)) ///
> ytitle(Total deaths) title("COVID-19 total deaths, $country", size(medium)) /// 
> xscale(lwidth(vthin) lcolor(gray*.2)) yscale(lwidth(vthin) lcolor(gray*.2)) legend(region(lcolor(none))) legend(bexpand) ///
> legend(order(1 "JOHN" 2 "DELP" 3 "IHME") size(small) row(1)) ///
> subtitle("2021 on, reference scenarios", size(small)) xline(22424, lcolor(red) lwidth(thick))  ///
> note("- Red line: 20210424 online meeting; The estimated probability, timing, dimensions, drivers, and preventive measures of" ///
> "    the FIFTH wave and Delta were discussed with MOH.", size(vsmall))
{res}{txt}
{com}. 
. graph save "graph 32a COVID-19 total deaths, $country, reference scenarios.gph", replace
{res}{txt}(file graph 32a COVID-19 total deaths, Iran, reference scenarios.gph saved)

{com}. graph export "graph 32a COVID-19 total deaths, $country, reference scenarios.pdf", replace
{txt}(file /Users/farshadpourmalek/Downloads/covir2-main/20220204/code/merge/graph 32a COVID-19 total deaths, Iran, reference scenarios.pdf written in PDF format)

{com}. 
. 
. 
. ****
. * total deaths, reference scenario, 2021, with IHME excess mortality 
. 
. twoway ///
> (line TotDeaMeRaA00S00 date, sort lcolor(cyan*1.2) lwidth(vthick)) /// 1 "JOHN"
> (line TotDeaMeRaA01S00 date, sort lcolor(red)) /// 2 "DELP"
> (line TotDeaMeSmA02S01 date, sort lcolor(black)) /// 3 "IHME"
> (line TotDeXMeSmA02S01 date, sort lcolor(black) lpattern(dash)) /// 4 "IHME excess"
> if date >= td(01jan2021) ///
> , xtitle(Date) xlabel(#$monthspast01jan2021merge, format(%tdYY-NN-DD) labsize(small)) xlabel(, grid) ///
> xlabel(, angle(forty_five)) ylabel(, format(%9.0fc) labsize(small)) ylabel(, labsize(small) angle(horizontal)) ///
> ytitle(Total deaths) title("COVID-19 total deaths, $country", size(medium)) /// 
> xscale(lwidth(vthin) lcolor(gray*.2)) yscale(lwidth(vthin) lcolor(gray*.2)) legend(region(lcolor(none))) legend(bexpand) ///
> legend(order(1 "JOHN" 2 "DELP" 3 "IHME" 4 "IHME excess") size(small) row(1)) ///
> subtitle("2021 on, reference scenarios", size(small)) xline(22424, lcolor(red) lwidth(thick))  ///
> note("- Red line: 20210424 online meeting; The estimated probability, timing, dimensions, drivers, and preventive measures of" ///
> "    the FIFTH wave and Delta were discussed with MOH.", size(vsmall))
{res}{txt}
{com}. 
. graph save "graph 32b COVID-19 total deaths, $country, reference scenarios.gph", replace
{res}{txt}(file graph 32b COVID-19 total deaths, Iran, reference scenarios.gph saved)

{com}. graph export "graph 32b COVID-19 total deaths, $country, reference scenarios.pdf", replace
{txt}(file /Users/farshadpourmalek/Downloads/covir2-main/20220204/code/merge/graph 32b COVID-19 total deaths, Iran, reference scenarios.pdf written in PDF format)

{com}. 
. 
. 
. ****
. * total deaths, reference scenario, CI, 2021
. 
. twoway ///
> (line TotDeaMeRaA00S00 date, sort lcolor(cyan*1.2) lwidth(vthick)) /// 1 JOHN
> (line TotDeaMeRaA01S00 date, sort lcolor(red)) /// 2 DELP mean
> (line TotDeaLoRaA01S00 date, sort lcolor(red) lpattern(dash)) /// 3 DELP lower
> (line TotDeaUpRaA01S00 date, sort lcolor(red) lpattern(dash)) /// 4 DELP upper
> (line TotDeaMeSmA02S01 date, sort lcolor(black)) /// 5 IHME mean
> (line TotDeaLoSmA02S01 date, sort lcolor(black) lpattern(dash)) /// 6 IHME lower
> (line TotDeaUpSmA02S01 date, sort lcolor(black) lpattern(dash)) /// 7 IHME upper
> if date >= td(01jan2021) ///
> , xtitle(Date) xlabel(#$monthspast01jan2021merge, format(%tdYY-NN-DD) labsize(small)) xlabel(, grid) ///
> xlabel(, angle(forty_five)) ylabel(, format(%9.0fc) labsize(small))  ylabel(, labsize(small) angle(horizontal)) ///
> ytitle(Total deaths) title("COVID-19 total deaths, $country", size(medium)) ///
> xscale(lwidth(vthin) lcolor(gray*.2)) yscale(lwidth(vthin) lcolor(gray*.2)) legend(region(lcolor(none))) legend(bexpand) ///
> legend(order(1 "JOHN" 2 "DELP" 5 "IHME") size(small) row(1)) ///
> note("Uncertainty limits: dashed curves") ///
> subtitle("2021 on, reference scenarios with uncertainty", size(small)) xline(22424, lcolor(red) lwidth(thick))  ///
> note("- Red line: 20210424 online meeting; The estimated probability, timing, dimensions, drivers, and preventive measures of" ///
> "    the FIFTH wave and Delta were discussed with MOH.", size(vsmall))
{res}{txt}
{com}. 
. graph save "graph 33 COVID-19 total deaths, $country, reference scenarios, CI.gph", replace
{res}{txt}(file graph 33 COVID-19 total deaths, Iran, reference scenarios, CI.gph saved)

{com}. graph export "graph 33 COVID-19 total deaths, $country, reference scenarios, CI.pdf", replace
{txt}(file /Users/farshadpourmalek/Downloads/covir2-main/20220204/code/merge/graph 33 COVID-19 total deaths, Iran, reference scenarios, CI.pdf written in PDF format)

{com}. 
. 
. 
. 
. *****************
. 
. * total cases or infections (graph numbers start with 41)
. 
. 
. ****
. * total cases or infections, reference scenario, all time
. 
. twoway ///
> (line TotCasMeRaA00S00 date, sort lcolor(cyan*1.2) lwidth(vthick)) /// 1 "JOHN"
> (line TotCasMeRaA01S00 date, sort lcolor(red)) /// 2 "DELP"
> (line TotINFMeSmA02S01 date, sort lcolor(black)) /// 3 "IHME"
> if date >= td(01jan2020) ///
> , xtitle(Date) xlabel(#$monthspast01jan2020merge, format(%tdYY-NN-DD) labsize(small)) xlabel(, grid) ///
> xlabel(, angle(forty_five)) ylabel(, format(%12.0fc) labsize(small))  ylabel(, labsize(small) angle(horizontal)) ///
> ytitle(Total cases or infections) title("COVID-19 total cases or infections, $country", size(medium)) /// 
> xscale(lwidth(vthin) lcolor(gray*.2)) yscale(lwidth(vthin) lcolor(gray*.2)) legend(region(lcolor(none))) legend(bexpand) ///
> legend(order(1 "JOHN cases" 2 "DELP cases" 3 "IHME infections") size(small) row(2)) ///
> subtitle("reference scenarios", size(small)) xline(22424, lcolor(red) lwidth(thick))  ///
> note("- Red line: 20210424 online meeting; The estimated probability, timing, dimensions, drivers, and preventive measures of" ///
> "    the FIFTH wave and Delta were discussed with MOH.", size(vsmall))
{res}{txt}
{com}. 
. graph save "graph 41 COVID-19 total cases, $country, reference scenarios, all time.gph", replace
{res}{txt}(file graph 41 COVID-19 total cases, Iran, reference scenarios, all time.gph saved)

{com}. graph export "graph 41 COVID-19 total cases, $country, reference scenarios, all time.pdf", replace
{txt}(file /Users/farshadpourmalek/Downloads/covir2-main/20220204/code/merge/graph 41 COVID-19 total cases, Iran, reference scenarios, all time.pdf written in PDF format)

{com}. 
. 
. 
. ****
. * total cases or infections, reference scenario, 2021
. 
. twoway ///
> (line TotCasMeRaA00S00 date, sort lcolor(cyan*1.2) lwidth(vthick)) /// 1 "JOHN"
> (line TotCasMeRaA01S00 date, sort lcolor(red)) /// 2 "DELP"
> (line TotINFMeSmA02S01 date, sort lcolor(black)) /// 3 "IHME"
> if date >= td(01jan2021) ///
> , xtitle(Date) xlabel(#$monthspast01jan2021merge, format(%tdYY-NN-DD) labsize(small)) xlabel(, grid) ///
> xlabel(, angle(forty_five)) ylabel(, format(%12.0fc) labsize(small))  ylabel(, labsize(small) angle(horizontal)) ///
> ytitle(Total cases or infections) title("COVID-19 total cases or infections, $country", size(medium)) /// 
> xscale(lwidth(vthin) lcolor(gray*.2)) yscale(lwidth(vthin) lcolor(gray*.2)) legend(region(lcolor(none))) legend(bexpand) ///
> legend(order(1 "JOHN cases" 2 "DELP cases" 3 "IHME infections") size(small) row(2)) ///
> subtitle("2021 on, reference scenarios", size(small)) xline(22424, lcolor(red) lwidth(thick))  ///
> note("- Red line: 20210424 online meeting; The estimated probability, timing, dimensions, drivers, and preventive measures of" ///
> "    the FIFTH wave and Delta were discussed with MOH.", size(vsmall))
{res}{txt}
{com}. 
. graph save "graph 42 COVID-19 total cases, $country, reference scenarios.gph", replace
{res}{txt}(file graph 42 COVID-19 total cases, Iran, reference scenarios.gph saved)

{com}. graph export "graph 42 COVID-19 total cases, $country, reference scenarios.pdf", replace
{txt}(file /Users/farshadpourmalek/Downloads/covir2-main/20220204/code/merge/graph 42 COVID-19 total cases, Iran, reference scenarios.pdf written in PDF format)

{com}. 
. 
. 
. ****
. * total cases or infections, reference scenario, CI, 2021
. 
. twoway ///
> (line TotCasMeRaA00S00 date, sort lcolor(cyan*1.2) lwidth(vthick)) /// 1 JOHN
> (line TotCasMeRaA01S00 date, sort lcolor(red)) /// 2 "DELP"
> (line TotCasLoRaA01S00 date, sort lcolor(red) lpattern(dash)) /// 3 "DELP"
> (line TotCasUpRaA01S00 date, sort lcolor(red) lpattern(dash)) /// 4 "DELP"
> (line TotINFMeSmA02S01 date, sort lcolor(black)) /// 5 IHME mean
> (line TotINFLoSmA02S01 date, sort lcolor(black) lpattern(dash)) /// 6 IHME lower
> (line TotINFUpSmA02S01 date, sort lcolor(black) lpattern(dash)) /// 7 IHME upper
> if date >= td(01jan2021) ///
> , xtitle(Date) xlabel(`dates2021', format(%tdYY-NN-DD) labsize(small)) xlabel(, grid) ///
> xlabel(, angle(forty_five)) ylabel(, format(%12.0fc) labsize(small))  ylabel(, labsize(small) angle(horizontal)) ///
> ytitle(Total cases or infections) title("COVID-19 total cases or infections, $country", size(medium)) ///
> xscale(lwidth(vthin) lcolor(gray*.2)) yscale(lwidth(vthin) lcolor(gray*.2)) legend(region(lcolor(none))) legend(bexpand) ///
> legend(order(1 "JOHN cases" 2 "DELP cases" 5 "IHME infections") size(small) row(2)) ///
> subtitle("2021 on, reference scenarios with uncertainty", size(small)) xline(22424, lcolor(red) lwidth(thick))  ///
> note("- Uncertainty limits: dashed curves." ///
> "- Red line: 20210424 online meeting; The estimated probability, timing, dimensions, drivers, and preventive measures of" ///
> "    the FIFTH wave and Delta were discussed with MOH.", size(vsmall))
{res}{txt}
{com}. 
. graph save "graph 43 COVID-19 total cases, $country, reference scenarios, CI.gph", replace
{res}{txt}(file graph 43 COVID-19 total cases, Iran, reference scenarios, CI.gph saved)

{com}. graph export "graph 43 COVID-19 total cases, $country, reference scenarios, CI.pdf", replace
{txt}(file /Users/farshadpourmalek/Downloads/covir2-main/20220204/code/merge/graph 43 COVID-19 total cases, Iran, reference scenarios, CI.pdf written in PDF format)

{com}. 
. 
. 
. ****************
. 
. * daily CFR / IFR (graph numbers start with 51)
. 
. 
. ****
. * CFR / IFR all studies, all time, reference scenarios, all time
. 
. twoway ///
> (line DayCfrMeRaA00S00 date, sort lcolor(cyan*1.2) lwidth(thick)) /// 1 "JOHN"
> (line DayCfrMeRaA01S00 date, sort lcolor(red)) /// 2 "DELP"
> (line infection_fatality_A02S01 date, sort lcolor(black)) /// 3 "IHME"
> if date >= td(01jan2020) ///
> , xtitle(Date) xlabel(#$monthspast01jan2020merge, format(%tdYY-NN-DD) labsize(small)) xlabel(, grid) ///
> xlabel(, angle(forty_five)) ylabel(, format(%12.0fc) labsize(small))  ylabel(, labsize(small) angle(horizontal)) ///
> ytitle(Daily CFR or IFR) title("COVID-19 daily CFR or IFR, $country", size(medium)) /// 
> xscale(lwidth(vthin) lcolor(gray*.2)) yscale(lwidth(vthin) lcolor(gray*.2)) legend(region(lcolor(none))) legend(bexpand) ///
> legend(order(1 "JOHN CFR" 2 "DELP CFR" 3 "IHME IFR") size(small) row(2)) ///
> subtitle("reference scenarios", size(small) color(white))
{res}{txt}
{com}. 
. graph save "graph 51 COVID-19 daily CFR, $country, reference scenarios, all time.gph", replace
{res}{txt}(file graph 51 COVID-19 daily CFR, Iran, reference scenarios, all time.gph saved)

{com}. graph export "graph 51 COVID-19 daily CFR, $country, reference scenarios, all time.pdf", replace
{txt}(file /Users/farshadpourmalek/Downloads/covir2-main/20220204/code/merge/graph 51 COVID-19 daily CFR, Iran, reference scenarios, all time.pdf written in PDF format)

{com}. 
. 
. 
. ****
. * cfr all studies, reference scenarios, 2021
. 
. twoway ///
> (line DayCfrMeRaA00S00 date, sort lcolor(cyan*1.2) lwidth(thick)) /// 1 "JOHN"
> (line DayCfrMeRaA01S00 date, sort lcolor(red)) /// 2 "DELP"
> (line infection_fatality_A02S01 date, sort lcolor(black)) /// 3 "IHME"
> if date >= td(01jan2021) ///
> , xtitle(Date) xlabel(#$monthspast01jan2021merge, format(%tdYY-NN-DD) labsize(small)) xlabel(, grid) ///
> xlabel(, angle(forty_five)) ylabel(, format(%12.0fc) labsize(small))  ylabel(, labsize(small) angle(horizontal)) ///
> ytitle(Daily CFR or IFR) title("COVID-19 daily CFR or IFR, $country", size(medium)) /// 
> xscale(lwidth(vthin) lcolor(gray*.2)) yscale(lwidth(vthin) lcolor(gray*.2)) legend(region(lcolor(none))) legend(bexpand) ///
> legend(order(1 "JOHN CFR" 2 "DELP CFR" 3 "IHME IFR") size(small) row(2)) ///
> subtitle("2021 on, reference scenarios", size(small))
{res}{txt}
{com}. 
. graph save "graph 52 COVID-19 daily CFR, $country, reference scenarios.gph", replace
{res}{txt}(file graph 52 COVID-19 daily CFR, Iran, reference scenarios.gph saved)

{com}. graph export "graph 52 COVID-19 daily CFR, $country, reference scenarios.pdf", replace
{txt}(file /Users/farshadpourmalek/Downloads/covir2-main/20220204/code/merge/graph 52 COVID-19 daily CFR, Iran, reference scenarios.pdf written in PDF format)

{com}. 
. 
. 
. 
. 
. ************************
. 
. * other outcomes (graph numbers start with 71)
. 
. 
. * all hospital-related outcomes, all time
. 
. twoway ///
> (line DayHosMeRaA01S00 date, sort lcolor(red) lwidth(thick)) /// 1 DELP Hospitalized (Daily Cases Active Hospitalized Mean DELP S0)
> (line DayVenMeRaA01S00 date, sort lcolor(red) lpattern(dash)  lwidth(thick)) /// 2 DELP Ventilated (Daily Cases Active Ventilated Mean DELP S0)
> (line DayBedMeSmA02S01 date, sort lcolor(black)) /// 3 IHME Bed need (Daily Beds needed Mean IHME S1)
> (line DayIcuMeSmA02S01 date, sort lcolor(green)) /// 4 IHME ICU need (Daily ICU beds needed Mean IHME S1)
> (line DayAdmMeSmA02S01 date, sort lcolor(yellow)) /// 5 IHME Admissions (Daily hospital admissions Mean IHME S1)
> if date >= td(01jan2020) ///
> , xtitle(Date) xlabel(#$monthspast01jan2020merge, format(%tdYY-NN-DD) labsize(small)) xlabel(, grid) ///
> xlabel(, angle(forty_five)) ylabel(, format(%9.0fc) labsize(small))  ylabel(, labsize(small) angle(horizontal)) ///
> ytitle(Daily outcomes) title("COVID-19 daily hospital-related outcomes $country", size(medium)) ///
> xscale(lwidth(vthin) lcolor(gray*.2)) yscale(lwidth(vthin) lcolor(gray*.2)) legend(region(lcolor(none))) legend(bexpand) ///
> legend(order(1 "DELP Hospitalized" 2 "DELP Ventilated" 3 "IHME Bed need" 4 "IHME ICU need" ///
> 5 "IHME Admissions") rows(4) size(small)) ///
> subtitle("reference scenarios", size(small) color(white)) xline(22424, lcolor(red) lwidth(thick))  ///
> note("- Red line: 20210424 online meeting; The estimated probability, timing, dimensions, drivers, and preventive measures of" ///
> "    the FIFTH wave and Delta were discussed with MOH.", size(vsmall))
{res}{txt}
{com}. 
. graph save "graph 71a COVID-19 hospital-related outcomes, all time.gph", replace
{res}{txt}(file graph 71a COVID-19 hospital-related outcomes, all time.gph saved)

{com}. graph export "graph 71a COVID-19 hospital-related outcomes, all time.pdf", replace
{txt}(file /Users/farshadpourmalek/Downloads/covir2-main/20220204/code/merge/graph 71a COVID-19 hospital-related outcomes, all time.pdf written in PDF format)

{com}. 
. 
. 
. 
. 
. * all hospital-related outcomes, all time
. 
. twoway ///
> (line DayHosMeRaA01S00 date, sort lcolor(red) lwidth(thick)) /// 1 DELP Hospitalized (Daily Cases Active Hospitalized Mean DELP S0)
> (line DayVenMeRaA01S00 date, sort lcolor(red) lpattern(dash)  lwidth(thick)) /// 2 DELP Ventilated (Daily Cases Active Ventilated Mean DELP S0)
> (line DayBedMeSmA02S01 date, sort lcolor(black)) /// 3 IHME Bed need (Daily Beds needed Mean IHME S1)
> (line DayIcuMeSmA02S01 date, sort lcolor(green)) /// 4 IHME ICU need (Daily ICU beds needed Mean IHME S1)
> (line DayAdmMeSmA02S01 date, sort lcolor(yellow)) /// 5 IHME Admissions (Daily hospital admissions Mean IHME S1)
> (line DayBEDMeSmA02    date, sort lcolor(black) lpattern(dash)) /// 6
> (line DayICUMeSmA02    date, sort lcolor(cyan) lpattern(dash)) /// 7
> if date >= td(01jan2020) ///
> , xtitle(Date) xlabel(#$monthspast01jan2020merge, format(%tdYY-NN-DD) labsize(small)) xlabel(, grid) ///
> xlabel(, angle(forty_five)) ylabel(, format(%9.0fc) labsize(small))  ylabel(, labsize(small) angle(horizontal)) ///
> ytitle(Daily outcomes) title("COVID-19 daily hospital-related outcomes $country", size(medium)) ///
> xscale(lwidth(vthin) lcolor(gray*.2)) yscale(lwidth(vthin) lcolor(gray*.2)) legend(region(lcolor(none))) legend(bexpand) ///
> legend(order(1 "DELP Hospitalized" 2 "DELP Ventilated" 3 "IHME Bed need" 4 "IHME ICU need" ///
> 5 "IHME Admissions" ///
> 6 "IHME All bed capcity" 7 "IHME ICU bed capacity") rows(4) size(small)) ///
> subtitle("reference scenarios", size(small) color(white)) xline(22424, lcolor(red) lwidth(thick))  ///
> note("- Red line: 20210424 online meeting; The estimated probability, timing, dimensions, drivers, and preventive measures of" ///
> "    the FIFTH wave and Delta were discussed with MOH.", size(vsmall))
{res}{txt}
{com}. 
. graph save "graph 71b COVID-19 hospital-related outcomes, all time.gph", replace
{res}{txt}(file graph 71b COVID-19 hospital-related outcomes, all time.gph saved)

{com}. graph export "graph 71b COVID-19 hospital-related outcomes, all time.pdf", replace
{txt}(file /Users/farshadpourmalek/Downloads/covir2-main/20220204/code/merge/graph 71b COVID-19 hospital-related outcomes, all time.pdf written in PDF format)

{com}. 
. 
. 
. 
. 
. 
. * daily hospital-related outcomes, DELP, IHME, wo IHME Bed need
. 
. twoway ///
> (line DayHosMeRaA01S00 date, sort lcolor(red) lwidth(thick)) /// 1 DELP Hospitalized (Daily Cases Active Hospitalized Mean DELP S0)
> (line DayVenMeRaA01S00 date, sort lcolor(red) lpattern(dash)  lwidth(thick)) /// 2 DELP Ventilated (Daily Cases Active Ventilated Mean DELP S0)
> (line DayIcuMeSmA02S01 date, sort lcolor(green)) /// 3 IHME ICU need (Daily ICU beds needed Mean IHME S1)
> (line DayAdmMeSmA02S01 date, sort lcolor(yellow)) /// 4 IHME Admissions (Daily hospital admissions Mean IHME S1)
> (line DayICUMeSmA02    date, sort lcolor(cyan) lpattern(dash)) /// 5
> if date >= td(01jan2021) ///
> , xtitle(Date) xlabel(#$monthspast01jan2021merge, format(%tdYY-NN-DD) labsize(small)) xlabel(, grid) ///
> xlabel(, angle(forty_five)) ylabel(, format(%9.0fc) labsize(small))  ylabel(, labsize(small) angle(horizontal)) ///
> ytitle(Daily outcomes) title("COVID-19 daily hospital-related outcomes $country", size(medium)) ///
> xscale(lwidth(vthin) lcolor(gray*.2)) yscale(lwidth(vthin) lcolor(gray*.2)) legend(region(lcolor(none))) legend(bexpand) ///
> legend(order(1 "DELP Hospitalized" 2 "DELP Ventilated" 3 "IHME ICU need" ///
> 4 "IHME Admissions" 5 "IHME All bed capcity") rows(3) size(small)) ///
> subtitle("2021 on, without IHME Bed need, reference scenarios", size(small)) xline(22424, lcolor(red) lwidth(thick))  ///
> note("- Uncertainty limits: dashed curves." ///
> "- Red line: 20210424 online meeting; The estimated probability, timing, dimensions, drivers, and preventive measures of" ///
> "    the FIFTH wave and Delta were discussed with MOH.", size(vsmall))
{res}{txt}
{com}. 
. graph save "graph 72 COVID-19 hospital-related outcomes, wo extremes, 2021.gph", replace
{res}{txt}(file graph 72 COVID-19 hospital-related outcomes, wo extremes, 2021.gph saved)

{com}. graph export "graph 72 COVID-19 hospital-related outcomes, wo extremes, 2021.pdf", replace
{txt}(file /Users/farshadpourmalek/Downloads/covir2-main/20220204/code/merge/graph 72 COVID-19 hospital-related outcomes, wo extremes, 2021.pdf written in PDF format)

{com}. 
. 
. 
. *******************************
. 
. * daily cases to deaths (CTD) 
. 
. 
. ****
. * Daily cases or infections to deaths (CTD / ITD) all studies, reference scenarios, all time
. 
. twoway ///
> (line DayCTDMeRaA00S00 date, sort lcolor(cyan*1.2) lwidth(vthick)) /// 1 "JOHN"
> (line DayCTDMeRaA01S00 date, sort lcolor(red)) /// 2 "DELP"
> (line DayITDMeRaA02S01 date, sort lcolor(black)) /// 3 "IHME"
> if date >= td(01jan2020) ///
> , xtitle(Date) xlabel(#$monthspast01jan2020merge, format(%tdYY-NN-DD) labsize(small)) xlabel(, grid) ///
> xlabel(, angle(forty_five)) ylabel(, format(%12.0fc) labsize(small))  ylabel(, labsize(small) angle(horizontal)) ///
> ytitle(Daily cases or infections to deaths) title("COVID-19 daily cases or infections, to deaths, $country", size(medium)) /// 
> xscale(lwidth(vthin) lcolor(gray*.2)) yscale(lwidth(vthin) lcolor(gray*.2) titlegap(2)) legend(region(lcolor(none))) legend(bexpand) ///
> legend(order(1 "JOHN cases" 2 "DELP cases" 3 "IHME infections") size(small) row(2)) ///
> subtitle("reference scenarios", size(small))
{res}{txt}
{com}. 
. graph save "graph 81 COVID-19 daily cases to deaths, $country, reference scenarios, all time.gph", replace
{res}{txt}(file graph 81 COVID-19 daily cases to deaths, Iran, reference scenarios, all time.gph saved)

{com}. graph export "graph 81 COVID-19 daily cases to deaths, $country, reference scenarios, all time.pdf", replace
{txt}(file /Users/farshadpourmalek/Downloads/covir2-main/20220204/code/merge/graph 81 COVID-19 daily cases to deaths, Iran, reference scenarios, all time.pdf written in PDF format)

{com}. 
. 
. 
. ****
. * Daily cases or infections to deaths (CTD / ITD) all studies, reference scenarios, 2021
. 
. twoway ///
> (line DayCTDMeRaA00S00 date, sort lcolor(cyan*1.2) lwidth(thick)) /// 1 "JOHN"
> (line DayCTDMeRaA01S00 date, sort lcolor(red)) /// 2 "DELP"
> (line DayITDMeRaA02S01 date, sort lcolor(black)) /// 3 "IHME"
> if date >= td(01jan2021) ///
> , xtitle(Date) xlabel(#$monthspast01jan2021merge, format(%tdYY-NN-DD) labsize(small)) xlabel(, grid) ///
> xlabel(, angle(forty_five)) ylabel(, format(%12.0fc) labsize(small))  ylabel(, labsize(small) angle(horizontal)) ///
> ytitle(Daily cases or infections to deaths) title("COVID-19 daily cases or infections, to deaths, $country", size(medium)) /// 
> xscale(lwidth(vthin) lcolor(gray*.2)) yscale(lwidth(vthin) lcolor(gray*.2) titlegap(2)) legend(region(lcolor(none))) legend(bexpand) ///
> legend(order(1 "JOHN cases" 2 "DELP cases" 3 "IHME infections") size(small) row(2)) ///
> subtitle("2021 on, reference scenarios", size(small))
{res}{txt}
{com}. 
. graph save "graph 82 COVID-19 daily cases to deaths, $country, reference scenarios.gph", replace
{res}{txt}(file graph 82 COVID-19 daily cases to deaths, Iran, reference scenarios.gph saved)

{com}. graph export "graph 82 COVID-19 daily cases to deaths, $country, reference scenarios.pdf", replace
{txt}(file /Users/farshadpourmalek/Downloads/covir2-main/20220204/code/merge/graph 82 COVID-19 daily cases to deaths, Iran, reference scenarios.pdf written in PDF format)

{com}. 
. 
. 
. ****
. * Total cases to deaths (CTD / ITD) all studies, all time, reference scenarios, all time
. 
. twoway ///
> (line TotCTDMeRaA00S00 date, sort lcolor(cyan*1.2) lwidth(vthick)) /// 1 "JOHN"
> (line TotCTDMeRaA01S00 date, sort lcolor(red)) /// 2 "DELP"
> (line TotITDMeRaA02S01 date, sort lcolor(black)) /// 3 "IHME"
> if date >= td(01jan2020) ///
> , xtitle(Date) xlabel(#$monthspast01jan2020merge, format(%tdYY-NN-DD) labsize(small)) xlabel(, grid) ///
> xlabel(, angle(forty_five)) ylabel(, format(%12.0fc) labsize(small))  ylabel(, labsize(small) angle(horizontal)) ///
> ytitle(Total cases or infections to deaths) title("COVID-19 total cases or infections, to deaths, $country", size(medium)) /// 
> xscale(lwidth(vthin) lcolor(gray*.2)) yscale(lwidth(vthin) lcolor(gray*.2) titlegap(2)) legend(region(lcolor(none))) legend(bexpand) ///
> legend(order(1 "JOHN cases" 2 "DELP cases" 3 "IHME infections") size(small) row(2)) ///
> subtitle("reference scenarios", size(small))
{res}{txt}
{com}. 
. graph save "graph 83 COVID-19 total cases to deaths, $country, reference scenarios, all time.gph", replace
{res}{txt}(file graph 83 COVID-19 total cases to deaths, Iran, reference scenarios, all time.gph saved)

{com}. graph export "graph 83 COVID-19 total cases to deaths, $country, reference scenarios, all time.pdf", replace
{txt}(file /Users/farshadpourmalek/Downloads/covir2-main/20220204/code/merge/graph 83 COVID-19 total cases to deaths, Iran, reference scenarios, all time.pdf written in PDF format)

{com}. 
. 
. 
. ****
. * Total cases to deaths (CTD / ITD) all studies, reference scenarios, 2021
. 
. twoway ///
> (line TotCTDMeRaA00S00 date, sort lcolor(cyan*1.2) lwidth(vthick)) /// 1 "JOHN"
> (line TotCTDMeRaA01S00 date, sort lcolor(red)) /// 2 "DELP"
> (line TotITDMeRaA02S01 date, sort lcolor(black)) /// 3 "IHME"
> if date >= td(01jan2021) ///
> , xtitle(Date) xlabel(#$monthspast01jan2021merge, format(%tdYY-NN-DD) labsize(small)) xlabel(, grid) ///
> xlabel(, angle(forty_five)) ylabel(, format(%12.0fc) labsize(small))  ylabel(, labsize(small) angle(horizontal)) ///
> ytitle(Total cases or infections to deaths) title("COVID-19 total cases or infections, to deaths, $country", size(medium)) /// 
> xscale(lwidth(vthin) lcolor(gray*.2)) yscale(lwidth(vthin) lcolor(gray*.2) titlegap(2)) legend(region(lcolor(none))) legend(bexpand) ///
> legend(order(1 "JOHN cases" 2 "DELP cases" 3 "IHME infections") size(small) row(2)) ///
> subtitle("2021 on, reference scenarios", size(small))
{res}{txt}
{com}. 
. graph save "graph 84 COVID-19 total cases to deaths, $country, reference scenarios.gph", replace
{res}{txt}(file graph 84 COVID-19 total cases to deaths, Iran, reference scenarios.gph saved)

{com}. graph export "graph 84 COVID-19 total cases to deaths, $country, reference scenarios.pdf", replace
{txt}(file /Users/farshadpourmalek/Downloads/covir2-main/20220204/code/merge/graph 84 COVID-19 total cases to deaths, Iran, reference scenarios.pdf written in PDF format)

{com}. 
. 
. 
. 
. *******************************
. 
. *  estimated to reported (graph numbers start with 91)
. 
. 
. * daily deaths estimated to reported  
. 
. 
. ****
. * daily deaths estimated to reported (DER) all studies, reference scenarios, all time
. 
. twoway ///
> (line DayDERMeRaA00S00 date, sort lcolor(cyan*1.2) lwidth(vthick)) /// 1 "JOHN"
> (line DayDERMeRaA01S00 date, sort lcolor(red)) /// 2 "DELP"
> (line DayDERMeRaA02S01 date, sort lcolor(black)) /// 3 "IHME"
> if date >= td(01jan2020) ///
> , xtitle(Date) xlabel(#$monthspast01jan2020merge, format(%tdYY-NN-DD) labsize(small)) xlabel(, grid) ///
> xlabel(, angle(forty_five)) ylabel(, format(%12.0fc) labsize(small))  ylabel(, labsize(small) angle(horizontal)) ///
> ytitle(Daily deaths estimated to reported) title("COVID-19 daily deaths, estimated to reported, $country", size(medium)) /// 
> xscale(lwidth(vthin) lcolor(gray*.2)) yscale(lwidth(vthin) lcolor(gray*.2) titlegap(2)) legend(region(lcolor(none))) legend(bexpand) ///
> legend(order(1 "JOHN" 2 "DELP" 3 "IHME") size(small) row(1)) ///
> subtitle("reference scenarios", size(small))
{res}{txt}
{com}. 
. graph save "graph 91 COVID-19 daily deaths estimated to reported, $country, reference scenarios, all time.gph", replace
{res}{txt}(file graph 91 COVID-19 daily deaths estimated to reported, Iran, reference scenarios, all time.gph saved)

{com}. graph export "graph 91 COVID-19 daily deaths estimated to reported, $country, reference scenarios, all time.pdf", replace
{txt}(file /Users/farshadpourmalek/Downloads/covir2-main/20220204/code/merge/graph 91 COVID-19 daily deaths estimated to reported, Iran, reference scenarios, all time.pdf written in PDF format)

{com}. 
. 
. 
. ****
. * daily deaths estimated to reported (DER) all studies, reference scenarios, 2021
. 
. twoway ///
> (line DayDERMeRaA00S00 date, sort lcolor(cyan*1.2) lwidth(vthick)) /// 1 "JOHN"
> (line DayDERMeRaA01S00 date, sort lcolor(red)) /// 2 "DELP"
> (line DayDERMeRaA02S01 date, sort lcolor(black)) /// 3 "IHME"
> if date >= td(01jan2021) ///
> , xtitle(Date) xlabel(#$monthspast01jan2021merge, format(%tdYY-NN-DD) labsize(small)) xlabel(, grid) ///
> xlabel(, angle(forty_five)) ylabel(, format(%12.1fc) labsize(small))  ylabel(, labsize(small) angle(horizontal)) ///
> ytitle(Daily deaths estimated to reported) title("COVID-19 daily deaths, estimated to reported, $country", size(medium)) /// 
> xscale(lwidth(vthin) lcolor(gray*.2)) yscale(lwidth(vthin) lcolor(gray*.2) titlegap(2)) legend(region(lcolor(none))) legend(bexpand) ///
> legend(order(1 "JOHN" 2 "DELP" 3 "IHME") size(small) row(1)) ///
> subtitle("reference scenarios", size(small))
{res}{txt}
{com}. 
. graph save "graph 92 COVID-19 daily deaths estimated to reported, $country, reference scenarios.gph", replace
{res}{txt}(file graph 92 COVID-19 daily deaths estimated to reported, Iran, reference scenarios.gph saved)

{com}. graph export "graph 92 COVID-19 daily deaths estimated to reported, $country, reference scenarios.pdf", replace
{txt}(file /Users/farshadpourmalek/Downloads/covir2-main/20220204/code/merge/graph 92 COVID-19 daily deaths estimated to reported, Iran, reference scenarios.pdf written in PDF format)

{com}. 
. 
. 
. * daily cases or infections estimated to reported cases
. 
. 
. ****
. * daily cases or infections estimated to reported cases (CER / IER) all studies, reference scenarios, all time 
. 
. twoway ///
> (line DayCERMeRaA00S00 date, sort lcolor(cyan*1.2) lwidth(vthick)) /// 1 "JOHN"
> (line DayCERMeRaA01S00 date, sort lcolor(red)) /// 2 "DELP"
> (line DayIERMeRaA02S01 date, sort lcolor(black)) /// 3 "IHME"
> if date >= td(01jan2020) ///
> , xtitle(Date) xlabel(#$monthspast01jan2020merge, format(%tdYY-NN-DD) labsize(small)) xlabel(, grid) ///
> xlabel(, angle(forty_five)) ylabel(, format(%12.0fc) labsize(small))  ylabel(, labsize(small) angle(horizontal)) ///
> ytitle(Daily cases or infections estimated to reported) title("COVID-19 daily cases estimated to reported, $country", size(medium)) /// 
> xscale(lwidth(vthin) lcolor(gray*.2)) yscale(lwidth(vthin) lcolor(gray*.2) titlegap(3)) legend(region(lcolor(none))) legend(bexpand) ///
> legend(order(1 "JOHN cases" 2 "DELP cases" 3 "IHME infections") size(small) row(2)) ///
> subtitle("daily cases or infections estimated, to reported cases; reference scenarios", size(small))
{res}{txt}
{com}. 
. graph save "graph 93 COVID-19 daily cases estimated to reported, $country, reference scenarios, all time .gph", replace
{res}{txt}(file graph 93 COVID-19 daily cases estimated to reported, Iran, reference scenarios, all time .gph saved)

{com}. graph export "graph 93 COVID-19 daily cases estimated to reported, $country, reference scenarios, all time .pdf", replace
{txt}(file /Users/farshadpourmalek/Downloads/covir2-main/20220204/code/merge/graph 93 COVID-19 daily cases estimated to reported, Iran, reference scenarios, all time .pdf written in PDF format)

{com}. 
. 
. 
. ****
. * daily cases or infections estimated to reported cases (CER / IER) all studies, 2021-01-01 on, reference scenarios
. 
. twoway ///
> (line DayCERMeRaA00S00 date, sort lcolor(cyan*1.2) lwidth(vthick)) /// 1 "JOHN"
> (line DayCERMeRaA01S00 date, sort lcolor(red)) /// 2 "DELP"
> (line DayIERMeRaA02S01 date, sort lcolor(black)) /// 3 "IHME"
> if date >= td(01jan2021) ///
> , xtitle(Date) xlabel(#$monthspast01jan2021merge, format(%tdYY-NN-DD) labsize(small)) xlabel(, grid) ///
> xlabel(, angle(forty_five)) ylabel(, format(%12.0fc) labsize(small))  ylabel(, labsize(small) angle(horizontal)) ///
> ytitle(Daily cases or infections estimated to reported) title("COVID-19 daily cases estimated to reported, $country", size(medium)) /// 
> xscale(lwidth(vthin) lcolor(gray*.2)) yscale(lwidth(vthin) lcolor(gray*.2) titlegap(3)) legend(region(lcolor(none))) legend(bexpand) ///
> legend(order(1 "JOHN cases" 2 "DELP cases" 3 "IHME infections") size(small) row(2)) ///
> subtitle("daily cases or infections estimated, to reported cases; reference scenarios", size(small))
{res}{txt}
{com}. 
. graph save "graph 94 COVID-19 daily cases estimated to reported, $country, reference scenarios.gph", replace
{res}{txt}(file graph 94 COVID-19 daily cases estimated to reported, Iran, reference scenarios.gph saved)

{com}. graph export "graph 94 COVID-19 daily cases estimated to reported, $country, reference scenarios.pdf", replace
{txt}(file /Users/farshadpourmalek/Downloads/covir2-main/20220204/code/merge/graph 94 COVID-19 daily cases estimated to reported, Iran, reference scenarios.pdf written in PDF format)

{com}. 
. 
. 
. ****
. * total deaths estimated to reported (DER) all studies, reference scenarios, all time
. 
. twoway ///
> (line TotDERMeRaA00S00 date, sort lcolor(cyan*1.2) lwidth(vthick)) /// 1 "JOHN
> (line TotDERMeRaA01S00 date, sort lcolor(red)) /// 2 "DELP"
> (line TotDERMeRaA02S01 date, sort lcolor(black)) /// 3 "IHME"
> if date >= td(01jan2020) ///
> , xtitle(Date) xlabel(#$monthspast01jan2020merge, format(%tdYY-NN-DD) labsize(small)) xlabel(, grid) ///
> xlabel(, angle(forty_five)) ylabel(, format(%12.0fc) labsize(small))  ylabel(, labsize(small) angle(horizontal)) ///
> ytitle(Total deaths estimated to reported) title("COVID-19 total deaths, estimated to reported, $country", size(medium)) /// 
> xscale(lwidth(vthin) lcolor(gray*.2)) yscale(lwidth(vthin) lcolor(gray*.2) titlegap(5)) legend(region(lcolor(none))) legend(bexpand) ///
> legend(order(1 "JOHN" 2 "DELP" 3 "IHME") size(small) row(1)) ///
> subtitle("reference scenarios", size(small))
{res}{txt}
{com}. 
. graph save "graph 95 COVID-19 total deaths estimated to reported, $country, reference scenarios, all time.gph", replace
{res}{txt}(file graph 95 COVID-19 total deaths estimated to reported, Iran, reference scenarios, all time.gph saved)

{com}. graph export "graph 95 COVID-19 total deaths estimated to reported, $country, reference scenarios, all time.pdf", replace
{txt}(file /Users/farshadpourmalek/Downloads/covir2-main/20220204/code/merge/graph 95 COVID-19 total deaths estimated to reported, Iran, reference scenarios, all time.pdf written in PDF format)

{com}. 
. 
. 
. ****
. * total deaths estimated to reported (DER) all studies, reference scenarios, 2021
. 
. twoway ///
> (line TotDERMeRaA00S00 date, sort lcolor(cyan*1.2) lwidth(vthick)) /// 1 "JOHN
> (line TotDERMeRaA01S00 date, sort lcolor(red)) /// 2 "DELP"
> (line TotDERMeRaA02S01 date, sort lcolor(black)) /// 3 "IHME"
> if date >= td(01jan2021) ///
> , xtitle(Date) xlabel(#$monthspast01jan2021merge, format(%tdYY-NN-DD) labsize(small)) xlabel(, grid) ///
> xlabel(, angle(forty_five)) ylabel(, format(%12.2fc) labsize(small))  ylabel(, labsize(small) angle(horizontal)) ///
> ytitle(Total deaths estimated to reported) title("COVID-19 total deaths, estimated to reported, $country", size(medium)) /// 
> xscale(lwidth(vthin) lcolor(gray*.2)) yscale(lwidth(vthin) lcolor(gray*.2) titlegap(5)) legend(region(lcolor(none))) legend(bexpand) ///
> legend(order(1 "JOHN" 2 "DELP" 3 "IHME") size(small) row(1)) ///
> subtitle("reference scenarios", size(small))
{res}{txt}
{com}. 
. graph save "graph 96 COVID-19 total deaths estimated to reported, $country, reference scenarios.gph", replace
{res}{txt}(file graph 96 COVID-19 total deaths estimated to reported, Iran, reference scenarios.gph saved)

{com}. graph export "graph 96 COVID-19 total deaths estimated to reported, $country, reference scenarios.pdf", replace
{txt}(file /Users/farshadpourmalek/Downloads/covir2-main/20220204/code/merge/graph 96 COVID-19 total deaths estimated to reported, Iran, reference scenarios.pdf written in PDF format)

{com}. 
. 
. 
. ****
. * total cases or infections or infections estimated to reported cases (CER / IER) all studies, reference scenarios, all time
. 
. twoway ///
> (line TotCERMeRaA00S00 date, sort lcolor(cyan*1.2) lwidth(vthick)) /// 1 "JOHN"
> (line TotCERMeRaA01S00 date, sort lcolor(red)) /// 2 "DELP"
> (line TotIERMeRaA02S01 date, sort lcolor(black)) /// 3 "IHME"
> if date >= td(01jan2020) ///
> , xtitle(Date) xlabel(#$monthspast01jan2020merge, format(%tdYY-NN-DD) labsize(small)) xlabel(, grid) ///
> xlabel(, angle(forty_five)) ylabel(, format(%12.0fc) labsize(small))  ylabel(, labsize(small) angle(horizontal)) ///
> ytitle(Total cases or infections estimated to reported) title("COVID-19 total cases estimated to reported, $country", size(medium)) /// 
> xscale(lwidth(vthin) lcolor(gray*.2)) yscale(lwidth(vthin) lcolor(gray*.2) titlegap(5)) legend(region(lcolor(none))) legend(bexpand) ///
> legend(order(1 "JOHN cases" 2 "DELP cases" 3 "IHME infections") size(small) row(2)) ///
> subtitle("total cases or infections estimated, to reported cases; reference scenarios", size(small))
{res}{txt}
{com}. 
. graph save "graph 97 COVID-19 total cases estimated to reported, $country, reference scenarios.gph", replace
{res}{txt}(file graph 97 COVID-19 total cases estimated to reported, Iran, reference scenarios.gph saved)

{com}. graph export "graph 97 COVID-19 total cases estimated to reported, $country, reference scenarios.pdf", replace
{txt}(file /Users/farshadpourmalek/Downloads/covir2-main/20220204/code/merge/graph 97 COVID-19 total cases estimated to reported, Iran, reference scenarios.pdf written in PDF format)

{com}. 
. 
. 
. ****
. * total cases or infections or infections estimated to reported cases (CER / IER) all studies, reference scenarios, 2021
. 
. twoway ///
> (line TotCERMeRaA00S00 date, sort lcolor(cyan*1.2) lwidth(vthick)) /// 1 "JOHN"
> (line TotCERMeRaA01S00 date, sort lcolor(red)) /// 2 "DELP"
> (line TotIERMeRaA02S01 date, sort lcolor(black)) /// 3 "IHME"
> if date >= td(01jan2021) ///
> , xtitle(Date) xlabel(#$monthspast01jan2021merge, format(%tdYY-NN-DD) labsize(small)) xlabel(, grid) ///
> xlabel(, angle(forty_five)) ylabel(, format(%12.0fc) labsize(small))  ylabel(, labsize(small) angle(horizontal)) ///
> ytitle(Total cases or infections estimated to reported) title("COVID-19 total cases estimated to reported, $country", size(medium)) /// 
> xscale(lwidth(vthin) lcolor(gray*.2)) yscale(lwidth(vthin) lcolor(gray*.2) titlegap(5)) legend(region(lcolor(none))) legend(bexpand) ///
> legend(order(1 "JOHN cases" 2 "DELP cases" 3 "IHME infections") size(small) row(2)) ///
> subtitle("total cases or infections estimated, to reported cases; reference scenarios", size(small))
{res}{txt}
{com}. 
. graph save "graph 98 COVID-19 total cases estimated to reported, $country, reference scenarios.gph", replace
{res}{txt}(file graph 98 COVID-19 total cases estimated to reported, Iran, reference scenarios.gph saved)

{com}. graph export "graph 98 COVID-19 total cases estimated to reported, $country, reference scenarios.pdf", replace
{txt}(file /Users/farshadpourmalek/Downloads/covir2-main/20220204/code/merge/graph 98 COVID-19 total cases estimated to reported, Iran, reference scenarios.pdf written in PDF format)

{com}. 
. 
. 
. 
. 
. 
. *****************
. 
. * IHME graphs
. 
. 
. 
. * R effective, 01jun2021 on
. 
. twoway ///
> (line reff_mean_A02S02 date, sort lcolor(green) lwidth(thick)) ///
> (line reff_mean_A02S01 date, sort lcolor(black) lwidth(thick)) ///
> (line reff_lower_A02S01 date, sort lcolor(black*.5) lpattern(dash)) ///
> (line reff_upper_A02S01 date, sort lcolor(black*.5) lpattern(dash)) ///
> if date >= td(01jun2021) ///
> , xtitle(Date) xlabel(#6, format(%tdYY-NN-DD) labsize(small)) xlabel(, grid) xlabel(, grid) ///
> xlabel(, angle(forty_five)) ylabel(, format(%12.1fc) labsize(small))  ylabel(, labsize(small) angle(horizontal)) ///
> ytitle(R effective) title("COVID-19 R effective, $country, IHME, 2 scenarios", size(medium)) ///
> xscale(lwidth(vthin) lcolor(gray*.2)) yscale(lwidth(vthin) lcolor(gray*.2)) legend(region(lcolor(none))) legend(bexpand) ///
> legend(order(1 "Better" 2 "Reference") rows(1)) ///
> note(Uncertainty limits: dashed curves)
{res}{txt}
{com}. 
. graph save "graph 101 COVID-19 R effective, $country, 2 scenarios 01jun2021 on.gph", replace
{res}{txt}(file graph 101 COVID-19 R effective, Iran, 2 scenarios 01jun2021 on.gph saved)

{com}. graph export "graph 101 COVID-19 R effective, $country, 2 scenarios 01jun2021 on.pdf", replace
{txt}(file /Users/farshadpourmalek/Downloads/covir2-main/20220204/code/merge/graph 101 COVID-19 R effective, Iran, 2 scenarios 01jun2021 on.pdf written in PDF format)

{com}. 
. 
. 
. 
. * daily Infection outcomes ratios, 2 scenarios 
.   
. twoway ///
> (line infection_detection_A02S01 date, sort lcolor(green)) ///
> (line infection_hospitalization_A02S01 date, sort lcolor(black)) ///
> (line infection_fatality_A02S01 date, sort lcolor(red)) ///
> (line infection_detection_A02S02 date, sort lcolor(green) lpattern(dash)) ///
> (line infection_hospitalization_A02S02 date, sort lcolor(black) lpattern(dash)) ///
> (line infection_fatality_A02S02 date, sort lcolor(red) lpattern(dash)) ///
> if date >= td(01jan2020) ///
> , xtitle(Date) xlabel(#$monthspast01jan2020merge, format(%tdYY-NN-DD) labsize(small)) xlabel(, grid) xlabel(, grid) ///
> xlabel(, angle(forty_five)) ylabel(, format(%9.2fc) labsize(small))  ylabel(, labsize(small) angle(horizontal)) ///
> ytitle(Daily infection outcome ratios) title("COVID-19 daily infection outcome ratios, $country, IHME, 2 scenarios", size(medium)) ///
> xscale(lwidth(vthin) lcolor(gray*.2)) yscale(lwidth(vthin) lcolor(gray*.2)) legend(region(lcolor(none))) legend(bexpand) ///
> legend(order(1 "Infection detection ratio" 2 "Infection hospitalization ratio" 3 "Infection fatality ratio") rows(2)) ///
> note("Better scenario: dashed curves")
{res}{txt}
{com}. 
. graph save "graph 102 COVID-19 daily Infection outcomes ratios, $country 2 scenarios, IHME.gph", replace
{res}{txt}(file graph 102 COVID-19 daily Infection outcomes ratios, Iran 2 scenarios, IHME.gph saved)

{com}. graph export "graph 102 COVID-19 daily Infection outcomes ratios, $country 2 scenarios, IHME.pdf", replace
{txt}(file /Users/farshadpourmalek/Downloads/covir2-main/20220204/code/merge/graph 102 COVID-19 daily Infection outcomes ratios, Iran 2 scenarios, IHME.pdf written in PDF format)

{com}. 
. 
. 
. 
. * daily % change in mobility, CI
. 
. twoway ///
> (line mobility_mean_A02S02 date, sort lcolor(green)) ///
> (line mobility_mean_A02S01 date, sort lcolor(black)) ///
> if date >= td(01jan2020) ///
> , xtitle(Date) xlabel(#$monthspast01jan2020merge, format(%tdYY-NN-DD) labsize(small)) xlabel(, grid) xlabel(, grid) ///
> xlabel(, angle(forty_five)) ylabel(, format(%12.1fc) labsize(small))  ylabel(, labsize(small) angle(horizontal)) ///
> ytitle(Daily % change in mobility from baseline) title("COVID-19 daily % change in mobility, $country, IHME, 2 scenarios", size(medium)) ///
> xscale(lwidth(vthin) lcolor(gray*.2)) yscale(lwidth(vthin) lcolor(gray*.2)) legend(region(lcolor(none))) legend(bexpand) ///
> legend(order(1 "Better" 2 "Reference") rows(1)) 
{res}{txt}
{com}. 
. graph save "graph 103 COVID-19 daily mobility, $country, 2 scenarios IHME.gph", replace
{res}{txt}(file graph 103 COVID-19 daily mobility, Iran, 2 scenarios IHME.gph saved)

{com}. graph export "graph 103 COVID-19 daily mobility, $country, 2 scenarios IHME.pdf", replace
{txt}(file /Users/farshadpourmalek/Downloads/covir2-main/20220204/code/merge/graph 103 COVID-19 daily mobility, Iran, 2 scenarios IHME.pdf written in PDF format)

{com}. 
. 
. 
. 
. * daily mask use Percent of population reporting always wearing a mask when leaving home
. 
. twoway ///
> (line mask_use_mean_A02S02 date, sort lcolor(green)) ///
> (line mask_use_mean_A02S01 date, sort lcolor(black)) ///
> if date >= td(01jan2020) ///
> , xtitle(Date) xlabel(#$monthspast01jan2020merge, format(%tdYY-NN-DD) labsize(small)) xlabel(, grid) xlabel(, grid) ///
> xlabel(, angle(forty_five)) ylabel(, format(%12.1fc) labsize(small))  ylabel(, labsize(small) angle(horizontal)) ///
> ytitle(Daily mask use) title("COVID-19 daily mask use, $country, IHME, 2 scenarios", size(medium)) ///
> xscale(lwidth(vthin) lcolor(gray*.2)) yscale(lwidth(vthin) lcolor(gray*.2)) legend(region(lcolor(none))) legend(bexpand) ///
> legend(order(1 "Better" 2 "Reference") rows(1)) ///
> subtitle(Percent of population reporting always wearing a mask when leaving home, size(small))
{res}{txt}
{com}. 
. graph save "graph 104 COVID-19 daily mask_use, $country, 2 scenarios IHME.gph", replace
{res}{txt}(file graph 104 COVID-19 daily mask_use, Iran, 2 scenarios IHME.gph saved)

{com}. graph export "graph 104 COVID-19 daily mask_use, $country, 2 scenarios IHME.pdf", replace
{txt}(file /Users/farshadpourmalek/Downloads/covir2-main/20220204/code/merge/graph 104 COVID-19 daily mask_use, Iran, 2 scenarios IHME.pdf written in PDF format)

{com}. 
. 
. 
. * cumulative vaccinated percent
. 
. twoway ///
> (line cumulative_all_vaccin_pct date, sort lcolor(black)) ///
> (line cumul_all_effect_vacci_pct date, sort lcolor(blue)) ///
> (line cumul_all_fully_vacci_pct date, sort lcolor(green) lwidth(thick)) ///
> if date >= td(01dec2020) ///
> , xtitle(Date) xlabel(#$monthspast01jan2021merge, format(%tdYY-NN-DD) labsize(small)) xlabel(, grid) xlabel(, grid) ///
> xlabel(, angle(forty_five)) ylabel(, format(%15.1fc) labsize(small))  ylabel(, labsize(small) angle(horizontal)) ///
> ytitle(% Cumulative vaccinated percent) title("COVID-19 cumulative vaccinated percent, $country, IHME, 2 scenarios", size(medium)) ///
> xscale(lwidth(vthin) lcolor(gray*.2)) yscale(lwidth(vthin) lcolor(gray*.2)) legend(region(lcolor(none))) legend(bexpand) ///
> legend(order(1 "Vaccinated" 2 "Effectively vaccinated" 3 "Fully vaccinated") rows(1)) ///
> note("Vaccinated: Initially vaccinated (one dose of two doses)" ///
> "Effectively vaccinated: one and two dose with efficacy" ///
> "Fully vaccinated: one of one and two of two doses", size(small))
{res}{txt}
{com}. 
. graph save "graph 105 COVID-19 cumulative vaccinated percent, $country IHME.gph", replace
{txt}(note: file graph 105 COVID-19 cumulative vaccinated percent, Iran IHME.gph not found)
{res}{txt}(file graph 105 COVID-19 cumulative vaccinated percent, Iran IHME.gph saved)

{com}. graph export "graph 105 COVID-19 cumulative vaccinated percent, $country IHME.pdf", replace
{txt}(file /Users/farshadpourmalek/Downloads/covir2-main/20220204/code/merge/graph 105 COVID-19 cumulative vaccinated percent, Iran IHME.pdf written in PDF format)

{com}. 
. 
. 
. 
. 
. * daily vaccinated percent
. 
. twoway ///
> (line daily_all_vaccin_pct date, sort lcolor(black)) ///
> (line daily_all_effect_vacci_pct date, sort lcolor(blue)) ///
> (line daily_all_fully_vacci_pct date, sort lcolor(green) lwidth(thick)) ///
> if date >= td(01dec2020) ///
> , xtitle(Date) xlabel(#$monthspast01jan2021merge, format(%tdYY-NN-DD) labsize(small)) xlabel(, grid) xlabel(, grid) ///
> xlabel(, angle(forty_five)) ylabel(, format(%15.1fc) labsize(small))  ylabel(, labsize(small) angle(horizontal)) ///
> ytitle(% Daily vaccinated percent) title("COVID-19 daily vaccinated percent, $country, IHME, 2 scenarios", size(medium)) ///
> xscale(lwidth(vthin) lcolor(gray*.2)) yscale(lwidth(vthin) lcolor(gray*.2)) legend(region(lcolor(none))) legend(bexpand) ///
> legend(order(1 "Vaccinated" 2 "Effectively vaccinated" 3 "Fully vaccinated") rows(1)) ///
> note("Vaccinated: Initially vaccinated (one dose of two doses)" ///
> "Effectively vaccinated: one and two dose with efficacy" ///
> "Fully vaccinated: one of one and two of two doses", size(small))
{res}{txt}
{com}. 
. graph save "graph 106 COVID-19 daily vaccinated percent, $country.gph", replace
{txt}(note: file graph 106 COVID-19 daily vaccinated percent, Iran.gph not found)
{res}{txt}(file graph 106 COVID-19 daily vaccinated percent, Iran.gph saved)

{com}. graph export "graph 106 COVID-19 daily vaccinated percent, $country.pdf", replace
{txt}(file /Users/farshadpourmalek/Downloads/covir2-main/20220204/code/merge/graph 106 COVID-19 daily vaccinated percent, Iran.pdf written in PDF format)

{com}. 
. 
. 
. 
. * daily vaccinated number
. 
. twoway ///
> (line daily_all_vaccinated date, sort lcolor(black)) ///
> (line daily_all_effectively_vacci date, sort lcolor(blue)) ///
> (line daily_all_fully_vaccinated date, sort lcolor(green) lwidth(thick)) ///
> if date >= td(01jan2021) ///
> , xtitle(Date) xlabel(#$monthspast01jan2021merge, format(%tdYY-NN-DD) labsize(small)) xlabel(, grid) xlabel(, grid) ///
> xlabel(, angle(forty_five)) ylabel(, format(%15.0fc) labsize(small))  ylabel(, labsize(small) angle(horizontal)) ///
> ytitle(Daily vaccinated number) title("COVID-19 daily vaccinated number, $country, IHME, 2 scenarios", size(medium)) ///
> xscale(lwidth(vthin) lcolor(gray*.2)) yscale(lwidth(vthin) lcolor(gray*.2)) legend(region(lcolor(none))) legend(bexpand) ///
> legend(order(1 "Vaccinated" 2 "Effectively vaccinated" 3 "Fully vaccinated") rows(1)) ///
> note("Vaccinated: Initially vaccinated (one dose of two doses)" ///
> "Effectively vaccinated: one and two dose with efficacy" ///
> "Fully vaccinated: one of one and two of two doses", size(small))
{res}{txt}
{com}. 
. graph save "graph 107 COVID-19 daily vaccinated number, $country.gph", replace
{txt}(note: file graph 107 COVID-19 daily vaccinated number, Iran.gph not found)
{res}{txt}(file graph 107 COVID-19 daily vaccinated number, Iran.gph saved)

{com}. graph export "graph 107 COVID-19 daily vaccinated number, $country.pdf", replace
{txt}(file /Users/farshadpourmalek/Downloads/covir2-main/20220204/code/merge/graph 107 COVID-19 daily vaccinated number, Iran.pdf written in PDF format)

{com}. 
. 
. 
. *
. 
. 
. 
. *****************       
. 
. * Calculated daily detected infections, IHME reference scenario = S1       
.            
. twoway ///
> (line DayCasMeRaA00S00 date, sort lcolor(cyan) lwidth(thick)) /// 1 JOHN
> (line DayINFDetMeSmA02S01 date, sort lcolor(red)) ///
> if date >= td(01jan2020) ///
> , xtitle(Date) xlabel(#$monthspast01jan2020merge, format(%tdYY-NN-DD) labsize(small)) xlabel(, grid) xlabel(, grid) ///
> xlabel(, angle(forty_five)) ylabel(, format(%15.0fc) labsize(small))  ylabel(, labsize(small) angle(horizontal)) ///
> ytitle(Daily outcomes) title("COVID-19 daily detected infections, $country, IHME, reference scenario", size(medium)) ///
> xscale(lwidth(vthin) lcolor(gray*.2)) yscale(lwidth(vthin) lcolor(gray*.2)) legend(region(lcolor(none))) legend(bexpand) ///    ///
> legend(order(1 "Daily cases smooth JOHN" 2 "Calculated daily detected infections IHME" ) rows(2) size(small)) ///
> note("Reference scenario = Current projection;" ///
> "Calculated daily detected infections = Daily infections * Infection detection ratio")
{res}{txt}
{com}.            
. graph save "graph 121 COVID-19 daily detected infections, $country reference scenario CI, IHME.gph", replace
{txt}(note: file graph 121 COVID-19 daily detected infections, Iran reference scenario CI, IHME.gph not found)
{res}{txt}(file graph 121 COVID-19 daily detected infections, Iran reference scenario CI, IHME.gph saved)

{com}. graph export "graph 121 COVID-19 daily detected infections, $country reference scenario CI, IHME.pdf", replace
{txt}(file /Users/farshadpourmalek/Downloads/covir2-main/20220204/code/merge/graph 121 COVID-19 daily detected infections, Iran reference scenario CI, IHME.pdf written in PDF format)

{com}. 
. 
. 
. 
. 
. *****************       
. 
. * Calculated daily hospitalized infections, IHME reference scenario = S1           
.            
. twoway ///         
> (line DayAdmMeSmA02S01 date, sort lcolor(black)) ///
> (line DayINFHosMeSmA02S01 date, sort lcolor(red)) ///
> if date >= td(01jan2020) ///
> , xtitle(Date) xlabel(#$monthspast01jan2020merge, format(%tdYY-NN-DD) labsize(small)) xlabel(, grid) xlabel(, grid) ///
> xlabel(, angle(forty_five)) ylabel(, format(%15.0fc) labsize(small))  ylabel(, labsize(small) angle(horizontal)) ///
> ytitle(Daily outcomes) title("COVID-19 daily hospitalized infections, $country, IHME, reference scenario", size(medium)) ///
> xscale(lwidth(vthin) lcolor(gray*.2)) yscale(lwidth(vthin) lcolor(gray*.2)) legend(region(lcolor(none))) legend(bexpand) ///    ///
> legend(order(1 "Daily hospital admissions" 2 "Calculated daily hospitalized infections") size(small)) ///
> note("Reference scenario = Current projection;" ///
> "Calculated daily hospitalized infections = Daily infections * Infection hospitalization ratio")
{res}{txt}
{com}.            
. graph save "graph 122 COVID-19 daily hospitalized infections, $country reference scenario CI, IHME.gph", replace
{txt}(note: file graph 122 COVID-19 daily hospitalized infections, Iran reference scenario CI, IHME.gph not found)
{res}{txt}(file graph 122 COVID-19 daily hospitalized infections, Iran reference scenario CI, IHME.gph saved)

{com}. graph export "graph 122 COVID-19 daily hospitalized infections, $country reference scenario CI, IHME.pdf", replace
{txt}(file /Users/farshadpourmalek/Downloads/covir2-main/20220204/code/merge/graph 122 COVID-19 daily hospitalized infections, Iran reference scenario CI, IHME.pdf written in PDF format)

{com}. 
. 
. 
. *****************       
. 
. * Calculated daily fatal infections, IHME reference scenario = S1          
. 
. twoway ///         
> (line DayDeaMeSmA00S00 date, sort lcolor(cyan) lwidth(vthick)) /// 1 Daily deaths smooth JOHN
> (line DayDeaMeSmA02S01 date, sort lcolor(black) lwidth(medthick)) /// 2 Daily deaths IHME
> (line DayDeXMeSmA02S01 date, sort lcolor(gold)lwidth(medthick)) /// 3 Daily excess deaths IHME
> (line DayINFFatMeSmA02S01 date, sort lcolor(red)) /// 4 Daily fatal infections IHME 
> if date >= td(01jan2020) ///
> , xtitle(Date) xlabel(#$monthspast01jan2020merge, format(%tdYY-NN-DD) labsize(small)) xlabel(, grid) xlabel(, grid) ///
> xlabel(, angle(forty_five)) ylabel(, format(%15.0fc) labsize(small))  ylabel(, labsize(small) angle(horizontal)) ///
> ytitle(Daily outcomes) title("COVID-19 daily fatal infections, $country, IHME, reference scenario", size(medium)) ///
> xscale(lwidth(vthin) lcolor(gray*.2)) yscale(lwidth(vthin) lcolor(gray*.2)) legend(region(lcolor(none))) legend(bexpand) ///    ///
> legend(order(1 "Daily deaths smooth JOHN" 2 "Daily deaths IHME" ///
> 3 "Daily excess deaths IHME" 4 "Calculated daily fatal infections IHME") rows(2) size(small)) ///
> note("Reference scenario = Current projection;" ///
> "Calculated daily fatal infections = Daily infections * Infection fatality ratio")
{res}{txt}
{com}.            
. graph save "graph 123 COVID-19 daily fatal infections, $country reference scenario CI, IHME.gph", replace
{txt}(note: file graph 123 COVID-19 daily fatal infections, Iran reference scenario CI, IHME.gph not found)
{res}{txt}(file graph 123 COVID-19 daily fatal infections, Iran reference scenario CI, IHME.gph saved)

{com}. graph export "graph 123 COVID-19 daily fatal infections, $country reference scenario CI, IHME.pdf", replace
{txt}(file /Users/farshadpourmalek/Downloads/covir2-main/20220204/code/merge/graph 123 COVID-19 daily fatal infections, Iran reference scenario CI, IHME.pdf written in PDF format)

{com}. 
. 
. 
. 
. 
. 
. 
. 
. 
. 
. 
. ************
. 
. * restore native scheme (of the local machine)
. 
. set scheme $nativescheme
{txt}
{com}. 
. di c(scheme)
{res}s2color
{txt}
{com}. 
. 
. view "log country merge.smcl"
{txt}
{com}. 
. log close
      {txt}name:  {res}<unnamed>
       {txt}log:  {res}/Users/farshadpourmalek/Downloads/covir2-main/20220204/code/merge/log country merge.smcl
  {txt}log type:  {res}smcl
 {txt}closed on:  {res} 5 Feb 2022, 19:47:06
{txt}{.-}
{smcl}
{txt}{sf}{ul off}