{smcl}
{com}{sf}{ul off}{txt}{.-}
      name:  {res}<unnamed>
       {txt}log:  {res}/Users/farshadpourmalek/Downloads/covir2-main/20220130/code/merge/log country merge.smcl
  {txt}log type:  {res}smcl
 {txt}opened on:  {res}31 Jan 2022, 00:35:46
{txt}
{com}. 
. 
. ***************************************************************************
. * This is "do country merge.do"
. 
. * Project: CovidVisualized country - countries without subnational estimates
. * Person: Farshad Pourmalek pourmalek_farshad at yahoo dot com
. * Time (initial): 2021-02-10
. 
. * OBJECTIVE: Merge component studies' estimates for country, graphs
. ***************************************************************************
. 
. 
. /* 
> 
> List of component studies:
> 
> JOHN A00
> 
> DELP A01
> IHME A02
> IMPE A03
> LANL A04 // The LANL COVID-19 Team made its last real-time forecast on September 27th, 2021. [for 20210926]. This is more than two weeks old and will not be used. 
> SRIV A05 // Some labs were much bettre with physics. 
> 
> */
. 
. 
. clear 
{txt}
{com}. 
. * JOHN
. 
. if regexm(c(os),"Mac") == 1 {c -(}
. 
.         use "$pathcovir2/JOHN/country JOHN.dta", clear 
. {c )-}
{txt}
{com}. else if regexm(c(os),"Windows") == 1 use "$pathcovir2\JOHN\country JOHN.dta", clear 
{txt}
{com}. 
. 
. label var loc_grand_name "Location"
{txt}
{com}. 
. 
. 
. *
. 
. sort date
{txt}
{com}. 
. qui compress
{txt}
{com}. 
. save "country.dta", replace
{txt}file country.dta saved

{com}. 
. export delimited using "country.csv", replace 
{res}{txt}file country.csv saved

{com}. 
. 
. *
. 
. 
. 
. 
. 
. ***************
. 
. * graphs 
. 
. 
. grstyle init
{res}{txt}
{com}. 
. grstyle color background white
{txt}
{com}. 
. 
. 
. 
. 
. 
. 
. **********
. 
. * gen monthspast vars for #thicknumber of graphs
. 
. 
. summ date

{txt}    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
{space 8}date {c |}{res}        761       22295    219.8261      21915      22675
{txt}
{com}. 
. gen mergemaxdate = r(max)
{txt}
{com}. 
. 
. gen monthspast01jan2020merge = ((mergemaxdate - td(01jan2020)) / 30) + 1
{txt}
{com}. 
. replace monthspast01jan2020merge = round(monthspast01jan2020merge)
{txt}(761 real changes made)

{com}. 
. global monthspast01jan2020merge = monthspast01jan2020merge
{txt}
{com}. 
. di $monthspast01jan2020merge
{res}26
{txt}
{com}. 
. 
. 
. gen monthspast01jan2021merge = ((mergemaxdate - td(01jan2021)) / 30) + 1
{txt}
{com}. 
. replace monthspast01jan2021merge = round(monthspast01jan2021merge)
{txt}(761 real changes made)

{com}. 
. global monthspast01jan2021merge = monthspast01jan2021merge
{txt}
{com}. 
. di $monthspast01jan2021merge
{res}14
{txt}
{com}. 
. 
. 
. gen monthspast01jan2022merge = ((mergemaxdate - td(01jan2022)) / 30) + 2
{txt}
{com}. 
. replace monthspast01jan2022merge = round(monthspast01jan2022merge)
{txt}(761 real changes made)

{com}. 
. global monthspast01jan2022merge = monthspast01jan2022merge
{txt}
{com}. 
. di $monthspast01jan2022merge
{res}3
{txt}
{com}. 
. 
. 
. 
. 
. ******************
. 
. 
. 
. * daily deaths (graph numbers start with 11)
. 
. 
. ****
. * daily deaths, JOHN, all time
. 
. twoway ///
> (line DayDeaMeSmA00S00 date, sort lcolor(cyan*1.2) lwidth(thick)) /// 1 "JOHN smooth"
> if date >= td(01jan2020) ///
> , xtitle(Date) xlabel(#$monthspast01jan2020merge, format(%tdYY-NN-DD) labsize(small)) xlabel(, grid) ///
> xlabel(, angle(forty_five)) ylabel(, format(%9.0fc) labsize(small)) ylabel(, labsize(small) angle(horizontal)) ///
> ytitle(Daily reported deaths) title("COVID-19 daily reported deaths, $country, all time", size(medium)) /// 
> xscale(lwidth(vthin) lcolor(gray*.2)) yscale(lwidth(vthin) lcolor(gray*.2)) legend(off)
{res}{txt}
{com}. 
. graph save "graph 11 COVID-19 daily deaths, $country, JOHN, all time.gph", replace
{res}{txt}(file graph 11 COVID-19 daily deaths, Iran, JOHN, all time.gph saved)

{com}. graph export "graph 11 COVID-19 daily deaths, $country, JOHN, all time.pdf", replace
{txt}(file /Users/farshadpourmalek/Downloads/covir2-main/20220130/code/merge/graph 11 COVID-19 daily deaths, Iran, JOHN, all time.pdf written in PDF format)

{com}. 
. 
. 
. ****
. * daily deaths, JOHN, 2021 on
. 
. twoway ///
> (line DayDeaMeSmA00S00 date, sort lcolor(cyan*1.2) lwidth(thick)) /// 1 "JOHN smooth"
> if date >= td(01jan2021) ///
> , xtitle(Date) xlabel(#$monthspast01jan2021merge, format(%tdYY-NN-DD) labsize(small)) xlabel(, grid) ///
> xlabel(, angle(forty_five)) ylabel(, format(%9.0fc) labsize(small)) ylabel(, labsize(small) angle(horizontal)) ///
> ytitle(Daily reported deaths) title("COVID-19 daily reported deaths, $country, 2021 on", size(medium)) /// 
> xscale(lwidth(vthin) lcolor(gray*.2)) yscale(lwidth(vthin) lcolor(gray*.2)) legend(off)
{res}{txt}
{com}. 
. graph save "graph 12 COVID-19 daily deaths, $country, JOHN, 2021.gph", replace
{res}{txt}(file graph 12 COVID-19 daily deaths, Iran, JOHN, 2021.gph saved)

{com}. graph export "graph 12 COVID-19 daily deaths, $country, JOHN, 2021.pdf", replace
{txt}(file /Users/farshadpourmalek/Downloads/covir2-main/20220130/code/merge/graph 12 COVID-19 daily deaths, Iran, JOHN, 2021.pdf written in PDF format)

{com}. 
. 
. 
. 
. ****
. * daily deaths, JOHN, recent
. 
. twoway ///
> (line DayDeaMeSmA00S00 date, sort lcolor(cyan*1.2) lwidth(thick)) /// 1 "JOHN smooth"
> if date >= td(01dec2021) ///
> , xtitle(Date) xlabel(#$monthspast01jan2022merge, format(%tdYY-NN-DD) labsize(small)) xlabel(, grid) ///
> xlabel(, angle(forty_five)) ylabel(, format(%9.0fc) labsize(small)) ylabel(, labsize(small) angle(horizontal)) ///
> ytitle(Daily reported deaths) title("COVID-19 daily reported deaths, $country, recent", size(medium)) /// 
> xscale(lwidth(vthin) lcolor(gray*.2)) yscale(lwidth(vthin) lcolor(gray*.2)) legend(off)
{res}{txt}
{com}. 
. graph save "graph 12 COVID-19 daily deaths, $country, JOHN, 2022.gph", replace
{res}{txt}(file graph 12 COVID-19 daily deaths, Iran, JOHN, 2022.gph saved)

{com}. graph export "graph 12 COVID-19 daily deaths, $country, JOHN, 2022.pdf", replace
{txt}(file /Users/farshadpourmalek/Downloads/covir2-main/20220130/code/merge/graph 12 COVID-19 daily deaths, Iran, JOHN, 2022.pdf written in PDF format)

{com}. 
. 
. 
. 
. 
. 
. 
. 
. * daily cases (graph numbers start with 21)
. 
. 
. ****
. * daily cases, JOHN, all time
. 
. twoway ///
> (line DayCasMeSmA00S00 date, sort lcolor(cyan*1.2) lwidth(thick)) /// 1 "JOHN smooth"
> if date >= td(01jan2020) ///
> , xtitle(Date) xlabel(#$monthspast01jan2020merge, format(%tdYY-NN-DD) labsize(small)) xlabel(, grid) ///
> xlabel(, angle(forty_five)) ylabel(, format(%9.0fc) labsize(small)) ylabel(, labsize(small) angle(horizontal)) ///
> ytitle(Daily reported cases) title("COVID-19 daily reported cases, $country, all time", size(medium)) /// 
> xscale(lwidth(vthin) lcolor(gray*.2)) yscale(lwidth(vthin) lcolor(gray*.2)) legend(off)
{res}{txt}
{com}. 
. graph save "graph 21 COVID-19 daily cases, $country, JOHN, all time.gph", replace
{txt}(note: file graph 21 COVID-19 daily cases, Iran, JOHN, all time.gph not found)
{res}{txt}(file graph 21 COVID-19 daily cases, Iran, JOHN, all time.gph saved)

{com}. graph export "graph 21 COVID-19 daily cases, $country, JOHN, all time.pdf", replace
{txt}(file /Users/farshadpourmalek/Downloads/covir2-main/20220130/code/merge/graph 21 COVID-19 daily cases, Iran, JOHN, all time.pdf written in PDF format)

{com}. 
. 
. 
. ****
. * daily cases, JOHN, 2021 on
. 
. twoway ///
> (line DayCasMeSmA00S00 date, sort lcolor(cyan*1.2) lwidth(thick)) /// 1 "JOHN smooth"
> if date >= td(01jan2021) ///
> , xtitle(Date) xlabel(#$monthspast01jan2021merge, format(%tdYY-NN-DD) labsize(small)) xlabel(, grid) ///
> xlabel(, angle(forty_five)) ylabel(, format(%9.0fc) labsize(small)) ylabel(, labsize(small) angle(horizontal)) ///
> ytitle(Daily reported cases) title("COVID-19 daily reported cases, $country, 2021 on", size(medium)) /// 
> xscale(lwidth(vthin) lcolor(gray*.2)) yscale(lwidth(vthin) lcolor(gray*.2)) legend(off)
{res}{txt}
{com}. 
. graph save "graph 22 COVID-19 daily cases, $country, JOHN, 2021.gph", replace
{txt}(note: file graph 22 COVID-19 daily cases, Iran, JOHN, 2021.gph not found)
{res}{txt}(file graph 22 COVID-19 daily cases, Iran, JOHN, 2021.gph saved)

{com}. graph export "graph 22 COVID-19 daily cases, $country, JOHN, 2021.pdf", replace
{txt}(file /Users/farshadpourmalek/Downloads/covir2-main/20220130/code/merge/graph 22 COVID-19 daily cases, Iran, JOHN, 2021.pdf written in PDF format)

{com}. 
. 
. 
. 
. ****
. * daily cases, JOHN, recent
. 
. twoway ///
> (line DayCasMeSmA00S00 date, sort lcolor(cyan*1.2) lwidth(thick)) /// 1 "JOHN smooth"
> if date >= td(01dec2021) ///
> , xtitle(Date) xlabel(#$monthspast01jan2022merge, format(%tdYY-NN-DD) labsize(small)) xlabel(, grid) ///
> xlabel(, angle(forty_five)) ylabel(, format(%9.0fc) labsize(small)) ylabel(, labsize(small) angle(horizontal)) ///
> ytitle(Daily reported cases) title("COVID-19 daily reported cases, $country, recent", size(medium)) /// 
> xscale(lwidth(vthin) lcolor(gray*.2)) yscale(lwidth(vthin) lcolor(gray*.2)) legend(off)
{res}{txt}
{com}. 
. graph save "graph 22 COVID-19 daily cases, $country, JOHN, 2022.gph", replace
{txt}(note: file graph 22 COVID-19 daily cases, Iran, JOHN, 2022.gph not found)
{res}{txt}(file graph 22 COVID-19 daily cases, Iran, JOHN, 2022.gph saved)

{com}. graph export "graph 22 COVID-19 daily cases, $country, JOHN, 2022.pdf", replace
{txt}(file /Users/farshadpourmalek/Downloads/covir2-main/20220130/code/merge/graph 22 COVID-19 daily cases, Iran, JOHN, 2022.pdf written in PDF format)

{com}. 
. 
. 
. 
. 
. 
. ************
. 
. * restore native scheme (of the local machine)
. 
. set scheme $nativescheme
{txt}
{com}. 
. di c(scheme)
{res}_GRSTYLE_
{txt}
{com}. 
. 
. view "log country merge.smcl"
{txt}
{com}. 
. log close
      {txt}name:  {res}<unnamed>
       {txt}log:  {res}/Users/farshadpourmalek/Downloads/covir2-main/20220130/code/merge/log country merge.smcl
  {txt}log type:  {res}smcl
 {txt}closed on:  {res}31 Jan 2022, 00:35:51
{txt}{.-}
{smcl}
{txt}{sf}{ul off}