{smcl}
{com}{sf}{ul off}{txt}
{com}. 
. ***************************************************************************
. * This is "do Iran LANL.do"
. 
. * Project: Rapid review of estimates of COVID Iran - No 2
. * Person: Farshad Pourmalek pourmalek_farshad@yahoo.com
. * Time (initial): 2021-02-10
. 
. * OBJECTIVE: Get and prepare LANL data for Iran, Locate peak dates and values
. ***************************************************************************
. 
. 
. * Get LANL estimates 
. 
. clear 
{txt}
{com}. 
. 
. * download four files for four outcomes
.                                                                        
. copy https://covid-19.bsvgateway.org/forecast/global/2021-04-11/files/2021-04-11_global_cumulative_daily_cases_website.csv 2021-04-11_global_cumulative_daily_cases_website.csv
{txt}
{com}. 
. copy https://covid-19.bsvgateway.org/forecast/global/2021-04-11/files/2021-04-11_global_cumulative_daily_deaths_website.csv 2021-04-11_global_cumulative_daily_deaths_website.csv
{txt}
{com}. 
. copy https://covid-19.bsvgateway.org/forecast/global/2021-04-11/files/2021-04-11_global_incidence_daily_cases_website.csv 2021-04-11_global_incidence_daily_cases_website.csv
{txt}
{com}. 
. copy https://covid-19.bsvgateway.org/forecast/global/2021-04-11/files/2021-04-11_global_incidence_daily_deaths_website.csv 2021-04-11_global_incidence_daily_deaths_website.csv 
{txt}
{com}. 
. 
. 
. 
. * import csv files
. 
. 
. 
. * Total Cases
. import delimited using "2021-04-11_global_cumulative_daily_cases_website.csv", clear varnames(1)
{res}{text}(30 vars, 84,474 obs)

{com}. save "global_cumulative_daily_cases.dta", replace
{txt}(note: file global_cumulative_daily_cases.dta not found)
file global_cumulative_daily_cases.dta saved

{com}. 
. * Total Deaths
. import delimited using "2021-04-11_global_cumulative_daily_deaths_website.csv", clear varnames(1)
{res}{text}(30 vars, 84,474 obs)

{com}. save "global_cumulative_daily_deaths.dta", replace
{txt}(note: file global_cumulative_daily_deaths.dta not found)
file global_cumulative_daily_deaths.dta saved

{com}. 
. * Daily Cases
. import delimited using "2021-04-11_global_incidence_daily_cases_website.csv", clear varnames(1)
{res}{text}(30 vars, 84,474 obs)

{com}. save "global_incidence_daily_cases.dta", replace
{txt}(note: file global_incidence_daily_cases.dta not found)
file global_incidence_daily_cases.dta saved

{com}. 
. * Daily Deaths 
. import delimited using "2021-04-11_global_incidence_daily_deaths_website.csv", clear varnames(1)
{res}{text}(30 vars, 84,474 obs)

{com}. save "global_incidence_daily_deaths.dta", replace
{txt}(note: file global_incidence_daily_deaths.dta not found)
file global_incidence_daily_deaths.dta saved

{com}.         
. 
. 
. 
. 
. *******************
. 
. 
. * Total Cases
. 
. use "global_cumulative_daily_cases.dta", clear 
{txt}
{com}. 
. keep date q50 q025 q975 truth_confirmed obs name 
{txt}
{com}. 
. keep if strpos(name, "Iran")
{txt}(83,980 observations deleted)

{com}. 
. 
. 
. * gen date
. 
. rename date date_original
{res}{txt}
{com}. 
. gen year = substr(date_original,1,4) 
{txt}
{com}. gen month = substr(date_original,6,2) 
{txt}
{com}. gen day = substr(date_original,9,2) 
{txt}
{com}. egen date2 = concat(day month year)
{txt}
{com}. gen date = date(date2, "DMY", 2050)
{txt}
{com}. format date %tdDDMonCCYY
{txt}
{com}. codebook date

{txt}{hline}
{res}date{right:(unlabeled)}
{txt}{hline}

{col 19}type:  numeric daily date ({res}float{txt})

{col 18}range:  [{res}21936{txt},{res}22429{txt}]{col 55}units:  {res}1
{col 8}{txt}or equivalently:  [{res}22jan2020{txt},{res}29may2021{txt}]{col 55}units:  {res}days
{col 10}{txt}unique values:  {res}494{col 51}{txt}missing .:  {res}0{txt}/{res}494

{txt}{col 19}mean:{res}{col 26} 22182.5{txt} = {res}24sep2020{txt} (+ 12 hours)
{col 15}std. dev:{res}{col 26}  142.75

{txt}{col 12}percentiles:{col 32}10%{col 42}25%{col 52}50%{col 62}75%{col 72}90%
{res}{col 27}   21985{col 37}   22059{col 47} 22182.5{col 57}   22306{col 67}   22380
{col 26}11mar2020{col 36}24may2020{col 46}24sep2020{col 56}26jan2021{col 66}10apr2021
{txt}
{com}. 
. drop year month day date2
{txt}
{com}. 
. 
. * rename estimate vars
. 
. rename q50  TotCasMeRaA04S00V02
{res}{txt}
{com}. rename q025 TotCasLoRaA04S00V02
{res}{txt}
{com}. rename q975 TotCasUpRaA04S00V02
{res}{txt}
{com}. 
. label var TotCasMeRaA04S00V02 "Total Cases Mean LANL S0 V2"
{txt}
{com}. label var TotCasLoRaA04S00V02 "Total Cases Lower LANL S0 V2"
{txt}
{com}. label var TotCasUpRaA04S00V02 "Total Cases Upper LANL S0 V2"
{txt}
{com}. 
. save "Iran LANL Total Cases.dta", replace
{txt}(note: file Iran LANL Total Cases.dta not found)
file Iran LANL Total Cases.dta saved

{com}. 
. 
. 
. 
. 
. 
. 
. *******************
. 
. * Total Deaths
. 
. use "global_cumulative_daily_deaths.dta", clear 
{txt}
{com}. 
. keep date q50 q025 q975 truth_deaths obs name 
{txt}
{com}. 
. keep if strpos(name, "Iran")
{txt}(83,980 observations deleted)

{com}. 
. 
. 
. * gen date
. 
. rename date date_original
{res}{txt}
{com}. 
. gen year = substr(date_original,1,4) 
{txt}
{com}. gen month = substr(date_original,6,2) 
{txt}
{com}. gen day = substr(date_original,9,2) 
{txt}
{com}. egen date2 = concat(day month year)
{txt}
{com}. gen date = date(date2, "DMY", 2050)
{txt}
{com}. format date %tdDDMonCCYY
{txt}
{com}. codebook date

{txt}{hline}
{res}date{right:(unlabeled)}
{txt}{hline}

{col 19}type:  numeric daily date ({res}float{txt})

{col 18}range:  [{res}21936{txt},{res}22429{txt}]{col 55}units:  {res}1
{col 8}{txt}or equivalently:  [{res}22jan2020{txt},{res}29may2021{txt}]{col 55}units:  {res}days
{col 10}{txt}unique values:  {res}494{col 51}{txt}missing .:  {res}0{txt}/{res}494

{txt}{col 19}mean:{res}{col 26} 22182.5{txt} = {res}24sep2020{txt} (+ 12 hours)
{col 15}std. dev:{res}{col 26}  142.75

{txt}{col 12}percentiles:{col 32}10%{col 42}25%{col 52}50%{col 62}75%{col 72}90%
{res}{col 27}   21985{col 37}   22059{col 47} 22182.5{col 57}   22306{col 67}   22380
{col 26}11mar2020{col 36}24may2020{col 46}24sep2020{col 56}26jan2021{col 66}10apr2021
{txt}
{com}. 
. drop year month day date2
{txt}
{com}. 
. 
. * rename estimate vars
. 
. rename q50  TotDeaMeRaA04S00V02
{res}{txt}
{com}. rename q025 TotDeaLoRaA04S00V02
{res}{txt}
{com}. rename q975 TotDeaUpRaA04S00V02
{res}{txt}
{com}. 
. label var TotDeaMeRaA04S00V02 "Total deaths Mean LANL S0 V2"
{txt}
{com}. label var TotDeaLoRaA04S00V02 "Total deaths Lower LANL S0 V2"
{txt}
{com}. label var TotDeaUpRaA04S00V02 "Total deaths Upper LANL S0 V2"
{txt}
{com}. 
. 
. save "Iran LANL Total Deaths.dta", replace
{txt}(note: file Iran LANL Total Deaths.dta not found)
file Iran LANL Total Deaths.dta saved

{com}. 
. 
. 
. 
. *******************
. 
. * Daily Cases
. 
. use "global_incidence_daily_cases.dta", clear 
{txt}
{com}. 
. keep date q50 q025 q975 truth_confirmed obs name 
{txt}
{com}. 
. keep if strpos(name, "Iran")
{txt}(83,980 observations deleted)

{com}. 
. 
. 
. * gen date
. 
. rename date date_original
{res}{txt}
{com}. 
. gen year = substr(date_original,1,4) 
{txt}
{com}. gen month = substr(date_original,6,2) 
{txt}
{com}. gen day = substr(date_original,9,2) 
{txt}
{com}. egen date2 = concat(day month year)
{txt}
{com}. gen date = date(date2, "DMY", 2050)
{txt}
{com}. format date %tdDDMonCCYY
{txt}
{com}. codebook date

{txt}{hline}
{res}date{right:(unlabeled)}
{txt}{hline}

{col 19}type:  numeric daily date ({res}float{txt})

{col 18}range:  [{res}21936{txt},{res}22429{txt}]{col 55}units:  {res}1
{col 8}{txt}or equivalently:  [{res}22jan2020{txt},{res}29may2021{txt}]{col 55}units:  {res}days
{col 10}{txt}unique values:  {res}494{col 51}{txt}missing .:  {res}0{txt}/{res}494

{txt}{col 19}mean:{res}{col 26} 22182.5{txt} = {res}24sep2020{txt} (+ 12 hours)
{col 15}std. dev:{res}{col 26}  142.75

{txt}{col 12}percentiles:{col 32}10%{col 42}25%{col 52}50%{col 62}75%{col 72}90%
{res}{col 27}   21985{col 37}   22059{col 47} 22182.5{col 57}   22306{col 67}   22380
{col 26}11mar2020{col 36}24may2020{col 46}24sep2020{col 56}26jan2021{col 66}10apr2021
{txt}
{com}. 
. drop year month day date2
{txt}
{com}. 
. 
. * rename estimate vars
. 
. rename q50  DayCasMeRaA04S00V02
{res}{txt}
{com}. rename q025 DayCasLoRaA04S00V02
{res}{txt}
{com}. rename q975 DayCasUpRaA04S00V02
{res}{txt}
{com}. 
. label var DayCasMeRaA04S00V02 "Daily cases Mean LANL S0 V2"
{txt}
{com}. label var DayCasLoRaA04S00V02 "Daily cases Lower LANL S0 V2"
{txt}
{com}. label var DayCasUpRaA04S00V02 "Daily cases Upper LANL S0 V2"
{txt}
{com}. 
. 
. save "Iran LANL Daily Cases.dta", replace
{txt}(note: file Iran LANL Daily Cases.dta not found)
file Iran LANL Daily Cases.dta saved

{com}. 
. 
. 
. *******************
. 
. 
. 
. 
. 
. 
. * Daily Deaths
. 
. use "global_incidence_daily_deaths.dta", clear 
{txt}
{com}. 
. keep date q50 q025 q975 truth_deaths obs name 
{txt}
{com}. 
. keep if strpos(name, "Iran")
{txt}(83,980 observations deleted)

{com}. 
. 
. 
. * gen date
. 
. rename date date_original
{res}{txt}
{com}. 
. gen year = substr(date_original,1,4) 
{txt}
{com}. gen month = substr(date_original,6,2) 
{txt}
{com}. gen day = substr(date_original,9,2) 
{txt}
{com}. egen date2 = concat(day month year)
{txt}
{com}. gen date = date(date2, "DMY", 2050)
{txt}
{com}. format date %tdDDMonCCYY
{txt}
{com}. codebook date

{txt}{hline}
{res}date{right:(unlabeled)}
{txt}{hline}

{col 19}type:  numeric daily date ({res}float{txt})

{col 18}range:  [{res}21936{txt},{res}22429{txt}]{col 55}units:  {res}1
{col 8}{txt}or equivalently:  [{res}22jan2020{txt},{res}29may2021{txt}]{col 55}units:  {res}days
{col 10}{txt}unique values:  {res}494{col 51}{txt}missing .:  {res}0{txt}/{res}494

{txt}{col 19}mean:{res}{col 26} 22182.5{txt} = {res}24sep2020{txt} (+ 12 hours)
{col 15}std. dev:{res}{col 26}  142.75

{txt}{col 12}percentiles:{col 32}10%{col 42}25%{col 52}50%{col 62}75%{col 72}90%
{res}{col 27}   21985{col 37}   22059{col 47} 22182.5{col 57}   22306{col 67}   22380
{col 26}11mar2020{col 36}24may2020{col 46}24sep2020{col 56}26jan2021{col 66}10apr2021
{txt}
{com}. 
. drop year month day date2
{txt}
{com}. 
. 
. * rename estimate vars
. 
. rename q50  DayDeaMeRaA04S00V02
{res}{txt}
{com}. rename q025 DayDeaLoRaA04S00V02
{res}{txt}
{com}. rename q975 DayDeaUpRaA04S00V02
{res}{txt}
{com}. 
. label var DayDeaMeRaA04S00V02 "Daily deaths Mean LANL S0 V2"
{txt}
{com}. label var DayDeaLoRaA04S00V02 "Daily deaths Lower LANL S0 V2"
{txt}
{com}. label var DayDeaUpRaA04S00V02 "Daily deaths Upper LANL S0 V2"
{txt}
{com}. 
. 
. save "Iran LANL Daily Deaths.dta", replace
{txt}(note: file Iran LANL Daily Deaths.dta not found)
file Iran LANL Daily Deaths.dta saved

{com}. 
. 
. 
. ******************
. 
. * merge four estimates files
. 
. 
. use "Iran LANL Total Cases.dta", clear 
{txt}
{com}. 
. merge 1:1 date using "Iran LANL Total Deaths.dta"
{res}
{txt}{col 5}Result{col 38}# of obs.
{col 5}{hline 41}
{col 5}not matched{col 30}{res}               0
{txt}{col 5}matched{col 30}{res}             494{txt}  (_merge==3)
{col 5}{hline 41}

{com}. 
. drop _merge
{txt}
{com}. 
. merge 1:1 date using "Iran LANL Daily Cases.dta"
{res}
{txt}{col 5}Result{col 38}# of obs.
{col 5}{hline 41}
{col 5}not matched{col 30}{res}               0
{txt}{col 5}matched{col 30}{res}             494{txt}  (_merge==3)
{col 5}{hline 41}

{com}. 
. drop _merge
{txt}
{com}. 
. merge 1:1 date using "Iran LANL Daily Deaths.dta"
{res}
{txt}{col 5}Result{col 38}# of obs.
{col 5}{hline 41}
{col 5}not matched{col 30}{res}               0
{txt}{col 5}matched{col 30}{res}             494{txt}  (_merge==3)
{col 5}{hline 41}

{com}. 
. drop _merge
{txt}
{com}. 
. drop date_original obs truth_confirmed truth_deaths
{txt}
{com}. 
. order ///
> TotDeaLoRaA04S00V02 TotDeaMeRaA04S00V02 TotDeaUpRaA04S00V02 ///
> DayDeaLoRaA04S00V02 DayDeaMeRaA04S00V02 DayDeaUpRaA04S00V02 ///
> TotCasLoRaA04S00V02 TotCasMeRaA04S00V02 TotCasUpRaA04S00V02 ///
> DayCasLoRaA04S00V02 DayCasMeRaA04S00V02 DayCasUpRaA04S00V02
{txt}
{com}. 
. order date name
{txt}
{com}. 
. rename name loc_grand_name
{res}{txt}
{com}. 
. 
. 
. 
. 
. * gen cfr
. 
. gen DayCfrMeRaA04S00V02 = 100 * DayDeaMeRaA04S00V02 / DayCasMeRaA04S00V02
{txt}(28 missing values generated)

{com}. gen DayCfrLoRaA04S00V02 = 100 * DayDeaLoRaA04S00V02 / DayCasLoRaA04S00V02
{txt}(28 missing values generated)

{com}. gen DayCfrUpRaA04S00V02 = 100 * DayDeaUpRaA04S00V02 / DayCasUpRaA04S00V02
{txt}(28 missing values generated)

{com}. 
. label var DayCfrMeRaA04S00V02 "Daily CFR Mean LANL S0 V2"
{txt}
{com}. label var DayCfrLoRaA04S00V02 "Daily CFR Lower LANL S0 V2"
{txt}
{com}. label var DayCfrUpRaA04S00V02 "Daily CFR Upper LANL S0 V2"
{txt}
{com}. 
. 
. 
. 
. 
. 
. * gen "Daily cases mean div by daily deaths mean LANL DayCbD" for visulization of temporal relation of deaths and cases peaks 
. 
. 
.         summ DayDeaMeRaA04S00V02 

{txt}    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayDeaMeR~02 {c |}{res}        494     179.918     154.831          0        593
{txt}
{com}.         gen DayDeMMeRaA04S00V02  = r(mean)
{txt}
{com}.         label var DayDeMMeRaA04S00V02  "Daily deaths mean LANL DayDeM"
{txt}
{com}. 
.         summ DayCasMeRaA04S00V02  

{txt}    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayCasMeR~02 {c |}{res}        494    7013.669    8317.015          0    38910.5
{txt}
{com}.         gen DayCaMMeRaA04S00V02  = r(mean)
{txt}
{com}.         label var DayCaMMeRaA04S00V02  "Daily cases mean LANL DayCaM"
{txt}
{com}.                            
.         gen DayCbDMeRaA04S00V02  = DayCaMMeRaA04S00V02  / DayDeMMeRaA04S00V02 
{txt}
{com}.         label var DayCbDMeRaA04S00V02  "Daily cases mean div by daily deaths mean LANL DayCbD"
{txt}
{com}.         summ DayCbDMeRaA04S00V02 

{txt}    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayCbDMeR~02 {c |}{res}        494    38.98258           0   38.98258   38.98258
{txt}
{com}.                                               
.         gen DayDMuMeRaA04S00V02  = DayDeaMeRaA04S00V02  * DayCbDMeRaA04S00V02 
{txt}
{com}.     label var DayDMuMeRaA04S00V02  "Daily deaths scaled (times means of cases by deaths) LANL"
{txt}
{com}.         summ DayDMuMeRaA04S00V02 

{txt}    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayDMuMeR~02 {c |}{res}        494    7013.669    6035.711          0   23116.67
{txt}
{com}. 
. 
. 
. 
. 
. ***********************
. 
. * graphs
. 
. 
. grstyle init
{res}{txt}
{com}. 
. grstyle color background white
{txt}
{com}. 
. 
. 
. * daily deaths     
. 
.            
. twoway (rarea DayDeaLoRaA04S00V02 DayDeaUpRaA04S00V02 date, sort color(green*.2)) ///
> (line DayDeaMeRaA04S00V02 date, sort lcolor(green)) ///
> , xtitle(Date) xlabel(#18, format(%tdYY-NN-DD) labsize(small)) xlabel(, grid) xlabel(, grid) ///
> xlabel(, angle(forty_five)) ylabel(, format(%9.0fc) labsize(small))  ylabel(, labsize(small) angle(horizontal)) ///
> ytitle(Daily deaths) title("COVID-19 daily deaths, Iran, LANL, single scenario", size(medium)) ///
> xscale(lwidth(vthin) lcolor(gray*.2)) yscale(lwidth(vthin) lcolor(gray*.2)) legend(off) 
{res}{txt}
{com}.    
.            
. graph save "graph 1 COVID-19 daily deaths, Iran, LANL.gph", replace
{txt}(note: file graph 1 COVID-19 daily deaths, Iran, LANL.gph not found)
{res}{txt}(file graph 1 COVID-19 daily deaths, Iran, LANL.gph saved)

{com}. graph export "graph 1 COVID-19 daily deaths, Iran, LANL.pdf", replace
{txt}(file /Users/farshadpourmalek/Downloads/covir2-main/20210413/code/LANL/graph 1 COVID-19 daily deaths, Iran, LANL.pdf written in PDF format)

{com}. 
. 
. 
. * daily cases
. 
. 
. twoway (rarea DayCasLoRaA04S00V02 DayCasUpRaA04S00V02 date, sort color(green*.2)) ///
> (line DayCasMeRaA04S00V02 date, sort lcolor(green)) ///
> , xtitle(Date) xlabel(#18, format(%tdYY-NN-DD) labsize(small)) xlabel(, grid) xlabel(, grid) ///
> xlabel(, angle(forty_five)) ylabel(, format(%9.0fc) labsize(small))  ylabel(, labsize(small) angle(horizontal)) ///
> ytitle(Daily cases) title("COVID-19 daily cases, Iran, LANL, single scenario", size(medium)) ///
> xscale(lwidth(vthin) lcolor(gray*.2)) yscale(lwidth(vthin) lcolor(gray*.2)) legend(off) 
{res}{txt}
{com}.    
.            
. graph save "graph 2 COVID-19 daily cases, Iran, LANL.gph", replace
{txt}(note: file graph 2 COVID-19 daily cases, Iran, LANL.gph not found)
{res}{txt}(file graph 2 COVID-19 daily cases, Iran, LANL.gph saved)

{com}. graph export "graph 2 COVID-19 daily cases, Iran, LANL.pdf", replace
{txt}(file /Users/farshadpourmalek/Downloads/covir2-main/20210413/code/LANL/graph 2 COVID-19 daily cases, Iran, LANL.pdf written in PDF format)

{com}. 
. 
. 
. 
. * total deaths     
.            
. twoway (rarea TotDeaLoRaA04S00V02 TotDeaUpRaA04S00V02 date, sort color(green*.2)) ///
> (line TotDeaMeRaA04S00V02 date, sort lcolor(green)) ///
> , xtitle(Date) xlabel(#18, format(%tdYY-NN-DD) labsize(small)) xlabel(, grid) xlabel(, grid) ///
> xlabel(, angle(forty_five)) ylabel(, format(%9.0fc) labsize(small))  ylabel(, labsize(small) angle(horizontal)) ///
> ytitle(Total deaths) title("COVID-19 total deaths, Iran, LANL, single scenario", size(medium)) ///
> xscale(lwidth(vthin) lcolor(gray*.2)) yscale(lwidth(vthin) lcolor(gray*.2)) legend(off) 
{res}{txt}
{com}.    
.            
. graph save "graph 3 COVID-19 total deaths, Iran, LANL.gph", replace
{txt}(note: file graph 3 COVID-19 total deaths, Iran, LANL.gph not found)
{res}{txt}(file graph 3 COVID-19 total deaths, Iran, LANL.gph saved)

{com}. graph export "graph 3 COVID-19 total deaths, Iran, LANL.pdf", replace
{txt}(file /Users/farshadpourmalek/Downloads/covir2-main/20210413/code/LANL/graph 3 COVID-19 total deaths, Iran, LANL.pdf written in PDF format)

{com}. 
. 
. 
. 
. 
. * total cases      
.            
. twoway (rarea TotCasLoRaA04S00V02 TotCasUpRaA04S00V02 date, sort color(green*.2)) ///
> (line TotCasMeRaA04S00V02 date, sort lcolor(green)) ///
> , xtitle(Date) xlabel(#18, format(%tdYY-NN-DD) labsize(small)) xlabel(, grid) xlabel(, grid) ///
> xlabel(, angle(forty_five)) ylabel(, format(%9.0fc) labsize(small))  ylabel(, labsize(small) angle(horizontal)) ///
> ytitle(Total cases) title("COVID-19 total cases, Iran, LANL, single scenario", size(medium)) ///
> xscale(lwidth(vthin) lcolor(gray*.2)) yscale(lwidth(vthin) lcolor(gray*.2)) legend(off) 
{res}{txt}
{com}.    
.            
. graph save "graph 4 COVID-19 total cases, Iran, LANL.gph", replace
{txt}(note: file graph 4 COVID-19 total cases, Iran, LANL.gph not found)
{res}{txt}(file graph 4 COVID-19 total cases, Iran, LANL.gph saved)

{com}. graph export "graph 4 COVID-19 total cases, Iran, LANL.pdf", replace
{txt}(file /Users/farshadpourmalek/Downloads/covir2-main/20210413/code/LANL/graph 4 COVID-19 total cases, Iran, LANL.pdf written in PDF format)

{com}. 
. 
. 
. 
. * daily cfr
. 
. 
. twoway (rarea DayCfrLoRaA04S00V02 DayCfrUpRaA04S00V02 date, sort color(green*.2)) ///
> (line DayCfrMeRaA04S00V02 date, sort lcolor(green)) ///
> , xtitle(Date) xlabel(#18, format(%tdYY-NN-DD) labsize(small)) xlabel(, grid) xlabel(, grid) ///
> xlabel(, angle(forty_five)) ylabel(, format(%9.0fc) labsize(small))  ylabel(, labsize(small) angle(horizontal)) ///
> ytitle(Daily CFR) title("COVID-19 daily CFR, Iran, LANL, single scenario", size(medium)) ///
> xscale(lwidth(vthin) lcolor(gray*.2)) yscale(lwidth(vthin) lcolor(gray*.2)) legend(off) 
{res}{txt}
{com}.    
.            
. graph save "graph 5 COVID-19 daily CFR, Iran, LANL.gph", replace
{txt}(note: file graph 5 COVID-19 daily CFR, Iran, LANL.gph not found)
{res}{txt}(file graph 5 COVID-19 daily CFR, Iran, LANL.gph saved)

{com}. graph export "graph 5 COVID-19 daily CFR, Iran, LANL.pdf", replace
{txt}(file /Users/farshadpourmalek/Downloads/covir2-main/20210413/code/LANL/graph 5 COVID-19 daily CFR, Iran, LANL.pdf written in PDF format)

{com}. 
. 
. 
. * daily cfr, 01dec2020 on
. 
. twoway (rarea DayCfrLoRaA04S00V02 DayCfrUpRaA04S00V02 date, sort color(green*.2)) ///
> (line DayCfrMeRaA04S00V02 date, sort lcolor(green)) ///
> if date > td(01dec2020) ///
> , xtitle(Date) xlabel(#6, format(%tdYY-NN-DD) labsize(small)) xlabel(, grid) xlabel(, grid) ///
> xlabel(, angle(forty_five)) ylabel(, format(%9.2fc) labsize(small))  ylabel(, labsize(small) angle(horizontal)) ///
> ytitle(Daily CFR) title("COVID-19 daily CFR, Iran, LANL, single scenario", size(medium)) ///
> xscale(lwidth(vthin) lcolor(gray*.2)) yscale(lwidth(vthin) lcolor(gray*.2)) legend(off) ///
> subtitle("after 2020-12-01", size(small))
{res}{txt}
{com}.    
.            
. graph save "graph 6 COVID-19 daily CFR, Iran, LANL, 01dec2020 on.gph", replace
{txt}(note: file graph 6 COVID-19 daily CFR, Iran, LANL, 01dec2020 on.gph not found)
{res}{txt}(file graph 6 COVID-19 daily CFR, Iran, LANL, 01dec2020 on.gph saved)

{com}. graph export "graph 6 COVID-19 daily CFR, Iran, LANL, 01dec2020 on.pdf", replace
{txt}(file /Users/farshadpourmalek/Downloads/covir2-main/20210413/code/LANL/graph 6 COVID-19 daily CFR, Iran, LANL, 01dec2020 on.pdf written in PDF format)

{com}. 
. 
. 
. 
. 
. 
. * DayCas DayDeaDay Dea_multip
. 
. twoway ///
> (line DayCasMeRaA04S00V02  date, sort lcolor(blue)) ///
> (line DayDeaMeRaA04S00V02  date, sort lcolor(red)) ///
> (line DayDMuMeRaA04S00V02  date, sort lpattern(dot) lcolor(red)) ///
> if date > td(01jan2020) ///
> , xtitle(Date) xlabel(, format(%tdYY-NN-DD) labsize(small)) xlabel(, grid) xlabel(, grid) ///
> xlabel(, angle(forty_five)) ylabel(, format(%12.0fc) labsize(small)) ylabel(, labsize(small) angle(horizontal)) ///
> ytitle(Daily cases and deaths) title("COVID-19 daily cases and deaths, Iran, LANL", size(medium)) ///
> xscale(lwidth(vthin) lcolor(gray*.2)) yscale(lwidth(vthin) lcolor(gray*.2)) yscale(titlegap(4)) legend(region(lcolor(none)))  ///
> legend(order(1 "Daily cases" 2 "Daily deaths" 3 "Daily deaths scaled for visualization") size(small)) ///
> subtitle("Daily deaths, scaled = times (means of cases divided by deaths) for visualization only", size(small)) ///
> note("Current scenario, mean estimate")
{res}{txt}
{com}. 
. qui graph save "graph 7 COVID-19 daily deaths and cases Iran, LANL.gph", replace
{txt}
{com}. qui graph export "graph 7 COVID-19 daily deaths and cases Iran, LANL.pdf", replace
{txt}
{com}. 
. 
. 
. 
. *************************************
. 
. * Locate peak dates and values - deaths 
. 
. 
. 
. * first peak
. 
. summ DayDeaMeRaA04S00V02 if date > td(01mar2020) & date < td(01may2020) 

{txt}    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayDeaMeR~02 {c |}{res}         60    99.56667    40.31502         11        158
{txt}
{com}. 
. gen DayDeaMeRaA04S00V02P1V = r(max)
{txt}
{com}. 
. summ date if DayDeaMeRaA04S00V02 == DayDeaMeRaA04S00V02P1V & date > td(01mar2020) & date < td(01may2020) 

{txt}    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
{space 8}date {c |}{res}          1       22009           .      22009      22009
{txt}
{com}. 
. gen DayDeaMeRaA04S00V02P1D = r(max)
{txt}
{com}. 
. summ DayDeaLoRaA04S00V02 if date == DayDeaMeRaA04S00V02P1D

{txt}    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayDeaLoR~02 {c |}{res}          1         158           .        158        158
{txt}
{com}. 
. gen DayDeaLoRaA04S00V02P1V = r(max)
{txt}
{com}. 
. summ DayDeaUpRaA04S00V02 if date == DayDeaMeRaA04S00V02P1D

{txt}    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayDeaUpR~02 {c |}{res}          1         158           .        158        158
{txt}
{com}. 
. gen DayDeaUpRaA04S00V02P1V = r(max)
{txt}
{com}. 
. label var DayDeaMeRaA04S00V02P1V "DayDeaMeRaA04S00V02 Peak 1 Value"
{txt}
{com}. label var DayDeaMeRaA04S00V02P1D "DayDeaMeRaA04S00V02 Peak 1 Date"
{txt}
{com}. label var DayDeaLoRaA04S00V02P1V "DayDeaLoRaA04S00V02 Peak 1 Value"
{txt}
{com}. label var DayDeaUpRaA04S00V02P1V "DayDeaUpRaA04S00V02 Peak 1 Value"
{txt}
{com}. format DayDeaMeRaA04S00V02P1D %tdDDMonCCYY
{txt}
{com}. 
. tab1 DayDeaMeRaA04S00V02P1V DayDeaLoRaA04S00V02P1V DayDeaUpRaA04S00V02P1V DayDeaMeRaA04S00V02P1D

{res}-> tabulation of DayDeaMeRaA04S00V02P1V  

{txt}DayDeaMeRaA {c |}
   04S00V02 {c |}
     Peak 1 {c |}
      Value {c |}      Freq.     Percent        Cum.
{hline 12}{c +}{hline 35}
        158 {c |}{res}        494      100.00      100.00
{txt}{hline 12}{c +}{hline 35}
      Total {c |}{res}        494      100.00

-> tabulation of DayDeaLoRaA04S00V02P1V  

{txt}DayDeaLoRaA {c |}
   04S00V02 {c |}
     Peak 1 {c |}
      Value {c |}      Freq.     Percent        Cum.
{hline 12}{c +}{hline 35}
        158 {c |}{res}        494      100.00      100.00
{txt}{hline 12}{c +}{hline 35}
      Total {c |}{res}        494      100.00

-> tabulation of DayDeaUpRaA04S00V02P1V  

{txt}DayDeaUpRaA {c |}
   04S00V02 {c |}
     Peak 1 {c |}
      Value {c |}      Freq.     Percent        Cum.
{hline 12}{c +}{hline 35}
        158 {c |}{res}        494      100.00      100.00
{txt}{hline 12}{c +}{hline 35}
      Total {c |}{res}        494      100.00

-> tabulation of DayDeaMeRaA04S00V02P1D  

{txt}DayDeaMeRaA {c |}
   04S00V02 {c |}
Peak 1 Date {c |}      Freq.     Percent        Cum.
{hline 12}{c +}{hline 35}
  04Apr2020 {c |}{res}        494      100.00      100.00
{txt}{hline 12}{c +}{hline 35}
      Total {c |}{res}        494      100.00
{txt}
{com}. 
. 
. * second peak 
. 
. summ DayDeaMeRaA04S00V02 if date > td(01jul2020) & date < td(30jul2020) 

{txt}    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayDeaMeR~02 {c |}{res}         28    192.3214    27.09934        142        235
{txt}
{com}. 
. gen DayDeaMeRaA04S00V02P2V = r(max)
{txt}
{com}. 
. summ date if DayDeaMeRaA04S00V02 == DayDeaMeRaA04S00V02P2V & date > td(01jul2020) & date < td(30jul2020)

{txt}    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
{space 8}date {c |}{res}          1       22124           .      22124      22124
{txt}
{com}. 
. gen DayDeaMeRaA04S00V02P2D = r(max)
{txt}
{com}. 
. summ DayDeaLoRaA04S00V02 if date == DayDeaMeRaA04S00V02P2D

{txt}    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayDeaLoR~02 {c |}{res}          1         235           .        235        235
{txt}
{com}. 
. gen DayDeaLoRaA04S00V02P2V = r(max)
{txt}
{com}. 
. summ DayDeaUpRaA04S00V02 if date == DayDeaMeRaA04S00V02P2D

{txt}    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayDeaUpR~02 {c |}{res}          1         235           .        235        235
{txt}
{com}. 
. gen DayDeaUpRaA04S00V02P2V = r(max)
{txt}
{com}. 
. label var DayDeaMeRaA04S00V02P2V "DayDeaMeRaA04S00V02 Peak 2 Value"
{txt}
{com}. label var DayDeaMeRaA04S00V02P2D "DayDeaMeRaA04S00V02 Peak 2 Date"
{txt}
{com}. label var DayDeaLoRaA04S00V02P2V "DayDeaLoRaA04S00V02 Peak 2 Value"
{txt}
{com}. label var DayDeaUpRaA04S00V02P2V "DayDeaUpRaA04S00V02 Peak 2 Value"
{txt}
{com}. format DayDeaMeRaA04S00V02P2D %tdDDMonCCYY
{txt}
{com}. 
. tab1 DayDeaMeRaA04S00V02P2V DayDeaLoRaA04S00V02P2V DayDeaUpRaA04S00V02P2V DayDeaMeRaA04S00V02P2D

{res}-> tabulation of DayDeaMeRaA04S00V02P2V  

{txt}DayDeaMeRaA {c |}
   04S00V02 {c |}
     Peak 2 {c |}
      Value {c |}      Freq.     Percent        Cum.
{hline 12}{c +}{hline 35}
        235 {c |}{res}        494      100.00      100.00
{txt}{hline 12}{c +}{hline 35}
      Total {c |}{res}        494      100.00

-> tabulation of DayDeaLoRaA04S00V02P2V  

{txt}DayDeaLoRaA {c |}
   04S00V02 {c |}
     Peak 2 {c |}
      Value {c |}      Freq.     Percent        Cum.
{hline 12}{c +}{hline 35}
        235 {c |}{res}        494      100.00      100.00
{txt}{hline 12}{c +}{hline 35}
      Total {c |}{res}        494      100.00

-> tabulation of DayDeaUpRaA04S00V02P2V  

{txt}DayDeaUpRaA {c |}
   04S00V02 {c |}
     Peak 2 {c |}
      Value {c |}      Freq.     Percent        Cum.
{hline 12}{c +}{hline 35}
        235 {c |}{res}        494      100.00      100.00
{txt}{hline 12}{c +}{hline 35}
      Total {c |}{res}        494      100.00

-> tabulation of DayDeaMeRaA04S00V02P2D  

{txt}DayDeaMeRaA {c |}
   04S00V02 {c |}
Peak 2 Date {c |}      Freq.     Percent        Cum.
{hline 12}{c +}{hline 35}
  28Jul2020 {c |}{res}        494      100.00      100.00
{txt}{hline 12}{c +}{hline 35}
      Total {c |}{res}        494      100.00
{txt}
{com}. 
. 
. * third peak 
. 
. 
. summ DayDeaMeRaA04S00V02 if date > td(01nov2020) & date < td(30nov2020)

{txt}    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayDeaMeR~02 {c |}{res}         28    449.1429    29.30392        388        486
{txt}
{com}. 
. gen DayDeaMeRaA04S00V02P3V = r(max)
{txt}
{com}. 
. summ date if DayDeaMeRaA04S00V02 == DayDeaMeRaA04S00V02P3V & date > td(01nov2020) & date < td(30nov2020)

{txt}    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
{space 8}date {c |}{res}          1       22235           .      22235      22235
{txt}
{com}. 
. gen DayDeaMeRaA04S00V02P3D = r(max)
{txt}
{com}. 
. summ DayDeaLoRaA04S00V02 if date == DayDeaMeRaA04S00V02P3D

{txt}    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayDeaLoR~02 {c |}{res}          1         486           .        486        486
{txt}
{com}. 
. gen DayDeaLoRaA04S00V02P3V = r(max)
{txt}
{com}. 
. summ DayDeaUpRaA04S00V02 if date == DayDeaMeRaA04S00V02P3D

{txt}    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayDeaUpR~02 {c |}{res}          1         486           .        486        486
{txt}
{com}. 
. gen DayDeaUpRaA04S00V02P3V = r(max)
{txt}
{com}. 
. label var DayDeaMeRaA04S00V02P3V "DayDeaMeRaA04S00V02 Peak 3 Value"
{txt}
{com}. label var DayDeaMeRaA04S00V02P3D "DayDeaMeRaA04S00V02 Peak 3 Date"
{txt}
{com}. label var DayDeaLoRaA04S00V02P3V "DayDeaLoRaA04S00V02 Peak 3 Value"
{txt}
{com}. label var DayDeaUpRaA04S00V02P3V "DayDeaUpRaA04S00V02 Peak 3 Value"
{txt}
{com}. format DayDeaMeRaA04S00V02P3D %tdDDMonCCYY
{txt}
{com}. 
. tab1 DayDeaMeRaA04S00V02P3V DayDeaLoRaA04S00V02P3V DayDeaUpRaA04S00V02P3V DayDeaMeRaA04S00V02P3D

{res}-> tabulation of DayDeaMeRaA04S00V02P3V  

{txt}DayDeaMeRaA {c |}
   04S00V02 {c |}
     Peak 3 {c |}
      Value {c |}      Freq.     Percent        Cum.
{hline 12}{c +}{hline 35}
        486 {c |}{res}        494      100.00      100.00
{txt}{hline 12}{c +}{hline 35}
      Total {c |}{res}        494      100.00

-> tabulation of DayDeaLoRaA04S00V02P3V  

{txt}DayDeaLoRaA {c |}
   04S00V02 {c |}
     Peak 3 {c |}
      Value {c |}      Freq.     Percent        Cum.
{hline 12}{c +}{hline 35}
        486 {c |}{res}        494      100.00      100.00
{txt}{hline 12}{c +}{hline 35}
      Total {c |}{res}        494      100.00

-> tabulation of DayDeaUpRaA04S00V02P3V  

{txt}DayDeaUpRaA {c |}
   04S00V02 {c |}
     Peak 3 {c |}
      Value {c |}      Freq.     Percent        Cum.
{hline 12}{c +}{hline 35}
        486 {c |}{res}        494      100.00      100.00
{txt}{hline 12}{c +}{hline 35}
      Total {c |}{res}        494      100.00

-> tabulation of DayDeaMeRaA04S00V02P3D  

{txt}DayDeaMeRaA {c |}
   04S00V02 {c |}
Peak 3 Date {c |}      Freq.     Percent        Cum.
{hline 12}{c +}{hline 35}
  16Nov2020 {c |}{res}        494      100.00      100.00
{txt}{hline 12}{c +}{hline 35}
      Total {c |}{res}        494      100.00
{txt}
{com}. 
. 
. 
. 
. 
. * start date avialable (P7) with this update 
. 
. 
. gen A04DA = td(05apr2021)
{txt}
{com}. 
. label var A04DA "LANL Start date this update"
{txt}
{com}. 
. summ DayDeaMeRaA04S00V02 if date == A04DA

{txt}    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayDeaMeR~02 {c |}{res}          1         172           .        172        172
{txt}
{com}. 
. gen DayDeaMeRaA04S00V02P7V = r(max)
{txt}
{com}. 
. label var DayDeaMeRaA04S00V02P7V "DayDeaMeRaA04S00V02 Start Value this update"
{txt}
{com}. 
. summ DayDeaLoRaA04S00V02 if date == A04DA

{txt}    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayDeaLoR~02 {c |}{res}          1         172           .        172        172
{txt}
{com}. 
. gen DayDeaLoRaA04S00V02P7V = r(max)
{txt}
{com}. 
. label var DayDeaLoRaA04S00V02P7V "DayDeaLoRaA04S00V02 Start Value this update"
{txt}
{com}. 
. summ DayDeaUpRaA04S00V02 if date == A04DA

{txt}    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayDeaUpR~02 {c |}{res}          1         172           .        172        172
{txt}
{com}. 
. gen DayDeaUpRaA04S00V02P7V = r(max)
{txt}
{com}. 
. label var DayDeaUpRaA04S00V02P7V "DayDeaUpRaA04S00V02 Start Value this update"
{txt}
{com}. 
. format A04DA %tdDDMonCCYY
{txt}
{com}. 
. tab1 DayDeaMeRaA04S00V02P7V DayDeaLoRaA04S00V02P7V DayDeaUpRaA04S00V02P7V A04DA

{res}-> tabulation of DayDeaMeRaA04S00V02P7V  

{txt}DayDeaMeRaA {c |}
   04S00V02 {c |}
Start Value {c |}
this update {c |}      Freq.     Percent        Cum.
{hline 12}{c +}{hline 35}
        172 {c |}{res}        494      100.00      100.00
{txt}{hline 12}{c +}{hline 35}
      Total {c |}{res}        494      100.00

-> tabulation of DayDeaLoRaA04S00V02P7V  

{txt}DayDeaLoRaA {c |}
   04S00V02 {c |}
Start Value {c |}
this update {c |}      Freq.     Percent        Cum.
{hline 12}{c +}{hline 35}
        172 {c |}{res}        494      100.00      100.00
{txt}{hline 12}{c +}{hline 35}
      Total {c |}{res}        494      100.00

-> tabulation of DayDeaUpRaA04S00V02P7V  

{txt}DayDeaUpRaA {c |}
   04S00V02 {c |}
Start Value {c |}
this update {c |}      Freq.     Percent        Cum.
{hline 12}{c +}{hline 35}
        172 {c |}{res}        494      100.00      100.00
{txt}{hline 12}{c +}{hline 35}
      Total {c |}{res}        494      100.00

-> tabulation of A04DA  

 {txt}LANL Start {c |}
  date this {c |}
     update {c |}      Freq.     Percent        Cum.
{hline 12}{c +}{hline 35}
  05Apr2021 {c |}{res}        494      100.00      100.00
{txt}{hline 12}{c +}{hline 35}
      Total {c |}{res}        494      100.00
{txt}
{com}. 
. 
. 
. 
. * end date avialable (P8)
. 
. summ date

{txt}    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
{space 8}date {c |}{res}        494     22182.5    142.7498      21936      22429
{txt}
{com}. 
. gen A04DZ = r(max)
{txt}
{com}. 
. labe var A04DZ "LANL End date"
{txt}
{com}. 
. summ DayDeaMeRaA04S00V02 if date == A04DZ

{txt}    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayDeaMeR~02 {c |}{res}          1       552.5           .      552.5      552.5
{txt}
{com}. 
. gen DayDeaMeRaA04S00V02P8V = r(max)
{txt}
{com}. 
. label var DayDeaMeRaA04S00V02P8V "DayDeaMeRaA04S00V02 End Value"
{txt}
{com}. 
. summ DayDeaLoRaA04S00V02 if date == A04DZ

{txt}    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayDeaLoR~02 {c |}{res}          1         158           .        158        158
{txt}
{com}. 
. gen DayDeaLoRaA04S00V02P8V = r(max)
{txt}
{com}. 
. label var DayDeaLoRaA04S00V02P8V "DayDeaLoRaA04S00V02 End Value"
{txt}
{com}. 
. summ DayDeaUpRaA04S00V02 if date == A04DZ

{txt}    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayDeaUpR~02 {c |}{res}          1     2337.05           .    2337.05    2337.05
{txt}
{com}. 
. gen DayDeaUpRaA04S00V02P8V = r(max)
{txt}
{com}. 
. label var DayDeaUpRaA04S00V02P8V "DayDeaUpRaA04S00V02 End Value"
{txt}
{com}. 
. format A04DZ %tdDDMonCCYY
{txt}
{com}. 
. tab1 DayDeaMeRaA04S00V02P8V DayDeaLoRaA04S00V02P8V DayDeaUpRaA04S00V02P8V A04DZ

{res}-> tabulation of DayDeaMeRaA04S00V02P8V  

{txt}DayDeaMeRaA {c |}
   04S00V02 {c |}
  End Value {c |}      Freq.     Percent        Cum.
{hline 12}{c +}{hline 35}
      552.5 {c |}{res}        494      100.00      100.00
{txt}{hline 12}{c +}{hline 35}
      Total {c |}{res}        494      100.00

-> tabulation of DayDeaLoRaA04S00V02P8V  

{txt}DayDeaLoRaA {c |}
   04S00V02 {c |}
  End Value {c |}      Freq.     Percent        Cum.
{hline 12}{c +}{hline 35}
        158 {c |}{res}        494      100.00      100.00
{txt}{hline 12}{c +}{hline 35}
      Total {c |}{res}        494      100.00

-> tabulation of DayDeaUpRaA04S00V02P8V  

{txt}DayDeaUpRaA {c |}
   04S00V02 {c |}
  End Value {c |}      Freq.     Percent        Cum.
{hline 12}{c +}{hline 35}
    2337.05 {c |}{res}        494      100.00      100.00
{txt}{hline 12}{c +}{hline 35}
      Total {c |}{res}        494      100.00

-> tabulation of A04DZ  

   {txt}LANL End {c |}
       date {c |}      Freq.     Percent        Cum.
{hline 12}{c +}{hline 35}
  29May2021 {c |}{res}        494      100.00      100.00
{txt}{hline 12}{c +}{hline 35}
      Total {c |}{res}        494      100.00
{txt}
{com}. 
. 
. 
. ****************
.   
. * Locate peak dates and values - cases 
. 
. 
. * first peak
. 
. 
. summ DayCasMeRaA04S00V02 if date > td(01mar2020) & date < td(01may2020)

{txt}    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayCasMeR~02 {c |}{res}         60    1561.033     723.458        523       3186
{txt}
{com}. 
. gen DayCasMeRaA04S00V02P1V = r(max)
{txt}
{com}. 
. summ date if DayCasMeRaA04S00V02 == DayCasMeRaA04S00V02P1V & td(01mar2020) & date < td(01may2020)

{txt}    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
{space 8}date {c |}{res}          1       22004           .      22004      22004
{txt}
{com}. 
. gen DayCasMeRaA04S00V02P1D = r(max)
{txt}
{com}. 
. summ DayCasLoRaA04S00V02 if date == DayCasMeRaA04S00V02P1D

{txt}    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayCasLoR~02 {c |}{res}          1        3186           .       3186       3186
{txt}
{com}. 
. gen DayCasLoRaA04S00V02P1V = r(max)
{txt}
{com}. 
. summ DayCasUpRaA04S00V02 if date == DayCasMeRaA04S00V02P1D

{txt}    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayCasUpR~02 {c |}{res}          1        3186           .       3186       3186
{txt}
{com}. 
. gen DayCasUpRaA04S00V02P1V = r(max)
{txt}
{com}. 
. label var DayCasMeRaA04S00V02P1V "DayCasMeRaA04S00V02 Peak 1 Value"
{txt}
{com}. label var DayCasMeRaA04S00V02P1D "DayCasMeRaA04S00V02 Peak 1 Date"
{txt}
{com}. label var DayCasLoRaA04S00V02P1V "DayCasLoRaA04S00V02 Peak 1 Value"
{txt}
{com}. label var DayCasUpRaA04S00V02P1V "DayCasUpRaA04S00V02 Peak 1 Value"
{txt}
{com}. format DayCasMeRaA04S00V02P1D %tdDDMonCCYY
{txt}
{com}. 
. tab1 DayCasMeRaA04S00V02P1V DayCasLoRaA04S00V02P1V DayCasUpRaA04S00V02P1V DayCasMeRaA04S00V02P1D

{res}-> tabulation of DayCasMeRaA04S00V02P1V  

{txt}DayCasMeRaA {c |}
   04S00V02 {c |}
     Peak 1 {c |}
      Value {c |}      Freq.     Percent        Cum.
{hline 12}{c +}{hline 35}
       3186 {c |}{res}        494      100.00      100.00
{txt}{hline 12}{c +}{hline 35}
      Total {c |}{res}        494      100.00

-> tabulation of DayCasLoRaA04S00V02P1V  

{txt}DayCasLoRaA {c |}
   04S00V02 {c |}
     Peak 1 {c |}
      Value {c |}      Freq.     Percent        Cum.
{hline 12}{c +}{hline 35}
       3186 {c |}{res}        494      100.00      100.00
{txt}{hline 12}{c +}{hline 35}
      Total {c |}{res}        494      100.00

-> tabulation of DayCasUpRaA04S00V02P1V  

{txt}DayCasUpRaA {c |}
   04S00V02 {c |}
     Peak 1 {c |}
      Value {c |}      Freq.     Percent        Cum.
{hline 12}{c +}{hline 35}
       3186 {c |}{res}        494      100.00      100.00
{txt}{hline 12}{c +}{hline 35}
      Total {c |}{res}        494      100.00

-> tabulation of DayCasMeRaA04S00V02P1D  

{txt}DayCasMeRaA {c |}
   04S00V02 {c |}
Peak 1 Date {c |}      Freq.     Percent        Cum.
{hline 12}{c +}{hline 35}
  30Mar2020 {c |}{res}        494      100.00      100.00
{txt}{hline 12}{c +}{hline 35}
      Total {c |}{res}        494      100.00
{txt}
{com}. 
. 
. * second peak
. 
. 
. summ DayCasMeRaA04S00V02 if date > td(01may2020) & date < td(30jun2020)

{txt}    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayCasMeR~02 {c |}{res}         59    2195.915    530.7193        802       3574
{txt}
{com}. 
. gen DayCasMeRaA04S00V02P2V = r(max)
{txt}
{com}. 
. summ date if DayCasMeRaA04S00V02 == DayCasMeRaA04S00V02P2V & date > td(01may2020) & date < td(30jun2020)

{txt}    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
{space 8}date {c |}{res}          1       22070           .      22070      22070
{txt}
{com}. 
. gen DayCasMeRaA04S00V02P2D = r(max)
{txt}
{com}. 
. summ DayCasLoRaA04S00V02 if date == DayCasMeRaA04S00V02P2D

{txt}    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayCasLoR~02 {c |}{res}          1        3574           .       3574       3574
{txt}
{com}. 
. gen DayCasLoRaA04S00V02P2V = r(max)
{txt}
{com}. 
. summ DayCasUpRaA04S00V02 if date == DayCasMeRaA04S00V02P2D

{txt}    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayCasUpR~02 {c |}{res}          1        3574           .       3574       3574
{txt}
{com}. 
. gen DayCasUpRaA04S00V02P2V = r(max)
{txt}
{com}. 
. label var DayCasMeRaA04S00V02P2V "DayCasMeRaA04S00V02 Peak 2 Value"
{txt}
{com}. label var DayCasMeRaA04S00V02P2D "DayCasMeRaA04S00V02 Peak 2 Date"
{txt}
{com}. label var DayCasLoRaA04S00V02P2V "DayCasLoRaA04S00V02 Peak 2 Value"
{txt}
{com}. label var DayCasUpRaA04S00V02P2V "DayCasUpRaA04S00V02 Peak 2 Value"
{txt}
{com}. format DayCasMeRaA04S00V02P2D %tdDDMonCCYY
{txt}
{com}. 
. tab1 DayCasMeRaA04S00V02P2V DayCasLoRaA04S00V02P2V DayCasUpRaA04S00V02P2V DayCasMeRaA04S00V02P2D

{res}-> tabulation of DayCasMeRaA04S00V02P2V  

{txt}DayCasMeRaA {c |}
   04S00V02 {c |}
     Peak 2 {c |}
      Value {c |}      Freq.     Percent        Cum.
{hline 12}{c +}{hline 35}
       3574 {c |}{res}        494      100.00      100.00
{txt}{hline 12}{c +}{hline 35}
      Total {c |}{res}        494      100.00

-> tabulation of DayCasLoRaA04S00V02P2V  

{txt}DayCasLoRaA {c |}
   04S00V02 {c |}
     Peak 2 {c |}
      Value {c |}      Freq.     Percent        Cum.
{hline 12}{c +}{hline 35}
       3574 {c |}{res}        494      100.00      100.00
{txt}{hline 12}{c +}{hline 35}
      Total {c |}{res}        494      100.00

-> tabulation of DayCasUpRaA04S00V02P2V  

{txt}DayCasUpRaA {c |}
   04S00V02 {c |}
     Peak 2 {c |}
      Value {c |}      Freq.     Percent        Cum.
{hline 12}{c +}{hline 35}
       3574 {c |}{res}        494      100.00      100.00
{txt}{hline 12}{c +}{hline 35}
      Total {c |}{res}        494      100.00

-> tabulation of DayCasMeRaA04S00V02P2D  

{txt}DayCasMeRaA {c |}
   04S00V02 {c |}
Peak 2 Date {c |}      Freq.     Percent        Cum.
{hline 12}{c +}{hline 35}
  04Jun2020 {c |}{res}        494      100.00      100.00
{txt}{hline 12}{c +}{hline 35}
      Total {c |}{res}        494      100.00
{txt}
{com}. 
. 
. 
. * third peak
. 
. summ DayCasMeRaA04S00V02 if date > td(01nov2020) & date < td(30jan2021)

{txt}    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayCasMeR~02 {c |}{res}         89     8819.36    2997.736       5502      14051
{txt}
{com}. 
. gen DayCasMeRaA04S00V02P3V = r(max)
{txt}
{com}. 
. summ date if DayCasMeRaA04S00V02 == DayCasMeRaA04S00V02P3V & date > td(01nov2020) & date < td(30jan2021)

{txt}    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
{space 8}date {c |}{res}          1       22246           .      22246      22246
{txt}
{com}. 
. gen DayCasMeRaA04S00V02P3D = r(max)
{txt}
{com}. 
. summ DayCasLoRaA04S00V02 if date == DayCasMeRaA04S00V02P3D

{txt}    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayCasLoR~02 {c |}{res}          1       14051           .      14051      14051
{txt}
{com}. 
. gen DayCasLoRaA04S00V02P3V = r(max)
{txt}
{com}. 
. summ DayCasUpRaA04S00V02 if date == DayCasMeRaA04S00V02P3D

{txt}    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayCasUpR~02 {c |}{res}          1       14051           .      14051      14051
{txt}
{com}. 
. gen DayCasUpRaA04S00V02P3V = r(max)
{txt}
{com}. 
. label var DayCasMeRaA04S00V02P3V "DayCasMeRaA04S00V02 Peak 3 Value"
{txt}
{com}. label var DayCasMeRaA04S00V02P3D "DayCasMeRaA04S00V02 Peak 3 Date"
{txt}
{com}. label var DayCasLoRaA04S00V02P3V "DayCasLoRaA04S00V02 Peak 3 Value"
{txt}
{com}. label var DayCasUpRaA04S00V02P3V "DayCasUpRaA04S00V02 Peak 3 Value"
{txt}
{com}. format DayCasMeRaA04S00V02P3D %tdDDMonCCYY
{txt}
{com}. 
. tab1 DayCasMeRaA04S00V02P3V DayCasLoRaA04S00V02P3V DayCasUpRaA04S00V02P3V DayCasMeRaA04S00V02P3D

{res}-> tabulation of DayCasMeRaA04S00V02P3V  

{txt}DayCasMeRaA {c |}
   04S00V02 {c |}
     Peak 3 {c |}
      Value {c |}      Freq.     Percent        Cum.
{hline 12}{c +}{hline 35}
      14051 {c |}{res}        494      100.00      100.00
{txt}{hline 12}{c +}{hline 35}
      Total {c |}{res}        494      100.00

-> tabulation of DayCasLoRaA04S00V02P3V  

{txt}DayCasLoRaA {c |}
   04S00V02 {c |}
     Peak 3 {c |}
      Value {c |}      Freq.     Percent        Cum.
{hline 12}{c +}{hline 35}
      14051 {c |}{res}        494      100.00      100.00
{txt}{hline 12}{c +}{hline 35}
      Total {c |}{res}        494      100.00

-> tabulation of DayCasUpRaA04S00V02P3V  

{txt}DayCasUpRaA {c |}
   04S00V02 {c |}
     Peak 3 {c |}
      Value {c |}      Freq.     Percent        Cum.
{hline 12}{c +}{hline 35}
      14051 {c |}{res}        494      100.00      100.00
{txt}{hline 12}{c +}{hline 35}
      Total {c |}{res}        494      100.00

-> tabulation of DayCasMeRaA04S00V02P3D  

{txt}DayCasMeRaA {c |}
   04S00V02 {c |}
Peak 3 Date {c |}      Freq.     Percent        Cum.
{hline 12}{c +}{hline 35}
  27Nov2020 {c |}{res}        494      100.00      100.00
{txt}{hline 12}{c +}{hline 35}
      Total {c |}{res}        494      100.00
{txt}
{com}. 
. 
. 
. 
. * start date avialable (P7) with this update 
. 
. 
. summ DayCasMeRaA04S00V02 if date == A04DA

{txt}    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayCasMeR~02 {c |}{res}          1       13890           .      13890      13890
{txt}
{com}. 
. gen DayCasMeRaA04S00V02P7V = r(max)
{txt}
{com}. 
. label var DayCasMeRaA04S00V02P7V "DayCasMeRaA04S00V02 Start Value this update"
{txt}
{com}. 
. summ DayCasLoRaA04S00V02 if date == A04DA

{txt}    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayCasLoR~02 {c |}{res}          1       13890           .      13890      13890
{txt}
{com}. 
. gen DayCasLoRaA04S00V02P7V = r(max)
{txt}
{com}. 
. label var DayCasLoRaA04S00V02P7V "DayCasLoRaA04S00V02 Start Value this update"
{txt}
{com}. 
. summ DayCasUpRaA04S00V02 if date == A04DA

{txt}    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayCasUpR~02 {c |}{res}          1       13890           .      13890      13890
{txt}
{com}. 
. gen DayCasUpRaA04S00V02P7V = r(max)
{txt}
{com}. 
. label var DayCasUpRaA04S00V02P7V "DayCasUpRaA04S00V02 Start Value this update"
{txt}
{com}. 
. format A04DA %tdDDMonCCYY
{txt}
{com}. 
. tab1 DayCasMeRaA04S00V02P7V DayCasLoRaA04S00V02P7V DayCasUpRaA04S00V02P7V A04DA

{res}-> tabulation of DayCasMeRaA04S00V02P7V  

{txt}DayCasMeRaA {c |}
   04S00V02 {c |}
Start Value {c |}
this update {c |}      Freq.     Percent        Cum.
{hline 12}{c +}{hline 35}
      13890 {c |}{res}        494      100.00      100.00
{txt}{hline 12}{c +}{hline 35}
      Total {c |}{res}        494      100.00

-> tabulation of DayCasLoRaA04S00V02P7V  

{txt}DayCasLoRaA {c |}
   04S00V02 {c |}
Start Value {c |}
this update {c |}      Freq.     Percent        Cum.
{hline 12}{c +}{hline 35}
      13890 {c |}{res}        494      100.00      100.00
{txt}{hline 12}{c +}{hline 35}
      Total {c |}{res}        494      100.00

-> tabulation of DayCasUpRaA04S00V02P7V  

{txt}DayCasUpRaA {c |}
   04S00V02 {c |}
Start Value {c |}
this update {c |}      Freq.     Percent        Cum.
{hline 12}{c +}{hline 35}
      13890 {c |}{res}        494      100.00      100.00
{txt}{hline 12}{c +}{hline 35}
      Total {c |}{res}        494      100.00

-> tabulation of A04DA  

 {txt}LANL Start {c |}
  date this {c |}
     update {c |}      Freq.     Percent        Cum.
{hline 12}{c +}{hline 35}
  05Apr2021 {c |}{res}        494      100.00      100.00
{txt}{hline 12}{c +}{hline 35}
      Total {c |}{res}        494      100.00
{txt}
{com}. 
. 
. 
. * end date avialable 
. 
. summ DayCasMeRaA04S00V02 if date == A04DZ

{txt}    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayCasMeR~02 {c |}{res}          1     25111.5           .    25111.5    25111.5
{txt}
{com}. 
. gen DayCasMeRaA04S00V02P8V = r(max)
{txt}
{com}. 
. label var DayCasMeRaA04S00V02P8V "DayCasMeRaA04S00V02 End Value"
{txt}
{com}. 
. summ DayCasLoRaA04S00V02 if date == A04DZ

{txt}    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayCasLoR~02 {c |}{res}          1    8230.425           .   8230.425   8230.425
{txt}
{com}. 
. gen DayCasLoRaA04S00V02P8V = r(max)
{txt}
{com}. 
. label var DayCasLoRaA04S00V02P8V "DayCasLoRaA04S00V02 End Value"
{txt}
{com}. 
. summ DayCasUpRaA04S00V02 if date == A04DZ

{txt}    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayCasUpR~02 {c |}{res}          1    65337.57           .   65337.57   65337.57
{txt}
{com}. 
. gen DayCasUpRaA04S00V02P8V = r(max)
{txt}
{com}. 
. label var DayCasUpRaA04S00V02P8V "DayCasUpRaA04S00V02 End Value"
{txt}
{com}. 
. format A04DZ %tdDDMonCCYY
{txt}
{com}. 
. tab1 DayCasMeRaA04S00V02P8V DayCasLoRaA04S00V02P8V DayCasUpRaA04S00V02P8V A04DZ

{res}-> tabulation of DayCasMeRaA04S00V02P8V  

{txt}DayCasMeRaA {c |}
   04S00V02 {c |}
  End Value {c |}      Freq.     Percent        Cum.
{hline 12}{c +}{hline 35}
    25111.5 {c |}{res}        494      100.00      100.00
{txt}{hline 12}{c +}{hline 35}
      Total {c |}{res}        494      100.00

-> tabulation of DayCasLoRaA04S00V02P8V  

{txt}DayCasLoRaA {c |}
   04S00V02 {c |}
  End Value {c |}      Freq.     Percent        Cum.
{hline 12}{c +}{hline 35}
   8230.425 {c |}{res}        494      100.00      100.00
{txt}{hline 12}{c +}{hline 35}
      Total {c |}{res}        494      100.00

-> tabulation of DayCasUpRaA04S00V02P8V  

{txt}DayCasUpRaA {c |}
   04S00V02 {c |}
  End Value {c |}      Freq.     Percent        Cum.
{hline 12}{c +}{hline 35}
   65337.57 {c |}{res}        494      100.00      100.00
{txt}{hline 12}{c +}{hline 35}
      Total {c |}{res}        494      100.00

-> tabulation of A04DZ  

   {txt}LANL End {c |}
       date {c |}      Freq.     Percent        Cum.
{hline 12}{c +}{hline 35}
  29May2021 {c |}{res}        494      100.00      100.00
{txt}{hline 12}{c +}{hline 35}
      Total {c |}{res}        494      100.00
{txt}
{com}. 
. 
. 
. sort date
{txt}
{com}. 
. qui compress
{txt}
{com}. 
. save "Iran LANL.dta", replace
{txt}(note: file Iran LANL.dta not found)
file Iran LANL.dta saved

{com}. 
. 
. 
. view "log Iran LANL.smcl"
{txt}
{com}. 
. log close
      {txt}name:  {res}<unnamed>
       {txt}log:  {res}/Users/farshadpourmalek/Downloads/covir2-main/20210413/code/LANL/log Iran LANL.smcl
  {txt}log type:  {res}smcl
 {txt}closed on:  {res}24 Apr 2021, 09:15:10
{txt}{.-}
{smcl}
{txt}{sf}{ul off}