{smcl}
{txt}{sf}{ul off}{.-}
      name:  {res}<unnamed>
       {txt}log:  {res}/Users/farshadpourmalek/Downloads/covir2-main/20210521/code/merge/log Iran merge.smcl
  {txt}log type:  {res}smcl
 {txt}opened on:  {res}14 Jun 2021, 20:34:35
{txt}
{com}. 
. 
. ***************************************************************************
. * This is "do Iran merge.do"
. 
. * Project: COVID-19 Iran Review No 2
. * Person: Farshad Pourmalek pourmalek_farshad@yahoo.com
. * Time (initial): 2021-02-10
. 
. * OBJECTIVE: Merge component studies' estimates for Iran, grphas
. ***************************************************************************
. 
. 
. /* studies:
> JOHN
> DELP
> IHME
> IMPE
> LANL
> SRIV
> SOLT
> GHAN
> */
. 
. 
. 
. 
. * JOHN
. 
. if regexm(c(os),"Mac") == 1 {c -(}
. 
.         use "$pathcovir2/JOHN/Iran JOHN.dta", clear 
. {c )-}
{txt}
{com}. else if regexm(c(os),"Windows") == 1 use "$pathcovir2\JOHN\Iran JOHN.dta", clear 
{txt}
{com}. 
. 
. 
. * DELP 
. 
. if regexm(c(os),"Mac") == 1 {c -(}
. 
.         merge 1:1 date using "$pathcovir2/DELP/Iran DELP.dta"
{res}
{txt}{col 5}Result{col 38}# of obs.
{col 5}{hline 41}
{col 5}not matched{col 30}{res}             538
{txt}{col 9}from master{col 30}{res}             506{txt}  (_merge==1)
{col 9}from using{col 30}{res}              32{txt}  (_merge==2)

{col 5}matched{col 30}{res}              24{txt}  (_merge==3)
{col 5}{hline 41}
{com}. {c )-}
{txt}
{com}. else if regexm(c(os),"Windows") == 1 merge 1:1 date using "$pathcovir2\DELP\Iran DELP.dta"
{txt}
{com}. 
. drop _merge
{txt}
{com}. 
. 
. 
. * IHME
. 
. if regexm(c(os),"Mac") == 1 {c -(}
. 
.         merge 1:1 date using "$pathcovir2/IHME/Iran IHME.dta"
{res}
{txt}{col 5}Result{col 38}# of obs.
{col 5}{hline 41}
{col 5}not matched{col 30}{res}              82
{txt}{col 9}from master{col 30}{res}              34{txt}  (_merge==1)
{col 9}from using{col 30}{res}              48{txt}  (_merge==2)

{col 5}matched{col 30}{res}             528{txt}  (_merge==3)
{col 5}{hline 41}
{com}. {c )-}
{txt}
{com}. else if regexm(c(os),"Windows") == 1 merge 1:1 date using "$pathcovir2\IHME\Iran IHME.dta"
{txt}
{com}. 
. drop _merge
{txt}
{com}. 
. 
. 
. * IMPE
. 
. if regexm(c(os),"Mac") == 1 {c -(}
. 
.         merge 1:1 date using "$pathcovir2/IMPE/Iran IMPE.dta"
{res}
{txt}{col 5}Result{col 38}# of obs.
{col 5}{hline 41}
{col 5}not matched{col 30}{res}              28
{txt}{col 9}from master{col 30}{res}              28{txt}  (_merge==1)
{col 9}from using{col 30}{res}               0{txt}  (_merge==2)

{col 5}matched{col 30}{res}             582{txt}  (_merge==3)
{col 5}{hline 41}
{com}. {c )-}
{txt}
{com}. else if regexm(c(os),"Windows") == 1 merge 1:1 date using "$pathcovir2\IMPE\Iran IMPE.dta"
{txt}
{com}. 
. drop _merge
{txt}
{com}. 
. 
. 
. * LANL
. 
. if regexm(c(os),"Mac") == 1 {c -(}
. 
.         merge 1:1 date using "$pathcovir2/LANL/Iran LANL.dta"
{res}
{txt}{col 5}Result{col 38}# of obs.
{col 5}{hline 41}
{col 5}not matched{col 30}{res}              78
{txt}{col 9}from master{col 30}{res}              78{txt}  (_merge==1)
{col 9}from using{col 30}{res}               0{txt}  (_merge==2)

{col 5}matched{col 30}{res}             532{txt}  (_merge==3)
{col 5}{hline 41}
{com}. {c )-}
{txt}
{com}. else if regexm(c(os),"Windows") == 1 merge 1:1 date using "$pathcovir2\LANL\Iran LANL.dta"
{txt}
{com}. 
. drop _merge
{txt}
{com}. 
. 
. * SRIV
. 
. 
. 
. if regexm(c(os),"Mac") == 1 {c -(}
. 
.         merge 1:1 date using "$pathcovir2/SRIV/Iran SRIV.dta"
{res}
{txt}{col 5}Result{col 38}# of obs.
{col 5}{hline 41}
{col 5}not matched{col 30}{res}             508
{txt}{col 9}from master{col 30}{res}             508{txt}  (_merge==1)
{col 9}from using{col 30}{res}               0{txt}  (_merge==2)

{col 5}matched{col 30}{res}             102{txt}  (_merge==3)
{col 5}{hline 41}
{com}. {c )-}
{txt}
{com}. else if regexm(c(os),"Windows") == 1 merge 1:1 date using "$pathcovir2\SRIV\Iran SRIV.dta"
{txt}
{com}. 
. drop _merge
{txt}
{com}. 
. 
. 
. * SOLT
. 
. 
. 
. if regexm(c(os),"Mac") == 1 {c -(}
. 
.         merge 1:1 date using "$pathcovir2/SOLT/Iran SOLT"
{res}
{txt}{col 5}Result{col 38}# of obs.
{col 5}{hline 41}
{col 5}not matched{col 30}{res}              90
{txt}{col 9}from master{col 30}{res}              45{txt}  (_merge==1)
{col 9}from using{col 30}{res}              45{txt}  (_merge==2)

{col 5}matched{col 30}{res}             565{txt}  (_merge==3)
{col 5}{hline 41}
{com}. {c )-}
{txt}
{com}. else if regexm(c(os),"Windows") == 1 merge 1:1 date using "$pathcovir2\SOLT\Iran SOLT"
{txt}
{com}. 
. drop _merge 
{txt}
{com}. 
. 
. 
. * GHAN
. 
. if regexm(c(os),"Mac") == 1 {c -(}
. 
.         merge 1:1 date using "$pathcovir2/GHAN/Iran GHAN"
{res}
{txt}{col 5}Result{col 38}# of obs.
{col 5}{hline 41}
{col 5}not matched{col 30}{res}              78
{txt}{col 9}from master{col 30}{res}              21{txt}  (_merge==1)
{col 9}from using{col 30}{res}              57{txt}  (_merge==2)

{col 5}matched{col 30}{res}             634{txt}  (_merge==3)
{col 5}{hline 41}
{com}. {c )-}
{txt}
{com}. else if regexm(c(os),"Windows") == 1 merge 1:1 date using "$pathcovir2\GHAN\Iran GHAN"
{txt}
{com}. 
. drop _merge 
{txt}
{com}. 
. 
. 
. 
. 
. 
. 
. * 
. 
. label var loc_grand_name "Location"
{txt}
{com}. 
. 
. 
. 
. 
. 
. 
. *************************************
. 
. 
. * Cases to deaths ratio
. 
. 
. gen DayCTDMeRaA00S00 =  DayCasMeRaA00S00 / DayDeaMeRaA00S00
{txt}(232 missing values generated)

{com}. 
. label var DayCTDMeRaA00S00  "Daily Cases to Deaths S0 JOHN"
{txt}
{com}. 
. gen TotCTDMeRaA00S00 =  TotCasMeRaA00S00 / TotDeaMeRaA00S00
{txt}(231 missing values generated)

{com}. 
. label var TotCTDMeRaA00S00  "Total Cases to Deaths S0 JOHN"
{txt}
{com}. 
. 
. 
. 
. gen DayCTDMeRaA01S00 =  DayCasMeRaA01S00 / DayDeaMeRaA01S00
{txt}(659 missing values generated)

{com}. 
. label var DayCTDMeRaA01S00  "Daily Cases to Deaths S0 DELP"
{txt}
{com}. 
. gen TotCTDMeRaA01S00 =  TotCasMeRaA01S00 / TotDeaMeRaA01S00
{txt}(656 missing values generated)

{com}. 
. label var TotCTDMeRaA01S00  "Total Cases to Deaths S0 DELP"  
{txt}
{com}. 
. 
. 
. 
. gen DayCTDMeRaA02S01  =  DayCasMeRaA02S01  / DayDeaMeRaA02S01 
{txt}(153 missing values generated)

{com}. 
. label var DayCTDMeRaA02S01   "Daily Cases to Deaths S1 IHME"
{txt}
{com}. 
. gen TotCTDMeRaA02S01  =  TotCasMeRaA02S01  / TotDeaMeRaA02S01 
{txt}(136 missing values generated)

{com}. 
. label var TotCTDMeRaA02S01   "Total Cases to Deaths S1 IHME"
{txt}
{com}. 
. 
. 
. 
. gen DayCTDMeRaA02S02 = DayCasMeRaA02S02 / DayDeaMeRaA02S02  
{txt}(604 missing values generated)

{com}. 
. label var DayCTDMeRaA02S02 "Daily Cases to Deaths S2 IHME"
{txt}
{com}. 
. gen TotCTDMeRaA02S02 = TotCasMeRaA02S02 / TotDeaMeRaA02S02  
{txt}(712 missing values generated)

{com}. 
. label var TotCTDMeRaA02S02 "Total Cases to Deaths S2 IHME"
{txt}
{com}. 
. 
. 
. 
. gen DayCTDMeRaA02S03  = DayCasMeRaA02S03  / DayDeaMeRaA02S03   
{txt}(604 missing values generated)

{com}. 
. label var DayCTDMeRaA02S03  "Daily Cases to Deaths S3 IHME"
{txt}
{com}. 
. gen TotCTDMeRaA02S03  = TotCasMeRaA02S03  / TotDeaMeRaA02S03   
{txt}(712 missing values generated)

{com}. 
. label var TotCTDMeRaA02S03  "Total Cases to Deaths S3 IHME"
{txt}
{com}. 
. 
. 
. 
. 
. 
. gen DayCTDMeRaA03S01  = DayCasMeRaA03S01  / DayDeaMeRaA03S01   
{txt}(145 missing values generated)

{com}. 
. label var DayCTDMeRaA03S01  "Daily Cases to Deaths S1 IMPE"
{txt}
{com}. 
. gen TotCTDMeRaA03S01  = TotCasMeRaA03S01  / TotDeaMeRaA03S01   
{txt}(142 missing values generated)

{com}. 
. label var TotCTDMeRaA03S01  "Total Cases to Deaths S1 IMPE"
{txt}
{com}. 
. 
. 
. gen DayCTDMeRaA03S02  = DayCasMeRaA03S02  / DayDeaMeRaA03S02   
{txt}(145 missing values generated)

{com}. 
. label var DayCTDMeRaA03S02  "Daily Cases to Deaths S2 IMPE"
{txt}
{com}. 
. gen TotCTDMeRaA03S02  = TotCasMeRaA03S02  / TotDeaMeRaA03S02   
{txt}(142 missing values generated)

{com}. 
. label var TotCTDMeRaA03S02  "Total Cases to Deaths S2 IMPE"
{txt}
{com}. 
. 
. 
. gen DayCTDMeRaA03S03  = DayCasMeRaA03S03  / DayDeaMeRaA03S03   
{txt}(145 missing values generated)

{com}. 
. label var DayCTDMeRaA03S03  "Daily Cases to Deaths S3 IMPE"
{txt}
{com}. 
. gen TotCTDMeRaA03S03  = TotCasMeRaA03S03  / TotDeaMeRaA03S03   
{txt}(142 missing values generated)

{com}. 
. label var TotCTDMeRaA03S03  "Total Cases to Deaths S3 IMPE"
{txt}
{com}. 
. 
. 
. 
. 
. gen DayCTDMeRaA04S00  = DayCasMeRaA04S00  / DayDeaMeRaA04S00   
{txt}(209 missing values generated)

{com}. 
. label var DayCTDMeRaA04S00  "Daily Cases to Deaths S0 LANL"
{txt}
{com}. 
. gen TotCTDMeRaA04S00  = TotCasMeRaA04S00  / TotDeaMeRaA04S00   
{txt}(208 missing values generated)

{com}. 
. label var TotCTDMeRaA04S00  "Total Cases to Deaths S0 LANL"
{txt}
{com}. 
. 
. 
. 
. 
. 
. gen DayCTDMeRaA05S00  = DayCasMeRaA05S00  / DayDeaMeRaA05S00   
{txt}(612 missing values generated)

{com}. 
. label var DayCTDMeRaA05S00  "Daily Cases to Deaths S0 SRIV"
{txt}
{com}. 
. gen TotCTDMeRaA05S00  = TotCasMeRaA05S00  / TotDeaMeRaA05S00   
{txt}(611 missing values generated)

{com}. 
. label var TotCTDMeRaA05S00  "Total Cases to Deaths S0 SRIV"
{txt}
{com}. 
. 
. 
. 
. ***********************
. 
. * daily deaths estimated to reported  
. 
.     
. gen DayDERMeRaA00S00 = DayDeaMeRaA00S00 / DayDeaMeRaA00S00
{txt}(232 missing values generated)

{com}. 
. label var DayDERMeRaA00S00 "Daily Deaths estim to reported JOHN = 1" 
{txt}
{com}. 
. 
. gen DayDERMeRaA01S00 = DayDeaMeRaA01S00 / DayDeaMeRaA00S00
{txt}(689 missing values generated)

{com}. 
. label var DayDERMeRaA01S00 "Daily Deaths estim to reported Mean DELP S0"
{txt}
{com}. 
. line DayDeaMeRaA01S00  DayDeaMeRaA00S00 date
{res}{txt}
{com}. 
. 
. 
. 
. gen DayDERMeRaA02S01 = DayDeaMeRaA02S01 / DayDeaMeRaA00S00
{txt}(232 missing values generated)

{com}. 
. label var DayDERMeRaA02S01 "Daily Deaths estim to reported Mean not smoothed IHME S1"
{txt}
{com}. 
. 
. gen DayDERMeRaA02S02 = DayDeaMeRaA02S02 / DayDeaMeRaA00S00
{txt}(232 missing values generated)

{com}. 
. label var DayDERMeRaA02S02 "Daily Deaths estim to reported Mean not smoothed IHME S2"
{txt}
{com}. 
. 
. gen DayDERMeRaA02S03 = DayDeaMeRaA02S03 / DayDeaMeRaA00S00
{txt}(232 missing values generated)

{com}. 
. label var DayDERMeRaA02S03 "Daily Deaths estim to reported Mean not smoothed IHME S3"
{txt}
{com}. 
. 
. 
. gen DayDERMeRaA03S01 = DayDeaMeRaA03S01 / DayDeaMeRaA00S00
{txt}(232 missing values generated)

{com}. 
. label var DayDERMeRaA03S01 "Daily Deaths estim to reported Mean S1 IMPE"
{txt}
{com}. 
. 
. gen DayDERMeRaA03S02 = DayDeaMeRaA03S02 / DayDeaMeRaA00S00
{txt}(232 missing values generated)

{com}. 
. label var DayDERMeRaA03S02 "Daily Deaths estim to reported Mean S2 IMPE"
{txt}
{com}. 
. 
. gen DayDERMeRaA03S03 = DayDeaMeRaA03S03 / DayDeaMeRaA00S00
{txt}(232 missing values generated)

{com}. 
. label var DayDERMeRaA03S03 "Daily Deaths estim to reported Mean S3 IMPE"
{txt}
{com}. 
. 
. 
. gen DayDERMeRaA04S00 = DayDeaMeRaA04S00 / DayDeaMeRaA00S00
{txt}(232 missing values generated)

{com}. 
. label var DayDERMeRaA04S00 "Daily Deaths estim to reported to Deaths S0 LANL"
{txt}
{com}. 
. 
. 
. gen DayDERMeRaA05S00  = DayDeaMeRaA05S00 / DayDeaMeRaA00S00
{txt}(688 missing values generated)

{com}. 
. label var DayDERMeRaA05S00 "Daily Deaths estim to reported S0 SRIV"
{txt}
{com}. 
. 
. 
. 
. 
. 
. * daily cases estimated to reported  
. 
. 
. gen DayCERMeRaA00S00 = DayCasMeRaA00S00 / DayCasMeRaA00S00
{txt}(231 missing values generated)

{com}. 
. label var DayCERMeRaA00S00 "Daily Cases estim to reported JOHN = 1" 
{txt}
{com}. 
. 
. 
. gen DayCERMeRaA01S00 = DayCasMeRaA01S00 / DayCasMeRaA00S00
{txt}(689 missing values generated)

{com}. 
. label var DayCERMeRaA01S00 "Daily Cases estim to reported Mean DELP S0"
{txt}
{com}. 
. 
. 
. gen DayCERMeRaA02S01 = DayCasMeRaA02S01 / DayCasMeRaA00S00
{txt}(231 missing values generated)

{com}. 
. label var DayCERMeRaA02S01 "Daily Cases estim to reported Mean not smoothed IHME S1"
{txt}
{com}. 
. 
. gen DayCERMeRaA02S02 = DayCasMeRaA02S02 / DayCasMeRaA00S00
{txt}(684 missing values generated)

{com}. 
. label var DayCERMeRaA02S02 "Daily Cases estim to reported Mean not smoothed IHME S2"
{txt}
{com}. 
. 
. gen DayCERMeRaA02S03 = DayCasMeRaA02S03 / DayCasMeRaA00S00
{txt}(684 missing values generated)

{com}. 
. label var DayCERMeRaA02S03 "Daily Cases estim to reported Mean not smoothed IHME S3"
{txt}
{com}. 
. 
. 
. gen DayCERMeRaA03S01 = DayCasMeRaA03S01 / DayCasMeRaA00S00
{txt}(231 missing values generated)

{com}. 
. label var DayCERMeRaA03S01 "Daily Cases estim to reported Mean S1 IMPE"
{txt}
{com}. 
. 
. gen DayCERMeRaA03S02 = DayCasMeRaA03S02 / DayCasMeRaA00S00
{txt}(231 missing values generated)

{com}. 
. label var DayCERMeRaA03S02 "Daily Cases estim to reported Mean S2 IMPE"
{txt}
{com}. 
. 
. gen DayCERMeRaA03S03 = DayCasMeRaA03S03 / DayCasMeRaA00S00
{txt}(231 missing values generated)

{com}. 
. label var DayCERMeRaA03S03 "Daily Cases estim to reported Mean S3 IMPE"
{txt}
{com}. 
. 
. 
. gen DayCERMeRaA04S00 = DayCasMeRaA04S00 / DayCasMeRaA00S00
{txt}(231 missing values generated)

{com}. 
. label var DayCERMeRaA04S00 "Daily Cases estim to reported to Cases S0 LANL"
{txt}
{com}. 
. 
. 
. gen DayCERMeRaA05S00  = DayCasMeRaA05S00 / DayCasMeRaA00S00
{txt}(688 missing values generated)

{com}. 
. label var DayCERMeRaA05S00 "Daily Cases estim to reported S0 SRIV"
{txt}
{com}. 
. 
. 
. 
. 
. 
. * Total deaths estimated to reported  
. 
. 
. gen TotDERMeRaA00S00 = TotDeaMeRaA00S00 / TotDeaMeRaA00S00
{txt}(231 missing values generated)

{com}. 
. label var TotDERMeRaA00S00 "Total Deaths estim to reported JOHN = 1" 
{txt}
{com}. 
. 
. 
. gen TotDERMeRaA01S00 = TotDeaMeRaA01S00 / TotDeaMeRaA00S00
{txt}(688 missing values generated)

{com}. 
. label var TotDERMeRaA01S00 "Total Deaths estim to reported Mean DELP S0"
{txt}
{com}. 
. 
. 
. gen TotDERMeRaA02S01 = TotDeaMeRaA02S01 / TotDeaMeRaA00S00
{txt}(231 missing values generated)

{com}. 
. label var TotDERMeRaA02S01 "Total Deaths estim to reported Mean not smoothed IHME S1"
{txt}
{com}. 
. 
. gen TotDERMeRaA02S02 = TotDeaMeRaA02S02 / TotDeaMeRaA00S00
{txt}(231 missing values generated)

{com}. 
. label var TotDERMeRaA02S02 "Total Deaths estim to reported Mean not smoothed IHME S2"
{txt}
{com}. 
. 
. gen TotDERMeRaA02S03 = TotDeaMeRaA02S03 / TotDeaMeRaA00S00
{txt}(231 missing values generated)

{com}. 
. label var TotDERMeRaA02S03 "Total Deaths estim to reported Mean not smoothed IHME S3"
{txt}
{com}. 
. 
. 
. gen TotDERMeRaA03S01 = TotDeaMeRaA03S01 / TotDeaMeRaA00S00
{txt}(231 missing values generated)

{com}. 
. label var TotDERMeRaA03S01 "Total Deaths estim to reported Mean S1 IMPE"
{txt}
{com}. 
. 
. gen TotDERMeRaA03S02 = TotDeaMeRaA03S02 / TotDeaMeRaA00S00
{txt}(231 missing values generated)

{com}. 
. label var TotDERMeRaA03S02 "Total Deaths estim to reported Mean S2 IMPE"
{txt}
{com}. 
. 
. gen TotDERMeRaA03S03 = TotDeaMeRaA03S03 / TotDeaMeRaA00S00
{txt}(231 missing values generated)

{com}. 
. label var TotDERMeRaA03S03 "Total Deaths estim to reported Mean S3 IMPE"
{txt}
{com}. 
. 
. 
. gen TotDERMeRaA04S00 = TotDeaMeRaA04S00 / TotDeaMeRaA00S00
{txt}(231 missing values generated)

{com}. 
. label var TotDERMeRaA04S00 "Total Deaths estim to reported to Deaths S0 LANL"
{txt}
{com}. 
. 
. 
. gen TotDERMeRaA05S00  = TotDeaMeRaA05S00 / TotDeaMeRaA00S00
{txt}(687 missing values generated)

{com}. 
. label var TotDERMeRaA05S00 "Total Deaths estim to reported S0 SRIV"
{txt}
{com}. 
. 
. 
. 
. 
. 
. * Total cases estimated to reported  
. 
. 
. gen TotCERMeRaA00S00 = TotCasMeRaA00S00 / TotCasMeRaA00S00
{txt}(231 missing values generated)

{com}. 
. label var TotCERMeRaA00S00 "Total Cases estim to reported JOHN = 1" 
{txt}
{com}. 
. 
. gen TotCERMeRaA01S00 = TotCasMeRaA01S00 / TotCasMeRaA00S00
{txt}(688 missing values generated)

{com}. 
. label var TotCERMeRaA01S00 "Total Cases estim to reported Mean DELP S0"
{txt}
{com}. 
. 
. 
. gen TotCERMeRaA02S01 = TotCasMeRaA02S01 / TotCasMeRaA00S00
{txt}(231 missing values generated)

{com}. 
. label var TotCERMeRaA02S01 "Total Cases estim to reported Mean not smoothed IHME S1"
{txt}
{com}. 
. 
. gen TotCERMeRaA02S02 = TotCasMeRaA02S02 / TotCasMeRaA00S00
{txt}(712 missing values generated)

{com}. 
. label var TotCERMeRaA02S02 "Total Cases estim to reported Mean not smoothed IHME S2"
{txt}
{com}. 
. 
. gen TotCERMeRaA02S03 = TotCasMeRaA02S03 / TotCasMeRaA00S00
{txt}(712 missing values generated)

{com}. 
. label var TotCERMeRaA02S03 "Total Cases estim to reported Mean not smoothed IHME S3"
{txt}
{com}. 
. 
. 
. gen TotCERMeRaA03S01 = TotCasMeRaA03S01 / TotCasMeRaA00S00
{txt}(231 missing values generated)

{com}. 
. label var TotCERMeRaA03S01 "Total Cases estim to reported Mean S1 IMPE"
{txt}
{com}. 
. 
. gen TotCERMeRaA03S02 = TotCasMeRaA03S02 / TotCasMeRaA00S00
{txt}(231 missing values generated)

{com}. 
. label var TotCERMeRaA03S02 "Total Cases estim to reported Mean S2 IMPE"
{txt}
{com}. 
. 
. gen TotCERMeRaA03S03 = TotCasMeRaA03S03 / TotCasMeRaA00S00
{txt}(231 missing values generated)

{com}. 
. label var TotCERMeRaA03S03 "Total Cases estim to reported Mean S3 IMPE"
{txt}
{com}. 
. 
. 
. gen TotCERMeRaA04S00 = TotCasMeRaA04S00 / TotCasMeRaA00S00
{txt}(231 missing values generated)

{com}. 
. label var TotCERMeRaA04S00 "Total Cases estim to reported to Cases S0 LANL"
{txt}
{com}. 
. 
. 
. gen TotCERMeRaA05S00  = TotCasMeRaA05S00 / TotCasMeRaA00S00
{txt}(687 missing values generated)

{com}. 
. label var TotCERMeRaA05S00 "Total Cases estim to reported S0 SRIV"
{txt}
{com}. 
. 
. 
. 
. *
. 
. di in red "********* Description of vars in final combined file Iran.dta *********" 
{res}{err}********* Description of vars in final combined file Iran.dta *********
{txt}
{com}. 
. 
. desc, fullnames

{txt}Contains data from {res}/Users/farshadpourmalek/Downloads/covir2-main/20210521/code/JOHN/Iran JOHN.dta
{txt}  obs:{res}           712                          
{txt} vars:{res}           497                          14 Jun 2021 20:26
{txt} size:{res}     1,396,944                          
{txt}{hline}
              storage   display    value
variable name   type    format     label      variable label
{hline}
{p 0 48}{res}{bind:date           }{txt}{bind: int     }{bind:{txt}%td..     }{space 1}{bind:         }{bind:  }{res}{res}{p_end}
{p 0 48}{bind:loc_grand_name }{txt}{bind: str4    }{bind:{txt}%9s       }{space 1}{bind:         }{bind:  }{res}{res}Location{p_end}
{p 0 48}DayDeaMeRaA00S00{p_end}
{p 0 48}{space 15}{txt}{bind: int     }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Daily Deaths JOHN{p_end}
{p 0 48}TotDeaMeRaA00S00{p_end}
{p 0 48}{space 15}{txt}{bind: long    }{bind:{txt}%10.0g    }{space 1}{bind:         }{bind:  }{res}{res}Total Deaths JOHN{p_end}
{p 0 48}DayDeaMeRaA00S00_CF2{p_end}
{p 0 48}{space 15}{txt}{bind: int     }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Daily Deaths JOHN correction factor 2{p_end}
{p 0 48}DayDeaMeRaA00S00_CF5{p_end}
{p 0 48}{space 15}{txt}{bind: int     }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Daily Deaths JOHN correction factor 5{p_end}
{p 0 48}TotDeaMeRaA00S00_CF2{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Total Deaths JOHN correction factor 2{p_end}
{p 0 48}TotDeaMeRaA00S00_CF5{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Total Deaths JOHN correction factor 5{p_end}
{p 0 48}DayCasMeRaA00S00{p_end}
{p 0 48}{space 15}{txt}{bind: int     }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Daily Cases JOHN{p_end}
{p 0 48}TotCasMeRaA00S00{p_end}
{p 0 48}{space 15}{txt}{bind: long    }{bind:{txt}%10.0g    }{space 1}{bind:         }{bind:  }{res}{res}Total Cases JOHN{p_end}
{p 0 48}DayCasMeRaA00S00_CF2{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Daily Cases JOHN correction factor 2{p_end}
{p 0 48}DayCasMeRaA00S00_CF5{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Daily Cases JOHN correction factor 5{p_end}
{p 0 48}TotCasMeRaA00S00_CF2{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Total Cases JOHN correction factor 2{p_end}
{p 0 48}TotCasMeRaA00S00_CF5{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Total Cases JOHN correction factor 5{p_end}
{p 0 48}TotRecMeRaA00S00{p_end}
{p 0 48}{space 15}{txt}{bind: long    }{bind:{txt}%10.0g    }{space 1}{bind:         }{bind:  }{res}{res}Total RECovered JOHN{p_end}
{p 0 48}DayRecMeRaA00S00{p_end}
{p 0 48}{space 15}{txt}{bind: int     }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Daily RECovered JOHN{p_end}
{p 0 48}DayCfrMeRaA00S00{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Daily CFR JOHN{p_end}
{p 0 48}DayActMeRaA00S00{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Daily Active JOHN{p_end}
{p 0 48}DayDeMMeRaA00S00{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Daily deaths mean JOHN DayDeM{p_end}
{p 0 48}DayCaMMeRaA00S00{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Daily cases mean JOHN DayCaM{p_end}
{p 0 48}DayCbDMeRaA00S00{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Daily cases mean div by daily deaths mean JOHN DayCbD{p_end}
{p 0 48}DayDeaMeRaA00multip{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Daily deaths scaled (times means of cases by deaths) only for visualization JOHN{p_end}
{p 0 48}TotDeaMeRaA01S00{p_end}
{p 0 48}{space 15}{txt}{bind: long    }{bind:{txt}%12.0g    }{space 1}{bind:         }{bind:  }{res}{res}Total Deaths Mean DELP S0{p_end}
{p 0 48}TotDeaLoRaA01S00{p_end}
{p 0 48}{space 15}{txt}{bind: long    }{bind:{txt}%12.0g    }{space 1}{bind:         }{bind:  }{res}{res}Total Deaths Lower DELP S0{p_end}
{p 0 48}TotDeaUpRaA01S00{p_end}
{p 0 48}{space 15}{txt}{bind: long    }{bind:{txt}%12.0g    }{space 1}{bind:         }{bind:  }{res}{res}Total Deaths Upper DELP S0{p_end}
{p 0 48}DayDeaMeRaA01S00{p_end}
{p 0 48}{space 15}{txt}{bind: int     }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Daily Deaths Mean DELP S0{p_end}
{p 0 48}DayDeaLoRaA01S00{p_end}
{p 0 48}{space 15}{txt}{bind: byte    }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Daily Deaths Lower DELP S0{p_end}
{p 0 48}DayDeaUpRaA01S00{p_end}
{p 0 48}{space 15}{txt}{bind: int     }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Daily Deaths Upper DELP S0{p_end}
{p 0 48}TotCasMeRaA01S00{p_end}
{p 0 48}{space 15}{txt}{bind: long    }{bind:{txt}%12.0g    }{space 1}{bind:         }{bind:  }{res}{res}Total Cases Mean DELP S0{p_end}
{p 0 48}TotCasLoRaA01S00{p_end}
{p 0 48}{space 15}{txt}{bind: long    }{bind:{txt}%12.0g    }{space 1}{bind:         }{bind:  }{res}{res}Total Cases Lower DELP S0{p_end}
{p 0 48}TotCasUpRaA01S00{p_end}
{p 0 48}{space 15}{txt}{bind: long    }{bind:{txt}%12.0g    }{space 1}{bind:         }{bind:  }{res}{res}Total Cases Upper DELP S0{p_end}
{p 0 48}DayCasMeRaA01S00{p_end}
{p 0 48}{space 15}{txt}{bind: int     }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Daily Cases Mean DELP S0{p_end}
{p 0 48}DayCasLoRaA01S00{p_end}
{p 0 48}{space 15}{txt}{bind: int     }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Daily Cases Lower DELP S0{p_end}
{p 0 48}DayCasUpRaA01S00{p_end}
{p 0 48}{space 15}{txt}{bind: int     }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Daily Cases Upper DELP S0{p_end}
{p 0 48}DayActMeRaA01S00{p_end}
{p 0 48}{space 15}{txt}{bind: long    }{bind:{txt}%12.0g    }{space 1}{bind:         }{bind:  }{res}{res}Daily Cases Active Mean DELP S0{p_end}
{p 0 48}DayHosMeRaA01S00{p_end}
{p 0 48}{space 15}{txt}{bind: int     }{bind:{txt}%12.0g    }{space 1}{bind:         }{bind:  }{res}{res}Daily Cases Active Hospitalized Mean DELP S0{p_end}
{p 0 48}DayVenMeRaA01S00{p_end}
{p 0 48}{space 15}{txt}{bind: int     }{bind:{txt}%12.0g    }{space 1}{bind:         }{bind:  }{res}{res}Daily Cases Active Ventilated Mean DELP S0{p_end}
{p 0 48}TotHosMeRaA01S00{p_end}
{p 0 48}{space 15}{txt}{bind: long    }{bind:{txt}%12.0g    }{space 1}{bind:         }{bind:  }{res}{res}Total Cases Active Mean DELP S0{p_end}
{p 0 48}DayCfrMeRaA01S00{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Daily CFR Mean DELP S0 V4{p_end}
{p 0 48}DayCfrLoRaA01S00{p_end}
{p 0 48}{space 15}{txt}{bind: byte    }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Daily CFR Lower DELP S0 V4{p_end}
{p 0 48}DayCfrUpRaA01S00{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Daily CFR Upper DELP S0 V4{p_end}
{p 0 48}DayDeMMeRaA01S00{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Daily deaths mean DELP DayDeM{p_end}
{p 0 48}DayCaMMeRaA01S00{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Daily cases mean DELP DayCaM{p_end}
{p 0 48}DayCbDMeRaA01S00{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Daily cases mean div by daily deaths mean DELP DayCbD{p_end}
{p 0 48}DayDMuMeRaA01S00{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Daily deaths scaled (times means of cases by deaths) only for visualization DELP{p_end}
{p 0 48}DayBedMeSmA02S01{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Daily Beds needed Mean IHME S1{p_end}
{p 0 48}DayBedUpSmA02S01{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Daily Beds needed Upper IHME S1{p_end}
{p 0 48}DayBedLoSmA02S01{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Daily Beds needed Lower IHME S1{p_end}
{p 0 48}DayIcuMeSmA02S01{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Daily ICU beds needed Mean IHME S1{p_end}
{p 0 48}DayIcuUpSmA02S01{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Daily ICU beds needed Upper IHME S1{p_end}
{p 0 48}DayIcuLoSmA02S01{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Daily ICU beds needed Lower IHME S1{p_end}
{p 0 48}DayAdmMeSmA02S01{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Daily hospital admissions Mean IHME S1{p_end}
{p 0 48}DayAdmUpSmA02S01{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Daily hospital admissions Upper IHME S1{p_end}
{p 0 48}DayAdmLoSmA02S01{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Daily hospital admissions Lower IHME S1{p_end}
{p 0 48}DayIcnMeSmA02S01{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Daily new people going to ICU Mean IHME S1{p_end}
{p 0 48}DayIcnUpSmA02S01{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Daily new people going to ICU Upper IHME S1{p_end}
{p 0 48}DayIcnLoSmA02S01{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Daily new people going to ICU Lower IHME S1{p_end}
{p 0 48}DayDeaMeRaA02S01{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Daily Deaths Mean not smoothed IHME S1{p_end}
{p 0 48}DayDeaLoRaA02S01{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Daily Deaths Lower not smoothed IHME S1{p_end}
{p 0 48}DayDeaUpRaA02S01{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Daily Deaths Upper not smoothed IHME S1{p_end}
{p 0 48}TotDeaMeRaA02S01{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Total Deaths Mean not smoothed IHME S1{p_end}
{p 0 48}TotDeaLoRaA02S01{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Total Deaths Lower not smoothed IHME S1{p_end}
{p 0 48}TotDeaUpRaA02S01{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Total Deaths Upper not smoothed IHME S1{p_end}
{p 0 48}DayDeaMeSmA02S01{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Daily Deaths Mean smoothed IHME S1{p_end}
{p 0 48}DayDeaLoSmA02S01{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Daily Deaths Lower smoothed IHME S1{p_end}
{p 0 48}DayDeaUpSmA02S01{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Daily Deaths Upper smoothed IHME S1{p_end}
{p 0 48}TotDeaMeSmA02S01{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Total Deaths Mean smoothed IHME S1{p_end}
{p 0 48}TotDeaLoSmA02S01{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Total Deaths Lower smoothed IHME S1{p_end}
{p 0 48}TotDeaUpSmA02S01{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Total Deaths Upper smoothed IHME S1{p_end}
{p 0 48}deaths_reported_mean{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}{p_end}
{p 0 48}deaths_reported_lower{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}{p_end}
{p 0 48}deaths_reported_upper{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}{p_end}
{p 0 48}totdea_reported_mean{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}{p_end}
{p 0 48}totdea_reported_lower{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}{p_end}
{p 0 48}totdea_reported_upper{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}{p_end}
{p 0 48}deaths_reported_mean_smoothed{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}{p_end}
{p 0 48}deaths_reported_lower_smoothed{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}{p_end}
{p 0 48}deaths_reported_upper_smoothed{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}{p_end}
{p 0 48}totdea_reported_mean_smoothed{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}{p_end}
{p 0 48}totdea_reported_lower_smoothed{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}{p_end}
{p 0 48}totdea_reported_upper_smoothed{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}{p_end}
{p 0 48}TotTesMeSmA02S01{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Total Tests Mean IHME S1{p_end}
{p 0 48}DayCasMeRaA02S01{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Daily Cases Mean not smoothed IHME S1{p_end}
{p 0 48}DayCasLoRaA02S01{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Daily Cases Lower not smoothed IHME S1{p_end}
{p 0 48}DayCasUpRaA02S01{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Daily Cases Upper not smoothed IHME S1{p_end}
{p 0 48}TotCasMeRaA02S01{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Total Cases Mean not smoothed IHME S1{p_end}
{p 0 48}TotCasUpRaA02S01{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Total Cases Upper not smoothed IHME S1{p_end}
{p 0 48}TotCasLoRaA02S01{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Total Cases Lower not smoothed IHME S1{p_end}
{p 0 48}TotSerMeSmA02S01{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Total seroprevalence Mean IHME S1{p_end}
{p 0 48}TotSerLoSmA02S01{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Total seroprevalence Lower IHME S1{p_end}
{p 0 48}TotSerUpSmA02S01{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Total seroprevalence Upper IHME S1{p_end}
{p 0 48}DayDeaMeRaA02S02V04{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Daily Deaths Mean not smoothed IHME S2{p_end}
{p 0 48}DayDeaLoRaA02S02V04{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Daily Deaths Lower not smoothed IHME S2{p_end}
{p 0 48}DayDeaUpRaA02S02V04{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Daily Deaths Upper not smoothed IHME S2{p_end}
{p 0 48}TotDeaMeRaA02S02V04{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Total Deaths Mean not smoothed IHME S2{p_end}
{p 0 48}TotDeaLoRaA02S02V04{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Total Deaths Lower not smoothed IHME S2{p_end}
{p 0 48}TotDeaUpRaA02S02V04{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Total Deaths Upper not smoothed IHME S2{p_end}
{p 0 48}DayDeaMeSmA02S02V04{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Daily Deaths Mean smoothed IHME S2{p_end}
{p 0 48}DayDeaLoSmA02S02V04{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Daily Deaths Lower smoothed IHME S2{p_end}
{p 0 48}DayDeaUpSmA02S02V04{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Daily Deaths Upper smoothed IHME S2{p_end}
{p 0 48}TotDeaMeSmA02S02V04{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Total Deaths Mean smoothed IHME S2{p_end}
{p 0 48}TotDeaLoSmA02S02V04{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Total Deaths Lower smoothed IHME S2{p_end}
{p 0 48}TotDeaUpSmA02S02V04{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Total Deaths Upper smoothed IHME S2{p_end}
{p 0 48}TotTesMeSmA02S02V04{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Total Tests Mean IHME S2{p_end}
{p 0 48}DayCasMeRaA02S02V04{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Daily Cases Mean not smoothed IHME S2{p_end}
{p 0 48}DayCasLoRaA02S02V04{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Daily Cases Lower not smoothed IHME S2{p_end}
{p 0 48}DayCasUpRaA02S02V04{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Daily Cases Upper not smoothed IHME S2{p_end}
{p 0 48}TotCasMeRaA02S02V04{p_end}
{p 0 48}{space 15}{txt}{bind: byte    }{bind:{txt}%8.0g     }{space 1}{bind:         }{bind:  }{res}{res}Total Cases Mean not smoothed IHME S2{p_end}
{p 0 48}TotCasUpRaA02S02V04{p_end}
{p 0 48}{space 15}{txt}{bind: byte    }{bind:{txt}%8.0g     }{space 1}{bind:         }{bind:  }{res}{res}Total Cases Upper not smoothed IHME S2{p_end}
{p 0 48}TotCasLoRaA02S02V04{p_end}
{p 0 48}{space 15}{txt}{bind: byte    }{bind:{txt}%8.0g     }{space 1}{bind:         }{bind:  }{res}{res}Total Cases Lower not smoothed IHME S2{p_end}
{p 0 48}TotSerMeSmA02S02V04{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Total seroprevalence Mean IHME S2{p_end}
{p 0 48}TotSerLoSmA02S02V04{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Total seroprevalence Lower IHME S2{p_end}
{p 0 48}TotSerUpSmA02S02V04{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Total seroprevalence Upper IHME S2{p_end}
{p 0 48}DayDeaMeRaA02S03V04{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Daily Deaths Mean not smoothed IHME S3{p_end}
{p 0 48}DayDeaLoRaA02S03V04{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Daily Deaths Lower not smoothed IHME S3{p_end}
{p 0 48}DayDeaUpRaA02S03V04{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Daily Deaths Upper not smoothed IHME S3{p_end}
{p 0 48}TotDeaMeRaA02S03V04{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Total Deaths Mean not smoothed IHME S3{p_end}
{p 0 48}TotDeaLoRaA02S03V04{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Total Deaths Lower not smoothed IHME S3{p_end}
{p 0 48}TotDeaUpRaA02S03V04{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Total Deaths Upper not smoothed IHME S3{p_end}
{p 0 48}DayDeaMeSmA02S03V04{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Daily Deaths Mean smoothed IHME S3{p_end}
{p 0 48}DayDeaLoSmA02S03V04{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Daily Deaths Lower smoothed IHME S3{p_end}
{p 0 48}DayDeaUpSmA02S03V04{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Daily Deaths Upper smoothed IHME S3{p_end}
{p 0 48}TotDeaMeSmA02S03V04{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Total Deaths Mean smoothed IHME S3{p_end}
{p 0 48}TotDeaLoSmA02S03V04{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Total Deaths Lower smoothed IHME S3{p_end}
{p 0 48}TotDeaUpSmA02S03V04{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Total Deaths Upper smoothed IHME S3{p_end}
{p 0 48}TotTesMeSmA02S03V04{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Total Tests Mean IHME S3{p_end}
{p 0 48}DayCasMeRaA02S03V04{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Daily Cases Mean not smoothed IHME S3{p_end}
{p 0 48}DayCasLoRaA02S03V04{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Daily Cases Lower not smoothed IHME S3{p_end}
{p 0 48}DayCasUpRaA02S03V04{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Daily Cases Upper not smoothed IHME S3{p_end}
{p 0 48}TotCasMeRaA02S03V04{p_end}
{p 0 48}{space 15}{txt}{bind: byte    }{bind:{txt}%8.0g     }{space 1}{bind:         }{bind:  }{res}{res}Total Cases Mean not smoothed IHME S3{p_end}
{p 0 48}TotCasUpRaA02S03V04{p_end}
{p 0 48}{space 15}{txt}{bind: byte    }{bind:{txt}%8.0g     }{space 1}{bind:         }{bind:  }{res}{res}Total Cases Upper not smoothed IHME S3{p_end}
{p 0 48}TotCasLoRaA02S03V04{p_end}
{p 0 48}{space 15}{txt}{bind: byte    }{bind:{txt}%8.0g     }{space 1}{bind:         }{bind:  }{res}{res}Total Cases Lower not smoothed IHME S3{p_end}
{p 0 48}TotSerMeSmA02S03V04{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Total seroprevalence Mean IHME S3{p_end}
{p 0 48}TotSerLoSmA02S03V04{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Total seroprevalence Lower IHME S3{p_end}
{p 0 48}TotSerUpSmA02S03V04{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Total seroprevalence Upper IHME S3{p_end}
{p 0 48}deaths_mean_p100k_rate{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Daily deaths mean raw per 100k rate IHME{p_end}
{p 0 48}deaths_lower_p100k_rate{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Daily deaths lower raw per 100k rate IHME{p_end}
{p 0 48}deaths_upper_p100k_rate{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Daily deaths upper raw per 100k rate IHME{p_end}
{p 0 48}totdea_mean_p100k_rate{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Total deaths mean per raw 100k rate IHME{p_end}
{p 0 48}totdea_lower_p100k_rate{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Total deaths mean per raw 100k rate IHME{p_end}
{p 0 48}totdea_upper_p100k_rate{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Total deaths upper per raw 100k rate IHME{p_end}
{p 0 48}deaths_mean_smoothed_p100k_rate{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Daily deaths mean smoothed per 100k rate IHME{p_end}
{p 0 48}deaths_lower_smoothed_p100k_rate{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Daily deaths lower smoothed per 100k rate IHME{p_end}
{p 0 48}deaths_upper_smoothed_p100k_rate{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Daily deaths upper smoothed per 100k rate IHME{p_end}
{p 0 48}totdea_mean_smoothed_p100k_rate{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Total deaths mean smoothed per 100k rate IHME{p_end}
{p 0 48}totdea_lower_smoothed_p100k_rate{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Total deaths lower smoothed per 100k rate IHME{p_end}
{p 0 48}totdea_upper_smoothed_p100k_rate{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Total deaths upper smoothed per 100k rate IHME{p_end}
{p 0 48}deaths_reported_mean_p100k_rate{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}{p_end}
{p 0 48}deaths_reported_lower_p100k_rate{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}{p_end}
{p 0 48}deaths_reported_upper_p100k_rate{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}{p_end}
{p 0 48}totdea_reported_mean_p100k_rate{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}{p_end}
{p 0 48}totdea_reported_lower_p100k_rate{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}{p_end}
{p 0 48}totdea_reported_upper_p100k_rate{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}{p_end}
{p 0 48}deaths_reported_mean_smoothed_p1{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}deaths_reported_mean_smoothed_p100k_rate{p_end}
{p 0 48}deaths_reported_lower_smoothed_p{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}deaths_reported_lower_smoothed_p100k_rate{p_end}
{p 0 48}deaths_reported_upper_smoothed_p{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}deaths_reported_upper_smoothed_p100k_rate{p_end}
{p 0 48}totdea_reported_mean_smoothed_p1{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}totdea_reported_mean_smoothed_p100k_rate{p_end}
{p 0 48}totdea_reported_lower_smoothed_p{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}totdea_reported_lower_smoothed_p100k_rate{p_end}
{p 0 48}totdea_reported_upper_smoothed_p{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}totdea_reported_upper_smoothed_p100k_rate{p_end}
{p 0 48}confirmed_infections_p100k_rate{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}confirmed infections per 100k rate IHME{p_end}
{p 0 48}est_infections_mean_p100k_rate{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}estimated infections mean per 100k rate IHME{p_end}
{p 0 48}est_infections_lower_p100k_rate{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}estimated infections lower per 100k rate IHME{p_end}
{p 0 48}est_infections_upper_p100k_rate{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}estimated infections upper per 100k rate IHME{p_end}
{p 0 48}DayCfrMeRaA02S01{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Daily CFR Mean Raw IHME S1{p_end}
{p 0 48}DayCfrLoRaA02S01{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Daily CFR Lower Raw IHME S1{p_end}
{p 0 48}DayCfrUpRaA02S01{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Daily CFR Upper Raw IHME S1{p_end}
{p 0 48}DayCfrMeRaA02S02V04{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Daily CFR Mean Raw IHME S2{p_end}
{p 0 48}DayCfrLoRaA02S02V04{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Daily CFR Lower Raw IHME S2{p_end}
{p 0 48}DayCfrUpRaA02S02V04{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Daily CFR Upper Raw IHME S2{p_end}
{p 0 48}DayCfrMeRaA02S03V04{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Daily CFR Mean Raw IHME S3{p_end}
{p 0 48}DayCfrLoRaA02S03V04{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Daily CFR Lower Raw IHME S3{p_end}
{p 0 48}DayCfrUpRaA02S03V04{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Daily CFR Upper Raw IHME S3{p_end}
{p 0 48}DayDeMMeSmA02S01{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Daily deaths mean IHME DayDeM{p_end}
{p 0 48}DayCaMMeRaA02S01{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Daily cases mean IHME DayCaM{p_end}
{p 0 48}DayCbDMeRaA02S01{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Daily cases mean div by daily deaths mean IHME DayCbD{p_end}
{p 0 48}DayDMuMeRaA02S01{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Daily deaths scaled (times means of cases by deaths) IHME{p_end}
{p 0 48}TotDeaMeRaA03S01{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Total Deaths Mean A03 S01 {p_end}
{p 0 48}TotDeaLoRaA03S01{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Total Deaths Lower A03 S01 {p_end}
{p 0 48}TotDeaUpRaA03S01{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Total Deaths Upper A03 S01 {p_end}
{p 0 48}TotDeaMeRaA03S02{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Total Deaths Mean A03 S02 {p_end}
{p 0 48}TotDeaLoRaA03S02{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Total Deaths Lower A03 S02 {p_end}
{p 0 48}TotDeaUpRaA03S02{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Total Deaths Upper A03 S02 {p_end}
{p 0 48}TotDeaMeRaA03S03{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Total Deaths Mean A03 S03 {p_end}
{p 0 48}TotDeaLoRaA03S03{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Total Deaths Lower A03 S03 {p_end}
{p 0 48}TotDeaUpRaA03S03{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Total Deaths Upper A03 S03 {p_end}
{p 0 48}TotDeaMeRaA03S04{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Total Deaths Mean A03 S04 {p_end}
{p 0 48}TotDeaLoRaA03S04{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Total Deaths Lower A03 S04 {p_end}
{p 0 48}TotDeaUpRaA03S04{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Total Deaths Upper A03 S04 {p_end}
{p 0 48}TotDeaMeRaA03S05{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Total Deaths Mean A03 S05 {p_end}
{p 0 48}TotDeaLoRaA03S05{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Total Deaths Lower A03 S05 {p_end}
{p 0 48}TotDeaUpRaA03S05{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Total Deaths Upper A03 S05 {p_end}
{p 0 48}TotDeaMeRaA03S06{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Total Deaths Mean A03 S06 {p_end}
{p 0 48}TotDeaLoRaA03S06{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Total Deaths Lower A03 S06 {p_end}
{p 0 48}TotDeaUpRaA03S06{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Total Deaths Upper A03 S06 {p_end}
{p 0 48}DayDeaMeRaA03S01{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Daily Deaths Mean A03 S01 {p_end}
{p 0 48}DayDeaLoRaA03S01{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Daily Deaths Lower A03 S01 {p_end}
{p 0 48}DayDeaUpRaA03S01{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Daily Deaths Upper A03 S01 {p_end}
{p 0 48}DayDeaMeRaA03S02{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Daily Deaths Mean A03 S02 {p_end}
{p 0 48}DayDeaLoRaA03S02{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Daily Deaths Lower A03 S02 {p_end}
{p 0 48}DayDeaUpRaA03S02{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Daily Deaths Upper A03 S02 {p_end}
{p 0 48}DayDeaMeRaA03S03{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Daily Deaths Mean A03 S03 {p_end}
{p 0 48}DayDeaLoRaA03S03{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Daily Deaths Lower A03 S03 {p_end}
{p 0 48}DayDeaUpRaA03S03{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Daily Deaths Upper A03 S03 {p_end}
{p 0 48}DayDeaMeRaA03S04{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Daily Deaths Mean A03 S04 {p_end}
{p 0 48}DayDeaLoRaA03S04{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Daily Deaths Lower A03 S04 {p_end}
{p 0 48}DayDeaUpRaA03S04{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Daily Deaths Upper A03 S04 {p_end}
{p 0 48}DayDeaMeRaA03S05{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Daily Deaths Mean A03 S05 {p_end}
{p 0 48}DayDeaLoRaA03S05{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Daily Deaths Lower A03 S05 {p_end}
{p 0 48}DayDeaUpRaA03S05{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Daily Deaths Upper A03 S05 {p_end}
{p 0 48}DayDeaMeRaA03S06{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Daily Deaths Mean A03 S06 {p_end}
{p 0 48}DayDeaLoRaA03S06{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Daily Deaths Lower A03 S06 {p_end}
{p 0 48}DayDeaUpRaA03S06{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Daily Deaths Upper A03 S06 {p_end}
{p 0 48}TotCasMeRaA03S01{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Total Cases Mean A03 S01 {p_end}
{p 0 48}TotCasLoRaA03S01{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Total Cases Lower A03 S01 {p_end}
{p 0 48}TotCasUpRaA03S01{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Total Cases Upper A03 S01 {p_end}
{p 0 48}TotCasMeRaA03S02{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Total Cases Mean A03 S02 {p_end}
{p 0 48}TotCasLoRaA03S02{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Total Cases Lower A03 S02 {p_end}
{p 0 48}TotCasUpRaA03S02{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Total Cases Upper A03 S02 {p_end}
{p 0 48}TotCasMeRaA03S03{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Total Cases Mean A03 S03 {p_end}
{p 0 48}TotCasLoRaA03S03{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Total Cases Lower A03 S03 {p_end}
{p 0 48}TotCasUpRaA03S03{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Total Cases Upper A03 S03 {p_end}
{p 0 48}TotCasMeRaA03S04{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Total Cases Mean A03 S04 {p_end}
{p 0 48}TotCasLoRaA03S04{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Total Cases Lower A03 S04 {p_end}
{p 0 48}TotCasUpRaA03S04{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Total Cases Upper A03 S04 {p_end}
{p 0 48}TotCasMeRaA03S05{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Total Cases Mean A03 S05 {p_end}
{p 0 48}TotCasLoRaA03S05{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Total Cases Lower A03 S05 {p_end}
{p 0 48}TotCasUpRaA03S05{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Total Cases Upper A03 S05 {p_end}
{p 0 48}TotCasMeRaA03S06{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Total Cases Mean A03 S06 {p_end}
{p 0 48}TotCasLoRaA03S06{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Total Cases Lower A03 S06 {p_end}
{p 0 48}TotCasUpRaA03S06{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Total Cases Upper A03 S06 {p_end}
{p 0 48}DayCasMeRaA03S01{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Daily Cases Mean A03 S01 {p_end}
{p 0 48}DayCasLoRaA03S01{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Daily Cases Lower A03 S01 {p_end}
{p 0 48}DayCasUpRaA03S01{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Daily Cases Upper A03 S01 {p_end}
{p 0 48}DayCasMeRaA03S02{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Daily Cases Mean A03 S02 {p_end}
{p 0 48}DayCasLoRaA03S02{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Daily Cases Lower A03 S02 {p_end}
{p 0 48}DayCasUpRaA03S02{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Daily Cases Upper A03 S02 {p_end}
{p 0 48}DayCasMeRaA03S03{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Daily Cases Mean A03 S03 {p_end}
{p 0 48}DayCasLoRaA03S03{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Daily Cases Lower A03 S03 {p_end}
{p 0 48}DayCasUpRaA03S03{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Daily Cases Upper A03 S03 {p_end}
{p 0 48}DayCasMeRaA03S04{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Daily Cases Mean A03 S04 {p_end}
{p 0 48}DayCasLoRaA03S04{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Daily Cases Lower A03 S04 {p_end}
{p 0 48}DayCasUpRaA03S04{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Daily Cases Upper A03 S04 {p_end}
{p 0 48}DayCasMeRaA03S05{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Daily Cases Mean A03 S05 {p_end}
{p 0 48}DayCasLoRaA03S05{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Daily Cases Lower A03 S05 {p_end}
{p 0 48}DayCasUpRaA03S05{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Daily Cases Upper A03 S05 {p_end}
{p 0 48}DayCasMeRaA03S06{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Daily Cases Mean A03 S06 {p_end}
{p 0 48}DayCasLoRaA03S06{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Daily Cases Lower A03 S06 {p_end}
{p 0 48}DayCasUpRaA03S06{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Daily Cases Upper A03 S06 {p_end}
{p 0 48}DayHodLoRaA03S01{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Daily hospital demand Lower A03 S01 {p_end}
{p 0 48}DayHodMeRaA03S01{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Daily hospital demand Mean A03 S01 {p_end}
{p 0 48}DayHodUpRaA03S01{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Daily hospital demand Upper A03 S01 {p_end}
{p 0 48}DayHodLoRaA03S02{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Daily hospital demand Lower A03 S02 {p_end}
{p 0 48}DayHodMeRaA03S02{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Daily hospital demand Mean A03 S02 {p_end}
{p 0 48}DayHodUpRaA03S02{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Daily hospital demand Upper A03 S02 {p_end}
{p 0 48}DayHodLoRaA03S03{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Daily hospital demand Lower A03 S03 {p_end}
{p 0 48}DayHodMeRaA03S03{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Daily hospital demand Mean A03 S03 {p_end}
{p 0 48}DayHodUpRaA03S03{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Daily hospital demand Upper A03 S03 {p_end}
{p 0 48}DayHodLoRaA03S04{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Daily hospital demand Lower A03 S04 {p_end}
{p 0 48}DayHodMeRaA03S04{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Daily hospital demand Mean A03 S04 {p_end}
{p 0 48}DayHodUpRaA03S04{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Daily hospital demand Upper A03 S04 {p_end}
{p 0 48}DayHodLoRaA03S05{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Daily hospital demand Lower A03 S05 {p_end}
{p 0 48}DayHodMeRaA03S05{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Daily hospital demand Mean A03 S05 {p_end}
{p 0 48}DayHodUpRaA03S05{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Daily hospital demand Upper A03 S05 {p_end}
{p 0 48}DayHodLoRaA03S06{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Daily hospital demand Lower A03 S06 {p_end}
{p 0 48}DayHodMeRaA03S06{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Daily hospital demand Mean A03 S06 {p_end}
{p 0 48}DayHodUpRaA03S06{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Daily hospital demand Upper A03 S06 {p_end}
{p 0 48}DayHoiLoRaA03S01{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}hospi_incid_y_025_S1{p_end}
{p 0 48}DayHoiMeRaA03S01{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}hospi_incid_y_mea_S1{p_end}
{p 0 48}DayHoiUpRaA03S01{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}hospi_incid_y_975_S1{p_end}
{p 0 48}DayHoiLoRaA03S02{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}hospi_incid_y_025_S2{p_end}
{p 0 48}DayHoiMeRaA03S02{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}hospi_incid_y_mea_S2{p_end}
{p 0 48}DayHoiUpRaA03S02{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}hospi_incid_y_975_S2{p_end}
{p 0 48}DayHoiLoRaA03S03{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}hospi_incid_y_025_S3{p_end}
{p 0 48}DayHoiMeRaA03S03{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}hospi_incid_y_mea_S3{p_end}
{p 0 48}DayHoiUpRaA03S03{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}hospi_incid_y_975_S3{p_end}
{p 0 48}DayHoiLoRaA03S04{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}hospi_incid_y_025_S4{p_end}
{p 0 48}DayHoiMeRaA03S04{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}hospi_incid_y_mea_S4{p_end}
{p 0 48}DayHoiUpRaA03S04{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}hospi_incid_y_975_S4{p_end}
{p 0 48}DayHoiLoRaA03S05{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}hospi_incid_y_025_S5{p_end}
{p 0 48}DayHoiMeRaA03S05{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}hospi_incid_y_mea_S5{p_end}
{p 0 48}DayHoiUpRaA03S05{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}hospi_incid_y_975_S5{p_end}
{p 0 48}DayHoiLoRaA03S06{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}hospi_incid_y_025_S6{p_end}
{p 0 48}DayHoiMeRaA03S06{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}hospi_incid_y_mea_S6{p_end}
{p 0 48}DayHoiUpRaA03S06{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}hospi_incid_y_975_S6{p_end}
{p 0 48}DayIcdLoRaA03S01{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Daily ICU demand Lower A03 S01 {p_end}
{p 0 48}DayIcdMeRaA03S01{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Daily ICU demand Mean A03 S01 {p_end}
{p 0 48}DayIcdUpRaA03S01{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Daily ICU demand Upper A03 S01 {p_end}
{p 0 48}DayIcdLoRaA03S02{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Daily ICU demand Lower A03 S02 {p_end}
{p 0 48}DayIcdMeRaA03S02{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Daily ICU demand Mean A03 S02 {p_end}
{p 0 48}DayIcdUpRaA03S02{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Daily ICU demand Upper A03 S02 {p_end}
{p 0 48}DayIcdLoRaA03S03{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Daily ICU demand Lower A03 S03 {p_end}
{p 0 48}DayIcdMeRaA03S03{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Daily ICU demand Mean A03 S03 {p_end}
{p 0 48}DayIcdUpRaA03S03{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Daily ICU demand Upper A03 S03 {p_end}
{p 0 48}DayIcdLoRaA03S04{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Daily ICU demand Lower A03 S04 {p_end}
{p 0 48}DayIcdMeRaA03S04{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Daily ICU demand Mean A03 S04 {p_end}
{p 0 48}DayIcdUpRaA03S04{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Daily ICU demand Upper A03 S04 {p_end}
{p 0 48}DayIcdLoRaA03S05{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Daily ICU demand Lower A03 S05 {p_end}
{p 0 48}DayIcdMeRaA03S05{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Daily ICU demand Mean A03 S05 {p_end}
{p 0 48}DayIcdUpRaA03S05{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Daily ICU demand Upper A03 S05 {p_end}
{p 0 48}DayIcdLoRaA03S06{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Daily ICU demand Lower A03 S06 {p_end}
{p 0 48}DayIcdMeRaA03S06{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Daily ICU demand Mean A03 S06 {p_end}
{p 0 48}DayIcdUpRaA03S06{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Daily ICU demand Upper A03 S06 {p_end}
{p 0 48}DayIciLoRaA03S01{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}icu___incid_y_025_S1{p_end}
{p 0 48}DayIciMeRaA03S01{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}icu___incid_y_mea_S1{p_end}
{p 0 48}DayIciUpRaA03S01{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}icu___incid_y_975_S1{p_end}
{p 0 48}DayIciLoRaA03S02{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}icu___incid_y_025_S2{p_end}
{p 0 48}DayIciMeRaA03S02{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}icu___incid_y_mea_S2{p_end}
{p 0 48}DayIciUpRaA03S02{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}icu___incid_y_975_S2{p_end}
{p 0 48}DayIciLoRaA03S03{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}icu___incid_y_025_S3{p_end}
{p 0 48}DayIciMeRaA03S03{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}icu___incid_y_mea_S3{p_end}
{p 0 48}DayIciUpRaA03S03{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}icu___incid_y_975_S3{p_end}
{p 0 48}DayIciLoRaA03S04{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}icu___incid_y_025_S4{p_end}
{p 0 48}DayIciMeRaA03S04{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}icu___incid_y_mea_S4{p_end}
{p 0 48}DayIciUpRaA03S04{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}icu___incid_y_975_S4{p_end}
{p 0 48}DayIciLoRaA03S05{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}icu___incid_y_025_S5{p_end}
{p 0 48}DayIciMeRaA03S05{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}icu___incid_y_mea_S5{p_end}
{p 0 48}DayIciUpRaA03S05{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}icu___incid_y_975_S5{p_end}
{p 0 48}DayIciLoRaA03S06{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}icu___incid_y_025_S6{p_end}
{p 0 48}DayIciMeRaA03S06{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}icu___incid_y_mea_S6{p_end}
{p 0 48}DayIciUpRaA03S06{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}icu___incid_y_975_S6{p_end}
{p 0 48}DayPreLoRaA03S01{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Daily prevalence Lower A03 S01 {p_end}
{p 0 48}DayPreMeRaA03S01{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Daily prevalence Mean A03 S01 {p_end}
{p 0 48}DayPreUpRaA03S01{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Daily prevalence Upper A03 S01 {p_end}
{p 0 48}DayPreLoRaA03S02{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Daily prevalence Lower A03 S02 {p_end}
{p 0 48}DayPreMeRaA03S02{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Daily prevalence Mean A03 S02 {p_end}
{p 0 48}DayPreUpRaA03S02{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Daily prevalence Upper A03 S02 {p_end}
{p 0 48}DayPreLoRaA03S03{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Daily prevalence Lower A03 S03 {p_end}
{p 0 48}DayPreMeRaA03S03{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Daily prevalence Mean A03 S03 {p_end}
{p 0 48}DayPreUpRaA03S03{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Daily prevalence Upper A03 S03 {p_end}
{p 0 48}DayPreLoRaA03S04{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Daily prevalence Lower A03 S04 {p_end}
{p 0 48}DayPreMeRaA03S04{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Daily prevalence Mean A03 S04 {p_end}
{p 0 48}DayPreUpRaA03S04{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Daily prevalence Upper A03 S04 {p_end}
{p 0 48}DayPreLoRaA03S05{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Daily prevalence Lower A03 S05 {p_end}
{p 0 48}DayPreMeRaA03S05{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Daily prevalence Mean A03 S05 {p_end}
{p 0 48}DayPreUpRaA03S05{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Daily prevalence Upper A03 S05 {p_end}
{p 0 48}DayPreLoRaA03S06{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Daily prevalence Lower A03 S06 {p_end}
{p 0 48}DayPreMeRaA03S06{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Daily prevalence Mean A03 S06 {p_end}
{p 0 48}DayPreUpRaA03S06{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Daily prevalence Upper A03 S06 {p_end}
{p 0 48}DayRefLoRaA03S01{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Daily R effective Lower A03 S01 {p_end}
{p 0 48}DayRefMeRaA03S01{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Daily R effective Mean A03 S01 {p_end}
{p 0 48}DayRefUpRaA03S01{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Daily R effective Upper A03 S01 {p_end}
{p 0 48}DayRefLoRaA03S02{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Daily R effective Lower A03 S02 {p_end}
{p 0 48}DayRefMeRaA03S02{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Daily R effective Mean A03 S02 {p_end}
{p 0 48}DayRefUpRaA03S02{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Daily R effective Upper A03 S02 {p_end}
{p 0 48}DayRefLoRaA03S03{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Daily R effective Lower A03 S03 {p_end}
{p 0 48}DayRefMeRaA03S03{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Daily R effective Mean A03 S03 {p_end}
{p 0 48}DayRefUpRaA03S03{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Daily R effective Upper A03 S03 {p_end}
{p 0 48}DayRefLoRaA03S04{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Daily R effective Lower A03 S04 {p_end}
{p 0 48}DayRefMeRaA03S04{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Daily R effective Mean A03 S04 {p_end}
{p 0 48}DayRefUpRaA03S04{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Daily R effective Upper A03 S04 {p_end}
{p 0 48}DayRefLoRaA03S05{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Daily R effective Lower A03 S05 {p_end}
{p 0 48}DayRefMeRaA03S05{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Daily R effective Mean A03 S05 {p_end}
{p 0 48}DayRefUpRaA03S05{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Daily R effective Upper A03 S05 {p_end}
{p 0 48}DayRefLoRaA03S06{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Daily R effective Lower A03 S06 {p_end}
{p 0 48}DayRefMeRaA03S06{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Daily R effective Mean A03 S06 {p_end}
{p 0 48}DayRefUpRaA03S06{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Daily R effective Upper A03 S06 {p_end}
{p 0 48}DayRttLoRaA03S01{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Daily R t Lower A03 S01 {p_end}
{p 0 48}DayRttMeRaA03S01{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Daily R t Mean A03 S01 {p_end}
{p 0 48}DayRttUpRaA03S01{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Daily R t Upper A03 S01 {p_end}
{p 0 48}DayRttLoRaA03S02{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Daily R t Lower A03 S02 {p_end}
{p 0 48}DayRttMeRaA03S02{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Daily R t Mean A03 S02 {p_end}
{p 0 48}DayRttUpRaA03S02{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Daily R t Upper A03 S02 {p_end}
{p 0 48}DayRttLoRaA03S03{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Daily R t Lower A03 S03 {p_end}
{p 0 48}DayRttMeRaA03S03{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Daily R t Mean A03 S03 {p_end}
{p 0 48}DayRttUpRaA03S03{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Daily R t Upper A03 S03 {p_end}
{p 0 48}DayRttLoRaA03S04{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Daily R t Lower A03 S04 {p_end}
{p 0 48}DayRttMeRaA03S04{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Daily R t Mean A03 S04 {p_end}
{p 0 48}DayRttUpRaA03S04{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Daily R t Upper A03 S04 {p_end}
{p 0 48}DayRttLoRaA03S05{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Daily R t Lower A03 S05 {p_end}
{p 0 48}DayRttMeRaA03S05{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Daily R t Mean A03 S05 {p_end}
{p 0 48}DayRttUpRaA03S05{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Daily R t Upper A03 S05 {p_end}
{p 0 48}DayRttLoRaA03S06{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Daily R t Lower A03 S06 {p_end}
{p 0 48}DayRttMeRaA03S06{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Daily R t Mean A03 S06 {p_end}
{p 0 48}DayRttUpRaA03S06{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Daily R t Upper A03 S06 {p_end}
{p 0 48}DayCfrMeRaA03S01{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Daily CFR Mean A03 S01 {p_end}
{p 0 48}DayCfrLoRaA03S01{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Daily CFR Lower A03 S01 {p_end}
{p 0 48}DayCfrUpRaA03S01{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Daily CFR Upper A03 S01 {p_end}
{p 0 48}DayCfrMeRaA03S02{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Daily CFR Mean A03 S02 {p_end}
{p 0 48}DayCfrLoRaA03S02{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Daily CFR Lower A03 S02 {p_end}
{p 0 48}DayCfrUpRaA03S02{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Daily CFR Upper A03 S02 {p_end}
{p 0 48}DayCfrMeRaA03S03{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Daily CFR Mean A03 S03 {p_end}
{p 0 48}DayCfrLoRaA03S03{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Daily CFR Lower A03 S03 {p_end}
{p 0 48}DayCfrUpRaA03S03{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Daily CFR Upper A03 S03 {p_end}
{p 0 48}DayCfrMeRaA03S04{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Daily CFR Mean A03 S04 {p_end}
{p 0 48}DayCfrLoRaA03S04{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Daily CFR Lower A03 S04 {p_end}
{p 0 48}DayCfrUpRaA03S04{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Daily CFR Upper A03 S04 {p_end}
{p 0 48}DayCfrMeRaA03S05{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Daily CFR Mean A03 S05 {p_end}
{p 0 48}DayCfrLoRaA03S05{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Daily CFR Lower A03 S05 {p_end}
{p 0 48}DayCfrUpRaA03S05{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Daily CFR Upper A03 S05 {p_end}
{p 0 48}DayCfrMeRaA03S06{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Daily CFR Mean A03 S06 {p_end}
{p 0 48}DayCfrLoRaA03S06{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Daily CFR Lower A03 S06 {p_end}
{p 0 48}DayCfrUpRaA03S06{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Daily CFR Upper A03 S06 {p_end}
{p 0 48}DayDeMMeRaA03S02{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Daily deaths mean IMPE DayDeM{p_end}
{p 0 48}DayCaMMeRaA03S02{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Daily cases mean IMPE DayCaM{p_end}
{p 0 48}DayCbDMeRaA03S02{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Daily cases mean div by daily deaths mean IMPE DayCbD{p_end}
{p 0 48}DayDMuMeRaA03S02{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Daily deaths scaled (times means of cases by deaths) IMPE{p_end}
{p 0 48}TotDeaLoRaA04S00{p_end}
{p 0 48}{space 15}{txt}{bind: double  }{bind:{txt}%8.0g     }{space 1}{bind:         }{bind:  }{res}{res}Total deaths Lower LANL S0{p_end}
{p 0 48}TotDeaMeRaA04S00{p_end}
{p 0 48}{space 15}{txt}{bind: double  }{bind:{txt}%8.0g     }{space 1}{bind:         }{bind:  }{res}{res}Total deaths Mean LANL S0{p_end}
{p 0 48}TotDeaUpRaA04S00{p_end}
{p 0 48}{space 15}{txt}{bind: double  }{bind:{txt}%8.0g     }{space 1}{bind:         }{bind:  }{res}{res}Total deaths Upper LANL S0{p_end}
{p 0 48}DayDeaLoRaA04S00{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%8.0g     }{space 1}{bind:         }{bind:  }{res}{res}Daily deaths Lower LANL S0{p_end}
{p 0 48}DayDeaMeRaA04S00{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%8.0g     }{space 1}{bind:         }{bind:  }{res}{res}Daily deaths Mean LANL S0{p_end}
{p 0 48}DayDeaUpRaA04S00{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%8.0g     }{space 1}{bind:         }{bind:  }{res}{res}Daily deaths Upper LANL S0{p_end}
{p 0 48}TotCasLoRaA04S00{p_end}
{p 0 48}{space 15}{txt}{bind: double  }{bind:{txt}%12.0g    }{space 1}{bind:         }{bind:  }{res}{res}Total Cases Lower LANL S0{p_end}
{p 0 48}TotCasMeRaA04S00{p_end}
{p 0 48}{space 15}{txt}{bind: double  }{bind:{txt}%12.0g    }{space 1}{bind:         }{bind:  }{res}{res}Total Cases Mean LANL S0{p_end}
{p 0 48}TotCasUpRaA04S00{p_end}
{p 0 48}{space 15}{txt}{bind: double  }{bind:{txt}%12.0g    }{space 1}{bind:         }{bind:  }{res}{res}Total Cases Upper LANL S0{p_end}
{p 0 48}DayCasLoRaA04S00{p_end}
{p 0 48}{space 15}{txt}{bind: double  }{bind:{txt}%8.0g     }{space 1}{bind:         }{bind:  }{res}{res}Daily cases Lower LANL S0{p_end}
{p 0 48}DayCasMeRaA04S00{p_end}
{p 0 48}{space 15}{txt}{bind: double  }{bind:{txt}%8.0g     }{space 1}{bind:         }{bind:  }{res}{res}Daily cases Mean LANL S0{p_end}
{p 0 48}DayCasUpRaA04S00{p_end}
{p 0 48}{space 15}{txt}{bind: double  }{bind:{txt}%8.0g     }{space 1}{bind:         }{bind:  }{res}{res}Daily cases Upper LANL S0{p_end}
{p 0 48}DayCfrMeRaA04S00{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Daily CFR Mean LANL S0{p_end}
{p 0 48}DayCfrLoRaA04S00{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Daily CFR Lower LANL S0{p_end}
{p 0 48}DayCfrUpRaA04S00{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Daily CFR Upper LANL S0{p_end}
{p 0 48}DayDeMMeRaA04S00{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Daily deaths mean LANL DayDeM{p_end}
{p 0 48}DayCaMMeRaA04S00{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Daily cases mean LANL DayCaM{p_end}
{p 0 48}DayCbDMeRaA04S00{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Daily cases mean div by daily deaths mean LANL DayCbD{p_end}
{p 0 48}DayDMuMeRaA04S00{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Daily deaths scaled (times means of cases by deaths) LANL{p_end}
{p 0 48}TotCasUpRaA05S00{p_end}
{p 0 48}{space 15}{txt}{bind: long    }{bind:{txt}%12.0g    }{space 1}{bind:         }{bind:  }{res}{res}Total Cases Upper SRIV{p_end}
{p 0 48}TotDeaMeRaA05S00{p_end}
{p 0 48}{space 15}{txt}{bind: long    }{bind:{txt}%12.0g    }{space 1}{bind:         }{bind:  }{res}{res}Total Deaths Mean SRIV{p_end}
{p 0 48}TotDeaLoRaA05S00{p_end}
{p 0 48}{space 15}{txt}{bind: long    }{bind:{txt}%12.0g    }{space 1}{bind:         }{bind:  }{res}{res}Total Deaths Lower SRIV{p_end}
{p 0 48}TotDeaUpRaA05S00{p_end}
{p 0 48}{space 15}{txt}{bind: long    }{bind:{txt}%12.0g    }{space 1}{bind:         }{bind:  }{res}{res}Total Deaths Upper SRIV{p_end}
{p 0 48}TotCasMeRaA05S00{p_end}
{p 0 48}{space 15}{txt}{bind: long    }{bind:{txt}%12.0g    }{space 1}{bind:         }{bind:  }{res}{res}Total Cases Mean SRIV{p_end}
{p 0 48}TotCasLoRaA05S00{p_end}
{p 0 48}{space 15}{txt}{bind: long    }{bind:{txt}%12.0g    }{space 1}{bind:         }{bind:  }{res}{res}Total Cases Lower SRIV{p_end}
{p 0 48}DayDeaMeRaA05S00{p_end}
{p 0 48}{space 15}{txt}{bind: int     }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Daily Deaths Mean SRIV{p_end}
{p 0 48}DayDeaLoRaA05S00{p_end}
{p 0 48}{space 15}{txt}{bind: int     }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Daily Deaths Lower SRIV{p_end}
{p 0 48}DayDeaUpRaA05S00{p_end}
{p 0 48}{space 15}{txt}{bind: int     }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Daily Deaths Upper SRIV{p_end}
{p 0 48}DayCasMeRaA05S00{p_end}
{p 0 48}{space 15}{txt}{bind: int     }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Daily Cases Mean SRIV{p_end}
{p 0 48}DayCasLoRaA05S00{p_end}
{p 0 48}{space 15}{txt}{bind: int     }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Daily Cases Lower SRIV{p_end}
{p 0 48}DayCasUpRaA05S00{p_end}
{p 0 48}{space 15}{txt}{bind: int     }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Daily Cases Upper SRIV{p_end}
{p 0 48}DayCfrMeRaA05S00{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Daily CFR Mean SRIV{p_end}
{p 0 48}DayCfrLoRaA05S00{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Daily CFR Lower SRIV{p_end}
{p 0 48}DayCfrUpRaA05S00{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Daily CFR Upper SRIV{p_end}
{p 0 48}DayDeMMeRaA05S00{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Daily deaths mean SRIV  DayDeM{p_end}
{p 0 48}DayCaMMeRaA05S00{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Daily cases mean SRIV  DayCaM{p_end}
{p 0 48}DayCbDMeRaA05S00{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Daily cases mean div by daily deaths mean SRIV  DayCbD{p_end}
{p 0 48}DayDMuMeRaA05S00{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Daily deaths scaled (times means of cases by deaths) SRIV {p_end}
{p 0 48}DayActMeRaA06S01{p_end}
{p 0 48}{space 15}{txt}{bind: long    }{bind:{txt}%10.0g    }{space 1}{bind:         }{bind:  }{res}{res}Daily Active cases SOLT S1{p_end}
{p 0 48}DayActMeRaA06S02{p_end}
{p 0 48}{space 15}{txt}{bind: long    }{bind:{txt}%10.0g    }{space 1}{bind:         }{bind:  }{res}{res}Daily Active cases SOLT S2{p_end}
{p 0 48}DayActMeRaA07S09{p_end}
{p 0 48}{space 15}{txt}{bind: long    }{bind:{txt}%10.0g    }{space 1}{bind:         }{bind:  }{res}{res}Daily Active cases GHAN S9{p_end}
{p 0 48}DayCTDMeRaA00S00{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Daily Cases to Deaths S0 JOHN{p_end}
{p 0 48}TotCTDMeRaA00S00{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Total Cases to Deaths S0 JOHN{p_end}
{p 0 48}DayCTDMeRaA01S00{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Daily Cases to Deaths S0 DELP{p_end}
{p 0 48}TotCTDMeRaA01S00{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Total Cases to Deaths S0 DELP{p_end}
{p 0 48}DayCTDMeRaA02S01{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Daily Cases to Deaths S1 IHME{p_end}
{p 0 48}TotCTDMeRaA02S01{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Total Cases to Deaths S1 IHME{p_end}
{p 0 48}DayCTDMeRaA02S02{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Daily Cases to Deaths S2 IHME{p_end}
{p 0 48}TotCTDMeRaA02S02{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Total Cases to Deaths S2 IHME{p_end}
{p 0 48}DayCTDMeRaA02S03{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Daily Cases to Deaths S3 IHME{p_end}
{p 0 48}TotCTDMeRaA02S03{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Total Cases to Deaths S3 IHME{p_end}
{p 0 48}DayCTDMeRaA03S01{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Daily Cases to Deaths S1 IMPE{p_end}
{p 0 48}TotCTDMeRaA03S01{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Total Cases to Deaths S1 IMPE{p_end}
{p 0 48}DayCTDMeRaA03S02{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Daily Cases to Deaths S2 IMPE{p_end}
{p 0 48}TotCTDMeRaA03S02{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Total Cases to Deaths S2 IMPE{p_end}
{p 0 48}DayCTDMeRaA03S03{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Daily Cases to Deaths S3 IMPE{p_end}
{p 0 48}TotCTDMeRaA03S03{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Total Cases to Deaths S3 IMPE{p_end}
{p 0 48}DayCTDMeRaA04S00{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Daily Cases to Deaths S0 LANL{p_end}
{p 0 48}TotCTDMeRaA04S00{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Total Cases to Deaths S0 LANL{p_end}
{p 0 48}DayCTDMeRaA05S00{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Daily Cases to Deaths S0 SRIV{p_end}
{p 0 48}TotCTDMeRaA05S00{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Total Cases to Deaths S0 SRIV{p_end}
{p 0 48}DayDERMeRaA00S00{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Daily Deaths estim to reported JOHN = 1{p_end}
{p 0 48}DayDERMeRaA01S00{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Daily Deaths estim to reported Mean DELP S0{p_end}
{p 0 48}DayDERMeRaA02S01{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Daily Deaths estim to reported Mean not smoothed IHME S1{p_end}
{p 0 48}DayDERMeRaA02S02{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Daily Deaths estim to reported Mean not smoothed IHME S2{p_end}
{p 0 48}DayDERMeRaA02S03{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Daily Deaths estim to reported Mean not smoothed IHME S3{p_end}
{p 0 48}DayDERMeRaA03S01{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Daily Deaths estim to reported Mean S1 IMPE{p_end}
{p 0 48}DayDERMeRaA03S02{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Daily Deaths estim to reported Mean S2 IMPE{p_end}
{p 0 48}DayDERMeRaA03S03{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Daily Deaths estim to reported Mean S3 IMPE{p_end}
{p 0 48}DayDERMeRaA04S00{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Daily Deaths estim to reported to Deaths S0 LANL{p_end}
{p 0 48}DayDERMeRaA05S00{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Daily Deaths estim to reported S0 SRIV{p_end}
{p 0 48}DayCERMeRaA00S00{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Daily Cases estim to reported JOHN = 1{p_end}
{p 0 48}DayCERMeRaA01S00{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Daily Cases estim to reported Mean DELP S0{p_end}
{p 0 48}DayCERMeRaA02S01{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Daily Cases estim to reported Mean not smoothed IHME S1{p_end}
{p 0 48}DayCERMeRaA02S02{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Daily Cases estim to reported Mean not smoothed IHME S2{p_end}
{p 0 48}DayCERMeRaA02S03{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Daily Cases estim to reported Mean not smoothed IHME S3{p_end}
{p 0 48}DayCERMeRaA03S01{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Daily Cases estim to reported Mean S1 IMPE{p_end}
{p 0 48}DayCERMeRaA03S02{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Daily Cases estim to reported Mean S2 IMPE{p_end}
{p 0 48}DayCERMeRaA03S03{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Daily Cases estim to reported Mean S3 IMPE{p_end}
{p 0 48}DayCERMeRaA04S00{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Daily Cases estim to reported to Cases S0 LANL{p_end}
{p 0 48}DayCERMeRaA05S00{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Daily Cases estim to reported S0 SRIV{p_end}
{p 0 48}TotDERMeRaA00S00{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Total Deaths estim to reported JOHN = 1{p_end}
{p 0 48}TotDERMeRaA01S00{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Total Deaths estim to reported Mean DELP S0{p_end}
{p 0 48}TotDERMeRaA02S01{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Total Deaths estim to reported Mean not smoothed IHME S1{p_end}
{p 0 48}TotDERMeRaA02S02{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Total Deaths estim to reported Mean not smoothed IHME S2{p_end}
{p 0 48}TotDERMeRaA02S03{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Total Deaths estim to reported Mean not smoothed IHME S3{p_end}
{p 0 48}TotDERMeRaA03S01{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Total Deaths estim to reported Mean S1 IMPE{p_end}
{p 0 48}TotDERMeRaA03S02{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Total Deaths estim to reported Mean S2 IMPE{p_end}
{p 0 48}TotDERMeRaA03S03{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Total Deaths estim to reported Mean S3 IMPE{p_end}
{p 0 48}TotDERMeRaA04S00{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Total Deaths estim to reported to Deaths S0 LANL{p_end}
{p 0 48}TotDERMeRaA05S00{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Total Deaths estim to reported S0 SRIV{p_end}
{p 0 48}TotCERMeRaA00S00{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Total Cases estim to reported JOHN = 1{p_end}
{p 0 48}TotCERMeRaA01S00{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Total Cases estim to reported Mean DELP S0{p_end}
{p 0 48}TotCERMeRaA02S01{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Total Cases estim to reported Mean not smoothed IHME S1{p_end}
{p 0 48}TotCERMeRaA02S02{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Total Cases estim to reported Mean not smoothed IHME S2{p_end}
{p 0 48}TotCERMeRaA02S03{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Total Cases estim to reported Mean not smoothed IHME S3{p_end}
{p 0 48}TotCERMeRaA03S01{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Total Cases estim to reported Mean S1 IMPE{p_end}
{p 0 48}TotCERMeRaA03S02{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Total Cases estim to reported Mean S2 IMPE{p_end}
{p 0 48}TotCERMeRaA03S03{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Total Cases estim to reported Mean S3 IMPE{p_end}
{p 0 48}TotCERMeRaA04S00{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Total Cases estim to reported to Cases S0 LANL{p_end}
{p 0 48}TotCERMeRaA05S00{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Total Cases estim to reported S0 SRIV{p_end}
{txt}{hline}
Sorted by: 
{res}     Note: Dataset has changed since last saved.
{txt}
{com}.  
.  
. *
. 
. sort date
{txt}
{com}. 
. qui compress
{txt}
{com}. 
. save "Iran.dta", replace
{txt}(note: file Iran.dta not found)
file Iran.dta saved

{com}. 
. export delimited using "Iran.csv", replace 
{res}{txt}(note: file Iran.csv not found)
{txt}file Iran.csv saved

{com}. 
. 
. *
. 
. 
. 
. 
. 
. ***************
. 
. * graphs 
. 
. 
. grstyle init
{res}{txt}
{com}. 
. grstyle color background white
{txt}
{com}. 
. 
. 
. ******************
. 
. ** order of graphs: 
. 
. ** (A) outcomes, (B) correction factors, (C) time coverage, (D) confidence intervals
. 
. 
. 
. ** (A) outcomes: 
. 
. * daily deaths, daily cases, total deaths, total cases, daily CFR, daily active cases, 
. * daily hospital-related outcomes, 
. * daily cases to deaths, total cases to deaths,
. * daily deaths estimated to reported, daily cases estimated to reported, total deaths estimated to reported, total cases estimated to reported
. 
. 
. 
. ** (B) correction factors 2 and 5 (for deaths and cases) 
. 
. * with correction factors 2 and 5, without correction factors 2 and 5
. 
. 
. 
. ** (C) time coverage
. 
. * all time, 2021-01-01 on
. 
. 
. 
. ** (D) confidence intervals 
. 
. * without confidence intervals, with confidence intervals, not show extremes 
. 
. 
. 
. 
. *****************
. 
. * daily deaths (graph numbers start with 11)
. 
. 
. * daily deaths, median or reference scenario
. 
. twoway ///
> (line DayDeaMeRaA00S00 date, sort lcolor(cyan) lwidth(vthick) lpattern(tight_dot)) /// 1 "JOHN"
> (line DayDeaMeRaA01S00 date, sort lcolor(red)) /// 2 "DELP"
> (line DayDeaMeSmA02S01 date, sort lcolor(black)) /// 3 "IHME"
> (line DayDeaMeRaA03S02 date, sort lcolor(magenta)) /// 4 "IMPE"
> (line DayDeaMeRaA04S00 date, sort lcolor(gold)) /// 5 "LANL"
> (line DayDeaMeRaA05S00 date, sort lcolor(green)) /// 6 "SRIV"
> if date >= td(22nov2019) & date <= td(22Dec2021) ///
> , xtitle(Date) xlabel(21875 21905 21935 21965 21994 22025 22056 22087 22118 22149 22180 ///
> 22210 22240 22270 22300 22330 22360 22391 22422 22453 22484 22515 22546 22576 22606 22636, ///
> format(%tdYY-NN-DD) labsize(small)) xlabel(, grid) xlabel(, grid) ///
> xlabel(, angle(forty_five)) ylabel(, format(%9.0fc) labsize(small)) ylabel(, labsize(small) angle(horizontal)) ///
> ytitle(Daily deaths) title("COVID-19 daily deaths, Iran, reference scenarios", size(medium)) /// 
> xscale(lwidth(vthin) lcolor(gray*.2)) yscale(lwidth(vthin) lcolor(gray*.2)) legend(region(lcolor(none))) legend(bexpand) ///
> legend(order(1 "JOHN" 2 "DELP" 3 "IHME" 4 "IMPE" 5 "LANL" 6 "SRIV") size(small) row(1)) ///
> subtitle("  .", size(small) color(white)) ///
> ttext(0 22nov2019  "Aza" 0 22dec2019  "Dey" 0 21jan2020  "Bah" 0 20feb2020  "Esf" ///
> 0 20mar2020  "99"   0 20apr2020  "Ord" 0 21may2020  "Kho" ///
> 0 21jun2020  "Tir"  0 22jul2020  "Mor" 0 22aug2020  "Sha" ///
> 0 22sep2020  "Meh"  0 22oct2020  "Aba" 0 21nov2020  "Aza" ///
> 0 21dec2020  "Dey"  0 20jan2021  "Bah" 0 19feb2021  "Esf" ///
> 0 21mar2021  "00"   0 21apr2021  "Ord" 0 22may2021  "Kho" ///
> 0 22jun2021  "Tir"  0 23jul2021  "Mor" 0 23Aug2021  "Sha" ///
> 0 23Sep2021  "Meh"  0 23Oct2021  "Aba" 0 22Nov2021  "Aza" ///
> 0 22Dec2021  "Dey"  , size(small) color(black) placement(south))
{res}{txt}
{com}. 
. graph save "graph 11 COVID-19 daily deaths, Iran, reference scenarios.gph", replace
{txt}(note: file graph 11 COVID-19 daily deaths, Iran, reference scenarios.gph not found)
{res}{txt}(file graph 11 COVID-19 daily deaths, Iran, reference scenarios.gph saved)

{com}. graph export "graph 11 COVID-19 daily deaths, Iran, reference scenarios.pdf", replace
{txt}(file /Users/farshadpourmalek/Downloads/covir2-main/20210521/code/merge/graph 11 COVID-19 daily deaths, Iran, reference scenarios.pdf written in PDF format)

{com}. 
. 
. 
. * daily deaths, median or reference scenario, w CF
. 
. twoway ///
> (line DayDeaMeRaA00S00 date, sort lcolor(cyan) lwidth(thick) lpattern(tight_dot)) /// 1 "JOHN"
> (line DayDeaMeRaA00S00_CF2 date, sort lcolor(cyan) lpattern(tight_dot)) /// 2 "JOHN" CF2
> (line DayDeaMeRaA00S00_CF5 date, sort lcolor(cyan) lpattern(tight_dot)) /// 3 "JOHN" CF5
> (line DayDeaMeRaA01S00 date, sort lcolor(red)) /// 4 "DELP"
> (line DayDeaMeSmA02S01 date, sort lcolor(black)) /// 5 "IHME"
> (line DayDeaMeRaA03S02 date, sort lcolor(magenta)) /// 6 "IMPE"
> (line DayDeaMeRaA04S00 date, sort lcolor(gold)) /// 7 "LANL"
> (line DayDeaMeRaA05S00 date, sort lcolor(green)) /// 8 "SRIV"
> if date >= td(22nov2019) & date <= td(22Dec2021) ///
> , xtitle(Date) xlabel(21875 21905 21935 21965 21994 22025 22056 22087 22118 22149 22180 ///
> 22210 22240 22270 22300 22330 22360 22391 22422 22453 22484 22515 22546 22576 22606 22636, ///
> format(%tdYY-NN-DD) labsize(small)) xlabel(, grid) xlabel(, grid) ///
> xlabel(, angle(forty_five)) ylabel(, format(%9.0fc) labsize(small))  ylabel(, labsize(small) angle(horizontal)) ///
> ytitle(Daily deaths) title("COVID-19 daily deaths, Iran, reference scenarios", size(medium)) /// 
> xscale(lwidth(vthin) lcolor(gray*.2)) yscale(lwidth(vthin) lcolor(gray*.2)) legend(region(lcolor(none))) legend(bexpand) ///
> legend(order(1 "JOHN" 2 "CF 2" 3 "CF 5" 4 "DELP" 5 "IHME" 6 "IMPE" 7 "LANL" 8 "SRIV") size(small) row(1)) ///
> subtitle("with correction factors 2 and 5", size(small)) ///
> ttext(0 22nov2019  "Aza" 0 22dec2019  "Dey" 0 21jan2020  "Bah" 0 20feb2020  "Esf" ///
> 0 20mar2020  "99"   0 20apr2020  "Ord" 0 21may2020  "Kho" ///
> 0 21jun2020  "Tir"  0 22jul2020  "Mor" 0 22aug2020  "Sha" ///
> 0 22sep2020  "Meh"  0 22oct2020  "Aba" 0 21nov2020  "Aza" ///
> 0 21dec2020  "Dey"  0 20jan2021  "Bah" 0 19feb2021  "Esf" ///
> 0 21mar2021  "00"   0 21apr2021  "Ord" 0 22may2021  "Kho" ///
> 0 22jun2021  "Tir"  0 23jul2021  "Mor" 0 23Aug2021  "Sha" ///
> 0 23Sep2021  "Meh"  0 23Oct2021  "Aba" 0 22Nov2021  "Aza" ///
> 0 22Dec2021  "Dey"  , size(small) color(black) placement(south))
{res}{txt}
{com}. 
. graph save "graph 12 COVID-19 daily deaths, Iran, reference scenarios, w CF.gph", replace
{txt}(note: file graph 12 COVID-19 daily deaths, Iran, reference scenarios, w CF.gph not found)
{res}{txt}(file graph 12 COVID-19 daily deaths, Iran, reference scenarios, w CF.gph saved)

{com}. graph export "graph 12 COVID-19 daily deaths, Iran, reference scenarios, w CF.pdf", replace
{txt}(file /Users/farshadpourmalek/Downloads/covir2-main/20210521/code/merge/graph 12 COVID-19 daily deaths, Iran, reference scenarios, w CF.pdf written in PDF format)

{com}. 
. 
. 
. * daily deaths, median or reference scenario, 2020-12-01 on
. 
. twoway ///
> (line DayDeaMeRaA00S00 date, sort lcolor(cyan) lwidth(vthick) lpattern(tight_dot)) /// 1 "JOHN"
> (line DayDeaMeRaA01S00 date, sort lcolor(red)) /// 2 "DELP"
> (line DayDeaMeSmA02S01 date, sort lcolor(black)) /// 3 "IHME"
> (line DayDeaMeRaA03S02 date, sort lcolor(magenta)) /// 4 "IMPE"
> (line DayDeaMeRaA04S00 date, sort lcolor(gold)) /// 5 "LANL"
> (line DayDeaMeRaA05S00 date, sort lcolor(green)) /// 6 "SRIV"
> if date >= td(20dec2020) & date <= td(23Sep2021) ///
> , xtitle(Date) xlabel(22270 22300 22330 22360 22391 22422 22453 22484 22515 22546, ///
> format(%tdYY-NN-DD) labsize(small)) xlabel(, grid) xlabel(, grid) ///
> xlabel(, angle(forty_five)) ylabel(, format(%9.0fc) labsize(small))  ylabel(, labsize(small) angle(horizontal)) ///
> ytitle(Daily deaths) title("COVID-19 daily deaths, Iran, reference scenarios", size(medium)) /// 
> xscale(lwidth(vthin) lcolor(gray*.2)) yscale(lwidth(vthin) lcolor(gray*.2)) legend(region(lcolor(none))) legend(bexpand) ///
> legend(order(1 "JOHN" 2 "DELP" 3 "IHME" 4 "IMPE" 5 "LANL" 6 "SRIV") size(small) row(1)) ///
> subtitle("after 2020-12-01", size(small)) ///
> ttext(0 21dec2020  "Dey"  0 20jan2021  "Bah" 0 19feb2021  "Esf" ///
> 0 21mar2021  "00"   0 21apr2021  "Ord" 0 22may2021  "Kho" ///
> 0 22jun2021  "Tir"  0 23jul2021  "Mor" 0 23Aug2021  "Sha" ///
> 0 23Sep2021  "Meh"  , size(small) color(black) placement(south))
{res}{txt}
{com}. 
. graph save "graph 13 COVID-19 daily deaths, Iran, reference scenarios, 2020-12-01 on.gph", replace
{txt}(note: file graph 13 COVID-19 daily deaths, Iran, reference scenarios, 2020-12-01 on.gph not found)
{res}{txt}(file graph 13 COVID-19 daily deaths, Iran, reference scenarios, 2020-12-01 on.gph saved)

{com}. graph export "graph 13 COVID-19 daily deaths, Iran, reference scenarios, 2020-12-01 on.pdf", replace
{txt}(file /Users/farshadpourmalek/Downloads/covir2-main/20210521/code/merge/graph 13 COVID-19 daily deaths, Iran, reference scenarios, 2020-12-01 on.pdf written in PDF format)

{com}. 
. 
. 
. * daily deaths, median or reference scenario, Ordibeshet 1400 on
. 
. twoway ///
> (line DayDeaMeRaA00S00 date, sort lcolor(cyan) lwidth(vthick) lpattern(tight_dot)) /// 1 "JOHN"
> (line DayDeaMeRaA01S00 date, sort lcolor(red)) /// 2 "DELP"
> (line DayDeaMeSmA02S01 date, sort lcolor(black)) /// 3 "IHME"
> (line DayDeaMeRaA03S02 date, sort lcolor(magenta)) /// 4 "IMPE"
> (line DayDeaMeRaA04S00 date, sort lcolor(gold)) /// 5 "LANL"
> (line DayDeaMeRaA05S00 date, sort lcolor(green)) /// 6 "SRIV"
> if date >= td(21apr2021) & date <= td(23Sep2021) ///
> , xtitle(Date) xlabel(22391 22422 22453 22484 22515 22546, ///
> format(%tdYY-NN-DD) labsize(small)) xlabel(, grid) xlabel(, grid) ///
> xlabel(, angle(forty_five)) ylabel(, format(%9.0fc) labsize(small))  ylabel(, labsize(small) angle(horizontal)) ///
> ytitle(Daily deaths) title("COVID-19 daily deaths, Iran, reference scenarios", size(medium)) /// 
> xscale(lwidth(vthin) lcolor(gray*.2)) yscale(lwidth(vthin) lcolor(gray*.2)) legend(region(lcolor(none))) legend(bexpand) ///
> legend(order(1 "JOHN" 2 "DELP" 3 "IHME" 4 "IMPE" 5 "LANL" 6 "SRIV") size(small) row(1)) ///
> subtitle("after Ordibeshet 1400", size(small)) ///
> ttext(0 21apr2021  "Ord" 0 22may2021  "Kho" ///
> 0 22jun2021  "Tir"  0 23jul2021  "Mor" 0 23Aug2021  "Sha" ///
> 0 23Sep2021  "Meh"  , size(small) color(black) placement(south))
{res}{txt}
{com}. 
. graph save "graph 14 COVID-19 daily deaths, Iran, reference scenarios, 2020-12-01 on.gph", replace
{txt}(note: file graph 14 COVID-19 daily deaths, Iran, reference scenarios, 2020-12-01 on.gph not found)
{res}{txt}(file graph 14 COVID-19 daily deaths, Iran, reference scenarios, 2020-12-01 on.gph saved)

{com}. graph export "graph 14 COVID-19 daily deaths, Iran, reference scenarios, 2020-12-01 on.pdf", replace
{txt}(file /Users/farshadpourmalek/Downloads/covir2-main/20210521/code/merge/graph 14 COVID-19 daily deaths, Iran, reference scenarios, 2020-12-01 on.pdf written in PDF format)

{com}. 
. 
. 
. * daily deaths, median or reference scenario, 2020-12-01 on, CI
. 
. twoway ///
> (line DayDeaMeRaA00S00 date, sort lcolor(cyan) lwidth(vthick) lpattern(tight_dot)) /// 1 JOHN
> (line DayDeaMeRaA01S00 date, sort lcolor(red)) /// 2 "DELP" mean
> (line DayDeaLoRaA01S00 date, sort lcolor(red) lpattern(dash)) /// 3 "DELP" lower
> (line DayDeaUpRaA01S00 date, sort lcolor(red) lpattern(dash)) /// 4 "DELP" upper
> (line DayDeaMeSmA02S01 date, sort lcolor(black)) /// 5 IHME mean
> (line DayDeaLoSmA02S02 date, sort lcolor(black) lpattern(dash)) /// 6 IHME lower
> (line DayDeaUpSmA02S03 date, sort lcolor(black) lpattern(dash)) /// 7 IHME upper
> (line DayDeaMeRaA03S02 date, sort lcolor(magenta)) /// 8 IMPE mean
> (line DayDeaLoRaA03S02 date, sort lcolor(magenta) lpattern(dash)) /// 9 IMPE lower
> (line DayDeaUpRaA03S02 date, sort lcolor(magenta) lpattern(dash)) /// 10 IMPE upper
> (line DayDeaMeRaA04S00 date, sort lcolor(gold)) /// 11 LANL mean
> (line DayDeaLoRaA04S00 date, sort lcolor(gold) lpattern(dash)) /// 12 LANL lower
> (line DayDeaUpRaA04S00 date, sort lcolor(gold) lpattern(dash)) /// 13 LANL upper
> (line DayDeaMeRaA05S00 date, sort lcolor(green)) /// 14 "SRIV" mean
> (line DayDeaMeRaA05S00 date, sort lcolor(green) lpattern(dash)) /// 15 "SRIV" lower
> (line DayDeaMeRaA05S00 date, sort lcolor(green) lpattern(dash)) /// 16 "SRIV" upper
> if date >= td(30nov2020) & date <= td(23Aug2021)  ///
> , xtitle(Date) xlabel(#9, format(%tdYY-NN-DD) labsize(small)) xlabel(, grid) xlabel(, grid) ///
> xlabel(, angle(forty_five)) ylabel(, format(%9.0fc) labsize(small))  ylabel(, labsize(small) angle(horizontal)) ///
> ytitle(Daily deaths) title("COVID-19 daily deaths, Iran, reference scenarios", size(medium)) ///
> xscale(lwidth(vthin) lcolor(gray*.2)) yscale(lwidth(vthin) lcolor(gray*.2)) legend(region(lcolor(none))) legend(bexpand) ///
> legend(order(1 "JOHN" 2 "DELP" 5 "IHME" 8 "IMPE" 11 "LANL" 14 "SRIV") size(small) row(1)) ///
> subtitle("after 2020-12-01, with uncertainty", size(small)) ///
> note("Uncertainty limits: dashed curves") 
{res}{txt}
{com}. 
. graph save "graph 15 COVID-19 daily deaths, Iran, reference scenarios, 2020-12-01 on, CI.gph", replace
{txt}(note: file graph 15 COVID-19 daily deaths, Iran, reference scenarios, 2020-12-01 on, CI.gph not found)
{res}{txt}(file graph 15 COVID-19 daily deaths, Iran, reference scenarios, 2020-12-01 on, CI.gph saved)

{com}. graph export "graph 15 COVID-19 daily deaths, Iran, reference scenarios, 2020-12-01 on, CI.pdf", replace
{txt}(file /Users/farshadpourmalek/Downloads/covir2-main/20210521/code/merge/graph 15 COVID-19 daily deaths, Iran, reference scenarios, 2020-12-01 on, CI.pdf written in PDF format)

{com}. 
. 
. 
. * daily deaths, median or reference scenario, 2020-12-01 on, CI
. 
. twoway ///
> (line DayDeaMeRaA00S00 date, sort lcolor(cyan) lwidth(vthick) lpattern(tight_dot)) /// 1 JOHN
> (line DayDeaMeRaA01S00 date, sort lcolor(red)) /// 2 "DELP" mean
> (line DayDeaLoRaA01S00 date, sort lcolor(red) lpattern(dash)) /// 3 "DELP" lower
> (line DayDeaUpRaA01S00 date, sort lcolor(red) lpattern(dash)) /// 4 "DELP" upper
> (line DayDeaMeSmA02S01 date, sort lcolor(black)) /// 5 IHME mean
> (line DayDeaLoSmA02S02 date, sort lcolor(black) lpattern(dash)) /// 6 IHME lower
> (line DayDeaUpSmA02S03 date, sort lcolor(black) lpattern(dash)) /// 7 IHME upper
> (line DayDeaMeRaA03S02 date, sort lcolor(magenta)) /// 8 IMPE mean
> (line DayDeaLoRaA03S02 date, sort lcolor(magenta) lpattern(dash)) /// 9 IMPE lower
> (line DayDeaUpRaA03S02 date, sort lcolor(magenta) lpattern(dash)) /// 10 IMPE upper
> (line DayDeaMeRaA04S00 date, sort lcolor(gold)) /// 11 LANL mean
> (line DayDeaLoRaA04S00 date, sort lcolor(gold) lpattern(dash)) /// 12 LANL lower
> (line DayDeaUpRaA04S00 date, sort lcolor(gold) lpattern(dash)) /// 13 LANL upper
> (line DayDeaMeRaA05S00 date, sort lcolor(green)) /// 14 "SRIV" mean
> (line DayDeaMeRaA05S00 date, sort lcolor(green) lpattern(dash)) /// 15 "SRIV" lower
> (line DayDeaMeRaA05S00 date, sort lcolor(green) lpattern(dash)) /// 16 "SRIV" upper
> if date >= td(21apr2021) & date <= td(23Sep2021) ///
> , xtitle(Date) xlabel(22391 22422 22453 22484 22515 22546, ///
> format(%tdYY-NN-DD) labsize(small)) xlabel(, grid) xlabel(, grid) ///
> xlabel(, angle(forty_five)) ylabel(, format(%9.0fc) labsize(small)) ylabel(, labsize(small) angle(horizontal)) ///
> ytitle(Daily deaths) title("COVID-19 daily deaths, Iran, reference scenarios", size(medium)) ///
> xscale(lwidth(vthin) lcolor(gray*.2)) yscale(lwidth(vthin) lcolor(gray*.2)) legend(region(lcolor(none))) legend(bexpand) ///
> legend(order(1 "JOHN" 2 "DELP" 5 "IHME" 8 "IMPE" 11 "LANL" 14 "SRIV") size(small) row(1)) ///
> subtitle("after Ordibeshet 1400, with uncertainty", size(small)) ///
> note("Uncertainty limits: dashed curves") ///
> ttext(0 21apr2021  "Ord" 0 22may2021  "Kho" ///
> 0 22jun2021  "Tir"  0 23jul2021  "Mor" 0 23Aug2021  "Sha" ///
> 0 23Sep2021  "Meh"  , size(small) color(black) placement(south))
{res}{txt}
{com}. 
. graph save "graph 16 COVID-19 daily deaths, Iran, reference scenarios, 2020-12-01 on, CI.gph", replace
{txt}(note: file graph 16 COVID-19 daily deaths, Iran, reference scenarios, 2020-12-01 on, CI.gph not found)
{res}{txt}(file graph 16 COVID-19 daily deaths, Iran, reference scenarios, 2020-12-01 on, CI.gph saved)

{com}. graph export "graph 16 COVID-19 daily deaths, Iran, reference scenarios, 2020-12-01 on, CI.pdf", replace
{txt}(file /Users/farshadpourmalek/Downloads/covir2-main/20210521/code/merge/graph 16 COVID-19 daily deaths, Iran, reference scenarios, 2020-12-01 on, CI.pdf written in PDF format)

{com}. 
. 
. 
. * daily deaths, median or reference scenario, 2020-12-01 on, CI, wo DLEP upper
. 
. twoway ///
> (line DayDeaMeRaA00S00 date, sort lcolor(cyan) lwidth(vthick) lpattern(tight_dot)) /// 1 JOHN
> (line DayDeaMeRaA01S00 date, sort lcolor(red)) /// 2 "DELP" mean
> (line DayDeaLoRaA01S00 date, sort lcolor(red) lpattern(dash)) /// 3 "DELP" lower
> (line DayDeaMeSmA02S01 date, sort lcolor(black)) /// 4 IHME mean
> (line DayDeaLoSmA02S02 date, sort lcolor(black) lpattern(dash)) /// 5 IHME lower
> (line DayDeaUpSmA02S03 date, sort lcolor(black) lpattern(dash)) /// 6 IHME upper
> (line DayDeaMeRaA03S02 date, sort lcolor(magenta)) /// 7 IMPE mean
> (line DayDeaLoRaA03S02 date, sort lcolor(magenta) lpattern(dash)) /// 8 IMPE lower
> (line DayDeaUpRaA03S02 date, sort lcolor(magenta) lpattern(dash)) /// 9 IMPE upper
> (line DayDeaMeRaA04S00 date, sort lcolor(gold)) /// 10 LANL mean
> (line DayDeaLoRaA04S00 date, sort lcolor(gold) lpattern(dash)) /// 11 LANL lower
> (line DayDeaUpRaA04S00 date, sort lcolor(gold) lpattern(dash)) /// 12 LANL upper
> (line DayDeaMeRaA05S00 date, sort lcolor(green)) /// 13 "SRIV" mean
> (line DayDeaMeRaA05S00 date, sort lcolor(green) lpattern(dash)) /// 14 "SRIV" lower
> (line DayDeaMeRaA05S00 date, sort lcolor(green) lpattern(dash)) /// 15 "SRIV" upper
> if date >= td(21apr2021) & date <= td(23Sep2021) ///
> , xtitle(Date) xlabel(22391 22422 22453 22484 22515 22546, ///
> format(%tdYY-NN-DD) labsize(small)) xlabel(, grid) xlabel(, grid) ///
> xlabel(, angle(forty_five)) ylabel(, format(%9.0fc) labsize(small)) ylabel(, labsize(small) angle(horizontal)) ///
> ytitle(Daily deaths) title("COVID-19 daily deaths, Iran, reference scenarios", size(medium)) ///
> xscale(lwidth(vthin) lcolor(gray*.2)) yscale(lwidth(vthin) lcolor(gray*.2)) legend(region(lcolor(none))) legend(bexpand) ///
> legend(order(1 "JOHN" 2 "DELP" 4 "IHME" 7 "IMPE" 10 "LANL" 13 "SRIV") size(small) row(1)) ///
> subtitle("after Ordibeshet 1400, with uncertainty, without DELP upper", size(small)) ///
> note("Uncertainty limits: dashed curves") ///
> ttext(0 21apr2021  "Ord" 0 22may2021  "Kho" ///
> 0 22jun2021  "Tir"  0 23jul2021  "Mor" 0 23Aug2021  "Sha" ///
> 0 23Sep2021  "Meh"  , size(small) color(black) placement(south))
{res}{txt}
{com}. 
. graph save "graph 17 COVID-19 daily deaths, Iran, reference scenarios, 2020-12-01 on, CI, wo DLEP upper.gph", replace
{txt}(note: file graph 17 COVID-19 daily deaths, Iran, reference scenarios, 2020-12-01 on, CI, wo DLEP upper.gph not found)
{res}{txt}(file graph 17 COVID-19 daily deaths, Iran, reference scenarios, 2020-12-01 on, CI, wo DLEP upper.gph saved)

{com}. graph export "graph 17 COVID-19 daily deaths, Iran, reference scenarios, 2020-12-01 on, CI, wo DLEP upper.pdf", replace
{txt}(file /Users/farshadpourmalek/Downloads/covir2-main/20210521/code/merge/graph 17 COVID-19 daily deaths, Iran, reference scenarios, 2020-12-01 on, CI, wo DLEP upper.pdf written in PDF format)

{com}. 
. 
. 
. * daily deaths, after Ordibeshet 1400, full scenarios, with uncertainty, without DELP upper
. 
. twoway ///
> (line DayDeaMeRaA00S00 date, sort lcolor(cyan) lwidth(vthick) lpattern(tight_dot)) /// 1 JOHN
> (line DayDeaMeRaA01S00 date, sort lcolor(red)) /// 2 "DELP" mean
> (line DayDeaLoRaA01S00 date, sort lcolor(red) lpattern(dash)) /// 3 "DELP" lower
> (line DayDeaMeSmA02S01 date, sort lcolor(black)) /// 4 IHME reference mean
> (line DayDeaLoSmA02S02 date, sort lcolor(black) lpattern(dash)) /// 5 IHME reference lower
> (line DayDeaUpSmA02S03 date, sort lcolor(black) lpattern(dash)) /// 6 IHME reference upper
> (line DayDeaMeSmA02S02 date, sort lcolor(black) lwidth(thick) lpattern(tight_dot)) /// 7 IHME better mean
> (line DayDeaMeSmA02S03 date, sort lcolor(black) lwidth(thick) lpattern(tight_dot)) /// 8 IHME worse mean
> (line DayDeaMeRaA03S02 date, sort lcolor(magenta)) /// 9 IMPE reference mean
> (line DayDeaLoRaA03S02 date, sort lcolor(magenta) lwidth(thick) lpattern(tight_dot)) /// 10 IMPE reference lower
> (line DayDeaUpRaA03S02 date, sort lcolor(magenta) lwidth(thick) lpattern(tight_dot)) /// 11 IMPE reference upper
> (line DayDeaMeRaA03S01 date, sort lcolor(magenta)) /// 12 IMPE better mean
> (line DayDeaMeRaA03S03 date, sort lcolor(magenta)) /// 13 IMPE worse mean
> (line DayDeaMeRaA04S00 date, sort lcolor(gold)) /// 14 LANL mean
> (line DayDeaLoRaA04S00 date, sort lcolor(gold) lpattern(dash)) /// 15 LANL lower
> (line DayDeaUpRaA04S00 date, sort lcolor(gold) lpattern(dash)) /// 16 LANL upper
> (line DayDeaMeRaA05S00 date, sort lcolor(green)) /// 17 "SRIV" mean
> (line DayDeaMeRaA05S00 date, sort lcolor(green) lpattern(dash)) /// 18 "SRIV" lower
> (line DayDeaMeRaA05S00 date, sort lcolor(green) lpattern(dash)) /// 19 "SRIV" upper
> if date >= td(21apr2021) & date <= td(23Sep2021) ///
> , xtitle(Date) xlabel(22391 22422 22453 22484 22515 22546, ///
> format(%tdYY-NN-DD) labsize(small)) xlabel(, grid) xlabel(, grid) ///
> xlabel(, angle(forty_five)) ylabel(, format(%9.0fc) labsize(small)) ylabel(, labsize(small) angle(horizontal)) ///
> ytitle(Daily deaths) title("COVID-19 daily deaths, Iran, full scenarios", size(medium)) ///
> xscale(lwidth(vthin) lcolor(gray*.2)) yscale(lwidth(vthin) lcolor(gray*.2)) legend(region(lcolor(none))) legend(bexpand) ///
> legend(order(1 "JOHN" 2 "DELP" 4 "IHME reference mean" 5 "IHME ref uncertainty" 7 "IHME better and worse" ///
> 9 "IMPE reference" 10 "IMPE ref uncertainty" 12 "IMPE better and worse" ///
> 14 "LANL" 17 "SRIV") size(small) row(4)) ///
> subtitle("after Ordibeshet 1400, full scenarios, with uncertainty, without DELP upper", size(small)) ///
> note("Uncertainty limits: dashed (– – –) curves; Better and worse scenarios: tight dot (|||||) curves") ///
> ttext(0 21apr2021  "Ord" 0 22may2021  "Kho" ///
> 0 22jun2021  "Tir"  0 23jul2021  "Mor" 0 23Aug2021  "Sha" ///
> 0 23Sep2021  "Meh"  , size(small) color(black) placement(south))
{res}{txt}
{com}. 
. graph save "graph 18 COVID-19 daily deaths, Iran, full scenarios, 2020-12-01 on, CI.gph", replace
{txt}(note: file graph 18 COVID-19 daily deaths, Iran, full scenarios, 2020-12-01 on, CI.gph not found)
{res}{txt}(file graph 18 COVID-19 daily deaths, Iran, full scenarios, 2020-12-01 on, CI.gph saved)

{com}. graph export "graph 18 COVID-19 daily deaths, Iran, full scenarios, 2020-12-01 on, CI.pdf", replace
{txt}(file /Users/farshadpourmalek/Downloads/covir2-main/20210521/code/merge/graph 18 COVID-19 daily deaths, Iran, full scenarios, 2020-12-01 on, CI.pdf written in PDF format)

{com}. 
. 
. 
. * daily deaths, after Ordibeshet 1400, reference scenario with uncertainty, IHME 
. 
. twoway ///
> (line DayDeaMeRaA00S00 date, sort lcolor(cyan) lwidth(vthick) lpattern(tight_dot)) /// 1 JOHN
> (line DayDeaMeRaA02S01 date, sort lcolor(black)) /// 2 IHME reference mean
> (line DayDeaLoRaA02S01 date, sort lcolor(green) lpattern(dash)) /// 3 IHME reference lower
> (line DayDeaUpRaA02S01 date, sort lcolor(red) lpattern(dash)) /// 4 IHME reference upper
> if date >= td(21apr2021) & date <= td(23Sep2021) ///
> , xtitle(Date) xlabel(22391 22422 22453 22484 22515 22546, ///
> format(%tdYY-NN-DD) labsize(small)) xlabel(, grid) xlabel(, grid) ///
> xlabel(, angle(forty_five)) ylabel(, format(%9.0fc) labsize(small)) ylabel(, labsize(small) angle(horizontal)) ///
> ytitle(Daily deaths) title("COVID-19 daily deaths, Iran, reference scenario with uncertainty, IHME", size(medium)) ///
> xscale(lwidth(vthin) lcolor(gray*.2)) yscale(lwidth(vthin) lcolor(gray*.2)) legend(region(lcolor(none))) legend(bexpand) ///
> legend(order(1 "JOHN" 2 "reference scenario, mean" 3 "reference scenario, lower" 4 "reference scenario, upper") size(small) row(2)) ///
> subtitle("after Ordibeshet 1400", size(small)) ///
> note("Uncertainty limits: dashed (– – –) curves") ///
> ttext(0 21apr2021  "Ord" 0 22may2021  "Kho" ///
> 0 22jun2021  "Tir"  0 23jul2021  "Mor" 0 23Aug2021  "Sha" ///
> 0 23Sep2021  "Meh"  , size(small) color(black) placement(south))
{res}{txt}
{com}. 
. graph save "graph 19 a COVID-19 daily deaths, Iran, reference scenario with uncertainty, IHME.gph", replace
{txt}(note: file graph 19 a COVID-19 daily deaths, Iran, reference scenario with uncertainty, IHME.gph not found)
{res}{txt}(file graph 19 a COVID-19 daily deaths, Iran, reference scenario with uncertainty, IHME.gph saved)

{com}. graph export "graph 19 a COVID-19 daily deaths, Iran, reference scenario with uncertainty, IHME.pdf", replace
{txt}(file /Users/farshadpourmalek/Downloads/covir2-main/20210521/code/merge/graph 19 a COVID-19 daily deaths, Iran, reference scenario with uncertainty, IHME.pdf written in PDF format)

{com}. 
. 
. 
. * daily deaths, after Ordibeshet 1400, 3 scenarios, IHME 
. 
. twoway ///
> (line DayDeaMeRaA00S00 date, sort lcolor(cyan) lwidth(vthick) lpattern(tight_dot)) /// 1 JOHN
> (line DayDeaMeRaA02S01 date, sort lcolor(black)) /// 2 IHME reference mean
> (line DayDeaMeRaA02S02 date, sort lcolor(green) lwidth(thick) lpattern(tight_dot)) /// 3 IHME better mean
> (line DayDeaMeRaA02S03 date, sort lcolor(red) lwidth(thick) lpattern(tight_dot)) /// 4 IHME worse mean
> (line DayDeaUpRaA02S03 date, sort lcolor(red) lpattern(dash)) /// 4 IHME worse upper
> if date >= td(21apr2021) & date <= td(23Sep2021) ///
> , xtitle(Date) xlabel(22391 22422 22453 22484 22515 22546, ///
> format(%tdYY-NN-DD) labsize(small)) xlabel(, grid) xlabel(, grid) ///
> xlabel(, angle(forty_five)) ylabel(, format(%9.0fc) labsize(small)) ylabel(, labsize(small) angle(horizontal)) ///
> ytitle(Daily deaths) title("COVID-19 daily deaths, Iran, 3 scenarios, IHME", size(medium)) ///
> xscale(lwidth(vthin) lcolor(gray*.2)) yscale(lwidth(vthin) lcolor(gray*.2)) legend(region(lcolor(none))) legend(bexpand) ///
> legend(order(1 "JOHN" 2 "reference scenario, mean" 3 "better scenario, mean" 4 "worse scenario, mean") size(small) row(2)) ///
> subtitle("after Ordibeshet 1400", size(small)) ///
> note("Better and worse scenarios: tight dot (|||||) curves; Uncertainty limits: dashed (– – –) curves") ///
> ttext(0 21apr2021  "Ord" 0 22may2021  "Kho" ///
> 0 22jun2021  "Tir"  0 23jul2021  "Mor" 0 23Aug2021  "Sha" ///
> 0 23Sep2021  "Meh"  , size(small) color(black) placement(south))
{res}{txt}
{com}. 
. graph save "graph 19 b COVID-19 daily deaths, Iran, 3 scenarios, IHME.gph", replace
{txt}(note: file graph 19 b COVID-19 daily deaths, Iran, 3 scenarios, IHME.gph not found)
{res}{txt}(file graph 19 b COVID-19 daily deaths, Iran, 3 scenarios, IHME.gph saved)

{com}. graph export "graph 19 b COVID-19 daily deaths, Iran, 3 scenarios, IHME.pdf", replace
{txt}(file /Users/farshadpourmalek/Downloads/covir2-main/20210521/code/merge/graph 19 b COVID-19 daily deaths, Iran, 3 scenarios, IHME.pdf written in PDF format)

{com}. 
. 
. 
. * daily deaths, after Ordibeshet 1400, reference scenario with uncertainty, IMPE 
. 
. twoway ///
> (line DayDeaMeRaA00S00 date, sort lcolor(cyan) lwidth(vthick) lpattern(tight_dot)) /// 1 JOHN
> (line DayDeaMeRaA03S02 date, sort lcolor(black)) /// 2 IMPE reference mean
> (line DayDeaLoRaA03S02 date, sort lcolor(green) lpattern(dash)) /// 3 IMPE reference lower
> (line DayDeaUpRaA03S02 date, sort lcolor(red) lpattern(dash)) /// 4 IMPE reference upper
> if date >= td(21apr2021) & date <= td(23Sep2021) ///
> , xtitle(Date) xlabel(22391 22422 22453 22484 22515 22546, ///
> format(%tdYY-NN-DD) labsize(small)) xlabel(, grid) xlabel(, grid) ///
> xlabel(, angle(forty_five)) ylabel(, format(%9.0fc) labsize(small)) ylabel(, labsize(small) angle(horizontal)) ///
> ytitle(Daily deaths) title("COVID-19 daily deaths, Iran, reference scenario with uncertainty, IMPE", size(medium)) ///
> xscale(lwidth(vthin) lcolor(gray*.2)) yscale(lwidth(vthin) lcolor(gray*.2)) legend(region(lcolor(none))) legend(bexpand) ///
> legend(order(1 "JOHN" 2 "reference scenario, mean" 3 "reference scenario, lower" 4 "reference scenario, upper") size(small) row(2)) ///
> subtitle("after Ordibeshet 1400", size(small)) ///
> note("Uncertainty limits: dashed (– – –) curves") ///
> ttext(0 21apr2021  "Ord" 0 22may2021  "Kho" ///
> 0 22jun2021  "Tir"  0 23jul2021  "Mor" 0 23Aug2021  "Sha" ///
> 0 23Sep2021  "Meh"  , size(small) color(black) placement(south))
{res}{txt}
{com}. 
. graph save "graph 19 c COVID-19 daily deaths, Iran, reference scenario with uncertainty, IMPE.gph", replace
{txt}(note: file graph 19 c COVID-19 daily deaths, Iran, reference scenario with uncertainty, IMPE.gph not found)
{res}{txt}(file graph 19 c COVID-19 daily deaths, Iran, reference scenario with uncertainty, IMPE.gph saved)

{com}. graph export "graph 19 c COVID-19 daily deaths, Iran, reference scenario with uncertainty, IMPE.pdf", replace
{txt}(file /Users/farshadpourmalek/Downloads/covir2-main/20210521/code/merge/graph 19 c COVID-19 daily deaths, Iran, reference scenario with uncertainty, IMPE.pdf written in PDF format)

{com}. 
. 
. 
. * daily deaths, after Ordibeshet 1400, 3 scenarios, IMPE 
. 
. twoway ///
> (line DayDeaMeRaA00S00 date, sort lcolor(cyan) lwidth(vthick) lpattern(tight_dot)) /// 1 JOHN
> (line DayDeaMeRaA03S02 date, sort lcolor(black)) /// 2 IMPE reference mean
> (line DayDeaMeRaA03S01 date, sort lcolor(green) lwidth(thick) lpattern(tight_dot)) /// 3 IMPE better mean
> (line DayDeaMeRaA03S03 date, sort lcolor(red) lwidth(thick) lpattern(tight_dot)) /// 4 IMPE worse mean
> (line DayDeaUpRaA03S03 date, sort lcolor(red) lpattern(dash)) /// 4 IMPE worse upper
> if date >= td(21apr2021) & date <= td(23Sep2021) ///
> , xtitle(Date) xlabel(22391 22422 22453 22484 22515 22546, ///
> format(%tdYY-NN-DD) labsize(small)) xlabel(, grid) xlabel(, grid) ///
> xlabel(, angle(forty_five)) ylabel(, format(%9.0fc) labsize(small)) ylabel(, labsize(small) angle(horizontal)) ///
> ytitle(Daily deaths) title("COVID-19 daily deaths, Iran, 3 scenarios, IMPE", size(medium)) ///
> xscale(lwidth(vthin) lcolor(gray*.2)) yscale(lwidth(vthin) lcolor(gray*.2)) legend(region(lcolor(none))) legend(bexpand) ///
> legend(order(1 "JOHN" 2 "reference scenario, mean" 3 "better scenario, mean" 4 "worse scenario, mean") size(small) row(2)) ///
> subtitle("after Ordibeshet 1400", size(small)) ///
> note("Better and worse scenarios: tight dot (|||||) curves; Uncertainty limits: dashed (– – –) curves") ///
> ttext(0 21apr2021  "Ord" 0 22may2021  "Kho" ///
> 0 22jun2021  "Tir"  0 23jul2021  "Mor" 0 23Aug2021  "Sha" ///
> 0 23Sep2021  "Meh"  , size(small) color(black) placement(south))
{res}{txt}
{com}. 
. graph save "graph 19 d COVID-19 daily deaths, Iran, 3 scenarios, IMPE.gph", replace
{txt}(note: file graph 19 d COVID-19 daily deaths, Iran, 3 scenarios, IMPE.gph not found)
{res}{txt}(file graph 19 d COVID-19 daily deaths, Iran, 3 scenarios, IMPE.gph saved)

{com}. graph export "graph 19 d COVID-19 daily deaths, Iran, 3 scenarios, IMPE.pdf", replace
{txt}(file /Users/farshadpourmalek/Downloads/covir2-main/20210521/code/merge/graph 19 d COVID-19 daily deaths, Iran, 3 scenarios, IMPE.pdf written in PDF format)

{com}. 
. 
. 
. ***********************
. 
. * daily cases (graph numbers start with 21)
. 
. 
. * daily cases, median or reference scenario
. 
. twoway ///
> (line DayCasMeRaA00S00 date, sort lcolor(cyan) lwidth(vthick) lpattern(tight_dot)) /// 1 "JOHN"
> (line DayCasMeRaA01S00 date, sort lcolor(red)) /// 2 "DELP"
> (line DayCasMeRaA02S01 date, sort lcolor(black)) /// 3 "IHME"
> (line DayCasMeRaA03S02 date, sort lcolor(magenta)) /// 4 "IMPE"
> (line DayCasMeRaA04S00 date, sort lcolor(gold)) /// 5 "LANL"
> (line DayCasMeRaA05S00 date, sort lcolor(green)) /// 6 "SRIV"
> if date >= td(22nov2019) & date <= td(22Dec2021) ///
> , xtitle(Date) xlabel(21875 21905 21935 21965 21994 22025 22056 22087 22118 22149 22180 ///
> 22210 22240 22270 22300 22330 22360 22391 22422 22453 22484 22515 22546 22576 22606 22636, ///
> format(%tdYY-NN-DD) labsize(small)) xlabel(, grid) xlabel(, grid) ///
> xlabel(, angle(forty_five)) ylabel(, format(%9.0fc) labsize(small)) ylabel(, labsize(small) angle(horizontal)) ///
> ytitle(Daily cases) title("COVID-19 daily cases, Iran, reference scenarios", size(medium)) /// 
> xscale(lwidth(vthin) lcolor(gray*.2)) yscale(lwidth(vthin) lcolor(gray*.2)) legend(region(lcolor(none))) legend(bexpand) ///
> legend(order(1 "JOHN" 2 "DELP" 3 "IHME" 4 "IMPE" 5 "LANL" 6 "SRIV") size(small) row(1)) ///
> subtitle("  .", size(small) color(white)) ///
> ttext(0 22nov2019  "Aza" 0 22dec2019  "Dey" 0 21jan2020  "Bah" 0 20feb2020  "Esf" ///
> 0 20mar2020  "99"   0 20apr2020  "Ord" 0 21may2020  "Kho" ///
> 0 21jun2020  "Tir"  0 22jul2020  "Mor" 0 22aug2020  "Sha" ///
> 0 22sep2020  "Meh"  0 22oct2020  "Aba" 0 21nov2020  "Aza" ///
> 0 21dec2020  "Dey"  0 20jan2021  "Bah" 0 19feb2021  "Esf" ///
> 0 21mar2021  "00"   0 21apr2021  "Ord" 0 22may2021  "Kho" ///
> 0 22jun2021  "Tir"  0 23jul2021  "Mor" 0 23Aug2021  "Sha" ///
> 0 23Sep2021  "Meh"  0 23Oct2021  "Aba" 0 22Nov2021  "Aza" ///
> 0 22Dec2021  "Dey"  , size(small) color(black) placement(south))
{res}{txt}
{com}. 
. graph save "graph 21 COVID-19 daily cases, Iran, reference scenarios.gph", replace
{txt}(note: file graph 21 COVID-19 daily cases, Iran, reference scenarios.gph not found)
{res}{txt}(file graph 21 COVID-19 daily cases, Iran, reference scenarios.gph saved)

{com}. graph export "graph 21 COVID-19 daily cases, Iran, reference scenarios.pdf", replace
{txt}(file /Users/farshadpourmalek/Downloads/covir2-main/20210521/code/merge/graph 21 COVID-19 daily cases, Iran, reference scenarios.pdf written in PDF format)

{com}. 
. 
. 
. * daily cases, median or reference scenario, w CF
. 
. twoway ///
> (line DayCasMeRaA00S00 date, sort lcolor(cyan) lwidth(thick) lpattern(tight_dot)) /// 1 "JOHN"
> (line DayCasMeRaA00S00_CF2 date, sort lcolor(cyan) lpattern(tight_dot)) /// 2 "JOHN" CF2
> (line DayCasMeRaA00S00_CF5 date, sort lcolor(cyan) lpattern(tight_dot)) /// 3 "JOHN" CF5
> (line DayCasMeRaA01S00 date, sort lcolor(red)) /// 4 "DELP"
> (line DayCasMeRaA02S01 date, sort lcolor(black)) /// 5 "IHME"
> (line DayCasMeRaA03S02 date, sort lcolor(magenta)) /// 6 "IMPE"
> (line DayCasMeRaA04S00 date, sort lcolor(gold)) /// 7 "LANL"
> (line DayCasMeRaA05S00 date, sort lcolor(green)) /// 8 "SRIV"
> if date >= td(22nov2019) & date <= td(22Dec2021) ///
> , xtitle(Date) xlabel(21875 21905 21935 21965 21994 22025 22056 22087 22118 22149 22180 ///
> 22210 22240 22270 22300 22330 22360 22391 22422 22453 22484 22515 22546 22576 22606 22636, ///
> format(%tdYY-NN-DD) labsize(small)) xlabel(, grid) xlabel(, grid) ///
> xlabel(, angle(forty_five)) ylabel(, format(%9.0fc) labsize(small))  ylabel(, labsize(small) angle(horizontal)) ///
> ytitle(Daily cases) title("COVID-19 daily cases, Iran, reference scenarios", size(medium)) /// 
> xscale(lwidth(vthin) lcolor(gray*.2)) yscale(lwidth(vthin) lcolor(gray*.2)) legend(region(lcolor(none))) legend(bexpand) ///
> legend(order(1 "JOHN" 2 "CF 2" 3 "CF 5" 4 "DELP" 5 "IHME" 6 "IMPE" 7 "LANL" 8 "SRIV") size(small) row(1)) ///
> subtitle("with correction factors 2 and 5", size(small)) ///
> ttext(0 22nov2019  "Aza" 0 22dec2019  "Dey" 0 21jan2020  "Bah" 0 20feb2020  "Esf" ///
> 0 20mar2020  "99"   0 20apr2020  "Ord" 0 21may2020  "Kho" ///
> 0 21jun2020  "Tir"  0 22jul2020  "Mor" 0 22aug2020  "Sha" ///
> 0 22sep2020  "Meh"  0 22oct2020  "Aba" 0 21nov2020  "Aza" ///
> 0 21dec2020  "Dey"  0 20jan2021  "Bah" 0 19feb2021  "Esf" ///
> 0 21mar2021  "00"   0 21apr2021  "Ord" 0 22may2021  "Kho" ///
> 0 22jun2021  "Tir"  0 23jul2021  "Mor" 0 23Aug2021  "Sha" ///
> 0 23Sep2021  "Meh"  0 23Oct2021  "Aba" 0 22Nov2021  "Aza" ///
> 0 22Dec2021  "Dey"  , size(small) color(black) placement(south))
{res}{txt}
{com}. 
. graph save "graph 22 COVID-19 daily cases, Iran, reference scenarios, w CF.gph", replace
{txt}(note: file graph 22 COVID-19 daily cases, Iran, reference scenarios, w CF.gph not found)
{res}{txt}(file graph 22 COVID-19 daily cases, Iran, reference scenarios, w CF.gph saved)

{com}. graph export "graph 22 COVID-19 daily cases, Iran, reference scenarios, w CF.pdf", replace
{txt}(file /Users/farshadpourmalek/Downloads/covir2-main/20210521/code/merge/graph 22 COVID-19 daily cases, Iran, reference scenarios, w CF.pdf written in PDF format)

{com}. 
. 
. 
. * daily cases, median or reference scenario, 2020-12-01 on
. 
. twoway ///
> (line DayCasMeRaA00S00 date, sort lcolor(cyan) lwidth(vthick) lpattern(tight_dot)) /// 1 "JOHN"
> (line DayCasMeRaA01S00 date, sort lcolor(red)) /// 2 "DELP"
> (line DayCasMeRaA02S01 date, sort lcolor(black)) /// 3 "IHME"
> (line DayCasMeRaA03S02 date, sort lcolor(magenta)) /// 4 "IMPE"
> (line DayCasMeRaA04S00 date, sort lcolor(gold)) /// 5 "LANL"
> (line DayCasMeRaA05S00 date, sort lcolor(green)) /// 6 "SRIV"
> if date >= td(20dec2020) & date <= td(23Sep2021) ///
> , xtitle(Date) xlabel(22270 22300 22330 22360 22391 22422 22453 22484 22515 22546, ///
> format(%tdYY-NN-DD) labsize(small)) xlabel(, grid) xlabel(, grid) ///
> xlabel(, angle(forty_five)) ylabel(, format(%9.0fc) labsize(small))  ylabel(, labsize(small) angle(horizontal)) ///
> ytitle(Daily cases) title("COVID-19 daily cases, Iran, reference scenarios", size(medium)) /// 
> xscale(lwidth(vthin) lcolor(gray*.2)) yscale(lwidth(vthin) lcolor(gray*.2)) legend(region(lcolor(none))) legend(bexpand) ///
> legend(order(1 "JOHN" 2 "DELP" 3 "IHME" 4 "IMPE" 5 "LANL" 6 "SRIV") size(small) row(1)) ///
> subtitle("after 2020-12-01", size(small)) ///
> ttext(0 21dec2020  "Dey"  0 20jan2021  "Bah" 0 19feb2021  "Esf" ///
> 0 21mar2021  "00"   0 21apr2021  "Ord" 0 22may2021  "Kho" ///
> 0 22jun2021  "Tir"  0 23jul2021  "Mor" 0 23Aug2021  "Sha" ///
> 0 23Sep2021  "Meh"  , size(small) color(black) placement(south))
{res}{txt}
{com}. 
. graph save "graph 23 COVID-19 daily cases, Iran, reference scenarios, 2020-12-01 on.gph", replace
{txt}(note: file graph 23 COVID-19 daily cases, Iran, reference scenarios, 2020-12-01 on.gph not found)
{res}{txt}(file graph 23 COVID-19 daily cases, Iran, reference scenarios, 2020-12-01 on.gph saved)

{com}. graph export "graph 23 COVID-19 daily cases, Iran, reference scenarios, 2020-12-01 on.pdf", replace
{txt}(file /Users/farshadpourmalek/Downloads/covir2-main/20210521/code/merge/graph 23 COVID-19 daily cases, Iran, reference scenarios, 2020-12-01 on.pdf written in PDF format)

{com}. 
. 
. 
. * daily cases, median or reference scenario, Ordibeshet 1400 on
. 
. twoway ///
> (line DayCasMeRaA00S00 date, sort lcolor(cyan) lwidth(vthick) lpattern(tight_dot)) /// 1 "JOHN"
> (line DayCasMeRaA01S00 date, sort lcolor(red)) /// 2 "DELP"
> (line DayCasMeRaA02S01 date, sort lcolor(black)) /// 3 "IHME"
> (line DayCasMeRaA03S02 date, sort lcolor(magenta)) /// 4 "IMPE"
> (line DayCasMeRaA04S00 date, sort lcolor(gold)) /// 5 "LANL"
> (line DayCasMeRaA05S00 date, sort lcolor(green)) /// 6 "SRIV"
> if date >= td(21apr2021) & date <= td(23Sep2021) ///
> , xtitle(Date) xlabel(22391 22422 22453 22484 22515 22546, ///
> format(%tdYY-NN-DD) labsize(small)) xlabel(, grid) xlabel(, grid) ///
> xlabel(, angle(forty_five)) ylabel(, format(%9.0fc) labsize(small))  ylabel(, labsize(small) angle(horizontal)) ///
> ytitle(Daily cases) title("COVID-19 daily cases, Iran, reference scenarios", size(medium)) /// 
> xscale(lwidth(vthin) lcolor(gray*.2)) yscale(lwidth(vthin) lcolor(gray*.2)) legend(region(lcolor(none))) legend(bexpand) ///
> legend(order(1 "JOHN" 2 "DELP" 3 "IHME" 4 "IMPE" 5 "LANL" 6 "SRIV") size(small) row(1)) ///
> subtitle("after Ordibeshet 1400", size(small)) ///
> ttext(0 21apr2021  "Ord" 0 22may2021  "Kho" ///
> 0 22jun2021  "Tir"  0 23jul2021  "Mor" 0 23Aug2021  "Sha" ///
> 0 23Sep2021  "Meh"  , size(small) color(black) placement(south))
{res}{txt}
{com}. 
. graph save "graph 24 COVID-19 daily cases, Iran, reference scenarios, 2020-12-01 on.gph", replace
{txt}(note: file graph 24 COVID-19 daily cases, Iran, reference scenarios, 2020-12-01 on.gph not found)
{res}{txt}(file graph 24 COVID-19 daily cases, Iran, reference scenarios, 2020-12-01 on.gph saved)

{com}. graph export "graph 24 COVID-19 daily cases, Iran, reference scenarios, 2020-12-01 on.pdf", replace
{txt}(file /Users/farshadpourmalek/Downloads/covir2-main/20210521/code/merge/graph 24 COVID-19 daily cases, Iran, reference scenarios, 2020-12-01 on.pdf written in PDF format)

{com}. 
. 
. 
. * daily cases, median or reference scenario, 2020-12-01 on, CI
. 
. twoway ///
> (line DayCasMeRaA00S00 date, sort lcolor(cyan) lwidth(vthick) lpattern(tight_dot)) /// 1 JOHN
> (line DayCasMeRaA01S00 date, sort lcolor(red)) /// 2 "DELP" mean
> (line DayCasLoRaA01S00 date, sort lcolor(red) lpattern(dash)) /// 3 "DELP" lower
> (line DayCasUpRaA01S00 date, sort lcolor(red) lpattern(dash)) /// 4 "DELP" upper
> (line DayCasMeRaA02S01 date, sort lcolor(black)) /// 5 IHME mean
> (line DayCasLoRaA02S01 date, sort lcolor(black) lpattern(dash)) /// 6 IHME lower
> (line DayCasUpRaA02S01 date, sort lcolor(black) lpattern(dash)) /// 7 IHME upper
> (line DayCasMeRaA03S02 date, sort lcolor(magenta)) /// 8 IMPE mean
> (line DayCasLoRaA03S02 date, sort lcolor(magenta) lpattern(dash)) /// 9 IMPE lower
> (line DayCasUpRaA03S02 date, sort lcolor(magenta) lpattern(dash)) /// 10 IMPE upper
> (line DayCasMeRaA04S00 date, sort lcolor(gold)) /// 11 LANL mean
> (line DayCasLoRaA04S00 date, sort lcolor(gold) lpattern(dash)) /// 12 LANL lower
> (line DayCasUpRaA04S00 date, sort lcolor(gold) lpattern(dash)) /// 13 LANL upper
> (line DayCasMeRaA05S00 date, sort lcolor(green)) /// 14 "SRIV" mean
> (line DayCasMeRaA05S00 date, sort lcolor(green) lpattern(dash)) /// 15 "SRIV" lower
> (line DayCasMeRaA05S00 date, sort lcolor(green) lpattern(dash)) /// 16 "SRIV" upper
> if date >= td(30nov2020) & date <= td(23Aug2021)  ///
> , xtitle(Date) xlabel(#9, format(%tdYY-NN-DD) labsize(small)) xlabel(, grid) xlabel(, grid) ///
> xlabel(, angle(forty_five)) ylabel(, format(%9.0fc) labsize(small))  ylabel(, labsize(small) angle(horizontal)) ///
> ytitle(Daily cases) title("COVID-19 daily cases, Iran, reference scenarios", size(medium)) ///
> xscale(lwidth(vthin) lcolor(gray*.2)) yscale(lwidth(vthin) lcolor(gray*.2)) legend(region(lcolor(none))) legend(bexpand) ///
> legend(order(1 "JOHN" 2 "DELP" 5 "IHME" 8 "IMPE" 11 "LANL" 14 "SRIV") size(small) row(1)) ///
> subtitle("after 2020-12-01, with uncertainty", size(small)) ///
> note("Uncertainty limits: dashed curves") 
{res}{txt}
{com}. 
. graph save "graph 25 COVID-19 daily cases, Iran, reference scenarios, 2020-12-01 on, CI.gph", replace
{txt}(note: file graph 25 COVID-19 daily cases, Iran, reference scenarios, 2020-12-01 on, CI.gph not found)
{res}{txt}(file graph 25 COVID-19 daily cases, Iran, reference scenarios, 2020-12-01 on, CI.gph saved)

{com}. graph export "graph 25 COVID-19 daily cases, Iran, reference scenarios, 2020-12-01 on, CI.pdf", replace
{txt}(file /Users/farshadpourmalek/Downloads/covir2-main/20210521/code/merge/graph 25 COVID-19 daily cases, Iran, reference scenarios, 2020-12-01 on, CI.pdf written in PDF format)

{com}. 
. 
. 
. * daily cases, median or reference scenario, 2020-12-01 on, CI
. 
. twoway ///
> (line DayCasMeRaA00S00 date, sort lcolor(cyan) lwidth(vthick) lpattern(tight_dot)) /// 1 JOHN
> (line DayCasMeRaA01S00 date, sort lcolor(red)) /// 2 "DELP" mean
> (line DayCasLoRaA01S00 date, sort lcolor(red) lpattern(dash)) /// 3 "DELP" lower
> (line DayCasUpRaA01S00 date, sort lcolor(red) lpattern(dash)) /// 4 "DELP" upper
> (line DayCasMeRaA02S01 date, sort lcolor(black)) /// 5 IHME mean
> (line DayCasLoRaA02S01 date, sort lcolor(black) lpattern(dash)) /// 6 IHME lower
> (line DayCasUpRaA02S01 date, sort lcolor(black) lpattern(dash)) /// 7 IHME upper
> (line DayCasMeRaA03S02 date, sort lcolor(magenta)) /// 8 IMPE mean
> (line DayCasLoRaA03S02 date, sort lcolor(magenta) lpattern(dash)) /// 9 IMPE lower
> (line DayCasUpRaA03S02 date, sort lcolor(magenta) lpattern(dash)) /// 10 IMPE upper
> (line DayCasMeRaA04S00 date, sort lcolor(gold)) /// 11 LANL mean
> (line DayCasLoRaA04S00 date, sort lcolor(gold) lpattern(dash)) /// 12 LANL lower
> (line DayCasUpRaA04S00 date, sort lcolor(gold) lpattern(dash)) /// 13 LANL upper
> (line DayCasMeRaA05S00 date, sort lcolor(green)) /// 14 "SRIV" mean
> (line DayCasMeRaA05S00 date, sort lcolor(green) lpattern(dash)) /// 15 "SRIV" lower
> (line DayCasMeRaA05S00 date, sort lcolor(green) lpattern(dash)) /// 16 "SRIV" upper
> if date >= td(21apr2021) & date <= td(23Sep2021) ///
> , xtitle(Date) xlabel(22391 22422 22453 22484 22515 22546, ///
> format(%tdYY-NN-DD) labsize(small)) xlabel(, grid) xlabel(, grid) ///
> xlabel(, angle(forty_five)) ylabel(, format(%9.0fc) labsize(small)) ylabel(, labsize(small) angle(horizontal)) ///
> ytitle(Daily cases) title("COVID-19 daily cases, Iran, reference scenarios", size(medium)) ///
> xscale(lwidth(vthin) lcolor(gray*.2)) yscale(lwidth(vthin) lcolor(gray*.2)) legend(region(lcolor(none))) legend(bexpand) ///
> legend(order(1 "JOHN" 2 "DELP" 5 "IHME" 8 "IMPE" 11 "LANL" 14 "SRIV") size(small) row(1)) ///
> subtitle("after Ordibeshet 1400, with uncertainty", size(small)) ///
> note("Uncertainty limits: dashed curves") ///
> ttext(0 21apr2021  "Ord" 0 22may2021  "Kho" ///
> 0 22jun2021  "Tir"  0 23jul2021  "Mor" 0 23Aug2021  "Sha" ///
> 0 23Sep2021  "Meh"  , size(small) color(black) placement(south))
{res}{txt}
{com}. 
. graph save "graph 26 COVID-19 daily cases, Iran, reference scenarios, 2020-12-01 on, CI.gph", replace
{txt}(note: file graph 26 COVID-19 daily cases, Iran, reference scenarios, 2020-12-01 on, CI.gph not found)
{res}{txt}(file graph 26 COVID-19 daily cases, Iran, reference scenarios, 2020-12-01 on, CI.gph saved)

{com}. graph export "graph 26 COVID-19 daily cases, Iran, reference scenarios, 2020-12-01 on, CI.pdf", replace
{txt}(file /Users/farshadpourmalek/Downloads/covir2-main/20210521/code/merge/graph 26 COVID-19 daily cases, Iran, reference scenarios, 2020-12-01 on, CI.pdf written in PDF format)

{com}. 
. 
. 
. * daily cases, after Ordibeshet 1400, full scenarios, with uncertainty, without DELP upper
. 
. twoway ///
> (line DayCasMeRaA00S00 date, sort lcolor(cyan) lwidth(vthick) lpattern(tight_dot)) /// 1 JOHN
> (line DayCasMeRaA01S00 date, sort lcolor(red)) /// 2 "DELP" mean
> (line DayCasLoRaA01S00 date, sort lcolor(red) lpattern(dash)) /// 3 "DELP" lower
> (line DayCasMeRaA02S01 date, sort lcolor(black)) /// 4 IHME reference mean
> (line DayCasLoRaA02S01 date, sort lcolor(black) lpattern(dash)) /// 5 IHME reference lower
> (line DayCasUpRaA02S01 date, sort lcolor(black) lpattern(dash)) /// 6 IHME reference upper
> (line DayCasMeRaA02S02 date, sort lcolor(black) lwidth(thick) lpattern(tight_dot)) /// 7 IHME better mean
> (line DayCasMeRaA02S03 date, sort lcolor(black) lwidth(thick) lpattern(tight_dot)) /// 8 IHME worse mean
> (line DayCasMeRaA03S02 date, sort lcolor(magenta)) /// 9 IMPE reference mean
> (line DayCasLoRaA03S02 date, sort lcolor(magenta) lwidth(thick) lpattern(tight_dot)) /// 10 IMPE reference lower
> (line DayCasUpRaA03S02 date, sort lcolor(magenta) lwidth(thick) lpattern(tight_dot)) /// 11 IMPE reference upper
> (line DayCasMeRaA03S01 date, sort lcolor(magenta)) /// 12 IMPE better mean
> (line DayCasMeRaA03S03 date, sort lcolor(magenta)) /// 13 IMPE worse mean
> (line DayCasMeRaA04S00 date, sort lcolor(gold)) /// 14 LANL mean
> (line DayCasLoRaA04S00 date, sort lcolor(gold) lpattern(dash)) /// 15 LANL lower
> (line DayCasUpRaA04S00 date, sort lcolor(gold) lpattern(dash)) /// 16 LANL upper
> (line DayCasMeRaA05S00 date, sort lcolor(green)) /// 17 "SRIV" mean
> (line DayCasMeRaA05S00 date, sort lcolor(green) lpattern(dash)) /// 18 "SRIV" lower
> (line DayCasMeRaA05S00 date, sort lcolor(green) lpattern(dash)) /// 19 "SRIV" upper
> if date >= td(21apr2021) & date <= td(23Sep2021) ///
> , xtitle(Date) xlabel(22391 22422 22453 22484 22515 22546, ///
> format(%tdYY-NN-DD) labsize(small)) xlabel(, grid) xlabel(, grid) ///
> xlabel(, angle(forty_five)) ylabel(, format(%9.0fc) labsize(small)) ylabel(, labsize(small) angle(horizontal)) ///
> ytitle(Daily cases) title("COVID-19 daily cases, Iran, full scenarios", size(medium)) ///
> xscale(lwidth(vthin) lcolor(gray*.2)) yscale(lwidth(vthin) lcolor(gray*.2)) legend(region(lcolor(none))) legend(bexpand) ///
> legend(order(1 "JOHN" 2 "DELP" 4 "IHME reference mean" 5 "IHME ref uncertainty" 7 "IHME better and worse" ///
> 9 "IMPE reference" 10 "IMPE ref uncertainty" 12 "IMPE better and worse" ///
> 14 "LANL" 17 "SRIV") size(small) row(4)) ///
> subtitle("after Ordibeshet 1400, full scenarios, with uncertainty, without DELP upper", size(small)) ///
> note("Uncertainty limits: dashed (– – –) curves; Better and worse scenarios: tight dot (|||||) curves") ///
> ttext(0 21apr2021  "Ord" 0 22may2021  "Kho" ///
> 0 22jun2021  "Tir"  0 23jul2021  "Mor" 0 23Aug2021  "Sha" ///
> 0 23Sep2021  "Meh"  , size(small) color(black) placement(south))
{res}{txt}
{com}. 
. graph save "graph 27 COVID-19 daily cases, Iran, full scenarios, 2020-12-01 on, CI.gph", replace
{txt}(note: file graph 27 COVID-19 daily cases, Iran, full scenarios, 2020-12-01 on, CI.gph not found)
{res}{txt}(file graph 27 COVID-19 daily cases, Iran, full scenarios, 2020-12-01 on, CI.gph saved)

{com}. graph export "graph 27 COVID-19 daily cases, Iran, full scenarios, 2020-12-01 on, CI.pdf", replace
{txt}(file /Users/farshadpourmalek/Downloads/covir2-main/20210521/code/merge/graph 27 COVID-19 daily cases, Iran, full scenarios, 2020-12-01 on, CI.pdf written in PDF format)

{com}. 
. 
. 
. * daily cases, after Ordibeshet 1400, reference scenario with uncertainty, IHME 
. 
. twoway ///
> (line DayCasMeRaA00S00 date, sort lcolor(cyan) lwidth(vthick) lpattern(tight_dot)) /// 1 JOHN
> (line DayCasMeRaA02S01 date, sort lcolor(black)) /// 2 IHME reference mean
> (line DayCasLoRaA02S01 date, sort lcolor(green) lpattern(dash)) /// 3 IHME reference lower
> (line DayCasUpRaA02S01 date, sort lcolor(red) lpattern(dash)) /// 4 IHME reference upper
> if date >= td(21apr2021) & date <= td(23Sep2021) ///
> , xtitle(Date) xlabel(22391 22422 22453 22484 22515 22546, ///
> format(%tdYY-NN-DD) labsize(small)) xlabel(, grid) xlabel(, grid) ///
> xlabel(, angle(forty_five)) ylabel(, format(%9.0fc) labsize(small)) ylabel(, labsize(small) angle(horizontal)) ///
> ytitle(Daily cases) title("COVID-19 daily cases, Iran, reference scenario with uncertainty, IHME", size(medium)) ///
> xscale(lwidth(vthin) lcolor(gray*.2)) yscale(lwidth(vthin) lcolor(gray*.2)) legend(region(lcolor(none))) legend(bexpand) ///
> legend(order(1 "JOHN" 2 "reference scenario, mean" 3 "reference scenario, lower" 4 "reference scenario, upper") size(small) row(2)) ///
> subtitle("after Ordibeshet 1400", size(small)) ///
> note("Uncertainty limits: dashed (– – –) curves") ///
> ttext(0 21apr2021  "Ord" 0 22may2021  "Kho" ///
> 0 22jun2021  "Tir"  0 23jul2021  "Mor" 0 23Aug2021  "Sha" ///
> 0 23Sep2021  "Meh"  , size(small) color(black) placement(south))
{res}{txt}
{com}. 
. graph save "graph 29 a COVID-19 daily cases, Iran, reference scenario with uncertainty, IHME.gph", replace
{txt}(note: file graph 29 a COVID-19 daily cases, Iran, reference scenario with uncertainty, IHME.gph not found)
{res}{txt}(file graph 29 a COVID-19 daily cases, Iran, reference scenario with uncertainty, IHME.gph saved)

{com}. graph export "graph 29 a COVID-19 daily cases, Iran, reference scenario with uncertainty, IHME.pdf", replace
{txt}(file /Users/farshadpourmalek/Downloads/covir2-main/20210521/code/merge/graph 29 a COVID-19 daily cases, Iran, reference scenario with uncertainty, IHME.pdf written in PDF format)

{com}. 
. 
. 
. * daily cases, after Ordibeshet 1400, 3 scenarios, IHME 
. 
. twoway ///
> (line DayCasMeRaA00S00 date, sort lcolor(cyan) lwidth(vthick) lpattern(tight_dot)) /// 1 JOHN
> (line DayCasMeRaA02S01 date, sort lcolor(black)) /// 2 IHME reference mean
> (line DayCasMeRaA02S02 date, sort lcolor(green) lwidth(thick) lpattern(tight_dot)) /// 3 IHME better mean
> (line DayCasMeRaA02S03 date, sort lcolor(red) lwidth(thick) lpattern(tight_dot)) /// 4 IHME worse mean
> (line DayCasUpRaA02S03 date, sort lcolor(red) lpattern(dash)) /// 4 IHME worse upper
> if date >= td(21apr2021) & date <= td(23Sep2021) ///
> , xtitle(Date) xlabel(22391 22422 22453 22484 22515 22546, ///
> format(%tdYY-NN-DD) labsize(small)) xlabel(, grid) xlabel(, grid) ///
> xlabel(, angle(forty_five)) ylabel(, format(%9.0fc) labsize(small)) ylabel(, labsize(small) angle(horizontal)) ///
> ytitle(Daily cases) title("COVID-19 daily cases, Iran, 3 scenarios, IHME", size(medium)) ///
> xscale(lwidth(vthin) lcolor(gray*.2)) yscale(lwidth(vthin) lcolor(gray*.2)) legend(region(lcolor(none))) legend(bexpand) ///
> legend(order(1 "JOHN" 2 "reference scenario, mean" 3 "better scenario, mean" 4 "worse scenario, mean") size(small) row(2)) ///
> subtitle("after Ordibeshet 1400", size(small)) ///
> note("Better and worse scenarios: tight dot (|||||) curves; Uncertainty limits: dashed (– – –) curves") ///
> ttext(0 21apr2021  "Ord" 0 22may2021  "Kho" ///
> 0 22jun2021  "Tir"  0 23jul2021  "Mor" 0 23Aug2021  "Sha" ///
> 0 23Sep2021  "Meh"  , size(small) color(black) placement(south))
{res}{txt}
{com}. 
. graph save "graph 29 b COVID-19 daily cases, Iran, 3 scenarios, IHME.gph", replace
{txt}(note: file graph 29 b COVID-19 daily cases, Iran, 3 scenarios, IHME.gph not found)
{res}{txt}(file graph 29 b COVID-19 daily cases, Iran, 3 scenarios, IHME.gph saved)

{com}. graph export "graph 29 b COVID-19 daily cases, Iran, 3 scenarios, IHME.pdf", replace
{txt}(file /Users/farshadpourmalek/Downloads/covir2-main/20210521/code/merge/graph 29 b COVID-19 daily cases, Iran, 3 scenarios, IHME.pdf written in PDF format)

{com}. 
. 
. 
. * daily cases, after Ordibeshet 1400, reference scenario with uncertainty, IMPE 
. 
. twoway ///
> (line DayCasMeRaA00S00 date, sort lcolor(cyan) lwidth(vthick) lpattern(tight_dot)) /// 1 JOHN
> (line DayCasMeRaA03S02 date, sort lcolor(black)) /// 2 IMPE reference mean
> (line DayCasLoRaA03S02 date, sort lcolor(green) lpattern(dash)) /// 3 IMPE reference lower
> (line DayCasUpRaA03S02 date, sort lcolor(red) lpattern(dash)) /// 4 IMPE reference upper
> if date >= td(21apr2021) & date <= td(23Sep2021) ///
> , xtitle(Date) xlabel(22391 22422 22453 22484 22515 22546, ///
> format(%tdYY-NN-DD) labsize(small)) xlabel(, grid) xlabel(, grid) ///
> xlabel(, angle(forty_five)) ylabel(, format(%9.0fc) labsize(small)) ylabel(, labsize(small) angle(horizontal)) ///
> ytitle(Daily cases) title("COVID-19 daily cases, Iran, reference scenario with uncertainty, IMPE", size(medium)) ///
> xscale(lwidth(vthin) lcolor(gray*.2)) yscale(lwidth(vthin) lcolor(gray*.2)) legend(region(lcolor(none))) legend(bexpand) ///
> legend(order(1 "JOHN" 2 "reference scenario, mean" 3 "reference scenario, lower" 4 "reference scenario, upper") size(small) row(2)) ///
> subtitle("after Ordibeshet 1400", size(small)) ///
> note("Uncertainty limits: dashed (– – –) curves") ///
> ttext(0 21apr2021  "Ord" 0 22may2021  "Kho" ///
> 0 22jun2021  "Tir"  0 23jul2021  "Mor" 0 23Aug2021  "Sha" ///
> 0 23Sep2021  "Meh"  , size(small) color(black) placement(south))
{res}{txt}
{com}. 
. graph save "graph 29 c COVID-19 daily cases, Iran, reference scenario with uncertainty, IMPE.gph", replace
{txt}(note: file graph 29 c COVID-19 daily cases, Iran, reference scenario with uncertainty, IMPE.gph not found)
{res}{txt}(file graph 29 c COVID-19 daily cases, Iran, reference scenario with uncertainty, IMPE.gph saved)

{com}. graph export "graph 29 c COVID-19 daily cases, Iran, reference scenario with uncertainty, IMPE.pdf", replace
{txt}(file /Users/farshadpourmalek/Downloads/covir2-main/20210521/code/merge/graph 29 c COVID-19 daily cases, Iran, reference scenario with uncertainty, IMPE.pdf written in PDF format)

{com}. 
. 
. 
. * daily cases, after Ordibeshet 1400, 3 scenarios, IMPE 
. 
. twoway ///
> (line DayCasMeRaA00S00 date, sort lcolor(cyan) lwidth(vthick) lpattern(tight_dot)) /// 1 JOHN
> (line DayCasMeRaA03S02 date, sort lcolor(black)) /// 2 IMPE reference mean
> (line DayCasMeRaA03S01 date, sort lcolor(green) lwidth(thick) lpattern(tight_dot)) /// 3 IMPE better mean
> (line DayCasMeRaA03S03 date, sort lcolor(red) lwidth(thick) lpattern(tight_dot)) /// 4 IMPE worse mean
> (line DayCasUpRaA03S03 date, sort lcolor(red) lpattern(dash)) /// 4 IMPE worse upper
> if date >= td(21apr2021) & date <= td(23Sep2021) ///
> , xtitle(Date) xlabel(22391 22422 22453 22484 22515 22546, ///
> format(%tdYY-NN-DD) labsize(small)) xlabel(, grid) xlabel(, grid) ///
> xlabel(, angle(forty_five)) ylabel(, format(%9.0fc) labsize(small)) ylabel(, labsize(small) angle(horizontal)) ///
> ytitle(Daily cases) title("COVID-19 daily cases, Iran, 3 scenarios, IMPE", size(medium)) ///
> xscale(lwidth(vthin) lcolor(gray*.2)) yscale(lwidth(vthin) lcolor(gray*.2)) legend(region(lcolor(none))) legend(bexpand) ///
> legend(order(1 "JOHN" 2 "reference scenario, mean" 3 "better scenario, mean" 4 "worse scenario, mean") size(small) row(2)) ///
> subtitle("after Ordibeshet 1400", size(small)) ///
> note("Better and worse scenarios: tight dot (|||||) curves; Uncertainty limits: dashed (– – –) curves") ///
> ttext(0 21apr2021  "Ord" 0 22may2021  "Kho" ///
> 0 22jun2021  "Tir"  0 23jul2021  "Mor" 0 23Aug2021  "Sha" ///
> 0 23Sep2021  "Meh"  , size(small) color(black) placement(south))
{res}{txt}
{com}. 
. graph save "graph 29 d COVID-19 daily cases, Iran, 3 scenarios, IMPE.gph", replace
{txt}(note: file graph 29 d COVID-19 daily cases, Iran, 3 scenarios, IMPE.gph not found)
{res}{txt}(file graph 29 d COVID-19 daily cases, Iran, 3 scenarios, IMPE.gph saved)

{com}. graph export "graph 29 d COVID-19 daily cases, Iran, 3 scenarios, IMPE.pdf", replace
{txt}(file /Users/farshadpourmalek/Downloads/covir2-main/20210521/code/merge/graph 29 d COVID-19 daily cases, Iran, 3 scenarios, IMPE.pdf written in PDF format)

{com}. 
. 
. 
. *****************
. 
. * total deaths (graph numbers start with 31)
. 
. 
. * total deaths, median or reference scenario
. 
. twoway ///
> (line TotDeaMeRaA00S00 date, sort lcolor(cyan) lwidth(vthick) lpattern(tight_dot)) /// 1 "JOHN"
> (line TotDeaMeRaA01S00 date, sort lcolor(red)) /// 2 "DELP"
> (line TotDeaMeSmA02S01 date, sort lcolor(black)) /// 3 "IHME"
> (line TotDeaMeRaA03S02 date, sort lcolor(magenta)) /// 4 "IMPE"
> (line TotDeaMeRaA04S00 date, sort lcolor(gold)) /// 5 "LANL"
> (line TotDeaMeRaA05S00 date, sort lcolor(green)) /// 6 "SRIV"
> if date >= td(01jan2020) & date <= td(01jan2022) ///
> , xtitle(Date) xlabel(#24, format(%tdYY-NN-DD) labsize(small)) xlabel(, grid) xlabel(, grid) ///
> xlabel(, angle(forty_five)) ylabel(, format(%9.0fc) labsize(small))  ylabel(, labsize(small) angle(horizontal)) ///
> ytitle(Total deaths) title("COVID-19 total deaths, Iran, reference scenarios", size(medium)) /// 
> xscale(lwidth(vthin) lcolor(gray*.2)) yscale(lwidth(vthin) lcolor(gray*.2)) legend(region(lcolor(none))) legend(bexpand) ///
> legend(order(1 "JOHN" 2 "DELP" 3 "IHME" 4 "IMPE" 5 "LANL" 6 "SRIV") size(small) row(1)) ///
> subtitle("  .", size(small) color(white))
{res}{txt}
{com}. 
. graph save "graph 31 COVID-19 total deaths, Iran, reference scenarios.gph", replace
{txt}(note: file graph 31 COVID-19 total deaths, Iran, reference scenarios.gph not found)
{res}{txt}(file graph 31 COVID-19 total deaths, Iran, reference scenarios.gph saved)

{com}. graph export "graph 31 COVID-19 total deaths, Iran, reference scenarios.pdf", replace
{txt}(file /Users/farshadpourmalek/Downloads/covir2-main/20210521/code/merge/graph 31 COVID-19 total deaths, Iran, reference scenarios.pdf written in PDF format)

{com}. 
. 
. 
. * total deaths, median or reference scenariom, w CF
. 
. twoway ///
> (line TotDeaMeRaA00S00 date, sort lcolor(cyan) lwidth(vthick) lpattern(tight_dot)) /// 1 "JOHN"
> (line TotDeaMeRaA00S00_CF2 date, sort lcolor(cyan) lpattern(tight_dot)) /// 2 "JOHN" CF2
> (line TotDeaMeRaA00S00_CF5 date, sort lcolor(cyan) lpattern(tight_dot)) /// 3 "JOHN" CF5
> (line TotDeaMeRaA01S00 date, sort lcolor(red)) /// 4 "DELP"
> (line TotDeaMeSmA02S01 date, sort lcolor(black)) /// 5 "IHME"
> (line TotDeaMeRaA03S02 date, sort lcolor(magenta)) /// 6 "IMPE"
> (line TotDeaMeRaA04S00 date, sort lcolor(gold)) /// 7 "LANL"
> (line TotDeaMeRaA05S00 date, sort lcolor(green)) /// 8 "SRIV"
> if date >= td(01jan2020) & date <= td(01jan2022) ///
> , xtitle(Date) xlabel(#24, format(%tdYY-NN-DD) labsize(small)) xlabel(, grid) xlabel(, grid) ///
> xlabel(, angle(forty_five)) ylabel(, format(%12.0fc) labsize(small))  ylabel(, labsize(small) angle(horizontal)) ///
> ytitle(Total deaths) title("COVID-19 total deaths, Iran, reference scenarios", size(medium)) /// 
> xscale(lwidth(vthin) lcolor(gray*.2)) yscale(lwidth(vthin) lcolor(gray*.2)) legend(region(lcolor(none))) legend(bexpand) ///
> legend(order(1 "JOHN" 2 "CF 2" 3 "CF 5" 4 "DELP" 5 "IHME" 6 "IMPE" 7 "LANL" 8 "SRIV") size(small) row(1)) ///
> subtitle("with correction factors 2 and 5", size(small))
{res}{txt}
{com}. 
. graph save "graph 32 COVID-19 total deaths, Iran, reference scenarios, w CF.gph", replace
{txt}(note: file graph 32 COVID-19 total deaths, Iran, reference scenarios, w CF.gph not found)
{res}{txt}(file graph 32 COVID-19 total deaths, Iran, reference scenarios, w CF.gph saved)

{com}. graph export "graph 32 COVID-19 total deaths, Iran, reference scenarios, w CF.pdf", replace
{txt}(file /Users/farshadpourmalek/Downloads/covir2-main/20210521/code/merge/graph 32 COVID-19 total deaths, Iran, reference scenarios, w CF.pdf written in PDF format)

{com}. 
. 
. 
. * total deaths, median or reference scenario, 2020-12-01 on
. 
. twoway ///
> (line TotDeaMeRaA00S00 date, sort lcolor(cyan) lwidth(vthick) lpattern(tight_dot)) /// 1 "JOHN"
> (line TotDeaMeRaA01S00 date, sort lcolor(red)) /// 2 "DELP"
> (line TotDeaMeSmA02S01 date, sort lcolor(black)) /// 3 "IHME"
> (line TotDeaMeRaA03S02 date, sort lcolor(magenta)) /// 4 "IMPE"
> (line TotDeaMeRaA04S00 date, sort lcolor(gold)) /// 5 "LANL"
> (line TotDeaMeRaA05S00 date, sort lcolor(green)) /// 6 "SRIV"
> if date >= td(01jan2021) & date <= td(01jan2022) ///
> , xtitle(Date) xlabel(#12, format(%tdYY-NN-DD) labsize(small)) xlabel(, grid) xlabel(, grid) ///
> xlabel(, angle(forty_five)) ylabel(, format(%9.0fc) labsize(small))  ylabel(, labsize(small) angle(horizontal)) ///
> ytitle(Total deaths) title("COVID-19 total deaths, Iran, reference scenarios", size(medium)) /// 
> xscale(lwidth(vthin) lcolor(gray*.2)) yscale(lwidth(vthin) lcolor(gray*.2)) legend(region(lcolor(none))) legend(bexpand) ///
> legend(order(1 "JOHN" 2 "DELP" 3 "IHME" 4 "IMPE" 5 "LANL" 6 "SRIV") size(small) row(1)) ///
> subtitle("after 2020-12-01", size(small))
{res}{txt}
{com}. 
. graph save "graph 33 COVID-19 total deaths, Iran, reference scenarios, 2020-12-01 on.gph", replace
{txt}(note: file graph 33 COVID-19 total deaths, Iran, reference scenarios, 2020-12-01 on.gph not found)
{res}{txt}(file graph 33 COVID-19 total deaths, Iran, reference scenarios, 2020-12-01 on.gph saved)

{com}. graph export "graph 33 COVID-19 total deaths, Iran, reference scenarios, 2020-12-01 on.pdf", replace
{txt}(file /Users/farshadpourmalek/Downloads/covir2-main/20210521/code/merge/graph 33 COVID-19 total deaths, Iran, reference scenarios, 2020-12-01 on.pdf written in PDF format)

{com}. 
. 
. 
. * total deaths, median or reference scenario, 2020-12-01 on, CI
. 
. twoway ///
> (line TotDeaMeRaA00S00 date, sort lcolor(cyan) lwidth(vthick) lpattern(tight_dot)) /// 1 JOHN
> (line TotDeaMeRaA01S00 date, sort lcolor(red)) /// 2 DELP mean
> (line TotDeaLoRaA01S00 date, sort lcolor(red) lpattern(dash)) /// 3 DELP lower
> (line TotDeaUpRaA01S00 date, sort lcolor(red) lpattern(dash)) /// 4 DELP upper
> (line TotDeaMeSmA02S01 date, sort lcolor(black)) /// 5 IHME mean
> (line TotDeaLoSmA02S01 date, sort lcolor(black) lpattern(dash)) /// 6 IHME lower
> (line TotDeaUpSmA02S01 date, sort lcolor(black) lpattern(dash)) /// 7 IHME upper
> (line TotDeaMeRaA03S02 date, sort lcolor(magenta)) /// 8 IMPE mean
> (line TotDeaLoRaA03S02 date, sort lcolor(magenta) lpattern(dash)) /// 9 IMPE lower
> (line TotDeaUpRaA03S02 date, sort lcolor(magenta) lpattern(dash)) /// 10 IMPE upper
> (line TotDeaMeRaA04S00 date, sort lcolor(gold)) /// 11 LANL mean
> (line TotDeaLoRaA04S00 date, sort lcolor(gold) lpattern(dash)) /// 12 LANL lower
> (line TotDeaUpRaA04S00 date, sort lcolor(gold) lpattern(dash)) /// 13 LANL upper
> (line TotDeaMeRaA05S00 date, sort lcolor(green)) /// 14 "SRIV" mean
> (line TotDeaLoRaA05S00 date, sort lcolor(green) lpattern(dash)) /// 15 "SRIV" lower
> (line TotDeaUpRaA05S00 date, sort lcolor(green) lpattern(dash)) /// 16 "SRIV" upper
> if date >= td(01jan2021) & date <= td(01jan2022) ///
> , xtitle(Date) xlabel(#12, format(%tdYY-NN-DD) labsize(small)) xlabel(, grid) xlabel(, grid) ///
> xlabel(, angle(forty_five)) ylabel(, format(%9.0fc) labsize(small))  ylabel(, labsize(small) angle(horizontal)) ///
> ytitle(Total deaths) title("COVID-19 total deaths, Iran, reference scenarios", size(medium)) ///
> xscale(lwidth(vthin) lcolor(gray*.2)) yscale(lwidth(vthin) lcolor(gray*.2)) legend(region(lcolor(none))) legend(bexpand) ///
> legend(order(1 "JOHN" 2 "DELP" 5 "IHME" 8 "IMPE" 11 "LANL" 14 "SRIV") size(small) row(1)) ///
> note("Uncertainty limits: dashed curves") ///
> subtitle("after 2020-12-01, with uncertainty", size(small))
{res}{txt}
{com}. 
. graph save "graph 34 COVID-19 total deaths, Iran, reference scenarios, 2020-12-01 on, CI.gph", replace
{txt}(note: file graph 34 COVID-19 total deaths, Iran, reference scenarios, 2020-12-01 on, CI.gph not found)
{res}{txt}(file graph 34 COVID-19 total deaths, Iran, reference scenarios, 2020-12-01 on, CI.gph saved)

{com}. graph export "graph 34 COVID-19 total deaths, Iran, reference scenarios, 2020-12-01 on, CI.pdf", replace
{txt}(file /Users/farshadpourmalek/Downloads/covir2-main/20210521/code/merge/graph 34 COVID-19 total deaths, Iran, reference scenarios, 2020-12-01 on, CI.pdf written in PDF format)

{com}. 
. 
. 
. * total deaths, median or reference scenario, 2020-12-01 on, CI, w CF
. 
. twoway ///
> (line TotDeaMeRaA00S00 date, sort lcolor(cyan) lwidth(vthick) lpattern(tight_dot)) /// 1 JOHN
> (line TotDeaMeRaA00S00_CF2 date, sort lcolor(cyan) lpattern(tight_dot)) /// 2 "JOHN" CF2
> (line TotDeaMeRaA00S00_CF5 date, sort lcolor(cyan) lpattern(tight_dot)) /// 3 "JOHN" CF5
> (line TotDeaMeRaA01S00 date, sort lcolor(red)) /// 4 DELP mean
> (line TotDeaLoRaA01S00 date, sort lcolor(red) lpattern(dash)) /// 5 DELP lower
> (line TotDeaUpRaA01S00 date, sort lcolor(red) lpattern(dash)) /// 6 DELP upper
> (line TotDeaMeSmA02S01 date, sort lcolor(black)) /// 7 IHME mean
> (line TotDeaLoSmA02S01 date, sort lcolor(black) lpattern(dash)) /// 8 IHME lower
> (line TotDeaUpSmA02S01 date, sort lcolor(black) lpattern(dash)) /// 9 IHME upper
> (line TotDeaMeRaA03S02 date, sort lcolor(magenta)) /// 10 IMPE mean
> (line TotDeaLoRaA03S02 date, sort lcolor(magenta) lpattern(dash)) /// 11 IMPE lower
> (line TotDeaUpRaA03S02 date, sort lcolor(magenta) lpattern(dash)) /// 12 IMPE upper
> (line TotDeaMeRaA04S00 date, sort lcolor(gold)) /// 13 LANL mean
> (line TotDeaLoRaA04S00 date, sort lcolor(gold) lpattern(dash)) /// 14 LANL lower
> (line TotDeaUpRaA04S00 date, sort lcolor(gold) lpattern(dash)) /// 15 LANL upper
> (line TotDeaMeRaA05S00 date, sort lcolor(green)) /// 16 "SRIV" mean
> (line TotDeaLoRaA05S00 date, sort lcolor(green) lpattern(dash)) /// 17 "SRIV" lower
> (line TotDeaUpRaA05S00 date, sort lcolor(green) lpattern(dash)) /// 18 "SRIV" upper
> if date >= td(01jan2021) & date <= td(01jan2022) ///
> , xtitle(Date) xlabel(#12, format(%tdYY-NN-DD) labsize(small)) xlabel(, grid) xlabel(, grid) ///
> xlabel(, angle(forty_five)) ylabel(, format(%9.0fc) labsize(small))  ylabel(, labsize(small) angle(horizontal)) ///
> ytitle(Total deaths) title("COVID-19 total deaths, Iran, reference scenarios", size(medium)) ///
> xscale(lwidth(vthin) lcolor(gray*.2)) yscale(lwidth(vthin) lcolor(gray*.2)) legend(region(lcolor(none))) legend(bexpand) ///
> legend(order(1 "JOHN" 2 "CF 2" 3 "CF 5" 4 "DELP" 7 "IHME" 10 "IMPE" 13 "LANL" 16 "SRIV") size(small) row(1)) ///
> note("Uncertainty limits: dashed curves") ///
> subtitle("after 2020-12-01, with correction factors 2 and 5, with uncertainty", size(small))
{res}{txt}
{com}. 
. graph save "graph 35 COVID-19 total deaths, Iran, reference scenarios, 2020-12-01 on, CI, w CF.gph", replace
{txt}(note: file graph 35 COVID-19 total deaths, Iran, reference scenarios, 2020-12-01 on, CI, w CF.gph not found)
{res}{txt}(file graph 35 COVID-19 total deaths, Iran, reference scenarios, 2020-12-01 on, CI, w CF.gph saved)

{com}. graph export "graph 35 COVID-19 total deaths, Iran, reference scenarios, 2020-12-01 on, CI, w CF.pdf", replace
{txt}(file /Users/farshadpourmalek/Downloads/covir2-main/20210521/code/merge/graph 35 COVID-19 total deaths, Iran, reference scenarios, 2020-12-01 on, CI, w CF.pdf written in PDF format)

{com}. 
. 
. 
. 
. *****************
. 
. * total cases (graph numbers start with 41)
. 
. 
. * total cases, median or reference scenario
. 
. twoway ///
> (line TotCasMeRaA00S00 date, sort lcolor(cyan) lwidth(vthick) lpattern(tight_dot)) /// 1 "JOHN"
> (line TotCasMeRaA01S00 date, sort lcolor(red)) /// 2 "DELP"
> (line TotCasMeRaA02S01 date, sort lcolor(black)) /// 3 "IHME"
> (line TotCasMeRaA03S02 date, sort lcolor(magenta)) /// 4 "IMPE"
> (line TotCasMeRaA04S00 date, sort lcolor(gold)) /// 5 "LANL"
> (line TotCasMeRaA05S00 date, sort lcolor(green)) /// 6 "SRIV"
> if date >= td(01jan2020) & date <= td(01jan2022) ///
> , xtitle(Date) xlabel(#24, format(%tdYY-NN-DD) labsize(small)) xlabel(, grid) xlabel(, grid) ///
> xlabel(, angle(forty_five)) ylabel(, format(%12.0fc) labsize(small))  ylabel(, labsize(small) angle(horizontal)) ///
> ytitle(Total cases) title("COVID-19 total cases, Iran, reference scenarios", size(medium)) /// 
> xscale(lwidth(vthin) lcolor(gray*.2)) yscale(lwidth(vthin) lcolor(gray*.2)) legend(region(lcolor(none))) legend(bexpand) ///
> legend(order(1 "JOHN" 2 "DELP" 3 "IHME" 4 "IMPE" 5 "LANL" 6 "SRIV") size(small) row(1)) ///
> subtitle("  .", size(small) color(white))
{res}{txt}
{com}. 
. graph save "graph 41 COVID-19 total cases, Iran, reference scenarios.gph", replace
{txt}(note: file graph 41 COVID-19 total cases, Iran, reference scenarios.gph not found)
{res}{txt}(file graph 41 COVID-19 total cases, Iran, reference scenarios.gph saved)

{com}. graph export "graph 41 COVID-19 total cases, Iran, reference scenarios.pdf", replace
{txt}(file /Users/farshadpourmalek/Downloads/covir2-main/20210521/code/merge/graph 41 COVID-19 total cases, Iran, reference scenarios.pdf written in PDF format)

{com}. 
. 
. 
. * total cases, median or reference scenario, w CF
. 
. twoway ///
> (line TotCasMeRaA00S00 date, sort lcolor(cyan) lwidth(vthick) lpattern(tight_dot)) /// 1 "JOHN"
> (line TotCasMeRaA00S00_CF2 date, sort lcolor(cyan) lpattern(tight_dot)) /// 2 "JOHN" CF2
> (line TotCasMeRaA00S00_CF5 date, sort lcolor(cyan) lpattern(tight_dot)) /// 3 "JOHN" CF5
> (line TotCasMeRaA01S00 date, sort lcolor(red)) /// 4 "DELP"
> (line TotCasMeRaA02S01 date, sort lcolor(black)) /// 5 "IHME"
> (line TotCasMeRaA03S02 date, sort lcolor(magenta)) /// 6 "IMPE"
> (line TotCasMeRaA04S00 date, sort lcolor(gold)) /// 7 "LANL"
> (line TotCasMeRaA05S00 date, sort lcolor(green)) /// 8 "SRIV"
> if date >= td(01jan2020) & date <= td(01jan2022) ///
> , xtitle(Date) xlabel(#24, format(%tdYY-NN-DD) labsize(small)) xlabel(, grid) xlabel(, grid) ///
> xlabel(, angle(forty_five)) ylabel(, format(%12.0fc) labsize(small))  ylabel(, labsize(small) angle(horizontal)) ///
> ytitle(Total cases) title("COVID-19 total cases, Iran, reference scenarios", size(medium)) /// 
> xscale(lwidth(vthin) lcolor(gray*.2)) yscale(lwidth(vthin) lcolor(gray*.2)) legend(region(lcolor(none))) legend(bexpand) ///
> legend(order(1 "JOHN" 2 "CF 2" 3 "CF 5" 4 "DELP" 5 "IHME" 6 "IMPE" 7 "LANL" 8 "SRIV") size(small) row(1)) ///
> subtitle("with correction factors 2 and 5", size(small))
{res}{txt}
{com}. 
. graph save "graph 42 COVID-19 total cases, Iran, reference scenarios, w CF.gph", replace
{txt}(note: file graph 42 COVID-19 total cases, Iran, reference scenarios, w CF.gph not found)
{res}{txt}(file graph 42 COVID-19 total cases, Iran, reference scenarios, w CF.gph saved)

{com}. graph export "graph 42 COVID-19 total cases, Iran, reference scenarios, w CF.pdf", replace
{txt}(file /Users/farshadpourmalek/Downloads/covir2-main/20210521/code/merge/graph 42 COVID-19 total cases, Iran, reference scenarios, w CF.pdf written in PDF format)

{com}. 
. 
. 
. * total cases, median or reference scenario, 2020-12-01 on
. 
. twoway ///
> (line TotCasMeRaA00S00 date, sort lcolor(cyan) lwidth(vthick) lpattern(tight_dot)) /// 1 "JOHN"
> (line TotCasMeRaA01S00 date, sort lcolor(red)) /// 2 "DELP"
> (line TotCasMeRaA02S01 date, sort lcolor(black)) /// 3 "IHME"
> (line TotCasMeRaA03S02 date, sort lcolor(magenta)) /// 4 "IMPE"
> (line TotCasMeRaA04S00 date, sort lcolor(gold)) /// 5 "LANL"
> (line TotCasMeRaA05S00 date, sort lcolor(green)) /// 6 "SRIV"
> if date >= td(01jan2021) & date <= td(01jan2022) ///
> , xtitle(Date) xlabel(#12, format(%tdYY-NN-DD) labsize(small)) xlabel(, grid) xlabel(, grid) ///
> xlabel(, angle(forty_five)) ylabel(, format(%12.0fc) labsize(small))  ylabel(, labsize(small) angle(horizontal)) ///
> ytitle(Total cases) title("COVID-19 total cases, Iran, reference scenarios", size(medium)) /// 
> xscale(lwidth(vthin) lcolor(gray*.2)) yscale(lwidth(vthin) lcolor(gray*.2)) legend(region(lcolor(none))) legend(bexpand) ///
> legend(order(1 "JOHN" 2 "DELP" 3 "IHME" 4 "IMPE" 5 "LANL" 6 "SRIV") size(small) row(1)) ///
> subtitle("after 2020-12-01", size(small))
{res}{txt}
{com}. 
. graph save "graph 43 COVID-19 total cases, Iran, reference scenarios, 2020-12-01 on.gph", replace
{txt}(note: file graph 43 COVID-19 total cases, Iran, reference scenarios, 2020-12-01 on.gph not found)
{res}{txt}(file graph 43 COVID-19 total cases, Iran, reference scenarios, 2020-12-01 on.gph saved)

{com}. graph export "graph 43 COVID-19 total cases, Iran, reference scenarios, 2020-12-01 on.pdf", replace
{txt}(file /Users/farshadpourmalek/Downloads/covir2-main/20210521/code/merge/graph 43 COVID-19 total cases, Iran, reference scenarios, 2020-12-01 on.pdf written in PDF format)

{com}. 
. 
. 
. * total cases, median or reference scenario, 2020-12-01 on, w CF
. 
. twoway ///
> (line TotCasMeRaA00S00 date, sort lcolor(cyan) lwidth(vthick) lpattern(tight_dot)) /// 1 "JOHN"
> (line TotCasMeRaA00S00_CF2 date, sort lcolor(cyan) lpattern(tight_dot)) /// 2 "JOHN" CF2
> (line TotCasMeRaA00S00_CF5 date, sort lcolor(cyan) lpattern(tight_dot)) /// 3 "JOHN" CF5
> (line TotCasMeRaA01S00 date, sort lcolor(red)) /// 4 "DELP"
> (line TotCasMeRaA02S01 date, sort lcolor(black)) /// 5 "IHME"
> (line TotCasMeRaA03S02 date, sort lcolor(magenta)) /// 6 "IMPE"
> (line TotCasMeRaA04S00 date, sort lcolor(gold)) /// 7 "LANL"
> (line TotCasMeRaA05S00 date, sort lcolor(green)) /// 8 "SRIV"
> if date >= td(01jan2021) & date <= td(01jan2022) ///
> , xtitle(Date) xlabel(#12, format(%tdYY-NN-DD) labsize(small)) xlabel(, grid) xlabel(, grid) ///
> xlabel(, angle(forty_five)) ylabel(, format(%12.0fc) labsize(small))  ylabel(, labsize(small) angle(horizontal)) ///
> ytitle(Total cases) title("COVID-19 total cases, Iran, reference scenarios", size(medium)) /// 
> xscale(lwidth(vthin) lcolor(gray*.2)) yscale(lwidth(vthin) lcolor(gray*.2)) legend(region(lcolor(none))) legend(bexpand) ///
> legend(order(1 "JOHN" 2 "CF 2" 3 "CF 5" 4 "DELP" 5 "IHME" 6 "IMPE" 7 "LANL" 8 "SRIV") size(small) row(1)) ///
> subtitle("after 2020-12-01, with correction factors 2 and 5", size(small))
{res}{txt}
{com}. 
. graph save "graph 44 COVID-19 total cases, Iran, reference scenarios, 2020-12-01 on, w CF.gph", replace
{txt}(note: file graph 44 COVID-19 total cases, Iran, reference scenarios, 2020-12-01 on, w CF.gph not found)
{res}{txt}(file graph 44 COVID-19 total cases, Iran, reference scenarios, 2020-12-01 on, w CF.gph saved)

{com}. graph export "graph 44 COVID-19 total cases, Iran, reference scenarios, 2020-12-01 on, w CF.pdf", replace
{txt}(file /Users/farshadpourmalek/Downloads/covir2-main/20210521/code/merge/graph 44 COVID-19 total cases, Iran, reference scenarios, 2020-12-01 on, w CF.pdf written in PDF format)

{com}. 
. 
. 
. * total cases, median or reference scenario, 2020-12-01 on, CI
. 
. twoway ///
> (line TotCasMeRaA00S00 date, sort lcolor(cyan) lwidth(vthick) lpattern(tight_dot)) /// 1 JOHN
> (line TotCasMeRaA01S00 date, sort lcolor(red)) /// 2 "DELP"
> (line TotCasLoRaA01S00 date, sort lcolor(red) lpattern(dash)) /// 3 "DELP"
> (line TotCasUpRaA01S00 date, sort lcolor(red) lpattern(dash)) /// 4 "DELP"
> (line TotCasMeRaA02S01 date, sort lcolor(black)) /// 5 IHME mean
> (line TotCasLoRaA02S01 date, sort lcolor(black) lpattern(dash)) /// 6 IHME lower
> (line TotCasUpRaA02S01 date, sort lcolor(black) lpattern(dash)) /// 7 IHME upper
> (line TotCasMeRaA03S02 date, sort lcolor(magenta)) /// 8 IMPE mean
> (line TotCasLoRaA03S02 date, sort lcolor(magenta) lpattern(dash)) /// 9 IMPE lower
> (line TotCasUpRaA03S02 date, sort lcolor(magenta) lpattern(dash)) /// 10 IMPE upper
> (line TotCasMeRaA04S00 date, sort lcolor(gold)) /// 11 LANL mean
> (line TotCasLoRaA04S00 date, sort lcolor(gold)  lpattern(dash)) /// 12 LANL lower
> (line TotCasUpRaA04S00 date, sort lcolor(gold)  lpattern(dash)) /// 13 LANL upper
> (line TotCasMeRaA05S00 date, sort lcolor(green)) /// 14 "SRIV" mean
> (line TotCasMeRaA05S00 date, sort lcolor(green) lpattern(dash)) /// 15 "SRIV" lower
> (line TotCasMeRaA05S00 date, sort lcolor(green) lpattern(dash)) /// 16 "SRIV" upper
> if date >= td(01jan2021) & date <= td(01jan2022) ///
> , xtitle(Date) xlabel(#12, format(%tdYY-NN-DD) labsize(small)) xlabel(, grid) xlabel(, grid) ///
> xlabel(, angle(forty_five)) ylabel(, format(%12.0fc) labsize(small))  ylabel(, labsize(small) angle(horizontal)) ///
> ytitle(Total cases) title("COVID-19 total cases, Iran, reference scenarios", size(medium)) ///
> xscale(lwidth(vthin) lcolor(gray*.2)) yscale(lwidth(vthin) lcolor(gray*.2)) legend(region(lcolor(none))) legend(bexpand) ///
> legend(order(1 "JOHN" 2 "DELP" 5 "IHME" 8 "IMPE" 11 "LANL" 14 "SRIV") size(small) row(1)) ///
> note("Uncertainty limits: dashed curves") ///
> subtitle("after 2020-12-01, with uncertainty", size(small))
{res}{txt}
{com}. 
. graph save "graph 45 COVID-19 total cases, Iran, reference scenarios, 2020-12-01 on, CI.gph", replace
{txt}(note: file graph 45 COVID-19 total cases, Iran, reference scenarios, 2020-12-01 on, CI.gph not found)
{res}{txt}(file graph 45 COVID-19 total cases, Iran, reference scenarios, 2020-12-01 on, CI.gph saved)

{com}. graph export "graph 45 COVID-19 total cases, Iran, reference scenarios, 2020-12-01 on, CI.pdf", replace
{txt}(file /Users/farshadpourmalek/Downloads/covir2-main/20210521/code/merge/graph 45 COVID-19 total cases, Iran, reference scenarios, 2020-12-01 on, CI.pdf written in PDF format)

{com}. 
. 
. 
. * total cases, median or reference scenario, 2020-12-01 on, CI, w CF
. 
. twoway ///
> (line TotCasMeRaA00S00 date, sort lcolor(cyan) lwidth(vthick) lpattern(tight_dot)) /// 1 JOHN
> (line TotCasMeRaA00S00_CF2 date, sort lcolor(cyan) lpattern(tight_dot)) /// 2 "JOHN" CF2
> (line TotCasMeRaA00S00_CF5 date, sort lcolor(cyan) lpattern(tight_dot)) /// 3 "JOHN" CF5
> (line TotCasMeRaA01S00 date, sort lcolor(red)) /// 4 "DELP"
> (line TotCasLoRaA01S00 date, sort lcolor(red) lpattern(dash)) /// 5 "DELP"
> (line TotCasUpRaA01S00 date, sort lcolor(red) lpattern(dash)) /// 6 "DELP"
> (line TotCasMeRaA02S01 date, sort lcolor(black)) /// 7 IHME mean
> (line TotCasLoRaA02S01 date, sort lcolor(black) lpattern(dash)) /// 8 IHME lower
> (line TotCasUpRaA02S01 date, sort lcolor(black) lpattern(dash)) /// 9 IHME upper
> (line TotCasMeRaA03S02 date, sort lcolor(magenta)) /// 10 IMPE mean
> (line TotCasLoRaA03S02 date, sort lcolor(magenta) lpattern(dash)) /// 11 IMPE lower
> (line TotCasUpRaA03S02 date, sort lcolor(magenta) lpattern(dash)) /// 12 IMPE upper
> (line TotCasMeRaA04S00 date, sort lcolor(gold)) /// 13 LANL mean
> (line TotCasLoRaA04S00 date, sort lcolor(gold)  lpattern(dash)) /// 14 LANL lower
> (line TotCasUpRaA04S00 date, sort lcolor(gold)  lpattern(dash)) /// 15 LANL upper
> (line TotCasMeRaA05S00 date, sort lcolor(green)) /// 16 "SRIV" mean
> (line TotCasMeRaA05S00 date, sort lcolor(green) lpattern(dash)) /// 17 "SRIV" lower
> (line TotCasMeRaA05S00 date, sort lcolor(green) lpattern(dash)) /// 18 "SRIV" upper
> if date >= td(01jan2021) & date <= td(01jan2022) ///
> , xtitle(Date) xlabel(#12, format(%tdYY-NN-DD) labsize(small)) xlabel(, grid) xlabel(, grid) ///
> xlabel(, angle(forty_five)) ylabel(, format(%12.0fc) labsize(small))  ylabel(, labsize(small) angle(horizontal)) ///
> ytitle(Total cases) title("COVID-19 total cases, Iran, reference scenarios", size(medium)) ///
> xscale(lwidth(vthin) lcolor(gray*.2)) yscale(lwidth(vthin) lcolor(gray*.2)) legend(region(lcolor(none))) legend(bexpand) ///
> legend(order(1 "JOHN" 2 "CF 2" 3 "CF 5" 4 "DELP" 7 "IHME" 10 "IMPE" 13 "LANL" 16 "SRIV") size(small) row(1)) ///
> note("Uncertainty limits: dashed curves")  ///
> subtitle("after 2020-12-01, with correction factors 2 and 5, with uncertainty", size(small))
{res}{txt}
{com}. 
. graph save "graph 46 COVID-19 total cases, Iran, reference scenarios, 2020-12-01 on, CI, w CF.gph", replace
{txt}(note: file graph 46 COVID-19 total cases, Iran, reference scenarios, 2020-12-01 on, CI, w CF.gph not found)
{res}{txt}(file graph 46 COVID-19 total cases, Iran, reference scenarios, 2020-12-01 on, CI, w CF.gph saved)

{com}. graph export "graph 46 COVID-19 total cases, Iran, reference scenarios, 2020-12-01 on, CI, w CF.pdf", replace
{txt}(file /Users/farshadpourmalek/Downloads/covir2-main/20210521/code/merge/graph 46 COVID-19 total cases, Iran, reference scenarios, 2020-12-01 on, CI, w CF.pdf written in PDF format)

{com}. 
. 
. 
. 
. *****************
. 
. * daily cfr (graph numbers start with 51)
. 
. 
. * cfr all studies, all time, reference scenarios
. 
. twoway ///
> (line DayCfrMeRaA00S00 date, sort lcolor(cyan) lwidth(vthick) lpattern(tight_dot)) /// 1 "JOHN"
> (line DayCfrMeRaA01S00 date, sort lcolor(red)) /// 2 "DELP"
> (line DayCfrMeRaA02S01 date, sort lcolor(black)) /// 3 "IHME"
> (line DayCfrMeRaA03S02 date, sort lcolor(magenta)) /// 4 "IMPE"
> (line DayCfrMeRaA04S00 date, sort lcolor(gold)) /// 5 "LANL"
> (line DayCfrMeRaA05S00 date, sort lcolor(green)) /// 6 "SRIV"
> if date >= td(01jan2020) & date <= td(01jan2022) ///
> , xtitle(Date) xlabel(#24, format(%tdYY-NN-DD) labsize(small)) xlabel(, grid) xlabel(, grid) ///
> xlabel(, angle(forty_five)) ylabel(, format(%12.0fc) labsize(small))  ylabel(, labsize(small) angle(horizontal)) ///
> ytitle(Daily CFR) title("COVID-19 daily CFR, Iran, reference scenarios", size(medium)) /// 
> xscale(lwidth(vthin) lcolor(gray*.2)) yscale(lwidth(vthin) lcolor(gray*.2)) legend(region(lcolor(none))) legend(bexpand) ///
> legend(order(1 "JOHN" 2 "DELP" 3 "IHME" 4 "IMPE" 5 "LANL" 6 "SRIV") size(small) row(1)) ///
> subtitle("  .", size(small) color(white))
{res}{txt}
{com}. 
. graph save "graph 51 COVID-19 daily CFR, Iran, reference scenarios.gph", replace
{txt}(note: file graph 51 COVID-19 daily CFR, Iran, reference scenarios.gph not found)
{res}{txt}(file graph 51 COVID-19 daily CFR, Iran, reference scenarios.gph saved)

{com}. graph export "graph 51 COVID-19 daily CFR, Iran, reference scenarios.pdf", replace
{txt}(file /Users/farshadpourmalek/Downloads/covir2-main/20210521/code/merge/graph 51 COVID-19 daily CFR, Iran, reference scenarios.pdf written in PDF format)

{com}. 
. 
. 
. * cfr all studies, 2021-01-01 on, reference scenarios
. 
. twoway ///
> (line DayCfrMeRaA00S00 date, sort lcolor(cyan) lwidth(vthick) lpattern(tight_dot)) /// 1 "JOHN"
> (line DayCfrMeRaA01S00 date, sort lcolor(red)) /// 2 "DELP"
> (line DayCfrMeRaA02S01 date, sort lcolor(black)) /// 3 "IHME"
> (line DayCfrMeRaA03S02 date, sort lcolor(magenta)) /// 4 "IMPE"
> (line DayCfrMeRaA04S00 date, sort lcolor(gold)) /// 5 "LANL"
> (line DayCfrMeRaA05S00 date, sort lcolor(green)) /// 6 "SRIV"
> if date >= td(01jan2021) & date <= td(01jan2022) ///
> , xtitle(Date) xlabel(#12, format(%tdYY-NN-DD) labsize(small)) xlabel(, grid) xlabel(, grid) ///
> xlabel(, angle(forty_five)) ylabel(, format(%12.0fc) labsize(small))  ylabel(, labsize(small) angle(horizontal)) ///
> ytitle(Daily CFR) title("COVID-19 daily CFR, Iran, reference scenarios", size(medium)) /// 
> xscale(lwidth(vthin) lcolor(gray*.2)) yscale(lwidth(vthin) lcolor(gray*.2)) legend(region(lcolor(none))) legend(bexpand) ///
> legend(order(1 "JOHN" 2 "DELP" 3 "IHME" 4 "IMPE" 5 "LANL" 6 "SRIV") size(small) row(1)) ///
> subtitle("after 2021-01-01", size(small))
{res}{txt}
{com}. 
. graph save "graph 52 COVID-19 daily CFR, Iran, reference scenarios, 2021-01-01 on.gph", replace
{txt}(note: file graph 52 COVID-19 daily CFR, Iran, reference scenarios, 2021-01-01 on.gph not found)
{res}{txt}(file graph 52 COVID-19 daily CFR, Iran, reference scenarios, 2021-01-01 on.gph saved)

{com}. graph export "graph 52 COVID-19 daily CFR, Iran, reference scenarios,2021-01-01 on.pdf", replace
{txt}(file /Users/farshadpourmalek/Downloads/covir2-main/20210521/code/merge/graph 52 COVID-19 daily CFR, Iran, reference scenarios,2021-01-01 on.pdf written in PDF format)

{com}. 
. 
. 
. 
. *****************
. 
. * daily active cases (graph numbers start with 61)
. 
. 
. * daily active cases, w GHAN
. 
. twoway ///
> (line DayActMeRaA00S00 date, sort lcolor(cyan) lwidth(vthick) lpattern(tight_dot)) /// 1 "JOHN" 
> (line DayActMeRaA01S00 date, sort lcolor(red)) /// 2 "DELP" 
> (line DayActMeRaA07S09 date, sort lcolor(black)) /// 3 "GHAN" 
> (line DayActMeRaA06S01 date, sort lcolor(red) lpattern(dash)) /// 4 "SOLT S1"
> (line DayActMeRaA06S02 date, sort lcolor(blue) lpattern(dash)) /// 5 "SOLT S2"
> if date >= td(01jan2020) & date <= td(01jan2022) ///
> , xtitle(Date) xlabel(#24, format(%tdYY-NN-DD) labsize(small)) xlabel(, grid) xlabel(, grid) ///
> xlabel(, angle(forty_five)) ylabel(, format(%12.0fc) labsize(small))  ylabel(, labsize(small) angle(horizontal)) ///
> ytitle(Daily active cases) title("COVID-19 daily active cases, Iran", size(medium)) /// 
> xscale(lwidth(vthin) lcolor(gray*.2)) yscale(lwidth(vthin) lcolor(gray*.2)) legend(region(lcolor(none))) legend(bexpand) ///
> legend(order(1 "JOHN" 2 "DELP" 3 "GHAN" 4 "SOLT S1" 5 "SOLT S2") size(small) row(1)) ///
> subtitle("  .", size(small) color(white))
{res}{txt}
{com}. 
. graph save "graph 61 COVID-19 daily active cases w GHAN.gph", replace
{txt}(note: file graph 61 COVID-19 daily active cases w GHAN.gph not found)
{res}{txt}(file graph 61 COVID-19 daily active cases w GHAN.gph saved)

{com}. graph export "graph 61 COVID-19 daily active cases w GHAN.pdf", replace
{txt}(file /Users/farshadpourmalek/Downloads/covir2-main/20210521/code/merge/graph 61 COVID-19 daily active cases w GHAN.pdf written in PDF format)

{com}. 
. 
. 
. * daily active cases, wo GHAN
. 
. twoway ///
> (line DayActMeRaA00S00 date, sort lcolor(cyan) lwidth(vthick) lpattern(tight_dot)) /// 1 "JOHN" 
> (line DayActMeRaA01S00 date, sort lcolor(red)) /// 2 "DELP" 
> (line DayActMeRaA06S01 date, sort lcolor(red) lpattern(dash)) /// 3 "SOLT S1"
> (line DayActMeRaA06S02 date, sort lcolor(blue) lpattern(dash)) /// 4 "SOLT S2"
> if date >= td(01jan2020) & date <= td(01jan2022) ///
> , xtitle(Date) xlabel(#24, format(%tdYY-NN-DD) labsize(small)) xlabel(, grid) xlabel(, grid) ///
> xlabel(, angle(forty_five)) ylabel(, format(%12.0fc) labsize(small))  ylabel(, labsize(small) angle(horizontal)) ///
> ytitle(Daily active cases) title("COVID-19 daily active cases, Iran", size(medium)) /// 
> xscale(lwidth(vthin) lcolor(gray*.2)) yscale(lwidth(vthin) lcolor(gray*.2)) legend(region(lcolor(none))) legend(bexpand) ///
> legend(order(1 "JOHN" 2 "DELP" 3 "SOLT S1" 4 "SOLT S2") size(small) row(1)) ///
> subtitle("without GHAN", size(small))
{res}{txt}
{com}. 
. graph save "graph 62 COVID-19 daily active cases wo GHAN.gph", replace
{txt}(note: file graph 62 COVID-19 daily active cases wo GHAN.gph not found)
{res}{txt}(file graph 62 COVID-19 daily active cases wo GHAN.gph saved)

{com}. graph export "graph 62 COVID-19 daily active cases wo GHAN.pdf", replace
{txt}(file /Users/farshadpourmalek/Downloads/covir2-main/20210521/code/merge/graph 62 COVID-19 daily active cases wo GHAN.pdf written in PDF format)

{com}. 
. 
. 
. * daily active cases, wo GHAN, Hijri
. 
. twoway ///
> (line DayActMeRaA00S00 date, sort lcolor(cyan) lwidth(vthick) lpattern(tight_dot)) /// 1 "JOHN" 
> (line DayActMeRaA01S00 date, sort lcolor(red)) /// 2 "DELP" 
> (line DayActMeRaA06S01 date, sort lcolor(red) lpattern(dash)) /// 3 "SOLT S1"
> (line DayActMeRaA06S02 date, sort lcolor(blue) lpattern(dash)) /// 4 "SOLT S2"
> if date >= td(20feb2020) & date <= td(23oct2021) ///
> , xtitle(Date) xlabel(21965 21994 22025 22056 22087 22118 22149 22180 22210 22240 22270 22300 22330 22360 22391 22422 22453 22484 22515 22546 22576 ///
> , format(%tdYY-NN-DD) labsize(small)) xlabel(, grid) xlabel(, grid) ///
> xlabel(, angle(forty_five)) ylabel(, format(%12.0fc) labsize(small))  ylabel(, labsize(small) angle(horizontal)) ///
> ytitle(Daily active cases) title("COVID-19 daily active cases, Iran", size(medium)) /// 
> xscale(lwidth(vthin) lcolor(gray*.2)) yscale(lwidth(vthin) lcolor(gray*.2)) legend(region(lcolor(none))) legend(bexpand) ///
> legend(order(1 "JOHN" 2 "DELP" 3 "SOLT S1" 4 "SOLT S2") size(small) row(1)) ///
> subtitle("without GHAN", size(small)) ///
> ttext(0 20feb2020  "Esf" 0 20mar2020  "Far" 0 20apr2020  "Ord" 0 21may2020  "Kho" 0 21jun2020  "Tir" 0 22jul2020  "Mor" ///
> 0 22aug2020  "Sha" 0 22sep2020  "Meh" 0 22oct2020  "Aba" 0 21nov2020  "Aza" 0 21dec2020  "Dey" 0 20jan2021  "Bah" ///
> 0 19feb2021  "Esf" 0 21mar2021  "Far" 0 21apr2021  "Ord" 0 22may2021  "Kho" 0 22jun2021  "Tir" 0 23jul2021  "Mor" ///
> 0 23aug2021  "Sha" 0 23sep2021  "Meh" 0 23oct2021  "Aba" , size(small) color(black) placement(south))
{res}{txt}
{com}. 
. graph save "graph 63 COVID-19 daily active cases wo GHAN Hijri.gph", replace
{txt}(note: file graph 63 COVID-19 daily active cases wo GHAN Hijri.gph not found)
{res}{txt}(file graph 63 COVID-19 daily active cases wo GHAN Hijri.gph saved)

{com}. graph export "graph 63 COVID-19 daily active cases wo GHAN Hijri.pdf", replace
{txt}(file /Users/farshadpourmalek/Downloads/covir2-main/20210521/code/merge/graph 63 COVID-19 daily active cases wo GHAN Hijri.pdf written in PDF format)

{com}. 
. 
. 
. * daily active cases, wo GHAN, 2020-12-01 on
. 
. twoway ///
> (line DayActMeRaA00S00 date, sort lcolor(cyan) lwidth(vthick) lpattern(tight_dot)) /// 1 "JOHN" 
> (line DayActMeRaA01S00 date, sort lcolor(red)) /// 2 "DELP" 
> (line DayActMeRaA06S01 date, sort lcolor(red) lpattern(dash)) /// 3 "SOLT S1"
> (line DayActMeRaA06S02 date, sort lcolor(blue) lpattern(dash)) /// 4 "SOLT S2"
> if date >= td(30nov2020) & date <= td(01jan2022) ///
> , xtitle(Date) xlabel(#12, format(%tdYY-NN-DD) labsize(small)) xlabel(, grid) xlabel(, grid) ///
> xlabel(, angle(forty_five)) ylabel(, format(%12.0fc) labsize(small))  ylabel(, labsize(small) angle(horizontal)) ///
> ytitle(Daily active cases) title("COVID-19 daily active cases, Iran", size(medium)) /// 
> xscale(lwidth(vthin) lcolor(gray*.2)) yscale(lwidth(vthin) lcolor(gray*.2)) legend(region(lcolor(none))) legend(bexpand) ///
> legend(order(1 "JOHN" 2 "DELP" 3 "SOLT S1" 4 "SOLT S2") size(small) row(1)) ///
> subtitle("after 2020-12-01, without GHAN, ", size(small))
{res}{txt}
{com}. 
. graph save "graph 64 COVID-19 daily active cases wo GHAN 2020-12-01 on.gph", replace
{txt}(note: file graph 64 COVID-19 daily active cases wo GHAN 2020-12-01 on.gph not found)
{res}{txt}(file graph 64 COVID-19 daily active cases wo GHAN 2020-12-01 on.gph saved)

{com}. graph export "graph 64 COVID-19 daily active cases wo GHAN 2020-12-01 on.pdf", replace
{txt}(file /Users/farshadpourmalek/Downloads/covir2-main/20210521/code/merge/graph 64 COVID-19 daily active cases wo GHAN 2020-12-01 on.pdf written in PDF format)

{com}. 
. 
. 
. 
. ************************
. 
. * other outcomes (graph numbers start with 71)
. 
. 
. * base codes with IHME and IMPE, all hospital-related outcomes
. 
. * daily hospital-related outcomes, DELP, IHME, IMPE
. /*
> twoway ///
> (line DayHosMeRaA01S00 date, sort lcolor(red)  lwidth(thick)) /// 1 DELP Hospitalized (Daily Cases Active Hospitalized Mean DELP S0)
> (line DayVenMeRaA01S00 date, sort lcolor(red) lpattern(dash)  lwidth(thick)) /// 2 DELP Ventilated (Daily Cases Active Ventilated Mean DELP S0)
> (line DayBedMeSmA02S01 date, sort lcolor(black)) /// 3 IHME Bed need (Daily Beds needed Mean IHME S1)
> (line DayIcuMeSmA02S01 date, sort lcolor(green)) /// 4 IHME ICU need (Daily ICU beds needed Mean IHME S1)
> (line DayVenMeSmA02S01 date, sort lcolor(red)) /// 5 IHME Vent need (Daily invasive Ventilation needed Mean IHME S1)
> (line DayAdmMeSmA02S01 date, sort lcolor(yellow)) /// 6 IHME Admissions (Daily hospital admissions Mean IHME S1)
> (line DayIcnMeSmA02S01 date, sort lcolor(blue)) /// 7 IHME ICU new (Daily new people going to ICU Mean IHME S1)
> (line DayHodMeRaA03S01 date, sort lcolor(magenta)) /// 8 IMPE Hosp demand (Daily hospital demand Mean A03 S01 )
> (line DayHoiMeRaA03S01 date, sort lcolor(magenta) lpattern(dash)) /// 9 IMPE Hosp incidence (Daily hospital incidence Mean A03 S01 )
> (line DayIcdMeRaA03S01 date, sort lcolor(magenta) lpattern(dash_dot)) /// 10 IMPE ICU demand (Daily ICU demand Mean A03 S01 )
> (line DayIciMeRaA03S01 date, sort lcolor(magenta) lpattern(longdash_shortdash)) /// 11 IMPE ICU incidence (Daily ICU incidence Mean A03 S01 )
> if date >= td(30dec2019) & date <= td(23Aug2021) ///
> , xtitle(Date) xlabel(#19, format(%tdYY-NN-DD) labsize(small)) xlabel(, grid) xlabel(, grid) ///
> xlabel(, angle(forty_five)) ylabel(, format(%9.0fc) labsize(small))  ylabel(, labsize(small) angle(horizontal)) ///
> ytitle(Daily outcomes) title("COVID-19 daily hospital-related outcomes Iran, median scenarios", size(medium)) ///
> xscale(lwidth(vthin) lcolor(gray*.2)) yscale(lwidth(vthin) lcolor(gray*.2)) legend(region(lcolor(none))) legend(bexpand) ///
> legend(order(1 "DELP Hospitalized" 2 "DELP Ventilated" 3 "IHME Bed need" 4 "IHME ICU need" 5 "IHME Vent need" ///
> 6 "IHME Admissions" 7 "IHME ICU new" 8 "IMPE Hosp demand" ///
> 9 "IMPE Hosp incidence" 10 "IMPE ICU demand" 11 "IMPE ICU incidence") rows(4) size(small)) ///
> subtitle("  .", size(small) color(white))
> 
> graph save "graph 71 COVID-19 hospital-related outcomes.gph", replace
> graph export "graph 71 COVID-19 hospital-related outcomes.pdf", replace
> */
. 
. 
. 
. twoway ///
> (line DayHosMeRaA01S00 date, sort lcolor(red)  lwidth(thick)) /// 1 DELP Hospitalized (Daily Cases Active Hospitalized Mean DELP S0)
> (line DayVenMeRaA01S00 date, sort lcolor(red) lpattern(dash)  lwidth(thick)) /// 2 DELP Ventilated (Daily Cases Active Ventilated Mean DELP S0)
> (line DayBedMeSmA02S01 date, sort lcolor(black)) /// 3 IHME Bed need (Daily Beds needed Mean IHME S1)
> (line DayIcuMeSmA02S01 date, sort lcolor(green)) /// 4 IHME ICU need (Daily ICU beds needed Mean IHME S1)
> (line DayAdmMeSmA02S01 date, sort lcolor(yellow)) /// 5 IHME Admissions (Daily hospital admissions Mean IHME S1)
> (line DayIcnMeSmA02S01 date, sort lcolor(blue)) /// 6 IHME ICU new (Daily new people going to ICU Mean IHME S1)
> (line DayHodMeRaA03S01 date, sort lcolor(magenta)) /// 7 IMPE Hosp demand (Daily hospital demand Mean A03 S01 )
> (line DayIcdMeRaA03S01 date, sort lcolor(magenta) lpattern(dash_dot)) /// 8 IMPE ICU demand (Daily ICU demand Mean A03 S01 )
> if date >= td(01jan2020) & date <= td(01jan2022) ///
> , xtitle(Date) xlabel(#24, format(%tdYY-NN-DD) labsize(small)) xlabel(, grid) xlabel(, grid) ///
> xlabel(, angle(forty_five)) ylabel(, format(%9.0fc) labsize(small))  ylabel(, labsize(small) angle(horizontal)) ///
> ytitle(Daily outcomes) title("COVID-19 daily hospital-related outcomes Iran, median scenarios", size(medium)) ///
> xscale(lwidth(vthin) lcolor(gray*.2)) yscale(lwidth(vthin) lcolor(gray*.2)) legend(region(lcolor(none))) legend(bexpand) ///
> legend(order(1 "DELP Hospitalized" 2 "DELP Ventilated" 3 "IHME Bed need" 4 "IHME ICU need" ///
> 5 "IHME Admissions" 6 "IHME ICU new" 7 "IMPE Hosp demand" ///
> 8 "IMPE ICU demand") rows(4) size(small)) ///
> subtitle("  .", size(small) color(white))
{res}{txt}
{com}. 
. graph save "graph 71 COVID-19 hospital-related outcomes.gph", replace
{txt}(note: file graph 71 COVID-19 hospital-related outcomes.gph not found)
{res}{txt}(file graph 71 COVID-19 hospital-related outcomes.gph saved)

{com}. graph export "graph 71 COVID-19 hospital-related outcomes.pdf", replace
{txt}(file /Users/farshadpourmalek/Downloads/covir2-main/20210521/code/merge/graph 71 COVID-19 hospital-related outcomes.pdf written in PDF format)

{com}. 
. 
. * daily hospital-related outcomes, DELP, IHME, IMPE, wo IHME Bed need, IMPE Hosp demand
. /*
> twoway ///
> (line DayHosMeRaA01S00 date, sort lcolor(red)  lwidth(thick)) /// 1 DELP Hospitalized (Daily Cases Active Hospitalized Mean DELP S0)
> (line DayVenMeRaA01S00 date, sort lcolor(red) lpattern(dash)  lwidth(thick)) /// 2 DELP Ventilated (Daily Cases Active Ventilated Mean DELP S0)
> (line DayIcuMeSmA02S01 date, sort lcolor(green)) /// 3 IHME ICU need (Daily ICU beds needed Mean IHME S1)
> (line DayVenMeSmA02S01 date, sort lcolor(red)) /// 4 IHME Vent need (Daily invasive Ventilation needed Mean IHME S1)
> (line DayAdmMeSmA02S01 date, sort lcolor(yellow)) /// 5 IHME Admissions (Daily hospital admissions Mean IHME S1)
> (line DayIcnMeSmA02S01 date, sort lcolor(blue)) /// 6 IHME ICU new (Daily new people going to ICU Mean IHME S1)
> (line DayHoiMeRaA03S01 date, sort lcolor(magenta) lpattern(dash)) /// 7 IMPE Hosp incidence (Daily hospital incidence Mean A03 S01 )
> (line DayIcdMeRaA03S01 date, sort lcolor(magenta) lpattern(dash_dot)) /// 8 IMPE ICU demand (Daily ICU demand Mean A03 S01 )
> (line DayIciMeRaA03S01 date, sort lcolor(magenta) lpattern(longdash_shortdash)) /// 9 IMPE ICU incidence (Daily ICU incidence Mean A03 S01 )
> if date >= td(30dec2019) & date <= td(23Aug2021) ///
> , xtitle(Date) xlabel(#19, format(%tdYY-NN-DD) labsize(small)) xlabel(, grid) xlabel(, grid) ///
> xlabel(, angle(forty_five)) ylabel(, format(%9.0fc) labsize(small))  ylabel(, labsize(small) angle(horizontal)) ///
> ytitle(Daily outcomes) title("COVID-19 daily hospital-related outcomes Iran, median scenarios", size(medium)) ///
> xscale(lwidth(vthin) lcolor(gray*.2)) yscale(lwidth(vthin) lcolor(gray*.2)) legend(region(lcolor(none))) legend(bexpand) ///
> legend(order(1 "DELP Hospitalized" 2 "DELP Ventilated" 3 "IHME ICU need" 4 "IHME Vent need" ///
> 5 "IHME Admissions" 6 "IHME ICU new" 7 "IMPE Hosp incidence" 8 "IMPE ICU demand" 9 "IMPE ICU incidence") rows(3) size(small)) ///
> subtitle("without IHME Bed need, IMPE Hosp demand", size(small))
> 
> graph save "graph 72 COVID-19 hospital-related outcomes, wo extremes.gph", replace
> graph export "graph 72 COVID-19 hospital-related outcomes, wo extremes.pdf", replace
> */
. 
. /*
> twoway ///
> (line DayHosMeRaA01S00 date, sort lcolor(red)  lwidth(thick)) /// 1 DELP Hospitalized (Daily Cases Active Hospitalized Mean DELP S0)
> (line DayVenMeRaA01S00 date, sort lcolor(red) lpattern(dash)  lwidth(thick)) /// 2 DELP Ventilated (Daily Cases Active Ventilated Mean DELP S0)
> (line DayIcuMeSmA02S01 date, sort lcolor(green)) /// 3 IHME ICU need (Daily ICU beds needed Mean IHME S1)
> (line DayAdmMeSmA02S01 date, sort lcolor(yellow)) /// 4 IHME Admissions (Daily hospital admissions Mean IHME S1)
> (line DayIcnMeSmA02S01 date, sort lcolor(blue)) /// 5 IHME ICU new (Daily new people going to ICU Mean IHME S1)
> (line DayHoiMeRaA03S01 date, sort lcolor(magenta) lpattern(dash)) /// 6 IMPE Hosp incidence (Daily hospital incidence Mean A03 S01 )
> (line DayIcdMeRaA03S01 date, sort lcolor(magenta) lpattern(dash_dot)) /// 7 IMPE ICU demand (Daily ICU demand Mean A03 S01 )
> (line DayIciMeRaA03S01 date, sort lcolor(magenta) lpattern(longdash_shortdash)) /// 8 IMPE ICU incidence (Daily ICU incidence Mean A03 S01 )
> if date >= td(30dec2019) & date <= td(23Aug2021) ///
> , xtitle(Date) xlabel(#19, format(%tdYY-NN-DD) labsize(small)) xlabel(, grid) xlabel(, grid) ///
> xlabel(, angle(forty_five)) ylabel(, format(%9.0fc) labsize(small))  ylabel(, labsize(small) angle(horizontal)) ///
> ytitle(Daily outcomes) title("COVID-19 daily hospital-related outcomes Iran, median scenarios", size(medium)) ///
> xscale(lwidth(vthin) lcolor(gray*.2)) yscale(lwidth(vthin) lcolor(gray*.2)) legend(region(lcolor(none))) legend(bexpand) ///
> legend(order(1 "DELP Hospitalized" 2 "DELP Ventilated" 3 "IHME ICU need" ///
> 4 "IHME Admissions" 5 "IHME ICU new" 6 "IMPE Hosp incidence" 7 "IMPE ICU demand" 8 "IMPE ICU incidence") rows(3) size(small)) ///
> subtitle("without IHME Bed need, IMPE Hosp demand", size(small))
> 
> graph save "graph 72 COVID-19 hospital-related outcomes, wo extremes.gph", replace
> graph export "graph 72 COVID-19 hospital-related outcomes, wo extremes.pdf", replace
> */
. 
. 
. * daily hospital-related outcomes, DELP, IHME, IMPE, wo IHME Bed need, IMPE Hosp demand, 2020-12-01 on 
. /*
> twoway ///
> (line DayHosMeRaA01S00 date, sort lcolor(red)  lwidth(thick)) /// 1 DELP Hospitalized (Daily Cases Active Hospitalized Mean DELP S0)
> (line DayVenMeRaA01S00 date, sort lcolor(red) lpattern(dash)  lwidth(thick)) /// 2 DELP Ventilated (Daily Cases Active Ventilated Mean DELP S0)
> (line DayIcuMeSmA02S01 date, sort lcolor(green)) /// 3 IHME ICU need (Daily ICU beds needed Mean IHME S1)
> (line DayVenMeSmA02S01 date, sort lcolor(red)) /// 4 IHME Vent need (Daily invasive Ventilation needed Mean IHME S1)
> (line DayAdmMeSmA02S01 date, sort lcolor(yellow)) /// 5 IHME Admissions (Daily hospital admissions Mean IHME S1)
> (line DayIcnMeSmA02S01 date, sort lcolor(blue)) /// 6 IHME ICU new (Daily new people going to ICU Mean IHME S1)
> (line DayHoiMeRaA03S01 date, sort lcolor(magenta) lpattern(dash)) /// 7 IMPE Hosp incidence (Daily hospital incidence Mean A03 S01 )
> (line DayIcdMeRaA03S01 date, sort lcolor(magenta) lpattern(dash_dot)) /// 8 IMPE ICU demand (Daily ICU demand Mean A03 S01 )
> (line DayIciMeRaA03S01 date, sort lcolor(magenta) lpattern(longdash_shortdash)) /// 9 IMPE ICU incidence (Daily ICU incidence Mean A03 S01 )
> if date >= td(30nov2020) & date <= td(23Aug2021) ///
> , xtitle(Date) xlabel(#8, format(%tdYY-NN-DD) labsize(small)) xlabel(, grid) xlabel(, grid) ///
> xlabel(, angle(forty_five)) ylabel(, format(%9.0fc) labsize(small))  ylabel(, labsize(small) angle(horizontal)) ///
> ytitle(Daily outcomes) title("COVID-19 daily hospital-related outcomes Iran, median scenarios", size(medium)) ///
> xscale(lwidth(vthin) lcolor(gray*.2)) yscale(lwidth(vthin) lcolor(gray*.2)) legend(region(lcolor(none))) legend(bexpand) ///
> legend(order(1 "DELP Hospitalized" 2 "DELP Ventilated" 3 "IHME ICU need" 4 "IHME Vent need" ///
> 5 "IHME Admissions" 6 "IHME ICU new" 7 "IMPE Hosp incidence" 8 "IMPE ICU demand" 9 "IMPE ICU incidence") rows(3) size(small)) ///
> subtitle("after 2020-12-01, without IHME Bed need, IMPE Hosp demand", size(small))
> 
> graph save "graph 73 COVID-19 hospital-related outcomes, wo extremes, 2020-12-01 on.gph", replace
> graph export "graph 73 COVID-19 hospital-related outcomes, wo extremes, 2020-12-01 on.pdf", replace
> */
. 
. 
. 
. /*
> twoway ///
> (line DayHosMeRaA01S00 date, sort lcolor(red)  lwidth(thick)) /// 1 DELP Hospitalized (Daily Cases Active Hospitalized Mean DELP S0)
> (line DayVenMeRaA01S00 date, sort lcolor(red) lpattern(dash)  lwidth(thick)) /// 2 DELP Ventilated (Daily Cases Active Ventilated Mean DELP S0)
> (line DayIcuMeSmA02S01 date, sort lcolor(green)) /// 3 IHME ICU need (Daily ICU beds needed Mean IHME S1)
> (line DayAdmMeSmA02S01 date, sort lcolor(yellow)) /// 4 IHME Admissions (Daily hospital admissions Mean IHME S1)
> (line DayIcnMeSmA02S01 date, sort lcolor(blue)) /// 5 IHME ICU new (Daily new people going to ICU Mean IHME S1)
> (line DayHoiMeRaA03S01 date, sort lcolor(magenta) lpattern(dash)) /// 6 IMPE Hosp incidence (Daily hospital incidence Mean A03 S01 )
> (line DayIcdMeRaA03S01 date, sort lcolor(magenta) lpattern(dash_dot)) /// 7 IMPE ICU demand (Daily ICU demand Mean A03 S01 )
> (line DayIciMeRaA03S01 date, sort lcolor(magenta) lpattern(longdash_shortdash)) /// 8 IMPE ICU incidence (Daily ICU incidence Mean A03 S01 )
> if date >= td(30nov2020) & date <= td(23Aug2021) ///
> , xtitle(Date) xlabel(#8, format(%tdYY-NN-DD) labsize(small)) xlabel(, grid) xlabel(, grid) ///
> xlabel(, angle(forty_five)) ylabel(, format(%9.0fc) labsize(small))  ylabel(, labsize(small) angle(horizontal)) ///
> ytitle(Daily outcomes) title("COVID-19 daily hospital-related outcomes Iran, median scenarios", size(medium)) ///
> xscale(lwidth(vthin) lcolor(gray*.2)) yscale(lwidth(vthin) lcolor(gray*.2)) legend(region(lcolor(none))) legend(bexpand) ///
> legend(order(1 "DELP Hospitalized" 2 "DELP Ventilated" 3 "IHME ICU need" ///
> 4 "IHME Admissions" 5 "IHME ICU new" 6 "IMPE Hosp incidence" 7 "IMPE ICU demand" 8 "IMPE ICU incidence") rows(3) size(small)) ///
> subtitle("after 2020-12-01, without IHME Bed need, IMPE Hosp demand", size(small))
> 
> graph save "graph 73 COVID-19 hospital-related outcomes, wo extremes, 2020-12-01 on.gph", replace
> graph export "graph 73 COVID-19 hospital-related outcomes, wo extremes, 2020-12-01 on.pdf", replace
> */
. 
. 
. 
. 
. twoway ///
> (line DayHosMeRaA01S00 date, sort lcolor(red)  lwidth(thick)) /// 1 DELP Hospitalized (Daily Cases Active Hospitalized Mean DELP S0)
> (line DayVenMeRaA01S00 date, sort lcolor(red) lpattern(dash)  lwidth(thick)) /// 2 DELP Ventilated (Daily Cases Active Ventilated Mean DELP S0)
> (line DayIcuMeSmA02S01 date, sort lcolor(green)) /// 3 IHME ICU need (Daily ICU beds needed Mean IHME S1)
> (line DayAdmMeSmA02S01 date, sort lcolor(yellow)) /// 4 IHME Admissions (Daily hospital admissions Mean IHME S1)
> (line DayIcnMeSmA02S01 date, sort lcolor(blue)) /// 5 IHME ICU new (Daily new people going to ICU Mean IHME S1)
> (line DayIcdMeRaA03S01 date, sort lcolor(magenta) lpattern(dash_dot)) /// 6 IMPE ICU demand (Daily ICU demand Mean A03 S01 )
> if date >= td(01jan2021) & date <= td(01jan2022) ///
> , xtitle(Date) xlabel(#12, format(%tdYY-NN-DD) labsize(small)) xlabel(, grid) xlabel(, grid) ///
> xlabel(, angle(forty_five)) ylabel(, format(%9.0fc) labsize(small))  ylabel(, labsize(small) angle(horizontal)) ///
> ytitle(Daily outcomes) title("COVID-19 daily hospital-related outcomes Iran, median scenarios", size(medium)) ///
> xscale(lwidth(vthin) lcolor(gray*.2)) yscale(lwidth(vthin) lcolor(gray*.2)) legend(region(lcolor(none))) legend(bexpand) ///
> legend(order(1 "DELP Hospitalized" 2 "DELP Ventilated" 3 "IHME ICU need" ///
> 4 "IHME Admissions" 5 "IHME ICU new" 6 "IMPE ICU demand") rows(3) size(small)) ///
> subtitle("after 2021-01-01, without IHME Bed need, IMPE Hosp demand", size(small))
{res}{txt}
{com}. 
. graph save "graph 73 COVID-19 hospital-related outcomes, wo extremes, 2020-12-01 on.gph", replace
{txt}(note: file graph 73 COVID-19 hospital-related outcomes, wo extremes, 2020-12-01 on.gph not found)
{res}{txt}(file graph 73 COVID-19 hospital-related outcomes, wo extremes, 2020-12-01 on.gph saved)

{com}. graph export "graph 73 COVID-19 hospital-related outcomes, wo extremes, 2020-12-01 on.pdf", replace
{txt}(file /Users/farshadpourmalek/Downloads/covir2-main/20210521/code/merge/graph 73 COVID-19 hospital-related outcomes, wo extremes, 2020-12-01 on.pdf written in PDF format)

{com}. 
. 
. 
. 
. 
. twoway ///
> (line DayHosMeRaA01S00 date, sort lcolor(red)  lwidth(thick)) /// 1 DELP Hospitalized (Daily Cases Active Hospitalized Mean DELP S0)
> (line DayVenMeRaA01S00 date, sort lcolor(red) lpattern(dash)  lwidth(thick)) /// 2 DELP Ventilated (Daily Cases Active Ventilated Mean DELP S0)
> (line DayIcuMeSmA02S01 date, sort lcolor(green)) /// 3 IHME ICU need (Daily ICU beds needed Mean IHME S1)
> (line DayAdmMeSmA02S01 date, sort lcolor(yellow)) /// 4 IHME Admissions (Daily hospital admissions Mean IHME S1)
> (line DayIcnMeSmA02S01 date, sort lcolor(blue)) /// 5 IHME ICU new (Daily new people going to ICU Mean IHME S1)
> (line DayIcdMeRaA03S01 date, sort lcolor(magenta) lpattern(dash_dot)) /// 6 IMPE ICU demand (Daily ICU demand Mean A03 S01 )
> if date >= td(21apr2021) & date <= td(23Sep2021) ///
> , xtitle(Date) xlabel(#8, format(%tdYY-NN-DD) labsize(small)) xlabel(, grid) xlabel(, grid) ///
> xlabel(, angle(forty_five)) ylabel(, format(%9.0fc) labsize(small))  ylabel(, labsize(small) angle(horizontal)) ///
> ytitle(Daily outcomes) title("COVID-19 daily hospital-related outcomes Iran, median scenarios", size(medium)) ///
> xscale(lwidth(vthin) lcolor(gray*.2)) yscale(lwidth(vthin) lcolor(gray*.2)) legend(region(lcolor(none))) legend(bexpand) ///
> legend(order(1 "DELP Hospitalized" 2 "DELP Ventilated" 3 "IHME ICU need" ///
> 4 "IHME Admissions" 5 "IHME ICU new" 6 "IMPE ICU demand") rows(3) size(small)) ///
> subtitle("after Ordibehesht 1400, without IHME Bed need, IMPE Hosp demand", size(small))
{res}{txt}
{com}. 
. graph save "graph 74 COVID-19 hospital-related outcomes, wo extremes, Ordibehesht 1400 on.gph", replace
{txt}(note: file graph 74 COVID-19 hospital-related outcomes, wo extremes, Ordibehesht 1400 on.gph not found)
{res}{txt}(file graph 74 COVID-19 hospital-related outcomes, wo extremes, Ordibehesht 1400 on.gph saved)

{com}. graph export "graph 74 COVID-19 hospital-related outcomes, wo extremes, Ordibehesht 1400 on.pdf", replace
{txt}(file /Users/farshadpourmalek/Downloads/covir2-main/20210521/code/merge/graph 74 COVID-19 hospital-related outcomes, wo extremes, Ordibehesht 1400 on.pdf written in PDF format)

{com}. 
. 
. 
. 
. *******************************
. 
. * daily cases to deaths (CTD) 
. 
. 
. * Daily cases to deaths (CTD) all studies, all time, reference scenarios
. 
. twoway ///
> (line DayCTDMeRaA00S00 date, sort lcolor(cyan) lwidth(vthick) lpattern(tight_dot)) /// 1 "JOHN"
> (line DayCTDMeRaA01S00 date, sort lcolor(red)) /// 2 "DELP"
> (line DayCTDMeRaA02S01 date, sort lcolor(black)) /// 3 "IHME"
> (line DayCTDMeRaA03S02 date, sort lcolor(magenta)) /// 4 "IMPE"
> (line DayCTDMeRaA04S00 date, sort lcolor(gold)) /// 5 "LANL"
> (line DayCTDMeRaA05S00 date, sort lcolor(green)) /// 6 "SRIV"
> if date >= td(01jan2020) & date <= td(01jan2022) ///
> , xtitle(Date) xlabel(#24, format(%tdYY-NN-DD) labsize(small)) xlabel(, grid) xlabel(, grid) ///
> xlabel(, angle(forty_five)) ylabel(, format(%12.0fc) labsize(small))  ylabel(, labsize(small) angle(horizontal)) ///
> ytitle(Daily cases to deaths) title("COVID-19 daily cases to deaths, Iran, reference scenarios", size(medium)) /// 
> xscale(lwidth(vthin) lcolor(gray*.2)) yscale(lwidth(vthin) lcolor(gray*.2)) legend(region(lcolor(none))) legend(bexpand) ///
> legend(order(1 "JOHN" 2 "DELP" 3 "IHME" 4 "IMPE" 5 "LANL" 6 "SRIV") size(small) row(1)) ///
> subtitle("  .", size(small) color(white))
{res}{txt}
{com}. 
. graph save "graph 81 COVID-19 daily cases to deaths, Iran, reference scenarios.gph", replace
{txt}(note: file graph 81 COVID-19 daily cases to deaths, Iran, reference scenarios.gph not found)
{res}{txt}(file graph 81 COVID-19 daily cases to deaths, Iran, reference scenarios.gph saved)

{com}. graph export "graph 81 COVID-19 daily cases to deaths, Iran, reference scenarios.pdf", replace
{txt}(file /Users/farshadpourmalek/Downloads/covir2-main/20210521/code/merge/graph 81 COVID-19 daily cases to deaths, Iran, reference scenarios.pdf written in PDF format)

{com}. 
. 
. 
. * Daily cases to deaths (CTD) all studies, 2021-01-01 on, reference scenarios
. 
. twoway ///
> (line DayCTDMeRaA00S00 date, sort lcolor(cyan) lwidth(vthick) lpattern(tight_dot)) /// 1 "JOHN"
> (line DayCTDMeRaA01S00 date, sort lcolor(red)) /// 2 "DELP"
> (line DayCTDMeRaA02S01 date, sort lcolor(black)) /// 3 "IHME"
> (line DayCTDMeRaA03S02 date, sort lcolor(magenta)) /// 4 "IMPE"
> (line DayCTDMeRaA04S00 date, sort lcolor(gold)) /// 5 "LANL"
> (line DayCTDMeRaA05S00 date, sort lcolor(green)) /// 6 "SRIV"
> if date >= td(01jan2021) & date <= td(01jan2022) ///
> , xtitle(Date) xlabel(#12, format(%tdYY-NN-DD) labsize(small)) xlabel(, grid) xlabel(, grid) ///
> xlabel(, angle(forty_five)) ylabel(, format(%12.0fc) labsize(small))  ylabel(, labsize(small) angle(horizontal)) ///
> ytitle(Daily cases to deaths) title("COVID-19 daily cases to deaths, Iran, reference scenarios", size(medium)) /// 
> xscale(lwidth(vthin) lcolor(gray*.2)) yscale(lwidth(vthin) lcolor(gray*.2)) legend(region(lcolor(none))) legend(bexpand) ///
> legend(order(1 "JOHN" 2 "DELP" 3 "IHME" 4 "IMPE" 5 "LANL" 6 "SRIV") size(small) row(1)) ///
> subtitle("after 2021-01-01", size(small))
{res}{txt}
{com}. 
. graph save "graph 82 COVID-19 daily cases to deaths, Iran, reference scenarios, 2021-01-01 on.gph", replace
{txt}(note: file graph 82 COVID-19 daily cases to deaths, Iran, reference scenarios, 2021-01-01 on.gph not found)
{res}{txt}(file graph 82 COVID-19 daily cases to deaths, Iran, reference scenarios, 2021-01-01 on.gph saved)

{com}. graph export "graph 82 COVID-19 daily cases to deaths, Iran, reference scenarios, 2021-01-01 on.pdf", replace
{txt}(file /Users/farshadpourmalek/Downloads/covir2-main/20210521/code/merge/graph 82 COVID-19 daily cases to deaths, Iran, reference scenarios, 2021-01-01 on.pdf written in PDF format)

{com}. 
. 
. 
. * Daily cases to deaths (CTD) all studies, Ordibehesht 1400 on, 3 scenarios
. 
. twoway ///
> (line DayCTDMeRaA00S00 date, sort lcolor(cyan) lwidth(vthick) lpattern(tight_dot)) /// 1 "JOHN"
> (line DayCTDMeRaA01S00 date, sort lcolor(red)) /// 2 "DELP"
> (line DayCTDMeRaA02S01 date, sort lcolor(black)) /// 3 "IHME" S1
> (line DayCTDMeRaA02S02 date, sort lcolor(black*.2) lpattern(dash)) /// 4 "IHME" S2
> (line DayCTDMeRaA02S03 date, sort lcolor(black*.2) lpattern(dash)) /// 5 "IHME" S3
> (line DayCTDMeRaA03S02 date, sort lcolor(magenta)) /// 6 "IMPE" S2
> (line DayCTDMeRaA03S01 date, sort lcolor(magenta*.2) lpattern(dash)) /// 7 "IMPE" S1
> (line DayCTDMeRaA03S03 date, sort lcolor(magenta*.2) lpattern(dash)) /// 8 "IMPE" S3
> (line DayCTDMeRaA04S00 date, sort lcolor(gold)) /// 9 "LANL"
> (line DayCTDMeRaA05S00 date, sort lcolor(green)) /// 10 "SRIV"
> if date >= td(21apr2021) & date <= td(23Sep2021) ///
> , xtitle(Date) xlabel(#7, format(%tdYY-NN-DD) labsize(small)) xlabel(, grid) xlabel(, grid) ///
> xlabel(, angle(forty_five)) ylabel(, format(%12.0fc) labsize(small))  ylabel(, labsize(small) angle(horizontal)) ///
> ytitle(Daily cases to deaths) title("COVID-19 daily cases to deaths, Iran, 3 scenarios", size(medium)) /// 
> xscale(lwidth(vthin) lcolor(gray*.2)) yscale(lwidth(vthin) lcolor(gray*.2)) legend(region(lcolor(none))) legend(bexpand) ///
> legend(order(1 "JOHN" 2 "DELP" 3 "IHME" 6 "IMPE" 9 "LANL" 10 "SRIV") size(small) row(1)) ///
> note("Current scenarios: solid curves. Best and worst scenarios: dashed curves") ///
> subtitle("after Ordibehesht 1400, 3 scenarios", size(small))
{res}{txt}
{com}. 
. graph save "graph 83 COVID-19 daily cases to deaths, Iran, 3 scenarios, Ordibehesht 1400 on.gph", replace
{txt}(note: file graph 83 COVID-19 daily cases to deaths, Iran, 3 scenarios, Ordibehesht 1400 on.gph not found)
{res}{txt}(file graph 83 COVID-19 daily cases to deaths, Iran, 3 scenarios, Ordibehesht 1400 on.gph saved)

{com}. graph export "graph 83 COVID-19 daily cases to deaths, Iran, 3 scenarios, Ordibehesht 1400 on.pdf", replace
{txt}(file /Users/farshadpourmalek/Downloads/covir2-main/20210521/code/merge/graph 83 COVID-19 daily cases to deaths, Iran, 3 scenarios, Ordibehesht 1400 on.pdf written in PDF format)

{com}. 
. 
. 
. * Total cases to deaths (CTD) all studies, all time, reference scenarios
. 
. twoway ///
> (line TotCTDMeRaA00S00 date, sort lcolor(cyan) lwidth(vthick) lpattern(tight_dot)) /// 1 "JOHN"
> (line TotCTDMeRaA01S00 date, sort lcolor(red)) /// 2 "DELP"
> (line TotCTDMeRaA02S01 date, sort lcolor(black)) /// 3 "IHME"
> (line TotCTDMeRaA03S02 date, sort lcolor(magenta)) /// 4 "IMPE"
> (line TotCTDMeRaA04S00 date, sort lcolor(gold)) /// 5 "LANL"
> (line TotCTDMeRaA05S00 date, sort lcolor(green)) /// 6 "SRIV"
> if date >= td(01jan2020) & date <= td(01jan2022) ///
> , xtitle(Date) xlabel(#24, format(%tdYY-NN-DD) labsize(small)) xlabel(, grid) xlabel(, grid) ///
> xlabel(, angle(forty_five)) ylabel(, format(%12.0fc) labsize(small))  ylabel(, labsize(small) angle(horizontal)) ///
> ytitle(Total cases to deaths) title("COVID-19 total cases to deaths, Iran, reference scenarios", size(medium)) /// 
> xscale(lwidth(vthin) lcolor(gray*.2)) yscale(lwidth(vthin) lcolor(gray*.2)) legend(region(lcolor(none))) legend(bexpand) ///
> legend(order(1 "JOHN" 2 "DELP" 3 "IHME" 4 "IMPE" 5 "LANL" 6 "SRIV") size(small) row(1)) ///
> subtitle("  .", size(small) color(white))
{res}{txt}
{com}. 
. graph save "graph 84 COVID-19 total cases to deaths, Iran, reference scenarios.gph", replace
{txt}(note: file graph 84 COVID-19 total cases to deaths, Iran, reference scenarios.gph not found)
{res}{txt}(file graph 84 COVID-19 total cases to deaths, Iran, reference scenarios.gph saved)

{com}. graph export "graph 84 COVID-19 total cases to deaths, Iran, reference scenarios.pdf", replace
{txt}(file /Users/farshadpourmalek/Downloads/covir2-main/20210521/code/merge/graph 84 COVID-19 total cases to deaths, Iran, reference scenarios.pdf written in PDF format)

{com}. 
. 
. 
. * Total cases to deaths (CTD) all studies, Ordibehesht 1400 on, reference scenarios
. 
. twoway ///
> (line TotCTDMeRaA00S00 date, sort lcolor(cyan) lwidth(vthick) lpattern(tight_dot)) /// 1 "JOHN"
> (line TotCTDMeRaA01S00 date, sort lcolor(red)) /// 2 "DELP"
> (line TotCTDMeRaA02S01 date, sort lcolor(black)) /// 3 "IHME"
> (line TotCTDMeRaA03S02 date, sort lcolor(magenta)) /// 4 "IMPE"
> (line TotCTDMeRaA04S00 date, sort lcolor(gold)) /// 5 "LANL"
> (line TotCTDMeRaA05S00 date, sort lcolor(green)) /// 6 "SRIV"
> if date >= td(21apr2021) & date <= td(23Sep2021) ///
> , xtitle(Date) xlabel(#7, format(%tdYY-NN-DD) labsize(small)) xlabel(, grid) xlabel(, grid) ///
> xlabel(, angle(forty_five)) ylabel(, format(%12.0fc) labsize(small))  ylabel(, labsize(small) angle(horizontal)) ///
> ytitle(Total cases to deaths) title("COVID-19 total cases to deaths, Iran, reference scenarios", size(medium)) /// 
> xscale(lwidth(vthin) lcolor(gray*.2)) yscale(lwidth(vthin) lcolor(gray*.2)) legend(region(lcolor(none))) legend(bexpand) ///
> legend(order(1 "JOHN" 2 "DELP" 3 "IHME" 4 "IMPE" 5 "LANL" 6 "SRIV") size(small) row(1)) ///
> subtitle("after Ordibehesht 1400", size(small))
{res}{txt}
{com}. 
. graph save "graph 85 COVID-19 total cases to deaths, Iran, reference scenarios, Ordibehesht 1400 on.gph", replace
{txt}(note: file graph 85 COVID-19 total cases to deaths, Iran, reference scenarios, Ordibehesht 1400 on.gph not found)
{res}{txt}(file graph 85 COVID-19 total cases to deaths, Iran, reference scenarios, Ordibehesht 1400 on.gph saved)

{com}. graph export "graph 85 COVID-19 total cases to deaths, Iran, reference scenarios, Ordibehesht 1400 on.pdf", replace
{txt}(file /Users/farshadpourmalek/Downloads/covir2-main/20210521/code/merge/graph 85 COVID-19 total cases to deaths, Iran, reference scenarios, Ordibehesht 1400 on.pdf written in PDF format)

{com}. 
. 
. 
. 
. *******************************
. 
. *  estimated to reported (graph numbers start with 91)
. 
. 
. * daily deaths estimated to reported  
. 
. 
. * daily deaths estimated to reported (DER) all studies, all time, reference scenarios
. 
. twoway ///
> (line DayDERMeRaA00S00 date, sort lcolor(cyan) lwidth(vthick) lpattern(tight_dot)) /// 1 "JOHN"
> (line DayDERMeRaA01S00 date, sort lcolor(red)) /// 2 "DELP"
> (line DayDERMeRaA02S01 date, sort lcolor(black)) /// 3 "IHME"
> (line DayDERMeRaA03S02 date, sort lcolor(magenta)) /// 4 "IMPE"
> (line DayDERMeRaA04S00 date, sort lcolor(gold)) /// 5 "LANL"
> (line DayDERMeRaA05S00 date, sort lcolor(green)) /// 6 "SRIV"
> if date >= td(01jan2020) & date <= td(01jan2022) ///
> , xtitle(Date) xlabel(#24, format(%tdYY-NN-DD) labsize(small)) xlabel(, grid) xlabel(, grid) ///
> xlabel(, angle(forty_five)) ylabel(, format(%12.1fc) labsize(small))  ylabel(, labsize(small) angle(horizontal)) ///
> ytitle(Daily deaths estimated to reported) title("COVID-19 daily deaths estimated to reported, Iran, reference scenarios", size(medium)) /// 
> xscale(lwidth(vthin) lcolor(gray*.2)) yscale(lwidth(vthin) lcolor(gray*.2)) legend(region(lcolor(none))) legend(bexpand) ///
> legend(order(1 "JOHN" 2 "DELP" 3 "IHME" 4 "IMPE" 5 "LANL" 6 "SRIV") size(small) row(1)) ///
> subtitle("  .", size(small) color(white))
{res}{txt}
{com}. 
. graph save "graph 91 COVID-19 daily deaths estimated to reported, Iran, reference scenarios.gph", replace
{txt}(note: file graph 91 COVID-19 daily deaths estimated to reported, Iran, reference scenarios.gph not found)
{res}{txt}(file graph 91 COVID-19 daily deaths estimated to reported, Iran, reference scenarios.gph saved)

{com}. graph export "graph 91 COVID-19 daily deaths estimated to reported, Iran, reference scenarios.pdf", replace
{txt}(file /Users/farshadpourmalek/Downloads/covir2-main/20210521/code/merge/graph 91 COVID-19 daily deaths estimated to reported, Iran, reference scenarios.pdf written in PDF format)

{com}. 
. 
. 
. * daily deaths estimated to reported (DER) all studies, 2021-01-01 on, reference scenarios
. 
. twoway ///
> (line DayDERMeRaA00S00 date, sort lcolor(cyan) lwidth(vthick) lpattern(tight_dot)) /// 1 "JOHN"
> (line DayDERMeRaA01S00 date, sort lcolor(red)) /// 2 "DELP"
> (line DayDERMeRaA02S01 date, sort lcolor(black)) /// 3 "IHME"
> (line DayDERMeRaA03S02 date, sort lcolor(magenta)) /// 4 "IMPE"
> (line DayDERMeRaA04S00 date, sort lcolor(gold)) /// 5 "LANL"
> (line DayDERMeRaA05S00 date, sort lcolor(green)) /// 6 "SRIV"
> if date >= td(01jan2021) & date <= td(01jan2022) ///
> , xtitle(Date) xlabel(#12, format(%tdYY-NN-DD) labsize(small)) xlabel(, grid) xlabel(, grid) ///
> xlabel(, angle(forty_five)) ylabel(, format(%12.1fc) labsize(small))  ylabel(, labsize(small) angle(horizontal)) ///
> ytitle(Daily deaths estimated to reported) title("COVID-19 daily deaths estimated to reported, Iran, reference scenarios", size(medium)) /// 
> xscale(lwidth(vthin) lcolor(gray*.2)) yscale(lwidth(vthin) lcolor(gray*.2)) legend(region(lcolor(none))) legend(bexpand) ///
> legend(order(1 "JOHN" 2 "DELP" 3 "IHME" 4 "IMPE" 5 "LANL" 6 "SRIV") size(small) row(1)) ///
> subtitle("  .", size(small) color(white))
{res}{txt}
{com}. 
. graph save "graph 92 COVID-19 daily deaths estimated to reported, Iran, reference scenarios, 2021-01-01 on.gph", replace
{txt}(note: file graph 92 COVID-19 daily deaths estimated to reported, Iran, reference scenarios, 2021-01-01 on.gph not found)
{res}{txt}(file graph 92 COVID-19 daily deaths estimated to reported, Iran, reference scenarios, 2021-01-01 on.gph saved)

{com}. graph export "graph 92 COVID-19 daily deaths estimated to reported, Iran, reference scenarios, 2021-01-01 on.pdf", replace
{txt}(file /Users/farshadpourmalek/Downloads/covir2-main/20210521/code/merge/graph 92 COVID-19 daily deaths estimated to reported, Iran, reference scenarios, 2021-01-01 on.pdf written in PDF format)

{com}. 
. 
. 
. * daily cases estimated to reported  
. 
. 
. * daily cases estimated to reported (CER) all studies, all time, reference scenarios
. 
. twoway ///
> (line DayCERMeRaA00S00 date, sort lcolor(cyan) lwidth(vthick) lpattern(tight_dot)) /// 1 "JOHN"
> (line DayCERMeRaA01S00 date, sort lcolor(red)) /// 2 "DELP"
> (line DayCERMeRaA02S01 date, sort lcolor(black)) /// 3 "IHME"
> (line DayCERMeRaA03S02 date, sort lcolor(magenta)) /// 4 "IMPE"
> (line DayCERMeRaA04S00 date, sort lcolor(gold)) /// 5 "LANL"
> (line DayCERMeRaA05S00 date, sort lcolor(green)) /// 6 "SRIV"
> if date >= td(01jan2020) & date <= td(01jan2022) ///
> , xtitle(Date) xlabel(#24, format(%tdYY-NN-DD) labsize(small)) xlabel(, grid) xlabel(, grid) ///
> xlabel(, angle(forty_five)) ylabel(, format(%12.0fc) labsize(small))  ylabel(, labsize(small) angle(horizontal)) ///
> ytitle(Daily cases estimated to reported) title("COVID-19 daily cases estimated to reported, Iran, reference scenarios", size(medium)) /// 
> xscale(lwidth(vthin) lcolor(gray*.2)) yscale(lwidth(vthin) lcolor(gray*.2)) legend(region(lcolor(none))) legend(bexpand) ///
> legend(order(1 "JOHN" 2 "DELP" 3 "IHME" 4 "IMPE" 5 "LANL" 6 "SRIV") size(small) row(1)) ///
> subtitle("  .", size(small) color(white))
{res}{txt}
{com}. 
. graph save "graph 93 COVID-19 daily cases estimated to reported, Iran, reference scenarios.gph", replace
{txt}(note: file graph 93 COVID-19 daily cases estimated to reported, Iran, reference scenarios.gph not found)
{res}{txt}(file graph 93 COVID-19 daily cases estimated to reported, Iran, reference scenarios.gph saved)

{com}. graph export "graph 93 COVID-19 daily cases estimated to reported, Iran, reference scenarios.pdf", replace
{txt}(file /Users/farshadpourmalek/Downloads/covir2-main/20210521/code/merge/graph 93 COVID-19 daily cases estimated to reported, Iran, reference scenarios.pdf written in PDF format)

{com}. 
. 
. 
. * daily cases estimated to reported (CER) all studies, 2021-01-01 on, reference scenarios
. 
. twoway ///
> (line DayCERMeRaA00S00 date, sort lcolor(cyan) lwidth(vthick) lpattern(tight_dot)) /// 1 "JOHN"
> (line DayCERMeRaA01S00 date, sort lcolor(red)) /// 2 "DELP"
> (line DayCERMeRaA02S01 date, sort lcolor(black)) /// 3 "IHME"
> (line DayCERMeRaA03S02 date, sort lcolor(magenta)) /// 4 "IMPE"
> (line DayCERMeRaA04S00 date, sort lcolor(gold)) /// 5 "LANL"
> (line DayCERMeRaA05S00 date, sort lcolor(green)) /// 6 "SRIV"
> if date >= td(01jan2021) & date <= td(01jan2022) ///
> , xtitle(Date) xlabel(#12, format(%tdYY-NN-DD) labsize(small)) xlabel(, grid) xlabel(, grid) ///
> xlabel(, angle(forty_five)) ylabel(, format(%12.1fc) labsize(small))  ylabel(, labsize(small) angle(horizontal)) ///
> ytitle(Daily cases estimated to reported) title("COVID-19 daily cases estimated to reported, Iran, reference scenarios", size(medium)) /// 
> xscale(lwidth(vthin) lcolor(gray*.2)) yscale(lwidth(vthin) lcolor(gray*.2)) legend(region(lcolor(none))) legend(bexpand) ///
> legend(order(1 "JOHN" 2 "DELP" 3 "IHME" 4 "IMPE" 5 "LANL" 6 "SRIV") size(small) row(1)) ///
> subtitle("  .", size(small) color(white))
{res}{txt}
{com}. 
. graph save "graph 94 COVID-19 daily cases estimated to reported, Iran, reference scenarios, 2021-01-01 on.gph", replace
{txt}(note: file graph 94 COVID-19 daily cases estimated to reported, Iran, reference scenarios, 2021-01-01 on.gph not found)
{res}{txt}(file graph 94 COVID-19 daily cases estimated to reported, Iran, reference scenarios, 2021-01-01 on.gph saved)

{com}. graph export "graph 94 COVID-19 daily cases estimated to reported, Iran, reference scenarios, 2021-01-01 on.pdf", replace
{txt}(file /Users/farshadpourmalek/Downloads/covir2-main/20210521/code/merge/graph 94 COVID-19 daily cases estimated to reported, Iran, reference scenarios, 2021-01-01 on.pdf written in PDF format)

{com}. 
. 
. 
. * total deaths estimated to reported (DER) all studies, all time, reference scenarios
. 
. twoway ///
> (line TotDERMeRaA00S00 date, sort lcolor(cyan) lwidth(vthick) lpattern(tight_dot)) /// 1 "JOHN
> (line TotDERMeRaA01S00 date, sort lcolor(red)) /// 2 "DELP"
> (line TotDERMeRaA02S01 date, sort lcolor(black)) /// 3 "IHME"
> (line TotDERMeRaA03S02 date, sort lcolor(magenta)) /// 4 "IMPE"
> (line TotDERMeRaA04S00 date, sort lcolor(gold)) /// 5 "LANL"
> (line TotDERMeRaA05S00 date, sort lcolor(green)) /// 6 "SRIV"
> if date >= td(01jan2020) & date <= td(01jan2022) ///
> , xtitle(Date) xlabel(#24, format(%tdYY-NN-DD) labsize(small)) xlabel(, grid) xlabel(, grid) ///
> xlabel(, angle(forty_five)) ylabel(, format(%12.0fc) labsize(small))  ylabel(, labsize(small) angle(horizontal)) ///
> ytitle(Total deaths estimated to reported) title("COVID-19 total deaths estimated to reported, Iran, reference scenarios", size(medium)) /// 
> xscale(lwidth(vthin) lcolor(gray*.2)) yscale(lwidth(vthin) lcolor(gray*.2)) legend(region(lcolor(none))) legend(bexpand) ///
> legend(order(1 "JOHN" 2 "DELP" 3 "IHME" 4 "IMPE" 5 "LANL" 6 "SRIV") size(small) row(1)) ///
> subtitle("  .", size(small) color(white))
{res}{txt}
{com}. 
. graph save "graph 95 COVID-19 total deaths estimated to reported, Iran, reference scenarios.gph", replace
{txt}(note: file graph 95 COVID-19 total deaths estimated to reported, Iran, reference scenarios.gph not found)
{res}{txt}(file graph 95 COVID-19 total deaths estimated to reported, Iran, reference scenarios.gph saved)

{com}. graph export "graph 95 COVID-19 total deaths estimated to reported, Iran, reference scenarios.pdf", replace
{txt}(file /Users/farshadpourmalek/Downloads/covir2-main/20210521/code/merge/graph 95 COVID-19 total deaths estimated to reported, Iran, reference scenarios.pdf written in PDF format)

{com}. 
. 
. 
. * total deaths estimated to reported (DER) all studies, 2021-01-01 on, reference scenarios
. 
. twoway ///
> (line TotDERMeRaA00S00 date, sort lcolor(cyan) lwidth(vthick) lpattern(tight_dot)) /// 1 "JOHN
> (line TotDERMeRaA01S00 date, sort lcolor(red)) /// 2 "DELP"
> (line TotDERMeRaA02S01 date, sort lcolor(black)) /// 3 "IHME"
> (line TotDERMeRaA03S02 date, sort lcolor(magenta)) /// 4 "IMPE"
> (line TotDERMeRaA04S00 date, sort lcolor(gold)) /// 5 "LANL"
> (line TotDERMeRaA05S00 date, sort lcolor(green)) /// 6 "SRIV"
> if date >= td(01jan2021) & date <= td(01jan2022) ///
> , xtitle(Date) xlabel(#12, format(%tdYY-NN-DD) labsize(small)) xlabel(, grid) xlabel(, grid) ///
> xlabel(, angle(forty_five)) ylabel(, format(%12.2fc) labsize(small))  ylabel(, labsize(small) angle(horizontal)) ///
> ytitle(Total deaths estimated to reported) title("COVID-19 total deaths estimated to reported, Iran, reference scenarios", size(medium)) /// 
> xscale(lwidth(vthin) lcolor(gray*.2)) yscale(lwidth(vthin) lcolor(gray*.2)) legend(region(lcolor(none))) legend(bexpand) ///
> legend(order(1 "JOHN" 2 "DELP" 3 "IHME" 4 "IMPE" 5 "LANL" 6 "SRIV") size(small) row(1)) ///
> subtitle("  .", size(small) color(white))
{res}{txt}
{com}. 
. graph save "graph 96 COVID-19 total deaths estimated to reported, Iran, reference scenarios, 2021-01-01 on.gph", replace
{txt}(note: file graph 96 COVID-19 total deaths estimated to reported, Iran, reference scenarios, 2021-01-01 on.gph not found)
{res}{txt}(file graph 96 COVID-19 total deaths estimated to reported, Iran, reference scenarios, 2021-01-01 on.gph saved)

{com}. graph export "graph 96 COVID-19 total deaths estimated to reported, Iran, reference scenarios, 2021-01-01 on.pdf", replace
{txt}(file /Users/farshadpourmalek/Downloads/covir2-main/20210521/code/merge/graph 96 COVID-19 total deaths estimated to reported, Iran, reference scenarios, 2021-01-01 on.pdf written in PDF format)

{com}. 
. 
. 
. * total cases estimated to reported (CER) all studies, all time, reference scenarios
. 
. twoway ///
> (line TotCERMeRaA00S00 date, sort lcolor(cyan) lwidth(vthick) lpattern(tight_dot)) /// 1 "JOHN"
> (line TotCERMeRaA01S00 date, sort lcolor(red)) /// 2 "DELP"
> (line TotCERMeRaA02S01 date, sort lcolor(black)) /// 3 "IHME"
> (line TotCERMeRaA03S02 date, sort lcolor(magenta)) /// 4 "IMPE"
> (line TotCERMeRaA04S00 date, sort lcolor(gold)) /// 5 "LANL"
> (line TotCERMeRaA05S00 date, sort lcolor(green)) /// 6 "SRIV"
> if date >= td(01jan2020) & date <= td(01jan2022) ///
> , xtitle(Date) xlabel(#24, format(%tdYY-NN-DD) labsize(small)) xlabel(, grid) xlabel(, grid) ///
> xlabel(, angle(forty_five)) ylabel(, format(%12.0fc) labsize(small))  ylabel(, labsize(small) angle(horizontal)) ///
> ytitle(Total cases estimated to reported) title("COVID-19 total cases estimated to reported, Iran, reference scenarios", size(medium)) /// 
> xscale(lwidth(vthin) lcolor(gray*.2)) yscale(lwidth(vthin) lcolor(gray*.2)) legend(region(lcolor(none))) legend(bexpand) ///
> legend(order(1 "JOHN" 2 "DELP" 3 "IHME" 4 "IMPE" 5 "LANL" 6 "SRIV") size(small) row(1)) ///
> subtitle("  .", size(small) color(white))
{res}{txt}
{com}. 
. graph save "graph 97 COVID-19 total cases estimated to reported, Iran, reference scenarios.gph", replace
{txt}(note: file graph 97 COVID-19 total cases estimated to reported, Iran, reference scenarios.gph not found)
{res}{txt}(file graph 97 COVID-19 total cases estimated to reported, Iran, reference scenarios.gph saved)

{com}. graph export "graph 97 COVID-19 total cases estimated to reported, Iran, reference scenarios.pdf", replace
{txt}(file /Users/farshadpourmalek/Downloads/covir2-main/20210521/code/merge/graph 97 COVID-19 total cases estimated to reported, Iran, reference scenarios.pdf written in PDF format)

{com}. 
. 
. 
. * total cases estimated to reported (CER) all studies, 2021-01-01 on, reference scenarios
. 
. twoway ///
> (line TotCERMeRaA00S00 date, sort lcolor(cyan) lwidth(vthick) lpattern(tight_dot)) /// 1 "JOHN"
> (line TotCERMeRaA01S00 date, sort lcolor(red)) /// 2 "DELP"
> (line TotCERMeRaA02S01 date, sort lcolor(black)) /// 3 "IHME"
> (line TotCERMeRaA03S02 date, sort lcolor(magenta)) /// 4 "IMPE"
> (line TotCERMeRaA04S00 date, sort lcolor(gold)) /// 5 "LANL"
> (line TotCERMeRaA05S00 date, sort lcolor(green)) /// 6 "SRIV"
> if date >= td(01jan2021) & date <= td(01jan2022) ///
> , xtitle(Date) xlabel(#12, format(%tdYY-NN-DD) labsize(small)) xlabel(, grid) xlabel(, grid) ///
> xlabel(, angle(forty_five)) ylabel(, format(%12.0fc) labsize(small))  ylabel(, labsize(small) angle(horizontal)) ///
> ytitle(Total cases estimated to reported) title("COVID-19 total cases estimated to reported, Iran, reference scenarios", size(medium)) /// 
> xscale(lwidth(vthin) lcolor(gray*.2)) yscale(lwidth(vthin) lcolor(gray*.2)) legend(region(lcolor(none))) legend(bexpand) ///
> legend(order(1 "JOHN" 2 "DELP" 3 "IHME" 4 "IMPE" 5 "LANL" 6 "SRIV") size(small) row(1)) ///
> subtitle("  .", size(small) color(white))
{res}{txt}
{com}. 
. graph save "graph 98 COVID-19 total cases estimated to reported, Iran, reference scenarios, 2021-01-01 on.gph", replace
{txt}(note: file graph 98 COVID-19 total cases estimated to reported, Iran, reference scenarios, 2021-01-01 on.gph not found)
{res}{txt}(file graph 98 COVID-19 total cases estimated to reported, Iran, reference scenarios, 2021-01-01 on.gph saved)

{com}. graph export "graph 98 COVID-19 total cases estimated to reported, Iran, reference scenarios, 2021-01-01 on.pdf", replace
{txt}(file /Users/farshadpourmalek/Downloads/covir2-main/20210521/code/merge/graph 98 COVID-19 total cases estimated to reported, Iran, reference scenarios, 2021-01-01 on.pdf written in PDF format)

{com}. 
. ***
. 
. 
. 
. 
. 
. 
. 
. 
. 
. ************
. 
. * restore native scheme (of the local machine)
. 
. set scheme $nativescheme
{txt}
{com}. 
. di c(scheme)
{res}_GRSTYLE_
{txt}
{com}. 
. 
. view "log Iran merge.smcl"
{txt}
{com}. 
. log close
      {txt}name:  {res}<unnamed>
       {txt}log:  {res}/Users/farshadpourmalek/Downloads/covir2-main/20210521/code/merge/log Iran merge.smcl
  {txt}log type:  {res}smcl
 {txt}closed on:  {res}14 Jun 2021, 20:35:43
{txt}{.-}
{smcl}
{txt}{sf}{ul off}