{smcl}
{com}{sf}{ul off}{txt}{.-}
      name:  {res}<unnamed>
       {txt}log:  {res}/Users/farshadpourmalek/Downloads/covir2-main/20210430/code/JOHNEMR/log EMR JOHN.smcl
  {txt}log type:  {res}smcl
 {txt}opened on:  {res} 1 May 2021, 00:35:53
{txt}
{com}. 
. ***************************************************************************
. * This is "do EMR JOHN.do"
. 
. * Project: Rapid review of estimates of COVID Iran - No 2
. * Person: Farshad Pourmalek pourmalek_farshad@yahoo.com
. * Time (initial): 2021-02-10
. 
. * OBJECTIVE: Get and prepare Johns Hopkins data for EMR, compare timing of deaths and cases peaks
. ***************************************************************************
. 
. 
. 
. * get Johns Hopkins data for deaths
. 
. import delimited ///
> "https://raw.githubusercontent.com/CSSEGISandData/COVID-19/master/csse_covid_19_data/csse_covid_19_time_series/time_series_covid19_deaths_global.csv" ///
> , clear varnames(1) colrange(2:2)
{res}{text}(1 var, 275 obs)

{com}. 
. save "time_series_covid19_deaths_global col 2.dta", replace
{txt}file time_series_covid19_deaths_global col 2.dta saved

{com}. 
. 
. import delimited ///
> "https://raw.githubusercontent.com/CSSEGISandData/COVID-19/master/csse_covid_19_data/csse_covid_19_time_series/time_series_covid19_deaths_global.csv" ///
> , clear varnames(1) colrange(5)
{res}{text}(465 vars, 275 obs)

{com}. 
. 
. save "time_series_covid19_deaths_global col 5 on.dta", replace
{txt}file time_series_covid19_deaths_global col 5 on.dta saved

{com}. 
. 
. use "time_series_covid19_deaths_global col 2.dta", clear 
{txt}
{com}. 
. merge 1:1 _n using "time_series_covid19_deaths_global col 5 on.dta"
{res}
{txt}{col 5}Result{col 38}# of obs.
{col 5}{hline 41}
{col 5}not matched{col 30}{res}               0
{txt}{col 5}matched{col 30}{res}             275{txt}  (_merge==3)
{col 5}{hline 41}

{com}. 
. rename countryregion loc_grand_name
{res}{txt}
{com}. 
. qui destring *, replace
{txt}
{com}. 
. 
. 
. * gen global sum
. 
. save "global JOHN deaths wo sum.dta", replace
{txt}file global JOHN deaths wo sum.dta saved

{com}. 
. drop loc_grand_name
{txt}
{com}. 
. qui destring *, replace
{txt}
{com}.  
. collapse (sum) *
{txt}
{com}. 
. gen loc_grand_name = "global"
{txt}
{com}.   
. save "global JOHN deaths sum.dta", replace
{txt}file global JOHN deaths sum.dta saved

{com}. 
. *
. 
. 
. use "global JOHN deaths wo sum.dta", clear
{txt}
{com}. 
. 
. 
. keep if ///
> loc_grand_name == "Algeria" | ///
> loc_grand_name == "Bahrain" | ///
> loc_grand_name == "Djibouti" | ///
> loc_grand_name == "Egypt" | ///
> loc_grand_name == "Iran" | ///
> loc_grand_name == "Iraq" | ///
> loc_grand_name == "Israel" | ///
> loc_grand_name == "Jordan" | ///
> loc_grand_name == "Kuwait" | ///
> loc_grand_name == "Lebanon" | ///
> loc_grand_name == "Libya" | ///
> loc_grand_name == "Oman" | ///
> loc_grand_name == "Palestine" | ///
> loc_grand_name == "Qatar" | ///
> loc_grand_name == "Saudi Arabia" | ///
> loc_grand_name == "Syria" | ///
> loc_grand_name == "Tunisia" | ///
> loc_grand_name == "United Arab Emirates" | ///
> loc_grand_name == "Yemen" 
{txt}(257 observations deleted)

{com}. 
. 
. * gen EMR sum
. 
. save "EMR JOHN deaths wo sum.dta", replace
{txt}file EMR JOHN deaths wo sum.dta saved

{com}. 
. drop loc_grand_name
{txt}
{com}. 
. qui destring *, replace
{txt}
{com}.  
. collapse (sum) *
{txt}
{com}. 
. gen loc_grand_name = "EMR"
{txt}
{com}.   
. save "EMR JOHN deaths sum.dta", replace
{txt}file EMR JOHN deaths sum.dta saved

{com}. 
. 
. * 
. 
. use "EMR JOHN deaths wo sum.dta", clear 
{txt}
{com}. 
. qui append using "EMR JOHN deaths sum.dta"
{txt}
{com}. 
. qui append using "global JOHN deaths sum.dta"
{txt}
{com}. 
. 
. *
. 
. 
. order loc_grand_name, last
{txt}
{com}. 
. gen counter = _n
{txt}
{com}. 
. reshape long v, i(loc_grand_name) 
{txt}(note: j = 1 2 3 4 5 6 7 8 9 10 11 12 13 14 15 16 17 18 19 20 21 22 23 24 25 26 27 28 29 30 31 32 33 34 35 36 37 38 39 40 41 42 43 44 45 46 47 48 49 50 51 52 53 54 55 56 57 58 59 60 61 62 63 64 65 66 67 68 69 70 71 72 73 74 75 76 77 78 79 80 81 82 83 84 85 86 87 88 89 90 91 92 93 94 95 96 97 98 99 100 101 102 103 104 105 106 107 108 109 110 111 112 113 114 115 116 117 118 119 120 121 122 123 124 125 126 127 128 129 130 131 132 133 134 135 136 137 138 139 140 141 142 143 144 145 146 147 148 149 150 151 152 153 154 155 156 157 158 159 160 161 162 163 164 165 166 167 168 169 170 171 172 173 174 175 176 177 178 179 180 181 182 183 184 185 186 187 188 189 190 191 192 193 194 195 196 197 198 199 200 201 202 203 204 205 206 207 208 209 210 211 212 213 214 215 216 217 218 219 220 221 222 223 224 225 226 227 228 229 230 231 232 233 234 235 236 237 238 239 240 241 242 243 244 245 246 247 248 249 250 251 252 253 254 255 256 257 258 259 260 261 262 263 264 265 266 267 268 269 270 271 272 273 274 275 276 277 278 279 280 281 282 283 284 285 286 287 288 289 290 291 292 293 294 295 296 297 298 299 300 301 302 303 304 305 306 307 308 309 310 311 312 313 314 315 316 317 318 319 320 321 322 323 324 325 326 327 328 329 330 331 332 333 334 335 336 337 338 339 340 341 342 343 344 345 346 347 348 349 350 351 352 353 354 355 356 357 358 359 360 361 362 363 364 365 366 367 368 369 370 371 372 373 374 375 376 377 378 379 380 381 382 383 384 385 386 387 388 389 390 391 392 393 394 395 396 397 398 399 400 401 402 403 404 405 406 407 408 409 410 411 412 413 414 415 416 417 418 419 420 421 422 423 424 425 426 427 428 429 430 431 432 433 434 435 436 437 438 439 440 441 442 443 444 445 446 447 448 449 450 451 452 453 454 455 456 457 458 459 460 461 462 463 464 465)

Data{col 36}wide{col 43}->{col 48}long
{hline 77}
Number of obs.                 {res}      20   {txt}->{res}    9300
{txt}Number of variables            {res}     468   {txt}->{res}       5
{txt}j variable (465 values)                   ->   {res}_j
{txt}xij variables:
                         {res}v1 v2 ... v465   {txt}->   {res}v
{txt}{hline 77}

{com}. 
. drop counter 
{txt}
{com}. 
. codebook _j

{txt}{hline}
{res}_j{right:(unlabeled)}
{txt}{hline}

{col 19}type:  numeric ({res}int{txt})

{col 18}range:  [{res}1{txt},{res}465{txt}]{col 55}units:  {res}1
{col 10}{txt}unique values:  {res}465{col 51}{txt}missing .:  {res}0{txt}/{res}9,300

{txt}{col 19}mean:{res}{col 26}     233
{txt}{col 15}std. dev:{res}{col 26} 134.241

{txt}{col 12}percentiles:{col 32}10%{col 42}25%{col 52}50%{col 62}75%{col 72}90%
{res}{col 27}      47{col 37}     117{col 47}     233{col 57}     349{col 67}     419
{txt}
{com}. 
. gen date = date("22 Jan 2020", "DMY")
{txt}
{com}. 
. replace date = date + _j - 1
{txt}(9,280 real changes made)

{com}. 
. format date %td
{txt}
{com}. 
. codebook date

{txt}{hline}
{res}date{right:(unlabeled)}
{txt}{hline}

{col 19}type:  numeric daily date ({res}float{txt})

{col 18}range:  [{res}21936{txt},{res}22400{txt}]{col 55}units:  {res}1
{col 8}{txt}or equivalently:  [{res}22jan2020{txt},{res}30apr2021{txt}]{col 55}units:  {res}days
{col 10}{txt}unique values:  {res}465{col 51}{txt}missing .:  {res}0{txt}/{res}9,300

{txt}{col 19}mean:{res}{col 26}   22168{txt} = {res}10sep2020{txt}
{col 15}std. dev:{res}{col 26} 134.241

{txt}{col 12}percentiles:{col 32}10%{col 42}25%{col 52}50%{col 62}75%{col 72}90%
{res}{col 27}   21982{col 37}   22052{col 47}   22168{col 57}   22284{col 67}   22354
{col 26}08mar2020{col 36}17may2020{col 46}10sep2020{col 56}04jan2021{col 66}15mar2021
{txt}
{com}. 
. order date 
{txt}
{com}. 
. rename v TotDeaMeRaA00S00V00
{res}{txt}
{com}. 
. label var TotDeaMeRaA00S00V00 "Total Deaths JOHN"
{txt}
{com}. 
. destring TotDeaMeRaA00S00V00, replace
{txt}TotDeaMeRaA00S00V00 already numeric; no {res}replace
{txt}
{com}. 
. list loc_grand_name TotDeaMeRaA00S00V00 if date == td(19feb2020) // Iran should be 2
{txt}
      {c TLC}{hline 22}{c -}{hline 10}{c TRC}
      {c |} {res}      loc_grand_name   TotDe~00 {txt}{c |}
      {c LT}{hline 22}{c -}{hline 10}{c RT}
  29. {c |} {res}             Algeria          0 {txt}{c |}
 494. {c |} {res}             Bahrain          0 {txt}{c |}
 959. {c |} {res}            Djibouti          0 {txt}{c |}
1424. {c |} {res}                 EMR          2 {txt}{c |}
1889. {c |} {res}               Egypt          0 {txt}{c |}
      {c LT}{hline 22}{c -}{hline 10}{c RT}
2354. {c |} {res}                Iran          2 {txt}{c |}
2819. {c |} {res}                Iraq          0 {txt}{c |}
3284. {c |} {res}              Israel          0 {txt}{c |}
3749. {c |} {res}              Jordan          0 {txt}{c |}
4214. {c |} {res}              Kuwait          0 {txt}{c |}
      {c LT}{hline 22}{c -}{hline 10}{c RT}
4679. {c |} {res}             Lebanon          0 {txt}{c |}
5144. {c |} {res}               Libya          0 {txt}{c |}
5609. {c |} {res}                Oman          0 {txt}{c |}
6074. {c |} {res}               Qatar          0 {txt}{c |}
6539. {c |} {res}        Saudi Arabia          0 {txt}{c |}
      {c LT}{hline 22}{c -}{hline 10}{c RT}
7004. {c |} {res}               Syria          0 {txt}{c |}
7469. {c |} {res}             Tunisia          0 {txt}{c |}
7934. {c |} {res}United Arab Emirates          0 {txt}{c |}
8399. {c |} {res}               Yemen          0 {txt}{c |}
8864. {c |} {res}              global       2123 {txt}{c |}
      {c BLC}{hline 22}{c -}{hline 10}{c BRC}

{com}. 
. gen DayDeaMeRaA00S00V00 =  TotDeaMeRaA00S00V00[_n] - TotDeaMeRaA00S00V00[_n-1]
{txt}(1 missing value generated)

{com}. 
. label var DayDeaMeRaA00S00V00 "Daily Deaths JOHN"
{txt}
{com}. 
. replace DayDeaMeRaA00S00V00 = TotDeaMeRaA00S00V00 if _j == 1
{txt}(20 real changes made)

{com}. 
. drop _j _merge
{txt}
{com}. 
. 
. order date loc_grand_name DayDeaMeRaA00S00V00 TotDeaMeRaA00S00V00 
{txt}
{com}.                                         
. 
. sort loc_grand_name date
{txt}
{com}. 
. save "EMR JOHN deaths.dta", replace
{txt}file EMR JOHN deaths.dta saved

{com}. 
. 
. 
. 
. * get Johns Hopkins data for cases
. 
. 
. import delimited using ///
> "https://raw.githubusercontent.com/CSSEGISandData/COVID-19/master/csse_covid_19_data/csse_covid_19_time_series/time_series_covid19_confirmed_global.csv" ///
> , clear varnames(1) colrange(2:2)
{res}{text}(1 var, 275 obs)

{com}. 
. save "time_series_covid19_confirmed_global col 2.dta", replace 
{txt}file time_series_covid19_confirmed_global col 2.dta saved

{com}. 
. 
. import delimited using ///
> "https://raw.githubusercontent.com/CSSEGISandData/COVID-19/master/csse_covid_19_data/csse_covid_19_time_series/time_series_covid19_confirmed_global.csv" ///
> , clear varnames(1) colrange(5)
{res}{text}(465 vars, 275 obs)

{com}. 
. save "time_series_covid19_confirmed_global col 5 on.dta", replace 
{txt}file time_series_covid19_confirmed_global col 5 on.dta saved

{com}. 
. 
. use "time_series_covid19_confirmed_global col 2.dta", clear 
{txt}
{com}. 
. merge 1:1 _n using "time_series_covid19_confirmed_global col 5 on.dta"
{res}
{txt}{col 5}Result{col 38}# of obs.
{col 5}{hline 41}
{col 5}not matched{col 30}{res}               0
{txt}{col 5}matched{col 30}{res}             275{txt}  (_merge==3)
{col 5}{hline 41}

{com}. 
. rename countryregion loc_grand_name
{res}{txt}
{com}. 
. qui destring *, replace
{txt}
{com}. 
. 
. 
. * gen global sum
. 
. save "global JOHN cases wo sum.dta", replace
{txt}file global JOHN cases wo sum.dta saved

{com}. 
. drop loc_grand_name
{txt}
{com}. 
. qui destring *, replace
{txt}
{com}.  
. collapse (sum) *
{txt}
{com}. 
. gen loc_grand_name = "global"
{txt}
{com}.   
. save "global JOHN cases sum.dta", replace
{txt}file global JOHN cases sum.dta saved

{com}. 
. *
. 
. 
. use "global JOHN cases wo sum.dta", clear
{txt}
{com}. 
. 
. 
. 
. keep if ///
> loc_grand_name == "Algeria" | ///
> loc_grand_name == "Bahrain" | ///
> loc_grand_name == "Djibouti" | ///
> loc_grand_name == "Egypt" | ///
> loc_grand_name == "Iran" | ///
> loc_grand_name == "Iraq" | ///
> loc_grand_name == "Israel" | ///
> loc_grand_name == "Jordan" | ///
> loc_grand_name == "Kuwait" | ///
> loc_grand_name == "Lebanon" | ///
> loc_grand_name == "Libya" | ///
> loc_grand_name == "Oman" | ///
> loc_grand_name == "Palestine" | ///
> loc_grand_name == "Qatar" | ///
> loc_grand_name == "Saudi Arabia" | ///
> loc_grand_name == "Syria" | ///
> loc_grand_name == "Tunisia" | ///
> loc_grand_name == "United Arab Emirates" | ///
> loc_grand_name == "Yemen" 
{txt}(257 observations deleted)

{com}. 
. 
. 
. * gen EMR sum
. 
. save "EMR JOHN cases wo sum.dta", replace
{txt}file EMR JOHN cases wo sum.dta saved

{com}. 
. drop loc_grand_name
{txt}
{com}. 
. qui destring *, replace
{txt}
{com}.  
. collapse (sum) *
{txt}
{com}. 
. gen loc_grand_name = "EMR"
{txt}
{com}.   
. save "EMR JOHN cases sum.dta", replace
{txt}file EMR JOHN cases sum.dta saved

{com}. 
. 
. * 
. 
. use "EMR JOHN cases wo sum.dta", clear 
{txt}
{com}. 
. qui append using "EMR JOHN cases sum.dta"
{txt}
{com}. 
. qui append using "global JOHN cases sum.dta"
{txt}
{com}. 
. 
. *
. 
. 
. 
. order loc_grand_name, last
{txt}
{com}. 
. gen counter = _n
{txt}
{com}. 
. reshape long v, i(loc_grand_name) 
{txt}(note: j = 1 2 3 4 5 6 7 8 9 10 11 12 13 14 15 16 17 18 19 20 21 22 23 24 25 26 27 28 29 30 31 32 33 34 35 36 37 38 39 40 41 42 43 44 45 46 47 48 49 50 51 52 53 54 55 56 57 58 59 60 61 62 63 64 65 66 67 68 69 70 71 72 73 74 75 76 77 78 79 80 81 82 83 84 85 86 87 88 89 90 91 92 93 94 95 96 97 98 99 100 101 102 103 104 105 106 107 108 109 110 111 112 113 114 115 116 117 118 119 120 121 122 123 124 125 126 127 128 129 130 131 132 133 134 135 136 137 138 139 140 141 142 143 144 145 146 147 148 149 150 151 152 153 154 155 156 157 158 159 160 161 162 163 164 165 166 167 168 169 170 171 172 173 174 175 176 177 178 179 180 181 182 183 184 185 186 187 188 189 190 191 192 193 194 195 196 197 198 199 200 201 202 203 204 205 206 207 208 209 210 211 212 213 214 215 216 217 218 219 220 221 222 223 224 225 226 227 228 229 230 231 232 233 234 235 236 237 238 239 240 241 242 243 244 245 246 247 248 249 250 251 252 253 254 255 256 257 258 259 260 261 262 263 264 265 266 267 268 269 270 271 272 273 274 275 276 277 278 279 280 281 282 283 284 285 286 287 288 289 290 291 292 293 294 295 296 297 298 299 300 301 302 303 304 305 306 307 308 309 310 311 312 313 314 315 316 317 318 319 320 321 322 323 324 325 326 327 328 329 330 331 332 333 334 335 336 337 338 339 340 341 342 343 344 345 346 347 348 349 350 351 352 353 354 355 356 357 358 359 360 361 362 363 364 365 366 367 368 369 370 371 372 373 374 375 376 377 378 379 380 381 382 383 384 385 386 387 388 389 390 391 392 393 394 395 396 397 398 399 400 401 402 403 404 405 406 407 408 409 410 411 412 413 414 415 416 417 418 419 420 421 422 423 424 425 426 427 428 429 430 431 432 433 434 435 436 437 438 439 440 441 442 443 444 445 446 447 448 449 450 451 452 453 454 455 456 457 458 459 460 461 462 463 464 465)

Data{col 36}wide{col 43}->{col 48}long
{hline 77}
Number of obs.                 {res}      20   {txt}->{res}    9300
{txt}Number of variables            {res}     468   {txt}->{res}       5
{txt}j variable (465 values)                   ->   {res}_j
{txt}xij variables:
                         {res}v1 v2 ... v465   {txt}->   {res}v
{txt}{hline 77}

{com}. 
. drop counter 
{txt}
{com}. 
. codebook _j

{txt}{hline}
{res}_j{right:(unlabeled)}
{txt}{hline}

{col 19}type:  numeric ({res}int{txt})

{col 18}range:  [{res}1{txt},{res}465{txt}]{col 55}units:  {res}1
{col 10}{txt}unique values:  {res}465{col 51}{txt}missing .:  {res}0{txt}/{res}9,300

{txt}{col 19}mean:{res}{col 26}     233
{txt}{col 15}std. dev:{res}{col 26} 134.241

{txt}{col 12}percentiles:{col 32}10%{col 42}25%{col 52}50%{col 62}75%{col 72}90%
{res}{col 27}      47{col 37}     117{col 47}     233{col 57}     349{col 67}     419
{txt}
{com}. 
. gen date = date("22 Jan 2020", "DMY")
{txt}
{com}. 
. replace date = date + _j - 1
{txt}(9,280 real changes made)

{com}. 
. format date %td
{txt}
{com}. 
. codebook date

{txt}{hline}
{res}date{right:(unlabeled)}
{txt}{hline}

{col 19}type:  numeric daily date ({res}float{txt})

{col 18}range:  [{res}21936{txt},{res}22400{txt}]{col 55}units:  {res}1
{col 8}{txt}or equivalently:  [{res}22jan2020{txt},{res}30apr2021{txt}]{col 55}units:  {res}days
{col 10}{txt}unique values:  {res}465{col 51}{txt}missing .:  {res}0{txt}/{res}9,300

{txt}{col 19}mean:{res}{col 26}   22168{txt} = {res}10sep2020{txt}
{col 15}std. dev:{res}{col 26} 134.241

{txt}{col 12}percentiles:{col 32}10%{col 42}25%{col 52}50%{col 62}75%{col 72}90%
{res}{col 27}   21982{col 37}   22052{col 47}   22168{col 57}   22284{col 67}   22354
{col 26}08mar2020{col 36}17may2020{col 46}10sep2020{col 56}04jan2021{col 66}15mar2021
{txt}
{com}. 
. order date 
{txt}
{com}. 
. rename v TotCasMeRaA00S00V00
{res}{txt}
{com}. 
. label var TotCasMeRaA00S00V00 "Total Cases JOHN"
{txt}
{com}. 
. gen DayCasMeRaA00S00V00 =  TotCasMeRaA00S00V00[_n] - TotCasMeRaA00S00V00[_n-1]
{txt}(1 missing value generated)

{com}. 
. label var DayCasMeRaA00S00V00 "Daily Cases JOHN"
{txt}
{com}. 
. replace DayCasMeRaA00S00V00 = TotCasMeRaA00S00V00 if _j == 1
{txt}(20 real changes made)

{com}. 
. drop _j _merge
{txt}
{com}. 
. 
. order date loc_grand_name DayCasMeRaA00S00V00 TotCasMeRaA00S00V00 
{txt}
{com}. 
. sort loc_grand_name date
{txt}
{com}. 
. compress
  {txt}variable {bf}date{sf} was {bf}{res}float{sf}{txt} now {bf}{res}int{sf}
  {txt}variable {bf}TotCasMeRaA00S00V00{sf} was {bf}{res}double{sf}{txt} now {bf}{res}long{sf}
  {txt}variable {bf}loc_grand_name{sf} was {bf}{res}str32{sf}{txt} now {bf}{res}str20{sf}
{txt}  (167,400 bytes saved)

{com}. 
. save "EMR JOHN Cases.dta", replace
{txt}file EMR JOHN Cases.dta saved

{com}. 
. 
. * merge deaths and cases 
. 
. use "EMR JOHN deaths.dta", clear 
{txt}
{com}. 
. merge 1:1 loc_grand_name date using "EMR JOHN Cases.dta"
{res}
{txt}{col 5}Result{col 38}# of obs.
{col 5}{hline 41}
{col 5}not matched{col 30}{res}               0
{txt}{col 5}matched{col 30}{res}           9,300{txt}  (_merge==3)
{col 5}{hline 41}

{com}. 
. drop _merge
{txt}
{com}. 
. 
. 
. 
. 
. replace loc_grand_name = "Saudi_Arabia" if loc_grand_name == "Saudi Arabia"
{txt}(465 real changes made)

{com}. replace loc_grand_name = "UAE" if loc_grand_name == "United Arab Emirates"
{txt}(465 real changes made)

{com}. 
. replace loc_grand_name = "1_Global" if loc_grand_name == "global"
{txt}(465 real changes made)

{com}. replace loc_grand_name = "2_EMR" if loc_grand_name == "EMR"
{txt}(465 real changes made)

{com}. 
. 
. 
. 
. * gen "Daily cases mean div by daily deaths mean JOHN DayCbD" for visulization of temporal relation of deaths and cases peaks 
. 
. 
. levelsof loc_grand_name, local(levels)
{txt}`"1_Global"' `"2_EMR"' `"Algeria"' `"Bahrain"' `"Djibouti"' `"Egypt"' `"Iran"' `"Iraq"' `"Israel"' `"Jordan"' `"Kuwait"' `"Lebanon"' `"Libya"' `"Oman"' `"Qatar"' `"Saudi_Arabia"' `"Syria"' `"Tunisia"' `"UAE"' `"Yemen"'

{com}. 
. foreach l of local levels {c -(}
{txt}  2{com}. 
.         di "`l'"
{txt}  3{com}.     
.         di "DayDeaMeRaA00S00V00"
{txt}  4{com}.         summ DayDeaMeRaA00S00V00 if loc_grand_name == "`l'"
{txt}  5{com}.         gen DayDeMMeRaA00S00V00_`l' = r(mean)
{txt}  6{com}.         label var DayDeMMeRaA00S00V00_`l' "Daily deaths mean JOHN DayDeM"
{txt}  7{com}.         di "                            "
{txt}  8{com}. 
.         di "DayCasMeRaA00S00V00"
{txt}  9{com}.         summ DayCasMeRaA00S00V00 if loc_grand_name == "`l'"
{txt} 10{com}.         gen DayCaMMeRaA00S00V00_`l' = r(mean)
{txt} 11{com}.         label var DayCaMMeRaA00S00V00_`l' "Daily cases mean JOHN DayCaM"
{txt} 12{com}.         di "                            "
{txt} 13{com}. 
.         di "DayCbDMeRaA00S00V00_(location)"
{txt} 14{com}.         gen DayCbDMeRaA00S00V00_`l' = DayCaMMeRaA00S00V00_`l' / DayDeMMeRaA00S00V00_`l'
{txt} 15{com}.         label var DayCbDMeRaA00S00V00_`l' "Daily cases mean div by daily deaths mean JOHN DayCbD"
{txt} 16{com}.         summ DayCbDMeRaA00S00V00_`l' if loc_grand_name == "`l'"
{txt} 17{com}.         di "                            "
{txt} 18{com}. 
.         di "DayDea_multip_(location)"
{txt} 19{com}.         gen DayDea_multip_`l' = DayDeaMeRaA00S00V00 * DayCbDMeRaA00S00V00_`l' if loc_grand_name == "`l'"
{txt} 20{com}.     label var DayDea_multip_`l' "Daily deaths scaled (times means of cases by deaths) only for visualization JOHN"
{txt} 21{com}.         summ DayDea_multip_`l' if loc_grand_name == "`l'"
{txt} 22{com}.         di "                            "
{txt} 23{com}.         
.         di "divider---------------------"
{txt} 24{com}.         di "                            "
{txt} 25{com}. 
. {c )-}
1_Global
DayDeaMeRaA00S00V00

{txt}    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayDeaMeR~00 {c |}{res}        465    6830.976    4211.527          1      17906
                            
DayCasMeRaA00S00V00

{txt}    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayCasMeR~00 {c |}{res}        465    324721.7    248194.5         98    1498213
                            
DayCbDMeRaA00S00V00_(location)

{txt}    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayCbDMeRa~l {c |}{res}        465    47.53664           0   47.53664   47.53664
                            
DayDea_multip_(location)
{txt}(8,835 missing values generated)

    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayDea_mul~l {c |}{res}        465    324721.7    200201.8   47.53664   851191.1
                            
divider---------------------
                            
2_EMR
DayDeaMeRaA00S00V00

{txt}    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayDeaMeR~00 {c |}{res}        465    335.9677    203.0131          0        850
                            
DayCasMeRaA00S00V00

{txt}    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayCasMeR~00 {c |}{res}        465     17859.3    12398.83          0      51903
                            
DayCbDMeRaA00S00V00_(location)

{txt}    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayCbDMeRa~R {c |}{res}        465    53.15778           0   53.15778   53.15778
                            
DayDea_multip_(location)
{txt}(8,835 missing values generated)

    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayDea_mul~R {c |}{res}        465     17859.3    10791.72          0   45184.11
                            
divider---------------------
                            
Algeria
DayDeaMeRaA00S00V00

{txt}    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayDeaMeR~00 {c |}{res}        465    6.995699     5.14153          0         30
                            
DayCasMeRaA00S00V00

{txt}    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayCasMeR~00 {c |}{res}        465    262.5978    237.2001          0       1133
                            
DayCbDMeRaA00S00V00_(location)

{txt}    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayCbDMeRa~a {c |}{res}        465    37.53704           0   37.53704   37.53704
                            
DayDea_multip_(location)
{txt}(8,835 missing values generated)

    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayDea_mul~a {c |}{res}        465    262.5978    192.9978          0   1126.111
                            
divider---------------------
                            
Bahrain
DayDeaMeRaA00S00V00

{txt}    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayDeaMeR~00 {c |}{res}        465    1.389247    1.692113          0          7
                            
DayCasMeRaA00S00V00

{txt}    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayCasMeR~00 {c |}{res}        465    380.5032    300.3134          0       1316
                            
DayCbDMeRaA00S00V00_(location)

{txt}    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayCbDMeRa~n {c |}{res}        465    273.8917           0   273.8917   273.8917
                            
DayDea_multip_(location)
{txt}(8,835 missing values generated)

    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayDea_mul~n {c |}{res}        465    380.5033    463.4556          0   1917.242
                            
divider---------------------
                            
Djibouti
DayDeaMeRaA00S00V00

{txt}    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayDeaMeR~00 {c |}{res}        465    .3075269    .9525642          0          9
                            
DayCasMeRaA00S00V00

{txt}    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayCasMeR~00 {c |}{res}        465    23.87097    51.35946          0        415
                            
DayCbDMeRaA00S00V00_(location)

{txt}    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayCbDMeRa~i {c |}{res}        465    77.62238           0   77.62238   77.62238
                            
DayDea_multip_(location)
{txt}(8,835 missing values generated)

    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayDea_mul~i {c |}{res}        465    23.87097     73.9403          0   698.6014
                            
divider---------------------
                            
Egypt
DayDeaMeRaA00S00V00

{txt}    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayDeaMeR~00 {c |}{res}        465    28.68602    23.13343          0         97
                            
DayCasMeRaA00S00V00

{txt}    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayCasMeR~00 {c |}{res}        465    489.3591    436.2652          0       1774
                            
DayCbDMeRaA00S00V00_(location)

{txt}    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayCbDMeRa~t {c |}{res}        465    17.05915           0   17.05915   17.05915
                            
DayDea_multip_(location)
{txt}(8,835 missing values generated)

    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayDea_mul~t {c |}{res}        465    489.3591    394.6366          0   1654.737
                            
divider---------------------
                            
Iran
DayDeaMeRaA00S00V00

{txt}    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayDeaMeR~00 {c |}{res}        465    154.3183    121.5952          0        496
                            
DayCasMeRaA00S00V00

{txt}    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayCasMeR~00 {c |}{res}        465    5374.359     5329.88          0      25582
                            
DayCbDMeRaA00S00V00_(location)

{txt}    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayCbDMeR~an {c |}{res}        465    34.82646           0   34.82646   34.82646
                            
DayDea_multip_(location)
{txt}(8,835 missing values generated)

    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayDea_mu~an {c |}{res}        465    5374.359    4234.732          0   17273.92
                            
divider---------------------
                            
Iraq
DayDeaMeRaA00S00V00

{txt}    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayDeaMeR~00 {c |}{res}        465    33.25806    31.45492          0        122
                            
DayCasMeRaA00S00V00

{txt}    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayCasMeR~00 {c |}{res}        465    2290.751    2115.219          0       8696
                            
DayCbDMeRaA00S00V00_(location)

{txt}    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayCbDMeRa~q {c |}{res}        465    68.87804           0   68.87804   68.87804
                            
DayDea_multip_(location)
{txt}(8,835 missing values generated)

    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayDea_mul~q {c |}{res}        465     2290.75    2166.553          0   8403.121
                            
divider---------------------
                            
Israel
DayDeaMeRaA00S00V00

{txt}    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayDeaMeR~00 {c |}{res}        465    13.68387    15.86585         -4        101
                            
DayCasMeRaA00S00V00

{txt}    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayCasMeR~00 {c |}{res}        465    1803.185    2329.238        -53      11934
                            
DayCbDMeRaA00S00V00_(location)

{txt}    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayCbDMeR~el {c |}{res}        465    131.7745           0   131.7745   131.7745
                            
DayDea_multip_(location)
{txt}(8,835 missing values generated)

    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayDea_mu~el {c |}{res}        465    1803.185    2090.714  -527.0979   13309.22
                            
divider---------------------
                            
Jordan
DayDeaMeRaA00S00V00

{txt}    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayDeaMeR~00 {c |}{res}        465    19.00215     27.5618          0        111
                            
DayCasMeRaA00S00V00

{txt}    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayCasMeR~00 {c |}{res}        465    1529.834    2227.087       -110       9535
                            
DayCbDMeRaA00S00V00_(location)

{txt}    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayCbDMe~dan {c |}{res}        465    80.50848           0   80.50848   80.50848
                            
DayDea_multip_(location)
{txt}(8,835 missing values generated)

    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayDea_m~dan {c |}{res}        465    1529.834    2218.959          0   8936.441
                            
divider---------------------
                            
Kuwait
DayDeaMeRaA00S00V00

{txt}    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayDeaMeR~00 {c |}{res}        465     3.36129    3.133971          0         14
                            
DayCasMeRaA00S00V00

{txt}    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayCasMeR~00 {c |}{res}        465     589.228    422.6968          0       1716
                            
DayCbDMeRaA00S00V00_(location)

{txt}    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayCbDMeR~it {c |}{res}        465    175.2982           0   175.2982   175.2982
                            
DayDea_multip_(location)
{txt}(8,835 missing values generated)

    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayDea_mu~it {c |}{res}        465     589.228    549.3793          0   2454.174
                            
divider---------------------
                            
Lebanon
DayDeaMeRaA00S00V00

{txt}    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayDeaMeR~00 {c |}{res}        465    15.65161    26.03982          0        351
                            
DayCasMeRaA00S00V00

{txt}    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayCasMeR~00 {c |}{res}        465    1132.426     1310.57          0       6154
                            
DayCbDMeRaA00S00V00_(location)

{txt}    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayCbDMeR~on {c |}{res}        465    72.35202           0   72.35202   72.35202
                            
DayDea_multip_(location)
{txt}(8,835 missing values generated)

    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayDea_mu~on {c |}{res}        465    1132.426    1884.034          0   25395.56
                            
divider---------------------
                            
Libya
DayDeaMeRaA00S00V00

{txt}    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayDeaMeR~00 {c |}{res}        465    6.513978    8.726219         -3         53
                            
DayCasMeRaA00S00V00

{txt}    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayCasMeR~00 {c |}{res}        465    381.7376    392.3008          0       1639
                            
DayCbDMeRaA00S00V00_(location)

{txt}    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayCbDMeR~ya {c |}{res}        465    58.60284           0   58.60284   58.60284
                            
DayDea_multip_(location)
{txt}(8,835 missing values generated)

    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayDea_mu~ya {c |}{res}        465    381.7376    511.3812  -175.8085    3105.95
                            
divider---------------------
                            
Oman
DayDeaMeRaA00S00V00

{txt}    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayDeaMeR~00 {c |}{res}        465    4.322581     7.34049          0         67
                            
DayCasMeRaA00S00V00

{txt}    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayCasMeR~00 {c |}{res}        465    415.5978    561.8399          0       3544
                            
DayCbDMeRaA00S00V00_(location)

{txt}    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayCbDMe~man {c |}{res}        465    96.14577           0   96.14577   96.14577
                            
DayDea_multip_(location)
{txt}(8,835 missing values generated)

    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayDea_m~man {c |}{res}        465    415.5978     705.757          0   6441.767
                            
divider---------------------
                            
Qatar
DayDeaMeRaA00S00V00

{txt}    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayDeaMeR~00 {c |}{res}        465    .9849462    1.738816          0         10
                            
DayCasMeRaA00S00V00

{txt}    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayCasMeR~00 {c |}{res}        465    442.2624    445.2054          0       2355
                            
DayCbDMeRaA00S00V00_(location)

{txt}    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayCbDMeRa~r {c |}{res}        465    449.0218           0   449.0218   449.0218
                            
DayDea_multip_(location)
{txt}(8,835 missing values generated)

    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayDea_mul~r {c |}{res}        465    442.2624    780.7662          0   4490.218
                            
divider---------------------
                            
Saudi_Arabia
DayDeaMeRaA00S00V00

{txt}    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayDeaMeR~00 {c |}{res}        465    14.96129    13.76115          0         58
                            
DayCasMeRaA00S00V00

{txt}    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayCasMeR~00 {c |}{res}        465    897.5548    1066.019          0       4919
                            
DayCbDMeRaA00S00V00_(location)

{txt}    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayCbDMe~bia {c |}{res}        465    59.99181           0   59.99181   59.99181
                            
DayDea_multip_(location)
{txt}(8,835 missing values generated)

    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayDea_m~bia {c |}{res}        465    897.5548    825.5561          0   3479.525
                            
divider---------------------
                            
Syria
DayDeaMeRaA00S00V00

{txt}    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayDeaMeR~00 {c |}{res}        465    3.423656    3.867844          0         20
                            
DayCasMeRaA00S00V00

{txt}    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayCasMeR~00 {c |}{res}        465    48.88817    46.46583          0        172
                            
DayCbDMeRaA00S00V00_(location)

{txt}    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayCbDM~yria {c |}{res}        465    14.27952           0   14.27952   14.27952
                            
DayDea_multip_(location)
{txt}(8,835 missing values generated)

    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayDea_~yria {c |}{res}        465    48.88817    55.23096          0   285.5905
                            
divider---------------------
                            
Tunisia
DayDeaMeRaA00S00V00

{txt}    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayDeaMeR~00 {c |}{res}        465    23.05806    32.29669          0        217
                            
DayCasMeRaA00S00V00

{txt}    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayCasMeR~00 {c |}{res}        465     664.772    904.2936          0       5752
                            
DayCbDMeRaA00S00V00_(location)

{txt}    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayCbDMe~sia {c |}{res}        465    28.83035           0   28.83035   28.83035
                            
DayDea_multip_(location)
{txt}(8,835 missing values generated)

    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayDea_m~sia {c |}{res}        465     664.772    931.1249          0   6256.186
                            
divider---------------------
                            
UAE
DayDeaMeRaA00S00V00

{txt}    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayDeaMeR~00 {c |}{res}        465    3.412903     3.98021          0         20
                            
DayCasMeRaA00S00V00

{txt}    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayCasMeR~00 {c |}{res}        465    1118.787    1022.814          0       3977
                            
DayCbDMeRaA00S00V00_(location)

{txt}    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayCbDMeRa~E {c |}{res}        465     327.811           0    327.811    327.811
                            
DayDea_multip_(location)
{txt}(8,835 missing values generated)

    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayDea_mul~E {c |}{res}        465    1118.787    1304.757          0    6556.22
                            
divider---------------------
                            
Yemen
DayDeaMeRaA00S00V00

{txt}    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayDeaMeR~00 {c |}{res}        465    2.636559    5.309713          0         52
                            
DayCasMeRaA00S00V00

{txt}    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayCasMeR~00 {c |}{res}        465    13.58495    25.75226         -1        174
                            
DayCbDMeRaA00S00V00_(location)

{txt}    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayCbDMeR~en {c |}{res}        465    5.152528           0   5.152528   5.152528
                            
DayDea_multip_(location)
{txt}(8,835 missing values generated)

    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayDea_mu~en {c |}{res}        465    13.58495    27.35845          0   267.9315
                            
divider---------------------
                            
{txt}
{com}. *
. 
. 
. * gen CFR
. 
. gen DayCfrMeRaA00S00V00 = 100 * DayDeaMeRaA00S00V00 / DayCasMeRaA00S00V00
{txt}(1,336 missing values generated)

{com}. 
. label var DayCfrMeRaA00S00V00 "Daily CFR JOHN"
{txt}
{com}. 
. di in red "negative CFR values:"
{res}{err}negative CFR values:
{txt}
{com}. 
. list date loc_grand_name DayDeaMeRaA00S00V00 DayCasMeRaA00S00V00 DayCfrMeRaA00S00V00 if DayCfrMeRaA00S00V00 < 0
{txt}
      {c TLC}{hline 11}{c -}{hline 10}{c -}{hline 10}{c -}{hline 10}{c -}{hline 11}{c TRC}
      {c |} {res}     date   loc_gr~e   DayDe~00   DayCa~00   DayCfr~00 {txt}{c |}
      {c LT}{hline 11}{c -}{hline 10}{c -}{hline 10}{c -}{hline 10}{c -}{hline 11}{c RT}
3689. {c |} {res}30mar2021     Israel         -4        514   -.7782101 {txt}{c |}
3707. {c |} {res}17apr2021     Israel         15        -53   -28.30189 {txt}{c |}
5306. {c |} {res}30jul2020      Libya         -3        216   -1.388889 {txt}{c |}
8573. {c |} {res}11aug2020      Yemen          5         -1        -500 {txt}{c |}
      {c BLC}{hline 11}{c -}{hline 10}{c -}{hline 10}{c -}{hline 10}{c -}{hline 11}{c BRC}

{com}. 
. 
. * describe CFR
. 
. levelsof loc_grand_name, local(levels)
{txt}`"1_Global"' `"2_EMR"' `"Algeria"' `"Bahrain"' `"Djibouti"' `"Egypt"' `"Iran"' `"Iraq"' `"Israel"' `"Jordan"' `"Kuwait"' `"Lebanon"' `"Libya"' `"Oman"' `"Qatar"' `"Saudi_Arabia"' `"Syria"' `"Tunisia"' `"UAE"' `"Yemen"'

{com}. 
. foreach l of local levels {c -(}
{txt}  2{com}. 
.         di "`l'"
{txt}  3{com}. 
.         tabstat DayCfrMeRaA00S00V00 if loc_grand_name == "`l'" & DayCfrMeRaA00S00V00 >= 0, stat(p25 p50 p75 iqr mean min max) varwidth(32)
{txt}  4{com}. 
.         di "divider---------------------"
{txt}  5{com}.         di "                            "
{txt}  6{com}. 
. {c )-}
1_Global

{txt}{ralign 32:variable} {...}
{c |}       p25       p50       p75       iqr      mean       min       max
{hline 33}{c +}{hline 70}
{ralign 32:DayCfrMeRaA00S00V00} {...}
{c |}{...}
 {res} 1.742898  2.192054  3.268745  1.525848  3.067148  .3395586  28.36879
{txt}{hline 33}{c BT}{hline 70}
divider---------------------
                            
2_EMR

{ralign 32:variable} {...}
{c |}       p25       p50       p75       iqr      mean       min       max
{hline 33}{c +}{hline 70}
{ralign 32:DayCfrMeRaA00S00V00} {...}
{c |}{...}
 {res} 1.343176  2.136523  2.821089  1.477912  2.693423         0       100
{txt}{hline 33}{c BT}{hline 70}
divider---------------------
                            
Algeria

{ralign 32:variable} {...}
{c |}       p25       p50       p75       iqr      mean       min       max
{hline 33}{c +}{hline 70}
{ralign 32:DayCfrMeRaA00S00V00} {...}
{c |}{...}
 {res} 1.869159  2.439024  3.846154  1.976995  4.152894         0  66.66666
{txt}{hline 33}{c BT}{hline 70}
divider---------------------
                            
Bahrain

{ralign 32:variable} {...}
{c |}       p25       p50       p75       iqr      mean       min       max
{hline 33}{c +}{hline 70}
{ralign 32:DayCfrMeRaA00S00V00} {...}
{c |}{...}
 {res}        0   .247841  .5154639  .5154639  .3470044         0  6.666667
{txt}{hline 33}{c BT}{hline 70}
divider---------------------
                            
Djibouti

{ralign 32:variable} {...}
{c |}       p25       p50       p75       iqr      mean       min       max
{hline 33}{c +}{hline 70}
{ralign 32:DayCfrMeRaA00S00V00} {...}
{c |}{...}
 {res}        0         0         0         0  1.915023         0       100
{txt}{hline 33}{c BT}{hline 70}
divider---------------------
                            
Egypt

{ralign 32:variable} {...}
{c |}       p25       p50       p75       iqr      mean       min       max
{hline 33}{c +}{hline 70}
{ralign 32:DayCfrMeRaA00S00V00} {...}
{c |}{...}
 {res} 4.578313  6.227469  8.553655  3.975341  6.969649         0  22.22222
{txt}{hline 33}{c BT}{hline 70}
divider---------------------
                            
Iran

{ralign 32:variable} {...}
{c |}       p25       p50       p75       iqr      mean       min       max
{hline 33}{c +}{hline 70}
{ralign 32:DayCfrMeRaA00S00V00} {...}
{c |}{...}
 {res} 1.650811  4.147641  6.127334  4.476522  4.529688         0       100
{txt}{hline 33}{c BT}{hline 70}
divider---------------------
                            
Iraq

{ralign 32:variable} {...}
{c |}       p25       p50       p75       iqr      mean       min       max
{hline 33}{c +}{hline 70}
{ralign 32:DayCfrMeRaA00S00V00} {...}
{c |}{...}
 {res} .6747639  1.596024  2.635783  1.961019  2.414954         0  66.66666
{txt}{hline 33}{c BT}{hline 70}
divider---------------------
                            
Israel

{ralign 32:variable} {...}
{c |}       p25       p50       p75       iqr      mean       min       max
{hline 33}{c +}{hline 70}
{ralign 32:DayCfrMeRaA00S00V00} {...}
{c |}{...}
 {res}  .436409  .7537689  1.639344  1.202935  1.744054         0        60
{txt}{hline 33}{c BT}{hline 70}
divider---------------------
                            
Jordan

{ralign 32:variable} {...}
{c |}       p25       p50       p75       iqr      mean       min       max
{hline 33}{c +}{hline 70}
{ralign 32:DayCfrMeRaA00S00V00} {...}
{c |}{...}
 {res}        0  .7392524  1.396972  1.396972  1.280456         0       100
{txt}{hline 33}{c BT}{hline 70}
divider---------------------
                            
Kuwait

{ralign 32:variable} {...}
{c |}       p25       p50       p75       iqr      mean       min       max
{hline 33}{c +}{hline 70}
{ralign 32:DayCfrMeRaA00S00V00} {...}
{c |}{...}
 {res} .2638522   .493421  .7462686  .4824164  .5447989         0  2.608696
{txt}{hline 33}{c BT}{hline 70}
divider---------------------
                            
Lebanon

{ralign 32:variable} {...}
{c |}       p25       p50       p75       iqr      mean       min       max
{hline 33}{c +}{hline 70}
{ralign 32:DayCfrMeRaA00S00V00} {...}
{c |}{...}
 {res}        0  .8258319  1.727303  1.727303   1.62571         0        25
{txt}{hline 33}{c BT}{hline 70}
divider---------------------
                            
Libya

{ralign 32:variable} {...}
{c |}       p25       p50       p75       iqr      mean       min       max
{hline 33}{c +}{hline 70}
{ralign 32:DayCfrMeRaA00S00V00} {...}
{c |}{...}
 {res} .7142857  1.385689   2.18281  1.468525  2.392103         0       100
{txt}{hline 33}{c BT}{hline 70}
divider---------------------
                            
Oman

{ralign 32:variable} {...}
{c |}       p25       p50       p75       iqr      mean       min       max
{hline 33}{c +}{hline 70}
{ralign 32:DayCfrMeRaA00S00V00} {...}
{c |}{...}
 {res} .2469136   .731318  1.598173   1.35126  1.159985         0  11.42857
{txt}{hline 33}{c BT}{hline 70}
divider---------------------
                            
Qatar

{ralign 32:variable} {...}
{c |}       p25       p50       p75       iqr      mean       min       max
{hline 33}{c +}{hline 70}
{ralign 32:DayCfrMeRaA00S00V00} {...}
{c |}{...}
 {res}        0         0  .3745318  .3745318  .2550154         0  16.66667
{txt}{hline 33}{c BT}{hline 70}
divider---------------------
                            
Saudi_Arabia

{ralign 32:variable} {...}
{c |}       p25       p50       p75       iqr      mean       min       max
{hline 33}{c +}{hline 70}
{ralign 32:DayCfrMeRaA00S00V00} {...}
{c |}{...}
 {res} 1.037344  1.557508  4.191617  3.154272    2.6067         0   10.6383
{txt}{hline 33}{c BT}{hline 70}
divider---------------------
                            
Syria

{ralign 32:variable} {...}
{c |}       p25       p50       p75       iqr      mean       min       max
{hline 33}{c +}{hline 70}
{ralign 32:DayCfrMeRaA00S00V00} {...}
{c |}{...}
 {res} 4.761905  6.493506  8.163265  3.401361    7.3582         0       100
{txt}{hline 33}{c BT}{hline 70}
divider---------------------
                            
Tunisia

{ralign 32:variable} {...}
{c |}       p25       p50       p75       iqr      mean       min       max
{hline 33}{c +}{hline 70}
{ralign 32:DayCfrMeRaA00S00V00} {...}
{c |}{...}
 {res}        0  2.658272  4.385211  4.385211  3.946269         0       100
{txt}{hline 33}{c BT}{hline 70}
divider---------------------
                            
UAE

{ralign 32:variable} {...}
{c |}       p25       p50       p75       iqr      mean       min       max
{hline 33}{c +}{hline 70}
{ralign 32:DayCfrMeRaA00S00V00} {...}
{c |}{...}
 {res} .1448016  .2514669  .4192872  .2744856  .3464237         0  4.878049
{txt}{hline 33}{c BT}{hline 70}
divider---------------------
                            
Yemen

{ralign 32:variable} {...}
{c |}       p25       p50       p75       iqr      mean       min       max
{hline 33}{c +}{hline 70}
{ralign 32:DayCfrMeRaA00S00V00} {...}
{c |}{...}
 {res}        0  14.28571  27.77778  27.77778  24.35422         0       400
{txt}{hline 33}{c BT}{hline 70}
divider---------------------
                            

{com}. *
. 
. 
. 
. * gen Cases to deaths ratio (CTD)
. 
. gen DayCTDMeRaA00S00V00 =  DayCasMeRaA00S00V00 / DayDeaMeRaA00S00V00
{txt}(2,846 missing values generated)

{com}. label var DayCTDMeRaA00S00V00  "Daily Cases to Deaths S0 JOHN"
{txt}
{com}.         
. gen TotCTDMeRaA00S00V00 =  TotCasMeRaA00S00V00 / TotDeaMeRaA00S00V00
{txt}(1,120 missing values generated)

{com}. label var TotCTDMeRaA00S00V00  "Total Cases to Deaths S0 JOHN"
{txt}
{com}. 
. 
. 
. 
. * describe Cases to deaths ratio (CTD)
. 
. levelsof loc_grand_name, local(levels)
{txt}`"1_Global"' `"2_EMR"' `"Algeria"' `"Bahrain"' `"Djibouti"' `"Egypt"' `"Iran"' `"Iraq"' `"Israel"' `"Jordan"' `"Kuwait"' `"Lebanon"' `"Libya"' `"Oman"' `"Qatar"' `"Saudi_Arabia"' `"Syria"' `"Tunisia"' `"UAE"' `"Yemen"'

{com}. 
. foreach l of local levels {c -(}
{txt}  2{com}. 
.         di "`l'"
{txt}  3{com}. 
.         tabstat DayCTDMeRaA00S00V00 if loc_grand_name == "`l'", stat(p25 p50 p75 iqr mean min max) varwidth(32)
{txt}  4{com}.         
.         tabstat TotCTDMeRaA00S00V00 if loc_grand_name == "`l'", stat(p25 p50 p75 iqr mean min max) varwidth(32)
{txt}  5{com}.         
. 
.         di "divider---------------------"
{txt}  6{com}.         di "                            "
{txt}  7{com}. 
. {c )-}
1_Global

{txt}{ralign 32:variable} {...}
{c |}       p25       p50       p75       iqr      mean       min       max
{hline 33}{c +}{hline 70}
{ralign 32:DayCTDMeRaA00S00V00} {...}
{c |}{...}
 {res} 30.59278  45.61932  57.37571  26.78293  45.00422     3.525     294.5
{txt}{hline 33}{c BT}{hline 70}

{ralign 32:variable} {...}
{c |}       p25       p50       p75       iqr      mean       min       max
{hline 33}{c +}{hline 70}
{ralign 32:TotCTDMeRaA00S00V00} {...}
{c |}{...}
 {res} 23.44982   34.2676  45.18612  21.73631  33.52398  13.80262  49.01241
{txt}{hline 33}{c BT}{hline 70}
divider---------------------
                            
2_EMR

{ralign 32:variable} {...}
{c |}       p25       p50       p75       iqr      mean       min       max
{hline 33}{c +}{hline 70}
{ralign 32:DayCTDMeRaA00S00V00} {...}
{c |}{...}
 {res} 35.18272  46.50432  72.88992   37.7072  52.37897         1  107.1461
{txt}{hline 33}{c BT}{hline 70}

{ralign 32:variable} {...}
{c |}       p25       p50       p75       iqr      mean       min       max
{hline 33}{c +}{hline 70}
{ralign 32:TotCTDMeRaA00S00V00} {...}
{c |}{...}
 {res} 37.55515  40.04827  43.33777  5.782623  38.21697         6  53.17723
{txt}{hline 33}{c BT}{hline 70}
divider---------------------
                            
Algeria

{ralign 32:variable} {...}
{c |}       p25       p50       p75       iqr      mean       min       max
{hline 33}{c +}{hline 70}
{ralign 32:DayCTDMeRaA00S00V00} {...}
{c |}{...}
 {res}    24.75  39.93333  52.04545  27.29545  40.17303       1.5     137.5
{txt}{hline 33}{c BT}{hline 70}

{ralign 32:variable} {...}
{c |}       p25       p50       p75       iqr      mean       min       max
{hline 33}{c +}{hline 70}
{ralign 32:TotCTDMeRaA00S00V00} {...}
{c |}{...}
 {res}       15  29.68198  36.61248  21.61248   26.9348  6.335463  37.99706
{txt}{hline 33}{c BT}{hline 70}
divider---------------------
                            
Bahrain

{ralign 32:variable} {...}
{c |}       p25       p50       p75       iqr      mean       min       max
{hline 33}{c +}{hline 70}
{ralign 32:DayCTDMeRaA00S00V00} {...}
{c |}{...}
 {res}      161       222       362       201  282.6436         0      1206
{txt}{hline 33}{c BT}{hline 70}

{ralign 32:variable} {...}
{c |}       p25       p50       p75       iqr      mean       min       max
{hline 33}{c +}{hline 70}
{ralign 32:TotCTDMeRaA00S00V00} {...}
{c |}{...}
 {res} 261.9231  274.8187  287.7615  25.83844  303.7904    104.75  701.1667
{txt}{hline 33}{c BT}{hline 70}
divider---------------------
                            
Djibouti

{ralign 32:variable} {...}
{c |}       p25       p50       p75       iqr      mean       min       max
{hline 33}{c +}{hline 70}
{ralign 32:DayCTDMeRaA00S00V00} {...}
{c |}{...}
 {res} 12.83333    34.125        77  64.16667  58.15668         1       251
{txt}{hline 33}{c BT}{hline 70}

{ralign 32:variable} {...}
{c |}       p25       p50       p75       iqr      mean       min       max
{hline 33}{c +}{hline 70}
{ralign 32:TotCTDMeRaA00S00V00} {...}
{c |}{...}
 {res} 89.65574  94.21429  101.4444   11.7887  128.6743  76.97887       560
{txt}{hline 33}{c BT}{hline 70}
divider---------------------
                            
Egypt

{ralign 32:variable} {...}
{c |}       p25       p50       p75       iqr      mean       min       max
{hline 33}{c +}{hline 70}
{ralign 32:DayCTDMeRaA00S00V00} {...}
{c |}{...}
 {res} 11.50943  15.77612  21.16216  9.652729  17.50784         0  71.18182
{txt}{hline 33}{c BT}{hline 70}

{ralign 32:variable} {...}
{c |}       p25       p50       p75       iqr      mean       min       max
{hline 33}{c +}{hline 70}
{ralign 32:TotCTDMeRaA00S00V00} {...}
{c |}{...}
 {res}  17.0908  17.60106  19.06409  1.973288  19.47717  12.98742        75
{txt}{hline 33}{c BT}{hline 70}
divider---------------------
                            
Iran

{ralign 32:variable} {...}
{c |}       p25       p50       p75       iqr      mean       min       max
{hline 33}{c +}{hline 70}
{ralign 32:DayCTDMeRaA00S00V00} {...}
{c |}{...}
 {res} 16.31756  23.84773  60.42498  44.10741  40.32009         1  152.6038
{txt}{hline 33}{c BT}{hline 70}

{ralign 32:variable} {...}
{c |}       p25       p50       p75       iqr      mean       min       max
{hline 33}{c +}{hline 70}
{ralign 32:TotCTDMeRaA00S00V00} {...}
{c |}{...}
 {res} 17.40789  19.35605  23.63103  6.223148  20.84912         1  40.15862
{txt}{hline 33}{c BT}{hline 70}
divider---------------------
                            
Iraq

{ralign 32:variable} {...}
{c |}       p25       p50       p75       iqr      mean       min       max
{hline 33}{c +}{hline 70}
{ralign 32:DayCTDMeRaA00S00V00} {...}
{c |}{...}
 {res} 36.51282  60.07547       119  82.48718  87.65051         0    592.25
{txt}{hline 33}{c BT}{hline 70}

{ralign 32:variable} {...}
{c |}       p25       p50       p75       iqr      mean       min       max
{hline 33}{c +}{hline 70}
{ralign 32:TotCTDMeRaA00S00V00} {...}
{c |}{...}
 {res} 26.36522  39.80869  46.93713  20.57192  37.80803     8.875  68.87804
{txt}{hline 33}{c BT}{hline 70}
divider---------------------
                            
Israel

{ralign 32:variable} {...}
{c |}       p25       p50       p75       iqr      mean       min       max
{hline 33}{c +}{hline 70}
{ralign 32:DayCTDMeRaA00S00V00} {...}
{c |}{...}
 {res}     52.8     119.6  184.0377  131.2377  143.7119    -128.5      1146
{txt}{hline 33}{c BT}{hline 70}

{ralign 32:variable} {...}
{c |}       p25       p50       p75       iqr      mean       min       max
{hline 33}{c +}{hline 70}
{ralign 32:TotCTDMeRaA00S00V00} {...}
{c |}{...}
 {res}   116.27  125.2625  135.0477  18.77773  129.2696  58.64685      1249
{txt}{hline 33}{c BT}{hline 70}
divider---------------------
                            
Jordan

{ralign 32:variable} {...}
{c |}       p25       p50       p75       iqr      mean       min       max
{hline 33}{c +}{hline 70}
{ralign 32:DayCTDMeRaA00S00V00} {...}
{c |}{...}
 {res} 56.75568  79.01328  120.2822  63.52652  96.47413         0       634
{txt}{hline 33}{c BT}{hline 70}

{ralign 32:variable} {...}
{c |}       p25       p50       p75       iqr      mean       min       max
{hline 33}{c +}{hline 70}
{ralign 32:TotCTDMeRaA00S00V00} {...}
{c |}{...}
 {res} 76.96572  85.79158  112.2273  35.26155  95.52712  51.11111       246
{txt}{hline 33}{c BT}{hline 70}
divider---------------------
                            
Kuwait

{ralign 32:variable} {...}
{c |}       p25       p50       p75       iqr      mean       min       max
{hline 33}{c +}{hline 70}
{ralign 32:DayCTDMeRaA00S00V00} {...}
{c |}{...}
 {res}   122.25   177.125  252.8333  130.5833  220.2644  38.33333       919
{txt}{hline 33}{c BT}{hline 70}

{ralign 32:variable} {...}
{c |}       p25       p50       p75       iqr      mean       min       max
{hline 33}{c +}{hline 70}
{ralign 32:TotCTDMeRaA00S00V00} {...}
{c |}{...}
 {res} 149.9101  162.5251  175.3032  25.39302  180.0451  120.6364      1234
{txt}{hline 33}{c BT}{hline 70}
divider---------------------
                            
Lebanon

{ralign 32:variable} {...}
{c |}       p25       p50       p75       iqr      mean       min       max
{hline 33}{c +}{hline 70}
{ralign 32:DayCTDMeRaA00S00V00} {...}
{c |}{...}
 {res} 49.69091  73.80952  137.2857  87.59481  112.1871         4      1360
{txt}{hline 33}{c BT}{hline 70}

{ralign 32:variable} {...}
{c |}       p25       p50       p75       iqr      mean       min       max
{hline 33}{c +}{hline 70}
{ralign 32:TotCTDMeRaA00S00V00} {...}
{c |}{...}
 {res} 51.32353      79.5  116.7059  65.38235  82.93387  20.33333  136.5479
{txt}{hline 33}{c BT}{hline 70}
divider---------------------
                            
Libya

{ralign 32:variable} {...}
{c |}       p25       p50       p75       iqr      mean       min       max
{hline 33}{c +}{hline 70}
{ralign 32:DayCTDMeRaA00S00V00} {...}
{c |}{...}
 {res} 40.76191  63.58333     97.75  56.98809  79.85268       -72       622
{txt}{hline 33}{c BT}{hline 70}

{ralign 32:variable} {...}
{c |}       p25       p50       p75       iqr      mean       min       max
{hline 33}{c +}{hline 70}
{ralign 32:TotCTDMeRaA00S00V00} {...}
{c |}{...}
 {res} 45.80672  60.91696  66.31718  20.51045  54.92826        11      78.6
{txt}{hline 33}{c BT}{hline 70}
divider---------------------
                            
Oman

{ralign 32:variable} {...}
{c |}       p25       p50       p75       iqr      mean       min       max
{hline 33}{c +}{hline 70}
{ralign 32:DayCTDMeRaA00S00V00} {...}
{c |}{...}
 {res}     51.2       103       180     128.8  146.1209      8.75      1082
{txt}{hline 33}{c BT}{hline 70}

{ralign 32:variable} {...}
{c |}       p25       p50       p75       iqr      mean       min       max
{hline 33}{c +}{hline 70}
{ralign 32:TotCTDMeRaA00S00V00} {...}
{c |}{...}
 {res} 89.87176  101.3482  196.9333  107.0616  135.0317  85.65003    254.75
{txt}{hline 33}{c BT}{hline 70}
divider---------------------
                            
Qatar

{ralign 32:variable} {...}
{c |}       p25       p50       p75       iqr      mean       min       max
{hline 33}{c +}{hline 70}
{ralign 32:DayCTDMeRaA00S00V00} {...}
{c |}{...}
 {res}      150       246       469       319  350.3859         6      1554
{txt}{hline 33}{c BT}{hline 70}

{ralign 32:variable} {...}
{c |}       p25       p50       p75       iqr      mean       min       max
{hline 33}{c +}{hline 70}
{ralign 32:TotCTDMeRaA00S00V00} {...}
{c |}{...}
 {res} 584.3762  602.3987  662.4268  78.05066  731.9245  316.3333  2373.733
{txt}{hline 33}{c BT}{hline 70}
divider---------------------
                            
Saudi_Arabia

{ralign 32:variable} {...}
{c |}       p25       p50       p75       iqr      mean       min       max
{hline 33}{c +}{hline 70}
{ralign 32:DayCTDMeRaA00S00V00} {...}
{c |}{...}
 {res}     23.4    62.651  89.08333  65.68333  70.89368       9.4  407.6667
{txt}{hline 33}{c BT}{hline 70}

{ralign 32:variable} {...}
{c |}       p25       p50       p75       iqr      mean       min       max
{hline 33}{c +}{hline 70}
{ralign 32:TotCTDMeRaA00S00V00} {...}
{c |}{...}
 {res} 58.67429  67.27483  100.4158  41.74149  88.71363  57.66693       767
{txt}{hline 33}{c BT}{hline 70}
divider---------------------
                            
Syria

{ralign 32:variable} {...}
{c |}       p25       p50       p75       iqr      mean       min       max
{hline 33}{c +}{hline 70}
{ralign 32:DayCTDMeRaA00S00V00} {...}
{c |}{...}
 {res} 11.83333  14.66667      17.6  5.766667  15.66791         0        72
{txt}{hline 33}{c BT}{hline 70}

{ralign 32:variable} {...}
{c |}       p25       p50       p75       iqr      mean       min       max
{hline 33}{c +}{hline 70}
{ralign 32:TotCTDMeRaA00S00V00} {...}
{c |}{...}
 {res} 15.18377   17.9625  21.30918  6.125406  18.83801         5  34.66667
{txt}{hline 33}{c BT}{hline 70}
divider---------------------
                            
Tunisia

{ralign 32:variable} {...}
{c |}       p25       p50       p75       iqr      mean       min       max
{hline 33}{c +}{hline 70}
{ralign 32:DayCTDMeRaA00S00V00} {...}
{c |}{...}
 {res} 19.03485  27.12121  40.55404  21.51919   36.5264         0     244.6
{txt}{hline 33}{c BT}{hline 70}

{ralign 32:variable} {...}
{c |}       p25       p50       p75       iqr      mean       min       max
{hline 33}{c +}{hline 70}
{ralign 32:TotCTDMeRaA00S00V00} {...}
{c |}{...}
 {res}    26.78  29.30053  34.78154  8.001538  34.34038  21.35294  75.88406
{txt}{hline 33}{c BT}{hline 70}
divider---------------------
                            
UAE

{ralign 32:variable} {...}
{c |}       p25       p50       p75       iqr      mean       min       max
{hline 33}{c +}{hline 70}
{ralign 32:DayCTDMeRaA00S00V00} {...}
{c |}{...}
 {res}    223.5       349  560.3333  336.8333  418.6428         0      1563
{txt}{hline 33}{c BT}{hline 70}

{ralign 32:variable} {...}
{c |}       p25       p50       p75       iqr      mean       min       max
{hline 33}{c +}{hline 70}
{ralign 32:TotCTDMeRaA00S00V00} {...}
{c |}{...}
 {res} 167.4243  235.3032  308.7145  141.2902  235.1141        70  359.5811
{txt}{hline 33}{c BT}{hline 70}
divider---------------------
                            
Yemen

{ralign 32:variable} {...}
{c |}       p25       p50       p75       iqr      mean       min       max
{hline 33}{c +}{hline 70}
{ralign 32:DayCTDMeRaA00S00V00} {...}
{c |}{...}
 {res}        2  4.666667       7.2       5.2  5.681738       -.2        41
{txt}{hline 33}{c BT}{hline 70}

{ralign 32:variable} {...}
{c |}       p25       p50       p75       iqr      mean       min       max
{hline 33}{c +}{hline 70}
{ralign 32:TotCTDMeRaA00S00V00} {...}
{c |}{...}
 {res} 3.446079  3.480449  4.057693   .611614  3.905582         3  7.083333
{txt}{hline 33}{c BT}{hline 70}
divider---------------------
                            

{com}. *
. 
. 
. 
. 
. 
. 
. 
. 
. * smooth 
. 
. encode loc_grand_name, gen(loc_grand_name_numeric)
{txt}
{com}. 
. tsset loc_grand_name_numeric date, daily   
{res}{txt}{col 8}panel variable:  {res}loc_grand_name_numeric (strongly balanced)
{txt}{col 9}time variable:  {res}{col 25}date, 22jan2020 to 30apr2021
{txt}{col 17}delta:  {res}1 day
{txt}
{com}. 
. 
. tssmooth ma DayDeaMeRaA00S00V00_window = DayDeaMeRaA00S00V00 if DayDeaMeRaA00S00V00 >= 0, window(3 1 3)
{txt}The smoother applied was
{res}{p 5 5 5} by loc_grand_name_numeric : (1/7)*[x(t-3) + x(t-2) + x(t-1) + 1*x(t) + x(t+1) + x(t+2) + x(t+3)]; x(t)= DayDeaMeRaA00S00V00 {p_end}
{txt}
{com}. 
. tssmooth ma DayDeaMeSmA00S00V00 = DayDeaMeRaA00S00V00_window, weights( 1 2 3 <4> 3 2 1) replace
{txt}The smoother applied was
{res}{p 5 5 5} by loc_grand_name_numeric : (1/16)*[1*x(t-3) + 2*x(t-2) + 3*x(t-1) + 4*x(t) + 3*x(t+1) + 2*x(t+2) + ...; x(t)= DayDeaMeRaA00S00V00_window
{txt}
{smcl}
{com}. 
. label var DayDeaMeSmA00S00V00 "Daily deaths mean smooth JOHN"
{txt}
{com}. 
. drop DayDeaMeRaA00S00V00_window
{txt}
{com}. 
. 
. tssmooth ma DayCasMeRaA00S00V00_window = DayCasMeRaA00S00V00 if DayCasMeRaA00S00V00 >= 0, window(3 1 3)
{txt}The smoother applied was
{res}{p 5 5 5} by loc_grand_name_numeric : (1/7)*[x(t-3) + x(t-2) + x(t-1) + 1*x(t) + x(t+1) + x(t+2) + x(t+3)]; x(t)= DayCasMeRaA00S00V00 {p_end}
{txt}
{com}. 
. tssmooth ma DayCasMeSmA00S00V00 = DayCasMeRaA00S00V00_window, weights( 1 2 3 <4> 3 2 1) replace
{txt}The smoother applied was
{res}{p 5 5 5} by loc_grand_name_numeric : (1/16)*[1*x(t-3) + 2*x(t-2) + 3*x(t-1) + 4*x(t) + 3*x(t+1) + 2*x(t+2) + ...; x(t)= DayCasMeRaA00S00V00_window
{txt}
{smcl}
{com}. 
. label var DayCasMeSmA00S00V00 "Daily cases mean smooth JOHN"
{txt}
{com}. 
. drop DayCasMeRaA00S00V00_window
{txt}
{com}. 
. 
. tssmooth ma DayCfrMeRaA00S00V00_window = DayCfrMeRaA00S00V00 if DayCfrMeRaA00S00V00 >= 0, window(3 1 3)
{txt}The smoother applied was
{res}{p 5 5 5} by loc_grand_name_numeric : (1/7)*[x(t-3) + x(t-2) + x(t-1) + 1*x(t) + x(t+1) + x(t+2) + x(t+3)]; x(t)= DayCfrMeRaA00S00V00 {p_end}
{txt}
{com}. 
. tssmooth ma DayCfrMeSmA00S00V00 = DayCfrMeRaA00S00V00_window, weights( 1 2 3 <4> 3 2 1) replace
{txt}The smoother applied was
{res}{p 5 5 5} by loc_grand_name_numeric : (1/16)*[1*x(t-3) + 2*x(t-2) + 3*x(t-1) + 4*x(t) + 3*x(t+1) + 2*x(t+2) + ...; x(t)= DayCfrMeRaA00S00V00_window
{txt}
{smcl}
{com}. 
. label var DayCfrMeSmA00S00V00 "Daily CFR mean smooth JOHN"
{txt}
{com}. 
. drop DayCfrMeRaA00S00V00_window
{txt}
{com}. 
. 
. tssmooth ma DayCTDMeRaA00S00V00_window = DayCTDMeRaA00S00V00 if DayCTDMeRaA00S00V00 >= 0, window(3 1 3)
{txt}The smoother applied was
{res}{p 5 5 5} by loc_grand_name_numeric : (1/7)*[x(t-3) + x(t-2) + x(t-1) + 1*x(t) + x(t+1) + x(t+2) + x(t+3)]; x(t)= DayCTDMeRaA00S00V00 {p_end}
{txt}
{com}. 
. tssmooth ma DayCTDMeSmA00S00V00 = DayCTDMeRaA00S00V00_window, weights( 1 2 3 <4> 3 2 1) replace
{txt}The smoother applied was
{res}{p 5 5 5} by loc_grand_name_numeric : (1/16)*[1*x(t-3) + 2*x(t-2) + 3*x(t-1) + 4*x(t) + 3*x(t+1) + 2*x(t+2) + ...; x(t)= DayCTDMeRaA00S00V00_window
{txt}
{smcl}
{com}. 
. label var DayCTDMeSmA00S00V00 "Daily CTD mean smooth JOHN"
{txt}
{com}. 
. drop DayCTDMeRaA00S00V00_window
{txt}
{com}. 
. 
. 
. tssmooth ma TotCTDMeRaA00S00V00_window = TotCTDMeRaA00S00V00 if TotCTDMeRaA00S00V00 >= 0, window(3 1 3)
{txt}The smoother applied was
{res}{p 5 5 5} by loc_grand_name_numeric : (1/7)*[x(t-3) + x(t-2) + x(t-1) + 1*x(t) + x(t+1) + x(t+2) + x(t+3)]; x(t)= TotCTDMeRaA00S00V00 {p_end}
{txt}
{com}. 
. tssmooth ma TotCTDMeSmA00S00V00 = TotCTDMeRaA00S00V00_window, weights( 1 2 3 <4> 3 2 1) replace
{txt}The smoother applied was
{res}{p 5 5 5} by loc_grand_name_numeric : (1/16)*[1*x(t-3) + 2*x(t-2) + 3*x(t-1) + 4*x(t) + 3*x(t+1) + 2*x(t+2) + ...; x(t)= TotCTDMeRaA00S00V00_window
{txt}
{smcl}
{com}. 
. label var TotCTDMeSmA00S00V00 "Total CTD mean smooth JOHN"
{txt}
{com}. 
. drop TotCTDMeRaA00S00V00_window
{txt}
{com}. 
. 
. 
. 
. levelsof loc_grand_name, local(levels)
{txt}`"1_Global"' `"2_EMR"' `"Algeria"' `"Bahrain"' `"Djibouti"' `"Egypt"' `"Iran"' `"Iraq"' `"Israel"' `"Jordan"' `"Kuwait"' `"Lebanon"' `"Libya"' `"Oman"' `"Qatar"' `"Saudi_Arabia"' `"Syria"' `"Tunisia"' `"UAE"' `"Yemen"'

{com}. 
. foreach l of local levels {c -(}
{txt}  2{com}. 
.         tssmooth ma DayDea_multip_`l'_w = DayDea_multip_`l' if (DayDea_multip_`l' >= 0) & (loc_grand_name == "`l'"), window(3 1 3)
{txt}  3{com}. 
.         tssmooth ma DayDea_multip_`l'_sm = DayDea_multip_`l'_w if (loc_grand_name == "`l'"), weights( 1 2 3 <4> 3 2 1) replace
{txt}  4{com}. 
.         label var DayDea_multip_`l'_w "Daily deaths scaled smooth only for visualization JOHN"
{txt}  5{com}. 
.         drop DayDea_multip_`l'_w 
{txt}  6{com}. {c )-}
{txt}The smoother applied was
{res}{p 5 5 5}(1/7)*[x(t-3) + x(t-2) + x(t-1) + 1*x(t) + x(t+1) + x(t+2) + x(t+3)]; x(t)= DayDea_multip_1_Global {p_end}
{txt}The smoother applied was
{res}{p 5 5 5}(1/16)*[1*x(t-3) + 2*x(t-2) + 3*x(t-1) + 4*x(t) + 3*x(t+1) + 2*x(t+2) + ...; x(t)= DayDea_multip_1_Global_w 
{txt}The smoother applied was
{res}{p 5 5 5}(1/7)*[x(t-3) + x(t-2) + x(t-1) + 1*x(t) + x(t+1) + x(t+2) + x(t+3)]; x(t)= DayDea_multip_2_EMR {p_end}
{txt}The smoother applied was
{res}{p 5 5 5}(1/16)*[1*x(t-3) + 2*x(t-2) + 3*x(t-1) + 4*x(t) + 3*x(t+1) + 2*x(t+2) + ...; x(t)= DayDea_multip_2_EMR_w 
{txt}The smoother applied was
{res}{p 5 5 5}(1/7)*[x(t-3) + x(t-2) + x(t-1) + 1*x(t) + x(t+1) + x(t+2) + x(t+3)]; x(t)= DayDea_multip_Algeria {p_end}
{txt}The smoother applied was
{res}{p 5 5 5}(1/16)*[1*x(t-3) + 2*x(t-2) + 3*x(t-1) + 4*x(t) + 3*x(t+1) + 2*x(t+2) + ...; x(t)= DayDea_multip_Algeria_w 
{txt}The smoother applied was
{res}{p 5 5 5}(1/7)*[x(t-3) + x(t-2) + x(t-1) + 1*x(t) + x(t+1) + x(t+2) + x(t+3)]; x(t)= DayDea_multip_Bahrain {p_end}
{txt}The smoother applied was
{res}{p 5 5 5}(1/16)*[1*x(t-3) + 2*x(t-2) + 3*x(t-1) + 4*x(t) + 3*x(t+1) + 2*x(t+2) + ...; x(t)= DayDea_multip_Bahrain_w 
{txt}The smoother applied was
{res}{p 5 5 5}(1/7)*[x(t-3) + x(t-2) + x(t-1) + 1*x(t) + x(t+1) + x(t+2) + x(t+3)]; x(t)= DayDea_multip_Djibouti {p_end}
{txt}The smoother applied was
{res}{p 5 5 5}(1/16)*[1*x(t-3) + 2*x(t-2) + 3*x(t-1) + 4*x(t) + 3*x(t+1) + 2*x(t+2) + ...; x(t)= DayDea_multip_Djibouti_w 
{txt}The smoother applied was
{res}{p 5 5 5}(1/7)*[x(t-3) + x(t-2) + x(t-1) + 1*x(t) + x(t+1) + x(t+2) + x(t+3)]; x(t)= DayDea_multip_Egypt {p_end}
{txt}The smoother applied was
{res}{p 5 5 5}(1/16)*[1*x(t-3) + 2*x(t-2) + 3*x(t-1) + 4*x(t) + 3*x(t+1) + 2*x(t+2) + ...; x(t)= DayDea_multip_Egypt_w 
{txt}The smoother applied was
{res}{p 5 5 5}(1/7)*[x(t-3) + x(t-2) + x(t-1) + 1*x(t) + x(t+1) + x(t+2) + x(t+3)]; x(t)= DayDea_multip_Iran {p_end}
{txt}The smoother applied was
{res}{p 5 5 5}(1/16)*[1*x(t-3) + 2*x(t-2) + 3*x(t-1) + 4*x(t) + 3*x(t+1) + 2*x(t+2) + ...; x(t)= DayDea_multip_Iran_w 
{txt}The smoother applied was
{res}{p 5 5 5}(1/7)*[x(t-3) + x(t-2) + x(t-1) + 1*x(t) + x(t+1) + x(t+2) + x(t+3)]; x(t)= DayDea_multip_Iraq {p_end}
{txt}The smoother applied was
{res}{p 5 5 5}(1/16)*[1*x(t-3) + 2*x(t-2) + 3*x(t-1) + 4*x(t) + 3*x(t+1) + 2*x(t+2) + ...; x(t)= DayDea_multip_Iraq_w 
{txt}The smoother applied was
{res}{p 5 5 5}(1/7)*[x(t-3) + x(t-2) + x(t-1) + 1*x(t) + x(t+1) + x(t+2) + x(t+3)]; x(t)= DayDea_multip_Israel {p_end}
{txt}The smoother applied was
{res}{p 5 5 5}(1/16)*[1*x(t-3) + 2*x(t-2) + 3*x(t-1) + 4*x(t) + 3*x(t+1) + 2*x(t+2) + ...; x(t)= DayDea_multip_Israel_w 
{txt}The smoother applied was
{res}{p 5 5 5}(1/7)*[x(t-3) + x(t-2) + x(t-1) + 1*x(t) + x(t+1) + x(t+2) + x(t+3)]; x(t)= DayDea_multip_Jordan {p_end}
{txt}The smoother applied was
{res}{p 5 5 5}(1/16)*[1*x(t-3) + 2*x(t-2) + 3*x(t-1) + 4*x(t) + 3*x(t+1) + 2*x(t+2) + ...; x(t)= DayDea_multip_Jordan_w 
{txt}The smoother applied was
{res}{p 5 5 5}(1/7)*[x(t-3) + x(t-2) + x(t-1) + 1*x(t) + x(t+1) + x(t+2) + x(t+3)]; x(t)= DayDea_multip_Kuwait {p_end}
{txt}The smoother applied was
{res}{p 5 5 5}(1/16)*[1*x(t-3) + 2*x(t-2) + 3*x(t-1) + 4*x(t) + 3*x(t+1) + 2*x(t+2) + ...; x(t)= DayDea_multip_Kuwait_w 
{txt}The smoother applied was
{res}{p 5 5 5}(1/7)*[x(t-3) + x(t-2) + x(t-1) + 1*x(t) + x(t+1) + x(t+2) + x(t+3)]; x(t)= DayDea_multip_Lebanon {p_end}
{txt}The smoother applied was
{res}{p 5 5 5}(1/16)*[1*x(t-3) + 2*x(t-2) + 3*x(t-1) + 4*x(t) + 3*x(t+1) + 2*x(t+2) + ...; x(t)= DayDea_multip_Lebanon_w 
{txt}The smoother applied was
{res}{p 5 5 5}(1/7)*[x(t-3) + x(t-2) + x(t-1) + 1*x(t) + x(t+1) + x(t+2) + x(t+3)]; x(t)= DayDea_multip_Libya {p_end}
{txt}The smoother applied was
{res}{p 5 5 5}(1/16)*[1*x(t-3) + 2*x(t-2) + 3*x(t-1) + 4*x(t) + 3*x(t+1) + 2*x(t+2) + ...; x(t)= DayDea_multip_Libya_w 
{txt}The smoother applied was
{res}{p 5 5 5}(1/7)*[x(t-3) + x(t-2) + x(t-1) + 1*x(t) + x(t+1) + x(t+2) + x(t+3)]; x(t)= DayDea_multip_Oman {p_end}
{txt}The smoother applied was
{res}{p 5 5 5}(1/16)*[1*x(t-3) + 2*x(t-2) + 3*x(t-1) + 4*x(t) + 3*x(t+1) + 2*x(t+2) + ...; x(t)= DayDea_multip_Oman_w 
{txt}The smoother applied was
{res}{p 5 5 5}(1/7)*[x(t-3) + x(t-2) + x(t-1) + 1*x(t) + x(t+1) + x(t+2) + x(t+3)]; x(t)= DayDea_multip_Qatar {p_end}
{txt}The smoother applied was
{res}{p 5 5 5}(1/16)*[1*x(t-3) + 2*x(t-2) + 3*x(t-1) + 4*x(t) + 3*x(t+1) + 2*x(t+2) + ...; x(t)= DayDea_multip_Qatar_w 
{txt}The smoother applied was
{res}{p 5 5 5}(1/7)*[x(t-3) + x(t-2) + x(t-1) + 1*x(t) + x(t+1) + x(t+2) + x(t+3)]; x(t)= DayDea_multip_Saudi_Arabia {p_end}
{txt}The smoother applied was
{res}{p 5 5 5}(1/16)*[1*x(t-3) + 2*x(t-2) + 3*x(t-1) + 4*x(t) + 3*x(t+1) + 2*x(t+2) + ...; x(t)= DayDea_multip_Saudi_Arabia_w 
{txt}The smoother applied was
{res}{p 5 5 5}(1/7)*[x(t-3) + x(t-2) + x(t-1) + 1*x(t) + x(t+1) + x(t+2) + x(t+3)]; x(t)= DayDea_multip_Syria {p_end}
{txt}The smoother applied was
{res}{p 5 5 5}(1/16)*[1*x(t-3) + 2*x(t-2) + 3*x(t-1) + 4*x(t) + 3*x(t+1) + 2*x(t+2) + ...; x(t)= DayDea_multip_Syria_w 
{txt}The smoother applied was
{res}{p 5 5 5}(1/7)*[x(t-3) + x(t-2) + x(t-1) + 1*x(t) + x(t+1) + x(t+2) + x(t+3)]; x(t)= DayDea_multip_Tunisia {p_end}
{txt}The smoother applied was
{res}{p 5 5 5}(1/16)*[1*x(t-3) + 2*x(t-2) + 3*x(t-1) + 4*x(t) + 3*x(t+1) + 2*x(t+2) + ...; x(t)= DayDea_multip_Tunisia_w 
{txt}The smoother applied was
{res}{p 5 5 5}(1/7)*[x(t-3) + x(t-2) + x(t-1) + 1*x(t) + x(t+1) + x(t+2) + x(t+3)]; x(t)= DayDea_multip_UAE {p_end}
{txt}The smoother applied was
{res}{p 5 5 5}(1/16)*[1*x(t-3) + 2*x(t-2) + 3*x(t-1) + 4*x(t) + 3*x(t+1) + 2*x(t+2) + ...; x(t)= DayDea_multip_UAE_w 
{txt}The smoother applied was
{res}{p 5 5 5}(1/7)*[x(t-3) + x(t-2) + x(t-1) + 1*x(t) + x(t+1) + x(t+2) + x(t+3)]; x(t)= DayDea_multip_Yemen {p_end}
{txt}The smoother applied was
{res}{p 5 5 5}(1/16)*[1*x(t-3) + 2*x(t-2) + 3*x(t-1) + 4*x(t) + 3*x(t+1) + 2*x(t+2) + ...; x(t)= DayDea_multip_Yemen_w 
{txt}
{smcl}
{com}. * 
. 
. 
. * 
. 
. tsset, clear
{txt}
{com}. 
. 
. 
. 
. 
. save "EMR JOHN.dta", replace
{txt}file EMR JOHN.dta saved

{com}. 
. 
. 
. 
. 
. 
. 
. **************
. 
. * graphs
. 
. ssc install grstyle, replace
{txt}checking {hilite:grstyle} consistency and verifying not already installed...
all files already exist and are up to date.

{com}. 
. grstyle init
{res}{txt}
{com}. 
. grstyle color background white
{txt}
{com}. 
. 
. 
. 
. 
. 
. 
. * adjust x axis ticks from Jan 2020 to this month and avoid globals
. forval i = 1(1)12 {c -(}
{txt}  2{com}.         local date2020 = mdy(`i', 1, 2020)
{txt}  3{com}.         local dates2020 `dates2020' `date2020'
{txt}  4{com}. {c )-}
{txt}
{com}. local wanted : di %tdNN daily("$S_DATE", "DMY")
{res}{txt}
{com}. forval i = 1(1)`wanted' {c -(}
{txt}  2{com}.         local date2021 = mdy(`i', 1, 2021)
{txt}  3{com}.         local dates2021 `dates2021' `date2021'
{txt}  4{com}. {c )-}
{txt}
{com}. *
. 
. 
. 
. 
. levelsof loc_grand_name, local(levels)
{txt}`"1_Global"' `"2_EMR"' `"Algeria"' `"Bahrain"' `"Djibouti"' `"Egypt"' `"Iran"' `"Iraq"' `"Israel"' `"Jordan"' `"Kuwait"' `"Lebanon"' `"Libya"' `"Oman"' `"Qatar"' `"Saudi_Arabia"' `"Syria"' `"Tunisia"' `"UAE"' `"Yemen"'

{com}. 
. foreach l of local levels {c -(}
{txt}  2{com}. 
. 
. 
. ** DayCas DayDea DayDea_multip
. 
. 
. * DayCas DayDea DayDea_multip, all raw
. 
. twoway ///
> (line DayCasMeRaA00S00V00 date, sort lcolor(blue)) ///
> (line DayDeaMeRaA00S00V00 date, sort lcolor(red)) ///
> (line DayDea_multip_`l' date, sort lpattern(dot) lcolor(red)) ///
> if date > td(01jan2020) & loc_grand_name == "`l'" ///
> , xtitle(Date) xlabel(`dates2020' `dates2021', format(%tdYY-NN-DD) labsize(small)) xlabel(, grid) xlabel(, grid) ///
> xlabel(, angle(forty_five)) ylabel(, format(%12.0fc) labsize(small)) ylabel(, labsize(small) angle(horizontal)) ///
> ytitle(Daily cases and deaths) title("COVID-19 daily cases and deaths, `l', Johns Hopkins", size(medium)) ///
> xscale(lwidth(vthin) lcolor(gray*.2)) yscale(lwidth(vthin) lcolor(gray*.2)) yscale(titlegap(4)) legend(region(lcolor(none)))  ///
> legend(order(1 "Daily cases" 2 "Daily deaths" 3 "Daily deaths scaled for visualization") size(small)) ///
> subtitle("Daily deaths, scaled = times (means of cases divided by deaths) for visualization only", size(small))
{txt}  3{com}. 
. qui graph save "graph 1 COVID-19 daily deaths and cases `l' Johns Hopkins.gph", replace
{txt}  4{com}. qui graph export "graph 1 COVID-19 daily deaths and cases `l' Johns Hopkins.pdf", replace
{txt}  5{com}. 
. 
. 
. 
. 
. * DayCas DayDea DayDea_multip, all smooth
. 
. twoway ///
> (line DayCasMeSmA00S00V00 date, sort lcolor(blue)) ///
> (line DayDeaMeSmA00S00V00 date, sort lcolor(red)) ///
> (line DayDea_multip_`l'_sm date, sort lpattern(dot) lcolor(red)) ///
> if date > td(01jan2020) & loc_grand_name == "`l'" ///
> , xtitle(Date) xlabel(`dates2020' `dates2021', format(%tdYY-NN-DD) labsize(small)) xlabel(, grid) xlabel(, grid) ///
> xlabel(, angle(forty_five)) ylabel(, format(%12.0fc) labsize(small)) ylabel(, labsize(small) angle(horizontal)) ///
> ytitle(Daily cases and deaths smoothed) title("COVID-19 daily cases and deaths smoothed, `l', Johns Hopkins", size(medium)) ///
> xscale(lwidth(vthin) lcolor(gray*.2)) yscale(lwidth(vthin) lcolor(gray*.2)) yscale(titlegap(4)) legend(region(lcolor(none)))  ///
> legend(order(1 "Daily cases smoothed" 2 "Daily deaths smoothed" 3 "Daily deaths scaled for visualization, smoothed") size(small)) ///
> subtitle("Daily deaths, scaled = times (means of cases divided by deaths) for visualization only, smoothed", size(small))
{txt}  6{com}. 
. qui graph save "graph 2 COVID-19 daily deaths and cases smoothed `l' Johns Hopkins.gph", replace
{txt}  7{com}. qui graph export "graph 2 COVID-19 daily deaths and cases smoothed `l' Johns Hopkins.pdf", replace
{txt}  8{com}. 
. 
. 
. 
. 
. ** DayDea
. 
. * DayDea, raw and smooth 
. 
. 
. twoway ///
> (line DayDeaMeRaA00S00V00 date, sort lcolor(gray)) ///
> (line DayDeaMeSmA00S00V00 date, sort lwidth(thick) lcolor(red)) ///
> if date > td(01jan2020) & loc_grand_name == "`l'" ///
> , xtitle(Date) xlabel(`dates2020' `dates2021', format(%tdYY-NN-DD) labsize(small)) xlabel(, grid) xlabel(, grid) ///
> xlabel(, angle(forty_five)) ylabel(, format(%12.0fc) labsize(small)) ylabel(, labsize(small) angle(horizontal)) ///
> ytitle(Daily deaths) title("COVID-19 daily deaths, `l', Johns Hopkins", size(medium)) ///
> xscale(lwidth(vthin) lcolor(gray*.2)) yscale(lwidth(vthin) lcolor(gray*.2)) yscale(titlegap(4)) legend(region(lcolor(none)))  ///
> legend(order(1 "Raw" 2 "Smoothed") size(small)) 
{txt}  9{com}. 
. qui graph save "graph 3 COVID-19 daily deaths `l' Johns Hopkins.gph", replace
{txt} 10{com}. qui graph export "graph 3 COVID-19 daily deaths `l' Johns Hopkins.pdf", replace
{txt} 11{com}. 
. 
. 
. ** Day CFR
. 
. * Day CFR raw
. 
. twoway ///
> (line DayCfrMeRaA00S00V00 date, sort lcolor(black)) ///
> if date > td(01jan2020) & loc_grand_name == "`l'" ///
> , xtitle(Date) xlabel(`dates2020' `dates2021', format(%tdYY-NN-DD) labsize(small)) xlabel(, grid) xlabel(, grid) ///
> xlabel(, angle(forty_five)) ylabel(, format(%9.2fc) labsize(small))  ylabel(, labsize(small) angle(horizontal)) ///
> ytitle(Daily CFR) title("COVID-19 daily CFR, `l', Johns Hopkins", size(medium)) ///
> xscale(lwidth(vthin) lcolor(gray*.2)) yscale(lwidth(vthin) lcolor(gray*.2)) legend(region(lcolor(none))) legend(bexpand) 
{txt} 12{com}. 
. 
. qui graph save "graph 4 COVID-19 daily CFR, `l', Johns Hopkins.gph", replace
{txt} 13{com}. qui graph export "graph 4 COVID-19 daily CFR, `l', Johns Hopkins.pdf", replace
{txt} 14{com}. 
. 
. 
. * Day CFR smoothed
. 
. twoway ///
> (line DayCfrMeSmA00S00V00 date, sort lcolor(black)) ///
> if date > td(01jan2020) & loc_grand_name == "`l'" ///
> , xtitle(Date) xlabel(`dates2020' `dates2021', format(%tdYY-NN-DD) labsize(small)) xlabel(, grid) xlabel(, grid) ///
> xlabel(, angle(forty_five)) ylabel(, format(%9.2fc) labsize(small))  ylabel(, labsize(small) angle(horizontal)) ///
> ytitle(Daily CFR smoothed) title("COVID-19 daily CFR, smoothed, `l', Johns Hopkins", size(medium)) ///
> xscale(lwidth(vthin) lcolor(gray*.2)) yscale(lwidth(vthin) lcolor(gray*.2)) legend(region(lcolor(none))) legend(bexpand) 
{txt} 15{com}. 
. 
. qui graph save "graph 5 COVID-19 daily CFR, smoothed `l', Johns Hopkins.gph", replace
{txt} 16{com}. qui graph export "graph 5 COVID-19 daily CFR, smoothed `l', Johns Hopkins.pdf", replace
{txt} 17{com}. 
. 
. 
. 
. * Day CFR raw and smoothed
. 
. twoway ///
> (line DayCfrMeRaA00S00V00 date, sort lcolor(gray)) ///
> (line DayCfrMeSmA00S00V00 date, sort lwidth(thick) lcolor(red)) ///
> if date > td(01jan2020) & loc_grand_name == "`l'" ///
> , xtitle(Date) xlabel(`dates2020' `dates2021', format(%tdYY-NN-DD) labsize(small)) xlabel(, grid) xlabel(, grid) ///
> xlabel(, angle(forty_five)) ylabel(, format(%9.2fc) labsize(small))  ylabel(, labsize(small) angle(horizontal)) ///
> ytitle(Daily CFR) title("COVID-19 daily CFR, `l', Johns Hopkins", size(medium)) ///
> xscale(lwidth(vthin) lcolor(gray*.2)) yscale(lwidth(vthin) lcolor(gray*.2)) legend(region(lcolor(none))) legend(bexpand) ///
> legend(order(1 "Raw" 2 "Smoothed") size(small)) ///
> 
{txt} 18{com}. 
. qui graph save "graph 6 COVID-19 daily CFR, raw and smoothed, `l', Johns Hopkins.gph", replace
{txt} 19{com}. qui graph export "graph 6 COVID-19 daily CFR, raw and smoothed, `l', Johns Hopkins.pdf", replace
{txt} 20{com}. 
. 
. 
. 
. ** Cases to deaths ratio (CTD)
. 
. 
. * Day CTD raw and smoothed
. 
. twoway ///
> (line DayCTDMeRaA00S00V00 date, sort lcolor(gray)) ///
> (line DayCTDMeSmA00S00V00 date, sort lwidth(thick) lcolor(red)) ///
> if date > td(01jan2020) & loc_grand_name == "`l'" ///
> , xtitle(Date) xlabel(`dates2020' `dates2021', format(%tdYY-NN-DD) labsize(small)) xlabel(, grid) xlabel(, grid) ///
> xlabel(, angle(forty_five)) ylabel(, format(%9.2fc) labsize(small))  ylabel(, labsize(small) angle(horizontal)) ///
> ytitle(Daily Cases to deaths ratio) title("COVID-19 daily cases to deaths ratio, `l', Johns Hopkins", size(medium)) ///
> xscale(lwidth(vthin) lcolor(gray*.2)) yscale(lwidth(vthin) lcolor(gray*.2)) legend(region(lcolor(none))) legend(bexpand) ///
> legend(order(1 "Raw" 2 "Smoothed") size(small)) ///
> 
{txt} 21{com}. 
. qui graph save "graph 7 COVID-19 daily CTD, raw and smoothed, `l', Johns Hopkins.gph", replace
{txt} 22{com}. qui graph export "graph 7 COVID-19 daily CTD, raw and smoothed, `l', Johns Hopkins.pdf", replace
{txt} 23{com}. 
. 
. 
. 
. * Tot CTD raw and smoothed
. 
. twoway ///
> (line TotCTDMeRaA00S00V00 date, sort lcolor(gray)) ///
> (line TotCTDMeSmA00S00V00 date, sort lwidth(thick) lcolor(red)) ///
> if date > td(01jan2020) & loc_grand_name == "`l'" ///
> , xtitle(Date) xlabel(`dates2020' `dates2021', format(%tdYY-NN-DD) labsize(small)) xlabel(, grid) xlabel(, grid) ///
> xlabel(, angle(forty_five)) ylabel(, format(%9.2fc) labsize(small))  ylabel(, labsize(small) angle(horizontal)) ///
> ytitle(Total Cases to deaths ratio) title("COVID-19 total cases to deaths ratio, `l', Johns Hopkins", size(medium)) ///
> xscale(lwidth(vthin) lcolor(gray*.2)) yscale(lwidth(vthin) lcolor(gray*.2)) legend(region(lcolor(none))) legend(bexpand) ///
> legend(order(1 "Raw" 2 "Smoothed") size(small)) ///
> 
{txt} 24{com}. 
. qui graph save "graph 8 COVID-19 total CTD, raw and smoothed, `l', Johns Hopkins.gph", replace
{txt} 25{com}. qui graph export "graph 8 COVID-19 total CTD, raw and smoothed, `l', Johns Hopkins.pdf", replace
{txt} 26{com}. 
. 
. 
. {c )-}
{res}{txt}
{com}. *
. 
. 
. 
. 
. 
. 
. 
. 
. view "log EMR JOHN.smcl"
{txt}
{com}. 
. log close
      {txt}name:  {res}<unnamed>
       {txt}log:  {res}/Users/farshadpourmalek/Downloads/covir2-main/20210430/code/JOHNEMR/log EMR JOHN.smcl
  {txt}log type:  {res}smcl
 {txt}closed on:  {res} 1 May 2021, 00:38:19
{txt}{.-}
{smcl}
{txt}{sf}{ul off}