{smcl}
{com}{sf}{ul off}{txt}{.-}
      name:  {res}<unnamed>
       {txt}log:  {res}/Users/farshadpourmalek/Downloads/covir2-main/20220715/code/MEDRIVA/log country MEDRIVA.smcl
  {txt}log type:  {res}smcl
 {txt}opened on:  {res}16 Jul 2022, 07:28:41
{txt}
{com}. 
. *****************************************************************************
. * This is "do country MEDRIVA.do"
. 
. * Project: CovidVisualized country - countries without subnational estimates
. * Person: Farshad Pourmalek 
. *****************************************************************************
. 
. 
.                                                                                                                                  
. 
. clear 
{txt}
{com}. 
. *****************************
. 
. * get MEDRIVA estimates
. 
. di "$MEDRIVAdate"
{res}20220715
{txt}
{com}. 
. * Source web page:
. * https://charts.medriva.com/country/IR
. 
. * "MEDRIVA $MEDRIVAdate.csv" is scraped from https://charts.medriva.com/country/IR
. 
.  
.  
.  
. ******************************
. 
. * import data file - "basic data"
. 
. import excel "MEDRIVA $MEDRIVAdate.xlsx", clear sheet("basic data") firstrow case(lower) 
{res}{txt}
{com}. 
. 
. * gen date
. 
. drop if date == "Date"
{txt}(41 observations deleted)

{com}. 
. gen row = _n
{txt}
{com}. 
. gsort -row
{txt}
{com}. 
. gen grow = _n 
{txt}
{com}. 
. gen year = ""
{txt}(862 missing values generated)

{com}. 
. replace year = "2020" if grow <= 302
{txt}variable {bf}year{sf} was {bf}{res}str1{sf}{txt} now {bf}{res}str4{sf}
{txt}(302 real changes made)

{com}. 
. replace year = "2021" if grow >= 303 & grow <= 667
{txt}(365 real changes made)

{com}. 
. replace year = "2022" if grow >= 668 
{txt}(195 real changes made)

{com}. 
. sort row
{txt}
{com}. 
. drop row grow
{txt}
{com}. 
. gen day = substr(date,1,2)
{txt}
{com}. 
. gen month = substr(date,4,3)
{txt}
{com}. 
. rename date date_original
{res}{txt}
{com}. 
. gen date2 = day + month + year
{txt}
{com}. 
. gen date = date(date2, "DMY", 2050)
{txt}
{com}. 
. format date %tdDDMonCCYY
{txt}
{com}. 
. drop date_original year day month date2
{txt}
{com}. 
. codebook date

{txt}{hline}
{res}date{right:(unlabeled)}
{txt}{hline}

{col 19}type:  numeric daily date ({res}float{txt})

{col 18}range:  [{res}21979{txt},{res}22840{txt}]{col 55}units:  {res}1
{col 8}{txt}or equivalently:  [{res}05mar2020{txt},{res}14jul2022{txt}]{col 55}units:  {res}days
{col 10}{txt}unique values:  {res}862{col 51}{txt}missing .:  {res}0{txt}/{res}862

{txt}{col 19}mean:{res}{col 26} 22409.5{txt} = {res}09may2021{txt} (+ 12 hours)
{col 15}std. dev:{res}{col 26} 248.982

{txt}{col 12}percentiles:{col 32}10%{col 42}25%{col 52}50%{col 62}75%{col 72}90%
{res}{col 27}   22065{col 37}   22194{col 47} 22409.5{col 57}   22625{col 67}   22754
{col 26}30may2020{col 36}06oct2020{col 46}09may2021{col 56}11dec2021{col 66}19apr2022
{txt}
{com}. 
. 
. 
. 
. * omit incomplete data lines
. 
. drop if date == td(05Mar2020) // missing newcases newdeaths newtests
{txt}(1 observation deleted)

{com}. 
. drop if totaltests == "-" // tests data is the added value of this "basic data"
{txt}(43 observations deleted)

{com}. 
. drop if date == td(03Jul2022) // incomplete data
{txt}(1 observation deleted)

{com}. 
. 
. 
. 
. 
. 
. * destring vars
.                 
. destring totalcases totaldeaths totaltests, replace
{txt}totalcases: all characters numeric; {res}replaced {txt}as {res}long
{txt}totaldeaths: all characters numeric; {res}replaced {txt}as {res}long
{txt}totaltests: all characters numeric; {res}replaced {txt}as {res}long
{txt}
{com}. 
. replace newcases = "." if newcases == "-"
{txt}(2 real changes made)

{com}. replace newdeaths = "." if newdeaths == "-"
{txt}(8 real changes made)

{com}. replace newtests = "." if newtests == "-"
{txt}(2 real changes made)

{com}. 
. destring newcases newdeaths newtests, replace
{txt}newcases: all characters numeric; {res}replaced {txt}as {res}long
{txt}(2 missing values generated)
{res}{txt}newdeaths: all characters numeric; {res}replaced {txt}as {res}int
{txt}(8 missing values generated)
{res}{txt}newtests: all characters numeric; {res}replaced {txt}as {res}long
{txt}(2 missing values generated)
{res}{txt}
{com}. 
. 
. replace newdeaths = 0 if newdeaths == . // zero daily deaths are recoded as "-" in this data
{txt}(8 real changes made)

{com}. 
. 
. 
. qui compress
{txt}
{com}. 
. save "MEDRIVA basic data $MEDRIVAdate.dta", replace
{txt}file MEDRIVA basic data 20220715.dta saved

{com}. 
. *
. 
. 
. 
. 
. 
. 
. 
. 
. 
. ******************************
. 
. * import data file - "hospital data"
. 
. import excel "MEDRIVA $MEDRIVAdate.xlsx", clear sheet("hospital data") firstrow case(lower) 
{res}{txt}
{com}. 
. 
. 
. * rename vars
. 
. rename currentlyinhospital inhospitalnow
{res}{txt}
{com}. 
. rename change inhospitalchange
{res}{txt}
{com}. 
. rename currentlyinicu inicunow
{res}{txt}
{com}. 
. rename e inicuchange
{res}{txt}
{com}. 
. 
. 
. 
. 
. * gen date
. 
. drop if date == "Date"
{txt}(41 observations deleted)

{com}. 
. gen row = _n
{txt}
{com}. 
. gsort -row
{txt}
{com}. 
. gen grow = _n 
{txt}
{com}. 
. gen year = ""
{txt}(862 missing values generated)

{com}. 
. replace year = "2020" if grow <= 302
{txt}variable {bf}year{sf} was {bf}{res}str1{sf}{txt} now {bf}{res}str4{sf}
{txt}(302 real changes made)

{com}. 
. replace year = "2021" if grow >= 303 & grow <= 667
{txt}(365 real changes made)

{com}. 
. replace year = "2022" if grow >= 668 
{txt}(195 real changes made)

{com}. 
. sort row
{txt}
{com}. 
. drop row grow
{txt}
{com}. 
. gen day = substr(date,1,2)
{txt}
{com}. 
. gen month = substr(date,4,3)
{txt}
{com}. 
. rename date date_original
{res}{txt}
{com}. 
. gen date2 = day + month + year
{txt}
{com}. 
. gen date = date(date2, "DMY", 2050)
{txt}
{com}. 
. format date %tdDDMonCCYY
{txt}
{com}. 
. drop date_original      year    day     month   date2
{txt}
{com}. 
. codebook date

{txt}{hline}
{res}date{right:(unlabeled)}
{txt}{hline}

{col 19}type:  numeric daily date ({res}float{txt})

{col 18}range:  [{res}21979{txt},{res}22840{txt}]{col 55}units:  {res}1
{col 8}{txt}or equivalently:  [{res}05mar2020{txt},{res}14jul2022{txt}]{col 55}units:  {res}days
{col 10}{txt}unique values:  {res}862{col 51}{txt}missing .:  {res}0{txt}/{res}862

{txt}{col 19}mean:{res}{col 26} 22409.5{txt} = {res}09may2021{txt} (+ 12 hours)
{col 15}std. dev:{res}{col 26} 248.982

{txt}{col 12}percentiles:{col 32}10%{col 42}25%{col 52}50%{col 62}75%{col 72}90%
{res}{col 27}   22065{col 37}   22194{col 47} 22409.5{col 57}   22625{col 67}   22754
{col 26}30may2020{col 36}06oct2020{col 46}09may2021{col 56}11dec2021{col 66}19apr2022
{txt}
{com}. 
. 
. 
. 
. * omit incomplete data lines
. 
. drop if date == td(03Jul2022) // incomplete data
{txt}(1 observation deleted)

{com}. 
. replace inicuchange = "." if date == td(13Jun2022) // zero is recorded as "-"
{txt}(1 real change made)

{com}. 
. drop if inicuchange == "-" // incomplete data
{txt}(827 observations deleted)

{com}. 
. 
. 
. 
. * destring vars
.                 
. destring inicunow inicuchange, replace
{txt}inicunow: all characters numeric; {res}replaced {txt}as {res}int
{txt}inicuchange: all characters numeric; {res}replaced {txt}as {res}int
{txt}(1 missing value generated)
{res}{txt}
{com}. 
. replace inhospitalnow = "." if inhospitalnow == "-"
{txt}(34 real changes made)

{com}. replace inhospitalchange = "." if inhospitalchange == "-"
{txt}(34 real changes made)

{com}. 
. destring inhospitalnow inhospitalchange, replace
{txt}inhospitalnow: all characters numeric; {res}replaced {txt}as {res}byte
{txt}(34 missing values generated)
{res}{txt}inhospitalchange: all characters numeric; {res}replaced {txt}as {res}byte
{txt}(34 missing values generated)
{res}{txt}
{com}. 
. qui compress
{txt}
{com}. 
. save "MEDRIVA hospital data $MEDRIVAdate.dta", replace
{txt}file MEDRIVA hospital data 20220715.dta saved

{com}. 
. *
. 
. 
. 
. 
. 
. 
. 
. 
. 
. 
. ******************************
. 
. * import data file - "percent positive"
. 
. import delimited using "percent positive $MEDRIVAdate.txt", clear delimiters(",")
{res}{text}(365 vars, 1 obs)

{com}. 
. 
. * percentpositive7dayaverage
. * graph "TOTAL TESTS PER DAY (IRAN)"
. * Inspect element, search for 14.6
. 
. *************************************************
. * identify earliest date::
. * 16 July 2021 <---
. * use this id line below:
. * replace date = td(16Jul2021) in 1
. 
. 
. *************************************************
. * get latest date data showing with hover: <---
. * 14 July 2022
. * % positive: 20.4
. * Total tests/day: 18673
. 
. 
. 
. 
. 
. gen id = _n 
{txt}
{com}. 
. reshape long v, i(id) j(j) 
{txt}(note: j = 1 2 3 4 5 6 7 8 9 10 11 12 13 14 15 16 17 18 19 20 21 22 23 24 25 26 27 28 29 30 31 32 33 34 35 36 37 38 39 40 41 42 43 44 45 46 47 48 49 50 51 52 53 54 55 56 57 58 59 60 61 62 63 64 65 66 67 68 69 70 71 72 73 74 75 76 77 78 79 80 81 82 83 84 85 86 87 88 89 90 91 92 93 94 95 96 97 98 99 100 101 102 103 104 105 106 107 108 109 110 111 112 113 114 115 116 117 118 119 120 121 122 123 124 125 126 127 128 129 130 131 132 133 134 135 136 137 138 139 140 141 142 143 144 145 146 147 148 149 150 151 152 153 154 155 156 157 158 159 160 161 162 163 164 165 166 167 168 169 170 171 172 173 174 175 176 177 178 179 180 181 182 183 184 185 186 187 188 189 190 191 192 193 194 195 196 197 198 199 200 201 202 203 204 205 206 207 208 209 210 211 212 213 214 215 216 217 218 219 220 221 222 223 224 225 226 227 228 229 230 231 232 233 234 235 236 237 238 239 240 241 242 243 244 245 246 247 248 249 250 251 252 253 254 255 256 257 258 259 260 261 262 263 264 265 266 267 268 269 270 271 272 273 274 275 276 277 278 279 280 281 282 283 284 285 286 287 288 289 290 291 292 293 294 295 296 297 298 299 300 301 302 303 304 305 306 307 308 309 310 311 312 313 314 315 316 317 318 319 320 321 322 323 324 325 326 327 328 329 330 331 332 333 334 335 336 337 338 339 340 341 342 343 344 345 346 347 348 349 350 351 352 353 354 355 356 357 358 359 360 361 362 363 364 365)

Data{col 36}wide{col 43}->{col 48}long
{hline 77}
Number of obs.                 {res}       1   {txt}->{res}     365
{txt}Number of variables            {res}     366   {txt}->{res}       3
{txt}j variable (365 values)                   ->   {res}j
{txt}xij variables:
                         {res}v1 v2 ... v365   {txt}->   {res}v
{txt}{hline 77}

{com}. 
. 
. 
. 
. * gen date
. 
. gen date = .
{txt}(365 missing values generated)

{com}. 
. replace date = td(16Jul2021) in 1
{txt}(1 real change made)

{com}. 
. replace date = date[_n-1] + 1 in 2/l
{txt}(364 real changes made)

{com}. 
. format date %tdDDMonCCYY
{txt}
{com}. 
. codebook date

{txt}{hline}
{res}date{right:(unlabeled)}
{txt}{hline}

{col 19}type:  numeric daily date ({res}float{txt})

{col 18}range:  [{res}22477{txt},{res}22841{txt}]{col 55}units:  {res}1
{col 8}{txt}or equivalently:  [{res}16jul2021{txt},{res}15jul2022{txt}]{col 55}units:  {res}days
{col 10}{txt}unique values:  {res}365{col 51}{txt}missing .:  {res}0{txt}/{res}365

{txt}{col 19}mean:{res}{col 26}   22659{txt} = {res}14jan2022{txt}
{col 15}std. dev:{res}{col 26} 105.511

{txt}{col 12}percentiles:{col 32}10%{col 42}25%{col 52}50%{col 62}75%{col 72}90%
{res}{col 27}   22513{col 37}   22568{col 47}   22659{col 57}   22750{col 67}   22805
{col 26}21aug2021{col 36}15oct2021{col 46}14jan2022{col 56}15apr2022{col 66}09jun2022
{txt}
{com}. 
. * 
. 
. rename v percentpositive7dayaverage
{res}{txt}
{com}. 
. label var percentpositive7dayaverage "% positive 7-day average"
{txt}
{com}. 
. drop id j
{txt}
{com}. 
. 
. qui compress
{txt}
{com}. 
. save "MEDRIVA percent positive data $MEDRIVAdate.dta", replace
{txt}file MEDRIVA percent positive data 20220715.dta saved

{com}. 
. 
. 
. 
. 
. *************
. 
. * merge data files
. 
. 
. use "MEDRIVA basic data $MEDRIVAdate.dta", clear
{txt}
{com}. 
. merge m:m date using "MEDRIVA hospital data $MEDRIVAdate.dta"
{res}
{txt}{col 5}Result{col 38}# of obs.
{col 5}{hline 41}
{col 5}not matched{col 30}{res}             783
{txt}{col 9}from master{col 30}{res}             783{txt}  (_merge==1)
{col 9}from using{col 30}{res}               0{txt}  (_merge==2)

{col 5}matched{col 30}{res}              34{txt}  (_merge==3)
{col 5}{hline 41}

{com}. 
. drop _merge
{txt}
{com}. 
. merge m:m date using "MEDRIVA percent positive data $MEDRIVAdate.dta"
{res}
{txt}{col 5}Result{col 38}# of obs.
{col 5}{hline 41}
{col 5}not matched{col 30}{res}             456
{txt}{col 9}from master{col 30}{res}             454{txt}  (_merge==1)
{col 9}from using{col 30}{res}               2{txt}  (_merge==2)

{col 5}matched{col 30}{res}             363{txt}  (_merge==3)
{col 5}{hline 41}

{com}. 
. drop _merge
{txt}
{com}. 
. sort date
{txt}
{com}. 
. qui compress
{txt}
{com}. 
. save "country MEDRIVA.dta", replace
{txt}file country MEDRIVA.dta saved

{com}. 
. 
. 
. 
. 
. 
. 
. 
. *************************************************
. * check latest date data showing with hover: <---
. * 14 July 2022
. * % positive: 20.4
. * Total tests/day: 18673
. 
. 
. 
. tab percentpositive7dayaverage if date == td(14Jul2022)

 {txt}% positive {c |}
      7-day {c |}
    average {c |}      Freq.     Percent        Cum.
{hline 12}{c +}{hline 35}
       18.2 {c |}{res}          1      100.00      100.00
{txt}{hline 12}{c +}{hline 35}
      Total {c |}{res}          1      100.00
{txt}
{com}. * 18.2
. 
. tab newtests if date == td(14Jul2022)

  {txt}New tests {c |}      Freq.     Percent        Cum.
{hline 12}{c +}{hline 35}
      18673 {c |}{res}          1      100.00      100.00
{txt}{hline 12}{c +}{hline 35}
      Total {c |}{res}          1      100.00
{txt}
{com}. * 18673
. 
. 
. 
. 
. 
. ************
. 
. * graphs 
. 
. grstyle init
{res}{txt}
{com}. 
. grstyle color background white
{txt}
{com}. 
. 
. 
. ****************************
. 
. * daily tests, MEDRIVA, 2020 on
. 
. twoway ///
> (line newtests date, sort lcolor(blue) lwidth(medium) yaxis(1)) /// 
> (line percentpositive7dayaverage date, sort lcolor(red) lwidth(medium) yaxis(2)) /// 
> if date >= td(01jan2020) ///
> , xtitle(Date) xlabel(, format(%tdYY-NN-DD) labsize(small)) xlabel(, grid) xlabel(, grid) ///
> xlabel(, angle(forty_five)) ///
> ylabel(, format(%9.0fc) labsize(small) axis(1))  ylabel(, labsize(small) angle(horizontal) axis(1)) ///
> ylabel(, format(%9.0fc) labsize(small) axis(2))  ylabel(, labsize(small) angle(horizontal) axis(2)) ///
> ytitle("Daily tests", axis(1)) ytitle("% positive 7-day average", axis(2)) ///
> title("COVID-19 daily tests, $country, MEDRIVA", size(medium)) ///
> xscale(lwidth(vthin) lcolor(gray*.2)) ytitle(, color(blue) axis(1)) ytitle(, color(red) axis(2)) ///
> yscale(lwidth(vthin) lcolor(gray*.2) axis(1)) yscale(lwidth(vthin) lcolor(gray*.2) axis(2)) ///
> legend(region(lcolor(none))) legend(bexpand) ///
> legend(order(1 "Daily tests" 2 "% positive 7-day average") size(small) row(1))
{res}{txt}
{com}. 
.  
. 
. graph export "graph 1 COVID-19 daily tests, $country, MEDRIVA.pdf", replace
{txt}(file /Users/farshadpourmalek/Downloads/covir2-main/20220715/code/MEDRIVA/graph 1 COVID-19 daily tests, Iran, MEDRIVA.pdf written in PDF format)

{com}. 
. 
. 
. 
. 
. 
. 
. view "log country MEDRIVA.smcl"
{txt}
{com}. 
. log close
      {txt}name:  {res}<unnamed>
       {txt}log:  {res}/Users/farshadpourmalek/Downloads/covir2-main/20220715/code/MEDRIVA/log country MEDRIVA.smcl
  {txt}log type:  {res}smcl
 {txt}closed on:  {res}16 Jul 2022, 07:28:45
{txt}{.-}
{smcl}
{txt}{sf}{ul off}