{smcl}
{txt}{sf}{ul off}{.-}
      name:  {res}<unnamed>
       {txt}log:  {res}/Users/farshadpourmalek/Downloads/covir2-main/20210507/code/merge/log Iran merge.smcl
  {txt}log type:  {res}smcl
 {txt}opened on:  {res}13 May 2021, 02:09:18
{txt}
{com}. 
. 
. ***************************************************************************
. * This is "do Iran merge.do"
. 
. * Project: COVID-19 Iran Review No 2
. * Person: Farshad Pourmalek pourmalek_farshad@yahoo.com
. * Time (initial): 2021-02-10
. 
. * OBJECTIVE: Merge component studies' estimates for Iran, grphas
. ***************************************************************************
. 
. 
. /* studies:
> JOHN
> DELP
> IHME
> IMPE
> LANL
> SRIV
> SOLT
> GHAN
> */
. 
. 
. 
. 
. * JOHN
. 
. if regexm(c(os),"Mac") == 1 {c -(}
. 
.         use "$pathcovir2/JOHN/Iran JOHN.dta", clear 
. {c )-}
{txt}
{com}. else if regexm(c(os),"Windows") == 1 use "$pathcovir2\JOHN\Iran JOHN.dta", clear 
{txt}
{com}. 
. 
. 
. * DELP 
. 
. if regexm(c(os),"Mac") == 1 {c -(}
. 
.         merge 1:1 date using "$pathcovir2/DELP/Iran DELP.dta"
{res}
{txt}{col 5}Result{col 38}# of obs.
{col 5}{hline 41}
{col 5}not matched{col 30}{res}             556
{txt}{col 9}from master{col 30}{res}             492{txt}  (_merge==1)
{col 9}from using{col 30}{res}              64{txt}  (_merge==2)

{col 5}matched{col 30}{res}               6{txt}  (_merge==3)
{col 5}{hline 41}
{com}. {c )-}
{txt}
{com}. else if regexm(c(os),"Windows") == 1 merge 1:1 date using "$pathcovir2\DELP\Iran DELP.dta"
{txt}
{com}. 
. drop _merge
{txt}
{com}. 
. 
. 
. * IHME
. 
. if regexm(c(os),"Mac") == 1 {c -(}
. 
.         merge 1:1 date using "$pathcovir2/IHME/Iran IHME.dta"
{res}
{txt}{col 5}Result{col 38}# of obs.
{col 5}{hline 41}
{col 5}not matched{col 30}{res}              82
{txt}{col 9}from master{col 30}{res}              34{txt}  (_merge==1)
{col 9}from using{col 30}{res}              48{txt}  (_merge==2)

{col 5}matched{col 30}{res}             528{txt}  (_merge==3)
{col 5}{hline 41}
{com}. {c )-}
{txt}
{com}. else if regexm(c(os),"Windows") == 1 merge 1:1 date using "$pathcovir2\IHME\Iran IHME.dta"
{txt}
{com}. 
. drop _merge
{txt}
{com}. 
. 
. 
. * IMPE
. 
. if regexm(c(os),"Mac") == 1 {c -(}
. 
.         merge 1:1 date using "$pathcovir2/IMPE/Iran IMPE.dta"
{res}
{txt}{col 5}Result{col 38}# of obs.
{col 5}{hline 41}
{col 5}not matched{col 30}{res}              47
{txt}{col 9}from master{col 30}{res}              47{txt}  (_merge==1)
{col 9}from using{col 30}{res}               0{txt}  (_merge==2)

{col 5}matched{col 30}{res}             563{txt}  (_merge==3)
{col 5}{hline 41}
{com}. {c )-}
{txt}
{com}. else if regexm(c(os),"Windows") == 1 merge 1:1 date using "$pathcovir2\IMPE\Iran IMPE.dta"
{txt}
{com}. 
. drop _merge
{txt}
{com}. 
. 
. 
. * LANL
. 
. if regexm(c(os),"Mac") == 1 {c -(}
. 
.         merge 1:1 date using "$pathcovir2/LANL/Iran LANL.dta"
{res}
{txt}{col 5}Result{col 38}# of obs.
{col 5}{hline 41}
{col 5}not matched{col 30}{res}              92
{txt}{col 9}from master{col 30}{res}              92{txt}  (_merge==1)
{col 9}from using{col 30}{res}               0{txt}  (_merge==2)

{col 5}matched{col 30}{res}             518{txt}  (_merge==3)
{col 5}{hline 41}
{com}. {c )-}
{txt}
{com}. else if regexm(c(os),"Windows") == 1 merge 1:1 date using "$pathcovir2\LANL\Iran LANL.dta"
{txt}
{com}. 
. drop _merge
{txt}
{com}. 
. 
. * SRIV
. 
. 
. 
. if regexm(c(os),"Mac") == 1 {c -(}
. 
.         merge 1:1 date using "$pathcovir2/SRIV/Iran SRIV.dta"
{res}
{txt}{col 5}Result{col 38}# of obs.
{col 5}{hline 41}
{col 5}not matched{col 30}{res}             508
{txt}{col 9}from master{col 30}{res}             508{txt}  (_merge==1)
{col 9}from using{col 30}{res}               0{txt}  (_merge==2)

{col 5}matched{col 30}{res}             102{txt}  (_merge==3)
{col 5}{hline 41}
{com}. {c )-}
{txt}
{com}. else if regexm(c(os),"Windows") == 1 merge 1:1 date using "$pathcovir2\SRIV\Iran SRIV.dta"
{txt}
{com}. 
. drop _merge
{txt}
{com}. 
. 
. 
. * SOLT
. 
. 
. 
. if regexm(c(os),"Mac") == 1 {c -(}
. 
.         merge 1:1 date using "$pathcovir2/SOLT/Iran SOLT"
{res}
{txt}{col 5}Result{col 38}# of obs.
{col 5}{hline 41}
{col 5}not matched{col 30}{res}              90
{txt}{col 9}from master{col 30}{res}              45{txt}  (_merge==1)
{col 9}from using{col 30}{res}              45{txt}  (_merge==2)

{col 5}matched{col 30}{res}             565{txt}  (_merge==3)
{col 5}{hline 41}
{com}. {c )-}
{txt}
{com}. else if regexm(c(os),"Windows") == 1 merge 1:1 date using "$pathcovir2\SOLT\Iran SOLT"
{txt}
{com}. 
. drop _merge 
{txt}
{com}. 
. 
. 
. * GHAN
. 
. if regexm(c(os),"Mac") == 1 {c -(}
. 
.         merge 1:1 date using "$pathcovir2/GHAN/Iran GHAN"
{res}
{txt}{col 5}Result{col 38}# of obs.
{col 5}{hline 41}
{col 5}not matched{col 30}{res}              78
{txt}{col 9}from master{col 30}{res}              21{txt}  (_merge==1)
{col 9}from using{col 30}{res}              57{txt}  (_merge==2)

{col 5}matched{col 30}{res}             634{txt}  (_merge==3)
{col 5}{hline 41}
{com}. {c )-}
{txt}
{com}. else if regexm(c(os),"Windows") == 1 merge 1:1 date using "$pathcovir2\GHAN\Iran GHAN"
{txt}
{com}. 
. drop _merge 
{txt}
{com}. 
. 
. 
. 
. 
. 
. 
. * 
. 
. label var loc_grand_name "Location"
{txt}
{com}. 
. 
. 
. 
. 
. 
. 
. *************************************
. 
. 
. * Cases to deaths ratio
. 
. 
. gen DayCTDMeRaA00S00V00 =  DayCasMeRaA00S00V00 / DayDeaMeRaA00S00V00
{txt}(264 missing values generated)

{com}. 
. label var DayCTDMeRaA00S00V00  "Daily Cases to Deaths S0 JOHN"
{txt}
{com}. 
. gen TotCTDMeRaA00S00V00 =  TotCasMeRaA00S00V00 / TotDeaMeRaA00S00V00
{txt}(263 missing values generated)

{com}. 
. label var TotCTDMeRaA00S00V00  "Total Cases to Deaths S0 JOHN"
{txt}
{com}. 
. 
. 
. 
. gen DayCTDMeRaA01S00V03 =  DayCasMeRaA01S00V03 / DayDeaMeRaA01S00V03
{txt}(643 missing values generated)

{com}. 
. label var DayCTDMeRaA01S00V03  "Daily Cases to Deaths S0 DELP"
{txt}
{com}. 
. gen TotCTDMeRaA01S00V03 =  TotCasMeRaA01S00V03 / TotDeaMeRaA01S00V03
{txt}(642 missing values generated)

{com}. 
. label var TotCTDMeRaA01S00V03  "Total Cases to Deaths S0 DELP"  
{txt}
{com}. 
. 
. 
. 
. gen DayCTDMeRaA02S01V03  =  DayCasMeRaA02S01V03  / DayDeaMeRaA02S01V03 
{txt}(153 missing values generated)

{com}. 
. label var DayCTDMeRaA02S01V03   "Daily Cases to Deaths S1 IHME"
{txt}
{com}. 
. gen TotCTDMeRaA02S01V03  =  TotCasMeRaA02S01V03  / TotDeaMeRaA02S01V03 
{txt}(136 missing values generated)

{com}. 
. label var TotCTDMeRaA02S01V03   "Total Cases to Deaths S1 IHME"
{txt}
{com}. 
. 
. 
. 
. gen DayCTDMeRaA02S02V03 = DayCasMeRaA02S02V03 / DayDeaMeRaA02S02V03  
{txt}(590 missing values generated)

{com}. 
. label var DayCTDMeRaA02S02V03 "Daily Cases to Deaths S2 IHME"
{txt}
{com}. 
. gen TotCTDMeRaA02S02V03 = TotCasMeRaA02S02V03 / TotDeaMeRaA02S02V03  
{txt}(712 missing values generated)

{com}. 
. label var TotCTDMeRaA02S02V03 "Total Cases to Deaths S2 IHME"
{txt}
{com}. 
. 
. 
. 
. gen DayCTDMeRaA02S03V03  = DayCasMeRaA02S03V03  / DayDeaMeRaA02S03V03   
{txt}(590 missing values generated)

{com}. 
. label var DayCTDMeRaA02S03V03  "Daily Cases to Deaths S3 IHME"
{txt}
{com}. 
. gen TotCTDMeRaA02S03V03  = TotCasMeRaA02S03V03  / TotDeaMeRaA02S03V03   
{txt}(712 missing values generated)

{com}. 
. label var TotCTDMeRaA02S03V03  "Total Cases to Deaths S3 IHME"
{txt}
{com}. 
. 
. 
. 
. 
. 
. gen DayCTDMeRaA03S01V07  = DayCasMeRaA03S01V07  / DayDeaMeRaA03S01V07   
{txt}(167 missing values generated)

{com}. 
. label var DayCTDMeRaA03S01V07  "Daily Cases to Deaths S1 IMPE"
{txt}
{com}. 
. gen TotCTDMeRaA03S01V07  = TotCasMeRaA03S01V07  / TotDeaMeRaA03S01V07   
{txt}(164 missing values generated)

{com}. 
. label var TotCTDMeRaA03S01V07  "Total Cases to Deaths S1 IMPE"
{txt}
{com}. 
. 
. 
. gen DayCTDMeRaA03S02V07  = DayCasMeRaA03S02V07  / DayDeaMeRaA03S02V07   
{txt}(167 missing values generated)

{com}. 
. label var DayCTDMeRaA03S02V07  "Daily Cases to Deaths S2 IMPE"
{txt}
{com}. 
. gen TotCTDMeRaA03S02V07  = TotCasMeRaA03S02V07  / TotDeaMeRaA03S02V07   
{txt}(164 missing values generated)

{com}. 
. label var TotCTDMeRaA03S02V07  "Total Cases to Deaths S2 IMPE"
{txt}
{com}. 
. 
. 
. gen DayCTDMeRaA03S03V07  = DayCasMeRaA03S03V07  / DayDeaMeRaA03S03V07   
{txt}(167 missing values generated)

{com}. 
. label var DayCTDMeRaA03S03V07  "Daily Cases to Deaths S3 IMPE"
{txt}
{com}. 
. gen TotCTDMeRaA03S03V07  = TotCasMeRaA03S03V07  / TotDeaMeRaA03S03V07   
{txt}(164 missing values generated)

{com}. 
. label var TotCTDMeRaA03S03V07  "Total Cases to Deaths S3 IMPE"
{txt}
{com}. 
. 
. 
. 
. 
. gen DayCTDMeRaA04S00V02  = DayCasMeRaA04S00V02  / DayDeaMeRaA04S00V02   
{txt}(223 missing values generated)

{com}. 
. label var DayCTDMeRaA04S00V02  "Daily Cases to Deaths S0 LANL"
{txt}
{com}. 
. gen TotCTDMeRaA04S00V02  = TotCasMeRaA04S00V02  / TotDeaMeRaA04S00V02   
{txt}(222 missing values generated)

{com}. 
. label var TotCTDMeRaA04S00V02  "Total Cases to Deaths S0 LANL"
{txt}
{com}. 
. 
. 
. 
. 
. 
. gen DayCTDMeRaA05S00V02  = DayCasMeRaA05S00V02  / DayDeaMeRaA05S00V02   
{txt}(612 missing values generated)

{com}. 
. label var DayCTDMeRaA05S00V02  "Daily Cases to Deaths S0 SRIV"
{txt}
{com}. 
. gen TotCTDMeRaA05S00V02  = TotCasMeRaA05S00V02  / TotDeaMeRaA05S00V02   
{txt}(611 missing values generated)

{com}. 
. label var TotCTDMeRaA05S00V02  "Total Cases to Deaths S0 SRIV"
{txt}
{com}. 
. 
. 
. 
. ***********************
. 
. * daily deaths estimated to reported  
. 
.     
. gen DayDERMeRaA00S00V00 = DayDeaMeRaA00S00V00 / DayDeaMeRaA00S00V00
{txt}(264 missing values generated)

{com}. 
. label var DayDERMeRaA00S00V00 "Daily Deaths estim to reported JOHN = 1" 
{txt}
{com}. 
. 
. gen DayDERMeRaA01S00V03 = DayDeaMeRaA01S00V03 / DayDeaMeRaA00S00V00
{txt}(707 missing values generated)

{com}. 
. label var DayDERMeRaA01S00V03 "Daily Deaths estim to reported Mean DELP S0 V3"
{txt}
{com}. 
. line DayDeaMeRaA01S00V03  DayDeaMeRaA00S00V00 date
{res}{txt}
{com}. 
. 
. 
. 
. gen DayDERMeRaA02S01V03 = DayDeaMeRaA02S01V03 / DayDeaMeRaA00S00V00
{txt}(264 missing values generated)

{com}. 
. label var DayDERMeRaA02S01V03 "Daily Deaths estim to reported Mean not smoothed IHME S1"
{txt}
{com}. 
. 
. gen DayDERMeRaA02S02V03 = DayDeaMeRaA02S02V03 / DayDeaMeRaA00S00V00
{txt}(264 missing values generated)

{com}. 
. label var DayDERMeRaA02S02V03 "Daily Deaths estim to reported Mean not smoothed IHME S2"
{txt}
{com}. 
. 
. gen DayDERMeRaA02S03V03 = DayDeaMeRaA02S03V03 / DayDeaMeRaA00S00V00
{txt}(264 missing values generated)

{com}. 
. label var DayDERMeRaA02S03V03 "Daily Deaths estim to reported Mean not smoothed IHME S3"
{txt}
{com}. 
. 
. 
. gen DayDERMeRaA03S01V07 = DayDeaMeRaA03S01V07 / DayDeaMeRaA00S00V00
{txt}(264 missing values generated)

{com}. 
. label var DayDERMeRaA03S01V07 "Daily Deaths estim to reported Mean S1 IMPE"
{txt}
{com}. 
. 
. gen DayDERMeRaA03S02V07 = DayDeaMeRaA03S02V07 / DayDeaMeRaA00S00V00
{txt}(264 missing values generated)

{com}. 
. label var DayDERMeRaA03S02V07 "Daily Deaths estim to reported Mean S2 IMPE"
{txt}
{com}. 
. 
. gen DayDERMeRaA03S03V07 = DayDeaMeRaA03S03V07 / DayDeaMeRaA00S00V00
{txt}(264 missing values generated)

{com}. 
. label var DayDERMeRaA03S03V07 "Daily Deaths estim to reported Mean S3 IMPE"
{txt}
{com}. 
. 
. 
. gen DayDERMeRaA04S00V02 = DayDeaMeRaA04S00V02 / DayDeaMeRaA00S00V00
{txt}(264 missing values generated)

{com}. 
. label var DayDERMeRaA04S00V02 "Daily Deaths estim to reported to Deaths S0 LANL"
{txt}
{com}. 
. 
. 
. gen DayDERMeRaA05S00V02  = DayDeaMeRaA05S00V02 / DayDeaMeRaA00S00V00
{txt}(705 missing values generated)

{com}. 
. label var DayDERMeRaA05S00V02 "Daily Deaths estim to reported S0 SRIV"
{txt}
{com}. 
. 
. 
. 
. 
. 
. * daily cases estimated to reported  
. 
. 
. gen DayCERMeRaA00S00V00 = DayCasMeRaA00S00V00 / DayCasMeRaA00S00V00
{txt}(263 missing values generated)

{com}. 
. label var DayCERMeRaA00S00V00 "Daily Cases estim to reported JOHN = 1" 
{txt}
{com}. 
. 
. 
. gen DayCERMeRaA01S00V03 = DayCasMeRaA01S00V03 / DayCasMeRaA00S00V00
{txt}(707 missing values generated)

{com}. 
. label var DayCERMeRaA01S00V03 "Daily Cases estim to reported Mean DELP S0 V3"
{txt}
{com}. 
. 
. 
. gen DayCERMeRaA02S01V03 = DayCasMeRaA02S01V03 / DayCasMeRaA00S00V00
{txt}(263 missing values generated)

{com}. 
. label var DayCERMeRaA02S01V03 "Daily Cases estim to reported Mean not smoothed IHME S1"
{txt}
{com}. 
. 
. gen DayCERMeRaA02S02V03 = DayCasMeRaA02S02V03 / DayCasMeRaA00S00V00
{txt}(702 missing values generated)

{com}. 
. label var DayCERMeRaA02S02V03 "Daily Cases estim to reported Mean not smoothed IHME S2"
{txt}
{com}. 
. 
. gen DayCERMeRaA02S03V03 = DayCasMeRaA02S03V03 / DayCasMeRaA00S00V00
{txt}(702 missing values generated)

{com}. 
. label var DayCERMeRaA02S03V03 "Daily Cases estim to reported Mean not smoothed IHME S3"
{txt}
{com}. 
. 
. 
. gen DayCERMeRaA03S01V07 = DayCasMeRaA03S01V07 / DayCasMeRaA00S00V00
{txt}(263 missing values generated)

{com}. 
. label var DayCERMeRaA03S01V07 "Daily Cases estim to reported Mean S1 IMPE"
{txt}
{com}. 
. 
. gen DayCERMeRaA03S02V07 = DayCasMeRaA03S02V07 / DayCasMeRaA00S00V00
{txt}(263 missing values generated)

{com}. 
. label var DayCERMeRaA03S02V07 "Daily Cases estim to reported Mean S2 IMPE"
{txt}
{com}. 
. 
. gen DayCERMeRaA03S03V07 = DayCasMeRaA03S03V07 / DayCasMeRaA00S00V00
{txt}(263 missing values generated)

{com}. 
. label var DayCERMeRaA03S03V07 "Daily Cases estim to reported Mean S3 IMPE"
{txt}
{com}. 
. 
. 
. gen DayCERMeRaA04S00V02 = DayCasMeRaA04S00V02 / DayCasMeRaA00S00V00
{txt}(263 missing values generated)

{com}. 
. label var DayCERMeRaA04S00V02 "Daily Cases estim to reported to Cases S0 LANL"
{txt}
{com}. 
. 
. 
. gen DayCERMeRaA05S00V02  = DayCasMeRaA05S00V02 / DayCasMeRaA00S00V00
{txt}(705 missing values generated)

{com}. 
. label var DayCERMeRaA05S00V02 "Daily Cases estim to reported S0 SRIV"
{txt}
{com}. 
. 
. 
. 
. 
. 
. * Total deaths estimated to reported  
. 
. 
. gen TotDERMeRaA00S00V00 = TotDeaMeRaA00S00V00 / TotDeaMeRaA00S00V00
{txt}(263 missing values generated)

{com}. 
. label var TotDERMeRaA00S00V00 "Total Deaths estim to reported JOHN = 1" 
{txt}
{com}. 
. 
. 
. gen TotDERMeRaA01S00V03 = TotDeaMeRaA01S00V03 / TotDeaMeRaA00S00V00
{txt}(706 missing values generated)

{com}. 
. label var TotDERMeRaA01S00V03 "Total Deaths estim to reported Mean DELP S0 V3"
{txt}
{com}. 
. 
. 
. gen TotDERMeRaA02S01V03 = TotDeaMeRaA02S01V03 / TotDeaMeRaA00S00V00
{txt}(263 missing values generated)

{com}. 
. label var TotDERMeRaA02S01V03 "Total Deaths estim to reported Mean not smoothed IHME S1"
{txt}
{com}. 
. 
. gen TotDERMeRaA02S02V03 = TotDeaMeRaA02S02V03 / TotDeaMeRaA00S00V00
{txt}(263 missing values generated)

{com}. 
. label var TotDERMeRaA02S02V03 "Total Deaths estim to reported Mean not smoothed IHME S2"
{txt}
{com}. 
. 
. gen TotDERMeRaA02S03V03 = TotDeaMeRaA02S03V03 / TotDeaMeRaA00S00V00
{txt}(263 missing values generated)

{com}. 
. label var TotDERMeRaA02S03V03 "Total Deaths estim to reported Mean not smoothed IHME S3"
{txt}
{com}. 
. 
. 
. gen TotDERMeRaA03S01V07 = TotDeaMeRaA03S01V07 / TotDeaMeRaA00S00V00
{txt}(263 missing values generated)

{com}. 
. label var TotDERMeRaA03S01V07 "Total Deaths estim to reported Mean S1 IMPE"
{txt}
{com}. 
. 
. gen TotDERMeRaA03S02V07 = TotDeaMeRaA03S02V07 / TotDeaMeRaA00S00V00
{txt}(263 missing values generated)

{com}. 
. label var TotDERMeRaA03S02V07 "Total Deaths estim to reported Mean S2 IMPE"
{txt}
{com}. 
. 
. gen TotDERMeRaA03S03V07 = TotDeaMeRaA03S03V07 / TotDeaMeRaA00S00V00
{txt}(263 missing values generated)

{com}. 
. label var TotDERMeRaA03S03V07 "Total Deaths estim to reported Mean S3 IMPE"
{txt}
{com}. 
. 
. 
. gen TotDERMeRaA04S00V02 = TotDeaMeRaA04S00V02 / TotDeaMeRaA00S00V00
{txt}(263 missing values generated)

{com}. 
. label var TotDERMeRaA04S00V02 "Total Deaths estim to reported to Deaths S0 LANL"
{txt}
{com}. 
. 
. 
. gen TotDERMeRaA05S00V02  = TotDeaMeRaA05S00V02 / TotDeaMeRaA00S00V00
{txt}(704 missing values generated)

{com}. 
. label var TotDERMeRaA05S00V02 "Total Deaths estim to reported S0 SRIV"
{txt}
{com}. 
. 
. 
. 
. 
. 
. * Total cases estimated to reported  
. 
. 
. gen TotCERMeRaA00S00V00 = TotCasMeRaA00S00V00 / TotCasMeRaA00S00V00
{txt}(263 missing values generated)

{com}. 
. label var TotCERMeRaA00S00V00 "Total Cases estim to reported JOHN = 1" 
{txt}
{com}. 
. 
. gen TotCERMeRaA01S00V03 = TotCasMeRaA01S00V03 / TotCasMeRaA00S00V00
{txt}(706 missing values generated)

{com}. 
. label var TotCERMeRaA01S00V03 "Total Cases estim to reported Mean DELP S0 V3"
{txt}
{com}. 
. 
. 
. gen TotCERMeRaA02S01V03 = TotCasMeRaA02S01V03 / TotCasMeRaA00S00V00
{txt}(263 missing values generated)

{com}. 
. label var TotCERMeRaA02S01V03 "Total Cases estim to reported Mean not smoothed IHME S1"
{txt}
{com}. 
. 
. gen TotCERMeRaA02S02V03 = TotCasMeRaA02S02V03 / TotCasMeRaA00S00V00
{txt}(712 missing values generated)

{com}. 
. label var TotCERMeRaA02S02V03 "Total Cases estim to reported Mean not smoothed IHME S2"
{txt}
{com}. 
. 
. gen TotCERMeRaA02S03V03 = TotCasMeRaA02S03V03 / TotCasMeRaA00S00V00
{txt}(712 missing values generated)

{com}. 
. label var TotCERMeRaA02S03V03 "Total Cases estim to reported Mean not smoothed IHME S3"
{txt}
{com}. 
. 
. 
. gen TotCERMeRaA03S01V07 = TotCasMeRaA03S01V07 / TotCasMeRaA00S00V00
{txt}(263 missing values generated)

{com}. 
. label var TotCERMeRaA03S01V07 "Total Cases estim to reported Mean S1 IMPE"
{txt}
{com}. 
. 
. gen TotCERMeRaA03S02V07 = TotCasMeRaA03S02V07 / TotCasMeRaA00S00V00
{txt}(263 missing values generated)

{com}. 
. label var TotCERMeRaA03S02V07 "Total Cases estim to reported Mean S2 IMPE"
{txt}
{com}. 
. 
. gen TotCERMeRaA03S03V07 = TotCasMeRaA03S03V07 / TotCasMeRaA00S00V00
{txt}(263 missing values generated)

{com}. 
. label var TotCERMeRaA03S03V07 "Total Cases estim to reported Mean S3 IMPE"
{txt}
{com}. 
. 
. 
. gen TotCERMeRaA04S00V02 = TotCasMeRaA04S00V02 / TotCasMeRaA00S00V00
{txt}(263 missing values generated)

{com}. 
. label var TotCERMeRaA04S00V02 "Total Cases estim to reported to Cases S0 LANL"
{txt}
{com}. 
. 
. 
. gen TotCERMeRaA05S00V02  = TotCasMeRaA05S00V02 / TotCasMeRaA00S00V00
{txt}(704 missing values generated)

{com}. 
. label var TotCERMeRaA05S00V02 "Total Cases estim to reported S0 SRIV"
{txt}
{com}. 
. 
. 
. 
. *
. 
. di in red "********* Description of vars in final combined file Iran.dta *********" 
{res}{err}********* Description of vars in final combined file Iran.dta *********
{txt}
{com}. 
. 
. desc, fullnames

{txt}Contains data from {res}/Users/farshadpourmalek/Downloads/covir2-main/20210507/code/JOHN/Iran JOHN.dta
{txt}  obs:{res}           712                          
{txt} vars:{res}           497                          13 May 2021 02:02
{txt} size:{res}     1,399,792                          
{txt}{hline}
              storage   display    value
variable name   type    format     label      variable label
{hline}
{p 0 48}{res}{bind:date           }{txt}{bind: int     }{bind:{txt}%td..     }{space 1}{bind:         }{bind:  }{res}{res}{p_end}
{p 0 48}{bind:loc_grand_name }{txt}{bind: str4    }{bind:{txt}%9s       }{space 1}{bind:         }{bind:  }{res}{res}Location{p_end}
{p 0 48}DayDeaMeRaA00S00V00{p_end}
{p 0 48}{space 15}{txt}{bind: int     }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Daily Deaths JOHN{p_end}
{p 0 48}TotDeaMeRaA00S00V00{p_end}
{p 0 48}{space 15}{txt}{bind: long    }{bind:{txt}%10.0g    }{space 1}{bind:         }{bind:  }{res}{res}Total Deaths JOHN{p_end}
{p 0 48}DayDeaMeRaA00S00V00_CF2{p_end}
{p 0 48}{space 15}{txt}{bind: int     }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Daily Deaths JOHN correction factor 2{p_end}
{p 0 48}DayDeaMeRaA00S00V00_CF5{p_end}
{p 0 48}{space 15}{txt}{bind: int     }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Daily Deaths JOHN correction factor 5{p_end}
{p 0 48}TotDeaMeRaA00S00V00_CF2{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Total Deaths JOHN correction factor 2{p_end}
{p 0 48}TotDeaMeRaA00S00V00_CF5{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Total Deaths JOHN correction factor 5{p_end}
{p 0 48}DayCasMeRaA00S00V00{p_end}
{p 0 48}{space 15}{txt}{bind: int     }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Daily Cases JOHN{p_end}
{p 0 48}TotCasMeRaA00S00V00{p_end}
{p 0 48}{space 15}{txt}{bind: long    }{bind:{txt}%10.0g    }{space 1}{bind:         }{bind:  }{res}{res}Total Cases JOHN{p_end}
{p 0 48}DayCasMeRaA00S00V00_CF2{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Daily Cases JOHN correction factor 2{p_end}
{p 0 48}DayCasMeRaA00S00V00_CF5{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Daily Cases JOHN correction factor 5{p_end}
{p 0 48}TotCasMeRaA00S00V00_CF2{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Total Cases JOHN correction factor 2{p_end}
{p 0 48}TotCasMeRaA00S00V00_CF5{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Total Cases JOHN correction factor 5{p_end}
{p 0 48}TotRecMeRaA00S00V00{p_end}
{p 0 48}{space 15}{txt}{bind: long    }{bind:{txt}%10.0g    }{space 1}{bind:         }{bind:  }{res}{res}Total RECovered JOHN{p_end}
{p 0 48}DayRecMeRaA00S00V00{p_end}
{p 0 48}{space 15}{txt}{bind: int     }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Daily RECovered JOHN{p_end}
{p 0 48}DayCfrMeRaA00S00V00{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Daily CFR JOHN{p_end}
{p 0 48}DayActMeRaA00S00V00{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Daily Active JOHN{p_end}
{p 0 48}DayDeMMeRaA00S00V00{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Daily deaths mean JOHN DayDeM{p_end}
{p 0 48}DayCaMMeRaA00S00V00{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Daily cases mean JOHN DayCaM{p_end}
{p 0 48}DayCbDMeRaA00S00V00{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Daily cases mean div by daily deaths mean JOHN DayCbD{p_end}
{p 0 48}DayDeaMeRaA00multip{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Daily deaths scaled (times means of cases by deaths) only for visualization JOHN{p_end}
{p 0 48}TotDeaMeRaA01S00V03{p_end}
{p 0 48}{space 15}{txt}{bind: long    }{bind:{txt}%12.0g    }{space 1}{bind:         }{bind:  }{res}{res}Total Deaths Mean DELP S0 V3{p_end}
{p 0 48}TotDeaLoRaA01S00V03{p_end}
{p 0 48}{space 15}{txt}{bind: long    }{bind:{txt}%12.0g    }{space 1}{bind:         }{bind:  }{res}{res}Total Deaths Lower DELP S0 V3{p_end}
{p 0 48}TotDeaUpRaA01S00V03{p_end}
{p 0 48}{space 15}{txt}{bind: long    }{bind:{txt}%12.0g    }{space 1}{bind:         }{bind:  }{res}{res}Total Deaths Upper DELP S0 V3{p_end}
{p 0 48}DayDeaMeRaA01S00V03{p_end}
{p 0 48}{space 15}{txt}{bind: int     }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Daily Deaths Mean DELP S0 V3{p_end}
{p 0 48}DayDeaLoRaA01S00V03{p_end}
{p 0 48}{space 15}{txt}{bind: byte    }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Daily Deaths Lower DELP S0 V3{p_end}
{p 0 48}DayDeaUpRaA01S00V03{p_end}
{p 0 48}{space 15}{txt}{bind: int     }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Daily Deaths Upper DELP S0 V3{p_end}
{p 0 48}TotCasMeRaA01S00V03{p_end}
{p 0 48}{space 15}{txt}{bind: long    }{bind:{txt}%12.0g    }{space 1}{bind:         }{bind:  }{res}{res}Total Cases Mean DELP S0 V3{p_end}
{p 0 48}TotCasLoRaA01S00V03{p_end}
{p 0 48}{space 15}{txt}{bind: long    }{bind:{txt}%12.0g    }{space 1}{bind:         }{bind:  }{res}{res}Total Cases Lower DELP S0 V3{p_end}
{p 0 48}TotCasUpRaA01S00V03{p_end}
{p 0 48}{space 15}{txt}{bind: long    }{bind:{txt}%12.0g    }{space 1}{bind:         }{bind:  }{res}{res}Total Cases Upper DELP S0 V3{p_end}
{p 0 48}DayCasMeRaA01S00V03{p_end}
{p 0 48}{space 15}{txt}{bind: int     }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Daily Cases Mean DELP S0 V3{p_end}
{p 0 48}DayCasLoRaA01S00V03{p_end}
{p 0 48}{space 15}{txt}{bind: int     }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Daily Cases Lower DELP S0 V3{p_end}
{p 0 48}DayCasUpRaA01S00V03{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Daily Cases Upper DELP S0 V3{p_end}
{p 0 48}DayActMeRaA01S00V03{p_end}
{p 0 48}{space 15}{txt}{bind: long    }{bind:{txt}%12.0g    }{space 1}{bind:         }{bind:  }{res}{res}Daily Cases Active Mean DELP S0 V3{p_end}
{p 0 48}DayHosMeRaA01S00V03{p_end}
{p 0 48}{space 15}{txt}{bind: int     }{bind:{txt}%12.0g    }{space 1}{bind:         }{bind:  }{res}{res}Daily Cases Active Hospitalized Mean DELP S0 V3{p_end}
{p 0 48}DayVenMeRaA01S00V03{p_end}
{p 0 48}{space 15}{txt}{bind: int     }{bind:{txt}%12.0g    }{space 1}{bind:         }{bind:  }{res}{res}Daily Cases Active Ventilated Mean DELP S0 V3{p_end}
{p 0 48}TotHosMeRaA01S00V03{p_end}
{p 0 48}{space 15}{txt}{bind: long    }{bind:{txt}%12.0g    }{space 1}{bind:         }{bind:  }{res}{res}Total Cases Active Mean DELP S0 V3{p_end}
{p 0 48}DayCfrMeRaA01S00V03{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Daily CFR Mean DELP S0 V3{p_end}
{p 0 48}DayCfrLoRaA01S00V03{p_end}
{p 0 48}{space 15}{txt}{bind: byte    }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Daily CFR Lower DELP S0 V3{p_end}
{p 0 48}DayCfrUpRaA01S00V03{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Daily CFR Upper DELP S0 V3{p_end}
{p 0 48}DayDeMMeRaA01S00V03{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Daily deaths mean DELP DayDeM{p_end}
{p 0 48}DayCaMMeRaA01S00V03{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Daily cases mean DELP DayCaM{p_end}
{p 0 48}DayCbDMeRaA01S00V03{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Daily cases mean div by daily deaths mean DELP DayCbD{p_end}
{p 0 48}DayDMuMeRaA01S00V03{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Daily deaths scaled (times means of cases by deaths) only for visualization DELP{p_end}
{p 0 48}DayBedMeSmA02S01V03{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Daily Beds needed Mean IHME S1{p_end}
{p 0 48}DayBedUpSmA02S01V03{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Daily Beds needed Upper IHME S1{p_end}
{p 0 48}DayBedLoSmA02S01V03{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Daily Beds needed Lower IHME S1{p_end}
{p 0 48}DayIcuMeSmA02S01V03{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Daily ICU beds needed Mean IHME S1{p_end}
{p 0 48}DayIcuUpSmA02S01V03{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Daily ICU beds needed Upper IHME S1{p_end}
{p 0 48}DayIcuLoSmA02S01V03{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Daily ICU beds needed Lower IHME S1{p_end}
{p 0 48}DayAdmMeSmA02S01V03{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Daily hospital admissions Mean IHME S1{p_end}
{p 0 48}DayAdmUpSmA02S01V03{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Daily hospital admissions Upper IHME S1{p_end}
{p 0 48}DayAdmLoSmA02S01V03{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Daily hospital admissions Lower IHME S1{p_end}
{p 0 48}DayIcnMeSmA02S01V03{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Daily new people going to ICU Mean IHME S1{p_end}
{p 0 48}DayIcnUpSmA02S01V03{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Daily new people going to ICU Upper IHME S1{p_end}
{p 0 48}DayIcnLoSmA02S01V03{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Daily new people going to ICU Lower IHME S1{p_end}
{p 0 48}DayDeaMeRaA02S01V03{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Daily Deaths Mean not smoothed IHME S1{p_end}
{p 0 48}DayDeaLoRaA02S01V03{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Daily Deaths Lower not smoothed IHME S1{p_end}
{p 0 48}DayDeaUpRaA02S01V03{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Daily Deaths Upper not smoothed IHME S1{p_end}
{p 0 48}TotDeaMeRaA02S01V03{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Total Deaths Mean not smoothed IHME S1{p_end}
{p 0 48}TotDeaLoRaA02S01V03{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Total Deaths Lower not smoothed IHME S1{p_end}
{p 0 48}TotDeaUpRaA02S01V03{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Total Deaths Upper not smoothed IHME S1{p_end}
{p 0 48}DayDeaMeSmA02S01V03{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Daily Deaths Mean smoothed IHME S1{p_end}
{p 0 48}DayDeaLoSmA02S01V03{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Daily Deaths Lower smoothed IHME S1{p_end}
{p 0 48}DayDeaUpSmA02S01V03{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Daily Deaths Upper smoothed IHME S1{p_end}
{p 0 48}TotDeaMeSmA02S01V03{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Total Deaths Mean smoothed IHME S1{p_end}
{p 0 48}TotDeaLoSmA02S01V03{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Total Deaths Lower smoothed IHME S1{p_end}
{p 0 48}TotDeaUpSmA02S01V03{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Total Deaths Upper smoothed IHME S1{p_end}
{p 0 48}deaths_reported_mean{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}{p_end}
{p 0 48}deaths_reported_lower{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}{p_end}
{p 0 48}deaths_reported_upper{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}{p_end}
{p 0 48}totdea_reported_mean{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}{p_end}
{p 0 48}totdea_reported_lower{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}{p_end}
{p 0 48}totdea_reported_upper{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}{p_end}
{p 0 48}deaths_reported_mean_smoothed{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}{p_end}
{p 0 48}deaths_reported_lower_smoothed{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}{p_end}
{p 0 48}deaths_reported_upper_smoothed{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}{p_end}
{p 0 48}totdea_reported_mean_smoothed{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}{p_end}
{p 0 48}totdea_reported_lower_smoothed{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}{p_end}
{p 0 48}totdea_reported_upper_smoothed{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}{p_end}
{p 0 48}TotTesMeSmA02S01V03{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Total Tests Mean IHME S1{p_end}
{p 0 48}DayCasMeRaA02S01V03{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Daily Cases Mean not smoothed IHME S1{p_end}
{p 0 48}DayCasLoRaA02S01V03{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Daily Cases Lower not smoothed IHME S1{p_end}
{p 0 48}DayCasUpRaA02S01V03{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Daily Cases Upper not smoothed IHME S1{p_end}
{p 0 48}TotCasMeRaA02S01V03{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Total Cases Mean not smoothed IHME S1{p_end}
{p 0 48}TotCasUpRaA02S01V03{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Total Cases Upper not smoothed IHME S1{p_end}
{p 0 48}TotCasLoRaA02S01V03{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Total Cases Lower not smoothed IHME S1{p_end}
{p 0 48}TotSerMeSmA02S01V03{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Total seroprevalence Mean IHME S1{p_end}
{p 0 48}TotSerLoSmA02S01V03{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Total seroprevalence Lower IHME S1{p_end}
{p 0 48}TotSerUpSmA02S01V03{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Total seroprevalence Upper IHME S1{p_end}
{p 0 48}DayDeaMeRaA02S02V03{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Daily Deaths Mean not smoothed IHME S2{p_end}
{p 0 48}DayDeaLoRaA02S02V03{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Daily Deaths Lower not smoothed IHME S2{p_end}
{p 0 48}DayDeaUpRaA02S02V03{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Daily Deaths Upper not smoothed IHME S2{p_end}
{p 0 48}TotDeaMeRaA02S02V03{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Total Deaths Mean not smoothed IHME S2{p_end}
{p 0 48}TotDeaLoRaA02S02V03{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Total Deaths Lower not smoothed IHME S2{p_end}
{p 0 48}TotDeaUpRaA02S02V03{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Total Deaths Upper not smoothed IHME S2{p_end}
{p 0 48}DayDeaMeSmA02S02V03{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Daily Deaths Mean smoothed IHME S2{p_end}
{p 0 48}DayDeaLoSmA02S02V03{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Daily Deaths Lower smoothed IHME S2{p_end}
{p 0 48}DayDeaUpSmA02S02V03{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Daily Deaths Upper smoothed IHME S2{p_end}
{p 0 48}TotDeaMeSmA02S02V03{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Total Deaths Mean smoothed IHME S2{p_end}
{p 0 48}TotDeaLoSmA02S02V03{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Total Deaths Lower smoothed IHME S2{p_end}
{p 0 48}TotDeaUpSmA02S02V03{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Total Deaths Upper smoothed IHME S2{p_end}
{p 0 48}TotTesMeSmA02S02V03{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Total Tests Mean IHME S2{p_end}
{p 0 48}DayCasMeRaA02S02V03{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Daily Cases Mean not smoothed IHME S2{p_end}
{p 0 48}DayCasLoRaA02S02V03{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Daily Cases Lower not smoothed IHME S2{p_end}
{p 0 48}DayCasUpRaA02S02V03{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Daily Cases Upper not smoothed IHME S2{p_end}
{p 0 48}TotCasMeRaA02S02V03{p_end}
{p 0 48}{space 15}{txt}{bind: byte    }{bind:{txt}%8.0g     }{space 1}{bind:         }{bind:  }{res}{res}Total Cases Mean not smoothed IHME S2{p_end}
{p 0 48}TotCasUpRaA02S02V03{p_end}
{p 0 48}{space 15}{txt}{bind: byte    }{bind:{txt}%8.0g     }{space 1}{bind:         }{bind:  }{res}{res}Total Cases Upper not smoothed IHME S2{p_end}
{p 0 48}TotCasLoRaA02S02V03{p_end}
{p 0 48}{space 15}{txt}{bind: byte    }{bind:{txt}%8.0g     }{space 1}{bind:         }{bind:  }{res}{res}Total Cases Lower not smoothed IHME S2{p_end}
{p 0 48}TotSerMeSmA02S02V03{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Total seroprevalence Mean IHME S2{p_end}
{p 0 48}TotSerLoSmA02S02V03{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Total seroprevalence Lower IHME S2{p_end}
{p 0 48}TotSerUpSmA02S02V03{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Total seroprevalence Upper IHME S2{p_end}
{p 0 48}DayDeaMeRaA02S03V03{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Daily Deaths Mean not smoothed IHME S3{p_end}
{p 0 48}DayDeaLoRaA02S03V03{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Daily Deaths Lower not smoothed IHME S3{p_end}
{p 0 48}DayDeaUpRaA02S03V03{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Daily Deaths Upper not smoothed IHME S3{p_end}
{p 0 48}TotDeaMeRaA02S03V03{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Total Deaths Mean not smoothed IHME S3{p_end}
{p 0 48}TotDeaLoRaA02S03V03{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Total Deaths Lower not smoothed IHME S3{p_end}
{p 0 48}TotDeaUpRaA02S03V03{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Total Deaths Upper not smoothed IHME S3{p_end}
{p 0 48}DayDeaMeSmA02S03V03{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Daily Deaths Mean smoothed IHME S3{p_end}
{p 0 48}DayDeaLoSmA02S03V03{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Daily Deaths Lower smoothed IHME S3{p_end}
{p 0 48}DayDeaUpSmA02S03V03{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Daily Deaths Upper smoothed IHME S3{p_end}
{p 0 48}TotDeaMeSmA02S03V03{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Total Deaths Mean smoothed IHME S3{p_end}
{p 0 48}TotDeaLoSmA02S03V03{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Total Deaths Lower smoothed IHME S3{p_end}
{p 0 48}TotDeaUpSmA02S03V03{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Total Deaths Upper smoothed IHME S3{p_end}
{p 0 48}TotTesMeSmA02S03V03{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Total Tests Mean IHME S3{p_end}
{p 0 48}DayCasMeRaA02S03V03{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Daily Cases Mean not smoothed IHME S3{p_end}
{p 0 48}DayCasLoRaA02S03V03{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Daily Cases Lower not smoothed IHME S3{p_end}
{p 0 48}DayCasUpRaA02S03V03{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Daily Cases Upper not smoothed IHME S3{p_end}
{p 0 48}TotCasMeRaA02S03V03{p_end}
{p 0 48}{space 15}{txt}{bind: byte    }{bind:{txt}%8.0g     }{space 1}{bind:         }{bind:  }{res}{res}Total Cases Mean not smoothed IHME S3{p_end}
{p 0 48}TotCasUpRaA02S03V03{p_end}
{p 0 48}{space 15}{txt}{bind: byte    }{bind:{txt}%8.0g     }{space 1}{bind:         }{bind:  }{res}{res}Total Cases Upper not smoothed IHME S3{p_end}
{p 0 48}TotCasLoRaA02S03V03{p_end}
{p 0 48}{space 15}{txt}{bind: byte    }{bind:{txt}%8.0g     }{space 1}{bind:         }{bind:  }{res}{res}Total Cases Lower not smoothed IHME S3{p_end}
{p 0 48}TotSerMeSmA02S03V03{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Total seroprevalence Mean IHME S3{p_end}
{p 0 48}TotSerLoSmA02S03V03{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Total seroprevalence Lower IHME S3{p_end}
{p 0 48}TotSerUpSmA02S03V03{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Total seroprevalence Upper IHME S3{p_end}
{p 0 48}deaths_mean_p100k_rate{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Daily deaths mean raw per 100k rate IHME{p_end}
{p 0 48}deaths_lower_p100k_rate{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Daily deaths lower raw per 100k rate IHME{p_end}
{p 0 48}deaths_upper_p100k_rate{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Daily deaths upper raw per 100k rate IHME{p_end}
{p 0 48}totdea_mean_p100k_rate{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Total deaths mean per raw 100k rate IHME{p_end}
{p 0 48}totdea_lower_p100k_rate{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Total deaths mean per raw 100k rate IHME{p_end}
{p 0 48}totdea_upper_p100k_rate{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Total deaths upper per raw 100k rate IHME{p_end}
{p 0 48}deaths_mean_smoothed_p100k_rate{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Daily deaths mean smoothed per 100k rate IHME{p_end}
{p 0 48}deaths_lower_smoothed_p100k_rate{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Daily deaths lower smoothed per 100k rate IHME{p_end}
{p 0 48}deaths_upper_smoothed_p100k_rate{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Daily deaths upper smoothed per 100k rate IHME{p_end}
{p 0 48}totdea_mean_smoothed_p100k_rate{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Total deaths mean smoothed per 100k rate IHME{p_end}
{p 0 48}totdea_lower_smoothed_p100k_rate{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Total deaths lower smoothed per 100k rate IHME{p_end}
{p 0 48}totdea_upper_smoothed_p100k_rate{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Total deaths upper smoothed per 100k rate IHME{p_end}
{p 0 48}deaths_reported_mean_p100k_rate{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}{p_end}
{p 0 48}deaths_reported_lower_p100k_rate{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}{p_end}
{p 0 48}deaths_reported_upper_p100k_rate{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}{p_end}
{p 0 48}totdea_reported_mean_p100k_rate{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}{p_end}
{p 0 48}totdea_reported_lower_p100k_rate{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}{p_end}
{p 0 48}totdea_reported_upper_p100k_rate{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}{p_end}
{p 0 48}deaths_reported_mean_smoothed_p1{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}deaths_reported_mean_smoothed_p100k_rate{p_end}
{p 0 48}deaths_reported_lower_smoothed_p{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}deaths_reported_lower_smoothed_p100k_rate{p_end}
{p 0 48}deaths_reported_upper_smoothed_p{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}deaths_reported_upper_smoothed_p100k_rate{p_end}
{p 0 48}totdea_reported_mean_smoothed_p1{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}totdea_reported_mean_smoothed_p100k_rate{p_end}
{p 0 48}totdea_reported_lower_smoothed_p{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}totdea_reported_lower_smoothed_p100k_rate{p_end}
{p 0 48}totdea_reported_upper_smoothed_p{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}totdea_reported_upper_smoothed_p100k_rate{p_end}
{p 0 48}confirmed_infections_p100k_rate{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}confirmed infections per 100k rate IHME{p_end}
{p 0 48}est_infections_mean_p100k_rate{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}estimated infections mean per 100k rate IHME{p_end}
{p 0 48}est_infections_lower_p100k_rate{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}estimated infections lower per 100k rate IHME{p_end}
{p 0 48}est_infections_upper_p100k_rate{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}estimated infections upper per 100k rate IHME{p_end}
{p 0 48}DayCfrMeRaA02S01V03{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Daily CFR Mean Raw IHME S1{p_end}
{p 0 48}DayCfrLoRaA02S01V03{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Daily CFR Lower Raw IHME S1{p_end}
{p 0 48}DayCfrUpRaA02S01V03{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Daily CFR Upper Raw IHME S1{p_end}
{p 0 48}DayCfrMeRaA02S02V03{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Daily CFR Mean Raw IHME S2{p_end}
{p 0 48}DayCfrLoRaA02S02V03{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Daily CFR Lower Raw IHME S2{p_end}
{p 0 48}DayCfrUpRaA02S02V03{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Daily CFR Upper Raw IHME S2{p_end}
{p 0 48}DayCfrMeRaA02S03V03{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Daily CFR Mean Raw IHME S3{p_end}
{p 0 48}DayCfrLoRaA02S03V03{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Daily CFR Lower Raw IHME S3{p_end}
{p 0 48}DayCfrUpRaA02S03V03{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Daily CFR Upper Raw IHME S3{p_end}
{p 0 48}DayDeMMeSmA02S01V03{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Daily deaths mean IHME DayDeM{p_end}
{p 0 48}DayCaMMeRaA02S01V03{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Daily cases mean IHME DayCaM{p_end}
{p 0 48}DayCbDMeRaA02S01V03{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Daily cases mean div by daily deaths mean IHME DayCbD{p_end}
{p 0 48}DayDMuMeRaA02S01V03{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Daily deaths scaled (times means of cases by deaths) IHME{p_end}
{p 0 48}TotDeaMeRaA03S01V07{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Total Deaths Mean A03 S01 V07{p_end}
{p 0 48}TotDeaLoRaA03S01V07{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Total Deaths Lower A03 S01 V07{p_end}
{p 0 48}TotDeaUpRaA03S01V07{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Total Deaths Upper A03 S01 V07{p_end}
{p 0 48}TotDeaMeRaA03S02V07{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Total Deaths Mean A03 S02 V07{p_end}
{p 0 48}TotDeaLoRaA03S02V07{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Total Deaths Lower A03 S02 V07{p_end}
{p 0 48}TotDeaUpRaA03S02V07{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Total Deaths Upper A03 S02 V07{p_end}
{p 0 48}TotDeaMeRaA03S03V07{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Total Deaths Mean A03 S03 V07{p_end}
{p 0 48}TotDeaLoRaA03S03V07{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Total Deaths Lower A03 S03 V07{p_end}
{p 0 48}TotDeaUpRaA03S03V07{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Total Deaths Upper A03 S03 V07{p_end}
{p 0 48}TotDeaMeRaA03S04V07{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Total Deaths Mean A03 S04 V07{p_end}
{p 0 48}TotDeaLoRaA03S04V07{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Total Deaths Lower A03 S04 V07{p_end}
{p 0 48}TotDeaUpRaA03S04V07{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Total Deaths Upper A03 S04 V07{p_end}
{p 0 48}TotDeaMeRaA03S05V07{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Total Deaths Mean A03 S05 V07{p_end}
{p 0 48}TotDeaLoRaA03S05V07{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Total Deaths Lower A03 S05 V07{p_end}
{p 0 48}TotDeaUpRaA03S05V07{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Total Deaths Upper A03 S05 V07{p_end}
{p 0 48}TotDeaMeRaA03S06V07{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Total Deaths Mean A03 S06 V07{p_end}
{p 0 48}TotDeaLoRaA03S06V07{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Total Deaths Lower A03 S06 V07{p_end}
{p 0 48}TotDeaUpRaA03S06V07{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Total Deaths Upper A03 S06 V07{p_end}
{p 0 48}DayDeaMeRaA03S01V07{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Daily Deaths Mean A03 S01 V07{p_end}
{p 0 48}DayDeaLoRaA03S01V07{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Daily Deaths Lower A03 S01 V07{p_end}
{p 0 48}DayDeaUpRaA03S01V07{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Daily Deaths Upper A03 S01 V07{p_end}
{p 0 48}DayDeaMeRaA03S02V07{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Daily Deaths Mean A03 S02 V07{p_end}
{p 0 48}DayDeaLoRaA03S02V07{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Daily Deaths Lower A03 S02 V07{p_end}
{p 0 48}DayDeaUpRaA03S02V07{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Daily Deaths Upper A03 S02 V07{p_end}
{p 0 48}DayDeaMeRaA03S03V07{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Daily Deaths Mean A03 S03 V07{p_end}
{p 0 48}DayDeaLoRaA03S03V07{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Daily Deaths Lower A03 S03 V07{p_end}
{p 0 48}DayDeaUpRaA03S03V07{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Daily Deaths Upper A03 S03 V07{p_end}
{p 0 48}DayDeaMeRaA03S04V07{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Daily Deaths Mean A03 S04 V07{p_end}
{p 0 48}DayDeaLoRaA03S04V07{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Daily Deaths Lower A03 S04 V07{p_end}
{p 0 48}DayDeaUpRaA03S04V07{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Daily Deaths Upper A03 S04 V07{p_end}
{p 0 48}DayDeaMeRaA03S05V07{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Daily Deaths Mean A03 S05 V07{p_end}
{p 0 48}DayDeaLoRaA03S05V07{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Daily Deaths Lower A03 S05 V07{p_end}
{p 0 48}DayDeaUpRaA03S05V07{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Daily Deaths Upper A03 S05 V07{p_end}
{p 0 48}DayDeaMeRaA03S06V07{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Daily Deaths Mean A03 S06 V07{p_end}
{p 0 48}DayDeaLoRaA03S06V07{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Daily Deaths Lower A03 S06 V07{p_end}
{p 0 48}DayDeaUpRaA03S06V07{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Daily Deaths Upper A03 S06 V07{p_end}
{p 0 48}TotCasMeRaA03S01V07{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Total Cases Mean A03 S01 V07{p_end}
{p 0 48}TotCasLoRaA03S01V07{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Total Cases Lower A03 S01 V07{p_end}
{p 0 48}TotCasUpRaA03S01V07{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Total Cases Upper A03 S01 V07{p_end}
{p 0 48}TotCasMeRaA03S02V07{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Total Cases Mean A03 S02 V07{p_end}
{p 0 48}TotCasLoRaA03S02V07{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Total Cases Lower A03 S02 V07{p_end}
{p 0 48}TotCasUpRaA03S02V07{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Total Cases Upper A03 S02 V07{p_end}
{p 0 48}TotCasMeRaA03S03V07{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Total Cases Mean A03 S03 V07{p_end}
{p 0 48}TotCasLoRaA03S03V07{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Total Cases Lower A03 S03 V07{p_end}
{p 0 48}TotCasUpRaA03S03V07{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Total Cases Upper A03 S03 V07{p_end}
{p 0 48}TotCasMeRaA03S04V07{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Total Cases Mean A03 S04 V07{p_end}
{p 0 48}TotCasLoRaA03S04V07{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Total Cases Lower A03 S04 V07{p_end}
{p 0 48}TotCasUpRaA03S04V07{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Total Cases Upper A03 S04 V07{p_end}
{p 0 48}TotCasMeRaA03S05V07{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Total Cases Mean A03 S05 V07{p_end}
{p 0 48}TotCasLoRaA03S05V07{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Total Cases Lower A03 S05 V07{p_end}
{p 0 48}TotCasUpRaA03S05V07{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Total Cases Upper A03 S05 V07{p_end}
{p 0 48}TotCasMeRaA03S06V07{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Total Cases Mean A03 S06 V07{p_end}
{p 0 48}TotCasLoRaA03S06V07{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Total Cases Lower A03 S06 V07{p_end}
{p 0 48}TotCasUpRaA03S06V07{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Total Cases Upper A03 S06 V07{p_end}
{p 0 48}DayCasMeRaA03S01V07{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Daily Cases Mean A03 S01 V07{p_end}
{p 0 48}DayCasLoRaA03S01V07{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Daily Cases Lower A03 S01 V07{p_end}
{p 0 48}DayCasUpRaA03S01V07{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Daily Cases Upper A03 S01 V07{p_end}
{p 0 48}DayCasMeRaA03S02V07{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Daily Cases Mean A03 S02 V07{p_end}
{p 0 48}DayCasLoRaA03S02V07{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Daily Cases Lower A03 S02 V07{p_end}
{p 0 48}DayCasUpRaA03S02V07{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Daily Cases Upper A03 S02 V07{p_end}
{p 0 48}DayCasMeRaA03S03V07{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Daily Cases Mean A03 S03 V07{p_end}
{p 0 48}DayCasLoRaA03S03V07{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Daily Cases Lower A03 S03 V07{p_end}
{p 0 48}DayCasUpRaA03S03V07{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Daily Cases Upper A03 S03 V07{p_end}
{p 0 48}DayCasMeRaA03S04V07{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Daily Cases Mean A03 S04 V07{p_end}
{p 0 48}DayCasLoRaA03S04V07{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Daily Cases Lower A03 S04 V07{p_end}
{p 0 48}DayCasUpRaA03S04V07{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Daily Cases Upper A03 S04 V07{p_end}
{p 0 48}DayCasMeRaA03S05V07{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Daily Cases Mean A03 S05 V07{p_end}
{p 0 48}DayCasLoRaA03S05V07{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Daily Cases Lower A03 S05 V07{p_end}
{p 0 48}DayCasUpRaA03S05V07{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Daily Cases Upper A03 S05 V07{p_end}
{p 0 48}DayCasMeRaA03S06V07{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Daily Cases Mean A03 S06 V07{p_end}
{p 0 48}DayCasLoRaA03S06V07{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Daily Cases Lower A03 S06 V07{p_end}
{p 0 48}DayCasUpRaA03S06V07{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Daily Cases Upper A03 S06 V07{p_end}
{p 0 48}DayHodLoRaA03S01V07{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Daily hospital demand Lower A03 S01 V07{p_end}
{p 0 48}DayHodMeRaA03S01V07{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Daily hospital demand Mean A03 S01 V07{p_end}
{p 0 48}DayHodUpRaA03S01V07{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Daily hospital demand Upper A03 S01 V07{p_end}
{p 0 48}DayHodLoRaA03S02V07{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Daily hospital demand Lower A03 S02 V07{p_end}
{p 0 48}DayHodMeRaA03S02V07{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Daily hospital demand Mean A03 S02 V07{p_end}
{p 0 48}DayHodUpRaA03S02V07{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Daily hospital demand Upper A03 S02 V07{p_end}
{p 0 48}DayHodLoRaA03S03V07{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Daily hospital demand Lower A03 S03 V07{p_end}
{p 0 48}DayHodMeRaA03S03V07{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Daily hospital demand Mean A03 S03 V07{p_end}
{p 0 48}DayHodUpRaA03S03V07{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Daily hospital demand Upper A03 S03 V07{p_end}
{p 0 48}DayHodLoRaA03S04V07{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Daily hospital demand Lower A03 S04 V07{p_end}
{p 0 48}DayHodMeRaA03S04V07{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Daily hospital demand Mean A03 S04 V07{p_end}
{p 0 48}DayHodUpRaA03S04V07{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Daily hospital demand Upper A03 S04 V07{p_end}
{p 0 48}DayHodLoRaA03S05V07{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Daily hospital demand Lower A03 S05 V07{p_end}
{p 0 48}DayHodMeRaA03S05V07{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Daily hospital demand Mean A03 S05 V07{p_end}
{p 0 48}DayHodUpRaA03S05V07{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Daily hospital demand Upper A03 S05 V07{p_end}
{p 0 48}DayHodLoRaA03S06V07{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Daily hospital demand Lower A03 S06 V07{p_end}
{p 0 48}DayHodMeRaA03S06V07{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Daily hospital demand Mean A03 S06 V07{p_end}
{p 0 48}DayHodUpRaA03S06V07{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Daily hospital demand Upper A03 S06 V07{p_end}
{p 0 48}DayHoiLoRaA03S01V07{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Daily hospital incidence Lower A03 S01 V07{p_end}
{p 0 48}DayHoiMeRaA03S01V07{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Daily hospital incidence Mean A03 S01 V07{p_end}
{p 0 48}DayHoiUpRaA03S01V07{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Daily hospital incidence Upper A03 S01 V07{p_end}
{p 0 48}DayHoiLoRaA03S02V07{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Daily hospital incidence Lower A03 S02 V07{p_end}
{p 0 48}DayHoiMeRaA03S02V07{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Daily hospital incidence Mean A03 S02 V07{p_end}
{p 0 48}DayHoiUpRaA03S02V07{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Daily hospital incidence Upper A03 S02 V07{p_end}
{p 0 48}DayHoiLoRaA03S03V07{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Daily hospital incidence Lower A03 S03 V07{p_end}
{p 0 48}DayHoiMeRaA03S03V07{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Daily hospital incidence Mean A03 S03 V07{p_end}
{p 0 48}DayHoiUpRaA03S03V07{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Daily hospital incidence Upper A03 S03 V07{p_end}
{p 0 48}DayHoiLoRaA03S04V07{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Daily hospital incidence Lower A03 S04 V07{p_end}
{p 0 48}DayHoiMeRaA03S04V07{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Daily hospital incidence Mean A03 S04 V07{p_end}
{p 0 48}DayHoiUpRaA03S04V07{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Daily hospital incidence Upper A03 S04 V07{p_end}
{p 0 48}DayHoiLoRaA03S05V07{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Daily hospital incidence Lower A03 S05 V07{p_end}
{p 0 48}DayHoiMeRaA03S05V07{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Daily hospital incidence Mean A03 S05 V07{p_end}
{p 0 48}DayHoiUpRaA03S05V07{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Daily hospital incidence Upper A03 S05 V07{p_end}
{p 0 48}DayHoiLoRaA03S06V07{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Daily hospital incidence Lower A03 S06 V07{p_end}
{p 0 48}DayHoiMeRaA03S06V07{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Daily hospital incidence Mean A03 S06 V07{p_end}
{p 0 48}DayHoiUpRaA03S06V07{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Daily hospital incidence Upper A03 S06 V07{p_end}
{p 0 48}DayIcdLoRaA03S01V07{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Daily ICU demand Lower A03 S01 V07{p_end}
{p 0 48}DayIcdMeRaA03S01V07{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Daily ICU demand Mean A03 S01 V07{p_end}
{p 0 48}DayIcdUpRaA03S01V07{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Daily ICU demand Upper A03 S01 V07{p_end}
{p 0 48}DayIcdLoRaA03S02V07{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Daily ICU demand Lower A03 S02 V07{p_end}
{p 0 48}DayIcdMeRaA03S02V07{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Daily ICU demand Mean A03 S02 V07{p_end}
{p 0 48}DayIcdUpRaA03S02V07{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Daily ICU demand Upper A03 S02 V07{p_end}
{p 0 48}DayIcdLoRaA03S03V07{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Daily ICU demand Lower A03 S03 V07{p_end}
{p 0 48}DayIcdMeRaA03S03V07{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Daily ICU demand Mean A03 S03 V07{p_end}
{p 0 48}DayIcdUpRaA03S03V07{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Daily ICU demand Upper A03 S03 V07{p_end}
{p 0 48}DayIcdLoRaA03S04V07{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Daily ICU demand Lower A03 S04 V07{p_end}
{p 0 48}DayIcdMeRaA03S04V07{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Daily ICU demand Mean A03 S04 V07{p_end}
{p 0 48}DayIcdUpRaA03S04V07{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Daily ICU demand Upper A03 S04 V07{p_end}
{p 0 48}DayIcdLoRaA03S05V07{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Daily ICU demand Lower A03 S05 V07{p_end}
{p 0 48}DayIcdMeRaA03S05V07{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Daily ICU demand Mean A03 S05 V07{p_end}
{p 0 48}DayIcdUpRaA03S05V07{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Daily ICU demand Upper A03 S05 V07{p_end}
{p 0 48}DayIcdLoRaA03S06V07{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Daily ICU demand Lower A03 S06 V07{p_end}
{p 0 48}DayIcdMeRaA03S06V07{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Daily ICU demand Mean A03 S06 V07{p_end}
{p 0 48}DayIcdUpRaA03S06V07{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Daily ICU demand Upper A03 S06 V07{p_end}
{p 0 48}DayIciLoRaA03S01V07{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Daily ICU incidence Lower A03 S01 V07{p_end}
{p 0 48}DayIciMeRaA03S01V07{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Daily ICU incidence Mean A03 S01 V07{p_end}
{p 0 48}DayIciUpRaA03S01V07{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Daily ICU incidence Upper A03 S01 V07{p_end}
{p 0 48}DayIciLoRaA03S02V07{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Daily ICU incidence Lower A03 S02 V07{p_end}
{p 0 48}DayIciMeRaA03S02V07{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Daily ICU incidence Mean A03 S02 V07{p_end}
{p 0 48}DayIciUpRaA03S02V07{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Daily ICU incidence Upper A03 S02 V07{p_end}
{p 0 48}DayIciLoRaA03S03V07{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Daily ICU incidence Lower A03 S03 V07{p_end}
{p 0 48}DayIciMeRaA03S03V07{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Daily ICU incidence Mean A03 S03 V07{p_end}
{p 0 48}DayIciUpRaA03S03V07{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Daily ICU incidence Upper A03 S03 V07{p_end}
{p 0 48}DayIciLoRaA03S04V07{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Daily ICU incidence Lower A03 S04 V07{p_end}
{p 0 48}DayIciMeRaA03S04V07{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Daily ICU incidence Mean A03 S04 V07{p_end}
{p 0 48}DayIciUpRaA03S04V07{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Daily ICU incidence Upper A03 S04 V07{p_end}
{p 0 48}DayIciLoRaA03S05V07{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Daily ICU incidence Lower A03 S05 V07{p_end}
{p 0 48}DayIciMeRaA03S05V07{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Daily ICU incidence Mean A03 S05 V07{p_end}
{p 0 48}DayIciUpRaA03S05V07{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Daily ICU incidence Upper A03 S05 V07{p_end}
{p 0 48}DayIciLoRaA03S06V07{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Daily ICU incidence Lower A03 S06 V07{p_end}
{p 0 48}DayIciMeRaA03S06V07{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Daily ICU incidence Mean A03 S06 V07{p_end}
{p 0 48}DayIciUpRaA03S06V07{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Daily ICU incidence Upper A03 S06 V07{p_end}
{p 0 48}DayPreLoRaA03S01V07{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Daily prevalence Lower A03 S01 V07{p_end}
{p 0 48}DayPreMeRaA03S01V07{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Daily prevalence Mean A03 S01 V07{p_end}
{p 0 48}DayPreUpRaA03S01V07{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Daily prevalence Upper A03 S01 V07{p_end}
{p 0 48}DayPreLoRaA03S02V07{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Daily prevalence Lower A03 S02 V07{p_end}
{p 0 48}DayPreMeRaA03S02V07{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Daily prevalence Mean A03 S02 V07{p_end}
{p 0 48}DayPreUpRaA03S02V07{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Daily prevalence Upper A03 S02 V07{p_end}
{p 0 48}DayPreLoRaA03S03V07{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Daily prevalence Lower A03 S03 V07{p_end}
{p 0 48}DayPreMeRaA03S03V07{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Daily prevalence Mean A03 S03 V07{p_end}
{p 0 48}DayPreUpRaA03S03V07{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Daily prevalence Upper A03 S03 V07{p_end}
{p 0 48}DayPreLoRaA03S04V07{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Daily prevalence Lower A03 S04 V07{p_end}
{p 0 48}DayPreMeRaA03S04V07{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Daily prevalence Mean A03 S04 V07{p_end}
{p 0 48}DayPreUpRaA03S04V07{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Daily prevalence Upper A03 S04 V07{p_end}
{p 0 48}DayPreLoRaA03S05V07{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Daily prevalence Lower A03 S05 V07{p_end}
{p 0 48}DayPreMeRaA03S05V07{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Daily prevalence Mean A03 S05 V07{p_end}
{p 0 48}DayPreUpRaA03S05V07{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Daily prevalence Upper A03 S05 V07{p_end}
{p 0 48}DayPreLoRaA03S06V07{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Daily prevalence Lower A03 S06 V07{p_end}
{p 0 48}DayPreMeRaA03S06V07{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Daily prevalence Mean A03 S06 V07{p_end}
{p 0 48}DayPreUpRaA03S06V07{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Daily prevalence Upper A03 S06 V07{p_end}
{p 0 48}DayRefLoRaA03S01V07{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Daily R effective Lower A03 S01 V07{p_end}
{p 0 48}DayRefMeRaA03S01V07{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Daily R effective Mean A03 S01 V07{p_end}
{p 0 48}DayRefUpRaA03S01V07{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Daily R effective Upper A03 S01 V07{p_end}
{p 0 48}DayRefLoRaA03S02V07{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Daily R effective Lower A03 S02 V07{p_end}
{p 0 48}DayRefMeRaA03S02V07{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Daily R effective Mean A03 S02 V07{p_end}
{p 0 48}DayRefUpRaA03S02V07{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Daily R effective Upper A03 S02 V07{p_end}
{p 0 48}DayRefLoRaA03S03V07{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Daily R effective Lower A03 S03 V07{p_end}
{p 0 48}DayRefMeRaA03S03V07{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Daily R effective Mean A03 S03 V07{p_end}
{p 0 48}DayRefUpRaA03S03V07{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Daily R effective Upper A03 S03 V07{p_end}
{p 0 48}DayRefLoRaA03S04V07{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Daily R effective Lower A03 S04 V07{p_end}
{p 0 48}DayRefMeRaA03S04V07{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Daily R effective Mean A03 S04 V07{p_end}
{p 0 48}DayRefUpRaA03S04V07{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Daily R effective Upper A03 S04 V07{p_end}
{p 0 48}DayRefLoRaA03S05V07{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Daily R effective Lower A03 S05 V07{p_end}
{p 0 48}DayRefMeRaA03S05V07{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Daily R effective Mean A03 S05 V07{p_end}
{p 0 48}DayRefUpRaA03S05V07{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Daily R effective Upper A03 S05 V07{p_end}
{p 0 48}DayRefLoRaA03S06V07{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Daily R effective Lower A03 S06 V07{p_end}
{p 0 48}DayRefMeRaA03S06V07{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Daily R effective Mean A03 S06 V07{p_end}
{p 0 48}DayRefUpRaA03S06V07{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Daily R effective Upper A03 S06 V07{p_end}
{p 0 48}DayRttLoRaA03S01V07{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Daily R t Lower A03 S01 V07{p_end}
{p 0 48}DayRttMeRaA03S01V07{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Daily R t Mean A03 S01 V07{p_end}
{p 0 48}DayRttUpRaA03S01V07{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Daily R t Upper A03 S01 V07{p_end}
{p 0 48}DayRttLoRaA03S02V07{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Daily R t Lower A03 S02 V07{p_end}
{p 0 48}DayRttMeRaA03S02V07{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Daily R t Mean A03 S02 V07{p_end}
{p 0 48}DayRttUpRaA03S02V07{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Daily R t Upper A03 S02 V07{p_end}
{p 0 48}DayRttLoRaA03S03V07{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Daily R t Lower A03 S03 V07{p_end}
{p 0 48}DayRttMeRaA03S03V07{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Daily R t Mean A03 S03 V07{p_end}
{p 0 48}DayRttUpRaA03S03V07{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Daily R t Upper A03 S03 V07{p_end}
{p 0 48}DayRttLoRaA03S04V07{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Daily R t Lower A03 S04 V07{p_end}
{p 0 48}DayRttMeRaA03S04V07{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Daily R t Mean A03 S04 V07{p_end}
{p 0 48}DayRttUpRaA03S04V07{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Daily R t Upper A03 S04 V07{p_end}
{p 0 48}DayRttLoRaA03S05V07{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Daily R t Lower A03 S05 V07{p_end}
{p 0 48}DayRttMeRaA03S05V07{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Daily R t Mean A03 S05 V07{p_end}
{p 0 48}DayRttUpRaA03S05V07{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Daily R t Upper A03 S05 V07{p_end}
{p 0 48}DayRttLoRaA03S06V07{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Daily R t Lower A03 S06 V07{p_end}
{p 0 48}DayRttMeRaA03S06V07{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Daily R t Mean A03 S06 V07{p_end}
{p 0 48}DayRttUpRaA03S06V07{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Daily R t Upper A03 S06 V07{p_end}
{p 0 48}DayCfrMeRaA03S01V07{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Daily CFR Mean A03 S01 V07{p_end}
{p 0 48}DayCfrLoRaA03S01V07{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Daily CFR Lower A03 S01 V07{p_end}
{p 0 48}DayCfrUpRaA03S01V07{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Daily CFR Upper A03 S01 V07{p_end}
{p 0 48}DayCfrMeRaA03S02V07{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Daily CFR Mean A03 S02 V07{p_end}
{p 0 48}DayCfrLoRaA03S02V07{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Daily CFR Lower A03 S02 V07{p_end}
{p 0 48}DayCfrUpRaA03S02V07{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Daily CFR Upper A03 S02 V07{p_end}
{p 0 48}DayCfrMeRaA03S03V07{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Daily CFR Mean A03 S03 V07{p_end}
{p 0 48}DayCfrLoRaA03S03V07{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Daily CFR Lower A03 S03 V07{p_end}
{p 0 48}DayCfrUpRaA03S03V07{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Daily CFR Upper A03 S03 V07{p_end}
{p 0 48}DayCfrMeRaA03S04V07{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Daily CFR Mean A03 S04 V07{p_end}
{p 0 48}DayCfrLoRaA03S04V07{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Daily CFR Lower A03 S04 V07{p_end}
{p 0 48}DayCfrUpRaA03S04V07{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Daily CFR Upper A03 S04 V07{p_end}
{p 0 48}DayCfrMeRaA03S05V07{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Daily CFR Mean A03 S05 V07{p_end}
{p 0 48}DayCfrLoRaA03S05V07{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Daily CFR Lower A03 S05 V07{p_end}
{p 0 48}DayCfrUpRaA03S05V07{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Daily CFR Upper A03 S05 V07{p_end}
{p 0 48}DayCfrMeRaA03S06V07{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Daily CFR Mean A03 S06 V07{p_end}
{p 0 48}DayCfrLoRaA03S06V07{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Daily CFR Lower A03 S06 V07{p_end}
{p 0 48}DayCfrUpRaA03S06V07{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Daily CFR Upper A03 S06 V07{p_end}
{p 0 48}DayDeMMeRaA03S02V07{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Daily deaths mean IMPE DayDeM{p_end}
{p 0 48}DayCaMMeRaA03S02V07{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Daily cases mean IMPE DayCaM{p_end}
{p 0 48}DayCbDMeRaA03S02V07{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Daily cases mean div by daily deaths mean IMPE DayCbD{p_end}
{p 0 48}DayDMuMeRaA03S02V07{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Daily deaths scaled (times means of cases by deaths) IMPE{p_end}
{p 0 48}TotDeaLoRaA04S00V02{p_end}
{p 0 48}{space 15}{txt}{bind: double  }{bind:{txt}%8.0g     }{space 1}{bind:         }{bind:  }{res}{res}Total deaths Lower LANL S0 V2{p_end}
{p 0 48}TotDeaMeRaA04S00V02{p_end}
{p 0 48}{space 15}{txt}{bind: double  }{bind:{txt}%8.0g     }{space 1}{bind:         }{bind:  }{res}{res}Total deaths Mean LANL S0 V2{p_end}
{p 0 48}TotDeaUpRaA04S00V02{p_end}
{p 0 48}{space 15}{txt}{bind: double  }{bind:{txt}%8.0g     }{space 1}{bind:         }{bind:  }{res}{res}Total deaths Upper LANL S0 V2{p_end}
{p 0 48}DayDeaLoRaA04S00V02{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%8.0g     }{space 1}{bind:         }{bind:  }{res}{res}Daily deaths Lower LANL S0 V2{p_end}
{p 0 48}DayDeaMeRaA04S00V02{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%8.0g     }{space 1}{bind:         }{bind:  }{res}{res}Daily deaths Mean LANL S0 V2{p_end}
{p 0 48}DayDeaUpRaA04S00V02{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%8.0g     }{space 1}{bind:         }{bind:  }{res}{res}Daily deaths Upper LANL S0 V2{p_end}
{p 0 48}TotCasLoRaA04S00V02{p_end}
{p 0 48}{space 15}{txt}{bind: double  }{bind:{txt}%12.0g    }{space 1}{bind:         }{bind:  }{res}{res}Total Cases Lower LANL S0 V2{p_end}
{p 0 48}TotCasMeRaA04S00V02{p_end}
{p 0 48}{space 15}{txt}{bind: double  }{bind:{txt}%12.0g    }{space 1}{bind:         }{bind:  }{res}{res}Total Cases Mean LANL S0 V2{p_end}
{p 0 48}TotCasUpRaA04S00V02{p_end}
{p 0 48}{space 15}{txt}{bind: double  }{bind:{txt}%12.0g    }{space 1}{bind:         }{bind:  }{res}{res}Total Cases Upper LANL S0 V2{p_end}
{p 0 48}DayCasLoRaA04S00V02{p_end}
{p 0 48}{space 15}{txt}{bind: double  }{bind:{txt}%8.0g     }{space 1}{bind:         }{bind:  }{res}{res}Daily cases Lower LANL S0 V2{p_end}
{p 0 48}DayCasMeRaA04S00V02{p_end}
{p 0 48}{space 15}{txt}{bind: double  }{bind:{txt}%8.0g     }{space 1}{bind:         }{bind:  }{res}{res}Daily cases Mean LANL S0 V2{p_end}
{p 0 48}DayCasUpRaA04S00V02{p_end}
{p 0 48}{space 15}{txt}{bind: double  }{bind:{txt}%8.0g     }{space 1}{bind:         }{bind:  }{res}{res}Daily cases Upper LANL S0 V2{p_end}
{p 0 48}DayCfrMeRaA04S00V02{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Daily CFR Mean LANL S0 V2{p_end}
{p 0 48}DayCfrLoRaA04S00V02{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Daily CFR Lower LANL S0 V2{p_end}
{p 0 48}DayCfrUpRaA04S00V02{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Daily CFR Upper LANL S0 V2{p_end}
{p 0 48}DayDeMMeRaA04S00V02{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Daily deaths mean LANL DayDeM{p_end}
{p 0 48}DayCaMMeRaA04S00V02{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Daily cases mean LANL DayCaM{p_end}
{p 0 48}DayCbDMeRaA04S00V02{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Daily cases mean div by daily deaths mean LANL DayCbD{p_end}
{p 0 48}DayDMuMeRaA04S00V02{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Daily deaths scaled (times means of cases by deaths) LANL{p_end}
{p 0 48}TotCasUpRaA05S00V02{p_end}
{p 0 48}{space 15}{txt}{bind: long    }{bind:{txt}%12.0g    }{space 1}{bind:         }{bind:  }{res}{res}Total Cases Upper SRIV{p_end}
{p 0 48}TotDeaMeRaA05S00V02{p_end}
{p 0 48}{space 15}{txt}{bind: long    }{bind:{txt}%12.0g    }{space 1}{bind:         }{bind:  }{res}{res}Total Deaths Mean SRIV{p_end}
{p 0 48}TotDeaLoRaA05S00V02{p_end}
{p 0 48}{space 15}{txt}{bind: long    }{bind:{txt}%12.0g    }{space 1}{bind:         }{bind:  }{res}{res}Total Deaths Lower SRIV{p_end}
{p 0 48}TotDeaUpRaA05S00V02{p_end}
{p 0 48}{space 15}{txt}{bind: long    }{bind:{txt}%12.0g    }{space 1}{bind:         }{bind:  }{res}{res}Total Deaths Upper SRIV{p_end}
{p 0 48}TotCasMeRaA05S00V02{p_end}
{p 0 48}{space 15}{txt}{bind: long    }{bind:{txt}%12.0g    }{space 1}{bind:         }{bind:  }{res}{res}Total Cases Mean SRIV{p_end}
{p 0 48}TotCasLoRaA05S00V02{p_end}
{p 0 48}{space 15}{txt}{bind: long    }{bind:{txt}%12.0g    }{space 1}{bind:         }{bind:  }{res}{res}Total Cases Lower SRIV{p_end}
{p 0 48}DayDeaMeRaA05S00V02{p_end}
{p 0 48}{space 15}{txt}{bind: int     }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Daily Deaths Mean SRIV{p_end}
{p 0 48}DayDeaLoRaA05S00V02{p_end}
{p 0 48}{space 15}{txt}{bind: int     }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Daily Deaths Lower SRIV{p_end}
{p 0 48}DayDeaUpRaA05S00V02{p_end}
{p 0 48}{space 15}{txt}{bind: int     }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Daily Deaths Upper SRIV{p_end}
{p 0 48}DayCasMeRaA05S00V02{p_end}
{p 0 48}{space 15}{txt}{bind: int     }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Daily Cases Mean SRIV{p_end}
{p 0 48}DayCasLoRaA05S00V02{p_end}
{p 0 48}{space 15}{txt}{bind: int     }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Daily Cases Lower SRIV{p_end}
{p 0 48}DayCasUpRaA05S00V02{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Daily Cases Upper SRIV{p_end}
{p 0 48}DayCfrMeRaA05S00V02{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Daily CFR Mean SRIV{p_end}
{p 0 48}DayCfrLoRaA05S00V02{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Daily CFR Lower SRIV{p_end}
{p 0 48}DayCfrUpRaA05S00V02{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Daily CFR Upper SRIV{p_end}
{p 0 48}DayDeMMeRaA05S00V02{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Daily deaths mean SRIV  DayDeM{p_end}
{p 0 48}DayCaMMeRaA05S00V02{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Daily cases mean SRIV  DayCaM{p_end}
{p 0 48}DayCbDMeRaA05S00V02{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Daily cases mean div by daily deaths mean SRIV  DayCbD{p_end}
{p 0 48}DayDMuMeRaA05S00V02{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Daily deaths scaled (times means of cases by deaths) SRIV {p_end}
{p 0 48}DayActMeRaA06S01V00{p_end}
{p 0 48}{space 15}{txt}{bind: long    }{bind:{txt}%10.0g    }{space 1}{bind:         }{bind:  }{res}{res}Daily Active cases SOLT S1{p_end}
{p 0 48}DayActMeRaA06S02V00{p_end}
{p 0 48}{space 15}{txt}{bind: long    }{bind:{txt}%10.0g    }{space 1}{bind:         }{bind:  }{res}{res}Daily Active cases SOLT S2{p_end}
{p 0 48}DayActMeRaA07S09V00{p_end}
{p 0 48}{space 15}{txt}{bind: long    }{bind:{txt}%10.0g    }{space 1}{bind:         }{bind:  }{res}{res}Daily Active cases GHAN S9{p_end}
{p 0 48}DayCTDMeRaA00S00V00{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Daily Cases to Deaths S0 JOHN{p_end}
{p 0 48}TotCTDMeRaA00S00V00{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Total Cases to Deaths S0 JOHN{p_end}
{p 0 48}DayCTDMeRaA01S00V03{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Daily Cases to Deaths S0 DELP{p_end}
{p 0 48}TotCTDMeRaA01S00V03{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Total Cases to Deaths S0 DELP{p_end}
{p 0 48}DayCTDMeRaA02S01V03{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Daily Cases to Deaths S1 IHME{p_end}
{p 0 48}TotCTDMeRaA02S01V03{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Total Cases to Deaths S1 IHME{p_end}
{p 0 48}DayCTDMeRaA02S02V03{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Daily Cases to Deaths S2 IHME{p_end}
{p 0 48}TotCTDMeRaA02S02V03{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Total Cases to Deaths S2 IHME{p_end}
{p 0 48}DayCTDMeRaA02S03V03{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Daily Cases to Deaths S3 IHME{p_end}
{p 0 48}TotCTDMeRaA02S03V03{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Total Cases to Deaths S3 IHME{p_end}
{p 0 48}DayCTDMeRaA03S01V07{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Daily Cases to Deaths S1 IMPE{p_end}
{p 0 48}TotCTDMeRaA03S01V07{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Total Cases to Deaths S1 IMPE{p_end}
{p 0 48}DayCTDMeRaA03S02V07{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Daily Cases to Deaths S2 IMPE{p_end}
{p 0 48}TotCTDMeRaA03S02V07{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Total Cases to Deaths S2 IMPE{p_end}
{p 0 48}DayCTDMeRaA03S03V07{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Daily Cases to Deaths S3 IMPE{p_end}
{p 0 48}TotCTDMeRaA03S03V07{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Total Cases to Deaths S3 IMPE{p_end}
{p 0 48}DayCTDMeRaA04S00V02{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Daily Cases to Deaths S0 LANL{p_end}
{p 0 48}TotCTDMeRaA04S00V02{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Total Cases to Deaths S0 LANL{p_end}
{p 0 48}DayCTDMeRaA05S00V02{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Daily Cases to Deaths S0 SRIV{p_end}
{p 0 48}TotCTDMeRaA05S00V02{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Total Cases to Deaths S0 SRIV{p_end}
{p 0 48}DayDERMeRaA00S00V00{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Daily Deaths estim to reported JOHN = 1{p_end}
{p 0 48}DayDERMeRaA01S00V03{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Daily Deaths estim to reported Mean DELP S0 V3{p_end}
{p 0 48}DayDERMeRaA02S01V03{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Daily Deaths estim to reported Mean not smoothed IHME S1{p_end}
{p 0 48}DayDERMeRaA02S02V03{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Daily Deaths estim to reported Mean not smoothed IHME S2{p_end}
{p 0 48}DayDERMeRaA02S03V03{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Daily Deaths estim to reported Mean not smoothed IHME S3{p_end}
{p 0 48}DayDERMeRaA03S01V07{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Daily Deaths estim to reported Mean S1 IMPE{p_end}
{p 0 48}DayDERMeRaA03S02V07{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Daily Deaths estim to reported Mean S2 IMPE{p_end}
{p 0 48}DayDERMeRaA03S03V07{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Daily Deaths estim to reported Mean S3 IMPE{p_end}
{p 0 48}DayDERMeRaA04S00V02{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Daily Deaths estim to reported to Deaths S0 LANL{p_end}
{p 0 48}DayDERMeRaA05S00V02{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Daily Deaths estim to reported S0 SRIV{p_end}
{p 0 48}DayCERMeRaA00S00V00{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Daily Cases estim to reported JOHN = 1{p_end}
{p 0 48}DayCERMeRaA01S00V03{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Daily Cases estim to reported Mean DELP S0 V3{p_end}
{p 0 48}DayCERMeRaA02S01V03{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Daily Cases estim to reported Mean not smoothed IHME S1{p_end}
{p 0 48}DayCERMeRaA02S02V03{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Daily Cases estim to reported Mean not smoothed IHME S2{p_end}
{p 0 48}DayCERMeRaA02S03V03{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Daily Cases estim to reported Mean not smoothed IHME S3{p_end}
{p 0 48}DayCERMeRaA03S01V07{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Daily Cases estim to reported Mean S1 IMPE{p_end}
{p 0 48}DayCERMeRaA03S02V07{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Daily Cases estim to reported Mean S2 IMPE{p_end}
{p 0 48}DayCERMeRaA03S03V07{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Daily Cases estim to reported Mean S3 IMPE{p_end}
{p 0 48}DayCERMeRaA04S00V02{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Daily Cases estim to reported to Cases S0 LANL{p_end}
{p 0 48}DayCERMeRaA05S00V02{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Daily Cases estim to reported S0 SRIV{p_end}
{p 0 48}TotDERMeRaA00S00V00{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Total Deaths estim to reported JOHN = 1{p_end}
{p 0 48}TotDERMeRaA01S00V03{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Total Deaths estim to reported Mean DELP S0 V3{p_end}
{p 0 48}TotDERMeRaA02S01V03{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Total Deaths estim to reported Mean not smoothed IHME S1{p_end}
{p 0 48}TotDERMeRaA02S02V03{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Total Deaths estim to reported Mean not smoothed IHME S2{p_end}
{p 0 48}TotDERMeRaA02S03V03{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Total Deaths estim to reported Mean not smoothed IHME S3{p_end}
{p 0 48}TotDERMeRaA03S01V07{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Total Deaths estim to reported Mean S1 IMPE{p_end}
{p 0 48}TotDERMeRaA03S02V07{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Total Deaths estim to reported Mean S2 IMPE{p_end}
{p 0 48}TotDERMeRaA03S03V07{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Total Deaths estim to reported Mean S3 IMPE{p_end}
{p 0 48}TotDERMeRaA04S00V02{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Total Deaths estim to reported to Deaths S0 LANL{p_end}
{p 0 48}TotDERMeRaA05S00V02{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Total Deaths estim to reported S0 SRIV{p_end}
{p 0 48}TotCERMeRaA00S00V00{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Total Cases estim to reported JOHN = 1{p_end}
{p 0 48}TotCERMeRaA01S00V03{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Total Cases estim to reported Mean DELP S0 V3{p_end}
{p 0 48}TotCERMeRaA02S01V03{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Total Cases estim to reported Mean not smoothed IHME S1{p_end}
{p 0 48}TotCERMeRaA02S02V03{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Total Cases estim to reported Mean not smoothed IHME S2{p_end}
{p 0 48}TotCERMeRaA02S03V03{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Total Cases estim to reported Mean not smoothed IHME S3{p_end}
{p 0 48}TotCERMeRaA03S01V07{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Total Cases estim to reported Mean S1 IMPE{p_end}
{p 0 48}TotCERMeRaA03S02V07{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Total Cases estim to reported Mean S2 IMPE{p_end}
{p 0 48}TotCERMeRaA03S03V07{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Total Cases estim to reported Mean S3 IMPE{p_end}
{p 0 48}TotCERMeRaA04S00V02{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Total Cases estim to reported to Cases S0 LANL{p_end}
{p 0 48}TotCERMeRaA05S00V02{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Total Cases estim to reported S0 SRIV{p_end}
{txt}{hline}
Sorted by: 
{res}     Note: Dataset has changed since last saved.
{txt}
{com}.  
.  
. *
. 
. sort date
{txt}
{com}. 
. qui compress
{txt}
{com}. 
. save "Iran.dta", replace
{txt}(note: file Iran.dta not found)
file Iran.dta saved

{com}. 
. export delimited using "Iran.csv", replace 
{res}{txt}(note: file Iran.csv not found)
{txt}file Iran.csv saved

{com}. 
. 
. *
. 
. 
. 
. 
. 
. ***************
. 
. * graphs 
. 
. 
. grstyle init
{res}{txt}
{com}. 
. grstyle color background white
{txt}
{com}. 
. 
. 
. ******************
. 
. ** order of graphs: 
. 
. ** (A) outcomes, (B) correction factors, (C) time coverage, (D) confidence intervals
. 
. 
. 
. ** (A) outcomes: 
. 
. * daily deaths, daily cases, total deaths, total cases, daily CFR, daily active cases, 
. * daily hospital-related outcomes, 
. * daily cases to deaths, total cases to deaths,
. * daily deaths estimated to reported, daily cases estimated to reported, total deaths estimated to reported, total cases estimated to reported
. 
. 
. 
. ** (B) correction factors 2 and 5 (for deaths and cases) 
. 
. * with correction factors 2 and 5, without correction factors 2 and 5
. 
. 
. 
. ** (C) time coverage
. 
. * all time, 2020-12-01 on
. 
. 
. 
. ** (D) confidence intervals 
. 
. * without confidence intervals, with confidence intervals, not show extremes 
. 
. 
. 
. 
. *****************
. 
. * daily deaths (graph numbers start with 11)
. 
. 
. * daily deaths, median or reference scenario
. 
. twoway ///
> (line DayDeaMeRaA00S00V00 date, sort lcolor(cyan) lwidth(vthick) lpattern(tight_dot)) /// 1 "JOHN"
> (line DayDeaMeRaA01S00V03 date, sort lcolor(red)) /// 2 "DELP"
> (line DayDeaMeSmA02S01V03 date, sort lcolor(black)) /// 3 "IHME"
> (line DayDeaMeRaA03S02V07 date, sort lcolor(magenta)) /// 4 "IMPE"
> (line DayDeaMeRaA04S00V02 date, sort lcolor(gold)) /// 5 "LANL"
> (line DayDeaMeRaA05S00V02 date, sort lcolor(green)) /// 6 "SRIV"
> if date >= td(01feb2020) & date <= td(23Aug2021) ///
> , xtitle(Date) xlabel(21935 21965 21994 22025 22056 22087 22118 22149 22180 ///
> 22210 22240 22270 22300 22330 22360 22391 22422 22453 22484 22515, ///
> format(%tdYY-NN-DD) labsize(small)) xlabel(, grid) xlabel(, grid) ///
> xlabel(, angle(forty_five)) ylabel(, format(%9.0fc) labsize(small))  ylabel(, labsize(small) angle(horizontal)) ///
> ytitle(Daily deaths) title("COVID-19 daily deaths, Iran, reference scenarios", size(medium)) /// 
> xscale(lwidth(vthin) lcolor(gray*.2)) yscale(lwidth(vthin) lcolor(gray*.2)) legend(region(lcolor(none))) legend(bexpand) ///
> legend(order(1 "JOHN" 2 "DELP" 3 "IHME" 4 "IMPE" 5 "LANL" 6 "SRIV") size(small) row(1)) ///
> subtitle("  .", size(small) color(white)) ///
> ttext(0 21jan2020  "Bah" 0 20feb2020  "Esf" 0 20mar2020  "Far" 0 20apr2020  "Ord" 0 21may2020  "Kho" ///
> 0 21jun2020  "Tir" 0 22jul2020  "Mor" 0 22aug2020  "Sha" 0 22sep2020  "Meh" ///
> 0 22oct2020  "Aba" 0 21nov2020  "Aza" 0 21dec2020  "Dey" 0 20jan2021  "Bah" ///
> 0 19feb2021  "Esf" 0 21mar2021  "Far" 0 21apr2021  "Ord" 0 22may2021  "Kho" ///
> 0 22jun2021  "Tir" 0 23jul2021  "Mor" 0 23Aug2021  "Sha", size(small) color(black) placement(south))
{res}{txt}
{com}. 
. graph save "graph 11a COVID-19 daily deaths, Iran, reference scenarios.gph", replace
{txt}(note: file graph 11a COVID-19 daily deaths, Iran, reference scenarios.gph not found)
{res}{txt}(file graph 11a COVID-19 daily deaths, Iran, reference scenarios.gph saved)

{com}. graph export "graph 11a COVID-19 daily deaths, Iran, reference scenarios.pdf", replace
{txt}(file /Users/farshadpourmalek/Downloads/covir2-main/20210507/code/merge/graph 11a COVID-19 daily deaths, Iran, reference scenarios.pdf written in PDF format)

{com}. 
. 
. 
. 
. 
. * daily deaths, median or reference scenario, w CF
. 
. twoway ///
> (line DayDeaMeRaA00S00V00 date, sort lcolor(cyan) lwidth(thick) lpattern(tight_dot)) /// 1 "JOHN"
> (line DayDeaMeRaA00S00V00_CF2 date, sort lcolor(cyan) lpattern(tight_dot)) /// 2 "JOHN" CF2
> (line DayDeaMeRaA00S00V00_CF5 date, sort lcolor(cyan) lpattern(tight_dot)) /// 3 "JOHN" CF5
> (line DayDeaMeRaA01S00V03 date, sort lcolor(red)) /// 4 "DELP"
> (line DayDeaMeSmA02S01V03 date, sort lcolor(black)) /// 5 "IHME"
> (line DayDeaMeRaA03S02V07 date, sort lcolor(magenta)) /// 6 "IMPE"
> (line DayDeaMeRaA04S00V02 date, sort lcolor(gold)) /// 7 "LANL"
> (line DayDeaMeRaA05S00V02 date, sort lcolor(green)) /// 8 "SRIV"
> if date <= td(24Aug2021) ///
> , xtitle(Date) xlabel(#20, format(%tdYY-NN-DD) labsize(small)) xlabel(, grid) xlabel(, grid) ///
> xlabel(, angle(forty_five)) ylabel(, format(%9.0fc) labsize(small))  ylabel(, labsize(small) angle(horizontal)) ///
> ytitle(Daily deaths) title("COVID-19 daily deaths, Iran, reference scenarios", size(medium)) /// 
> xscale(lwidth(vthin) lcolor(gray*.2)) yscale(lwidth(vthin) lcolor(gray*.2)) legend(region(lcolor(none))) legend(bexpand) ///
> legend(order(1 "JOHN" 2 "CF 2" 3 "CF 5" 4 "DELP" 5 "IHME" 6 "IMPE" 7 "LANL" 8 "SRIV") size(small) row(1)) ///
> subtitle("with correction factors 2 and 5", size(small))
{res}{txt}
{com}. 
. graph save "graph 11b COVID-19 daily deaths, Iran, reference scenarios, w CF.gph", replace
{txt}(note: file graph 11b COVID-19 daily deaths, Iran, reference scenarios, w CF.gph not found)
{res}{txt}(file graph 11b COVID-19 daily deaths, Iran, reference scenarios, w CF.gph saved)

{com}. graph export "graph 11b COVID-19 daily deaths, Iran, reference scenarios, w CF.pdf", replace
{txt}(file /Users/farshadpourmalek/Downloads/covir2-main/20210507/code/merge/graph 11b COVID-19 daily deaths, Iran, reference scenarios, w CF.pdf written in PDF format)

{com}. 
. 
. 
. 
. * daily deaths, median or reference scenario, 2020-12-01 on
. 
. twoway ///
> (line DayDeaMeRaA00S00V00 date, sort lcolor(cyan) lwidth(vthick) lpattern(tight_dot)) /// 1 "JOHN"
> (line DayDeaMeRaA01S00V03 date, sort lcolor(red)) /// 2 "DELP"
> (line DayDeaMeSmA02S01V03 date, sort lcolor(black)) /// 3 "IHME"
> (line DayDeaMeRaA03S02V07 date, sort lcolor(magenta)) /// 4 "IMPE"
> (line DayDeaMeRaA04S00V02 date, sort lcolor(gold)) /// 5 "LANL"
> (line DayDeaMeRaA05S00V02 date, sort lcolor(green)) /// 6 "SRIV"
> if date >= td(20dec2020) & date <= td(23Aug2021) ///
> , xtitle(Date) xlabel(22270 22300 22330 22360 22391 22422 22453 22484 22515, ///
> format(%tdYY-NN-DD) labsize(small)) xlabel(, grid) xlabel(, grid) ///
> xlabel(, angle(forty_five)) ylabel(, format(%9.0fc) labsize(small))  ylabel(, labsize(small) angle(horizontal)) ///
> ytitle(Daily deaths) title("COVID-19 daily deaths, Iran, reference scenarios", size(medium)) /// 
> xscale(lwidth(vthin) lcolor(gray*.2)) yscale(lwidth(vthin) lcolor(gray*.2)) legend(region(lcolor(none))) legend(bexpand) ///
> legend(order(1 "JOHN" 2 "DELP" 3 "IHME" 4 "IMPE" 5 "LANL" 6 "SRIV") size(small) row(1)) ///
> subtitle("after 2020-12-01", size(small)) ///
> ttext(0 21dec2020  "Dey" 0 20jan2021  "Bah" ///
> 0 19feb2021  "Esf" 0 21mar2021  "Far" 0 21apr2021  "Ord" 0 22may2021  "Kho" ///
> 0 22jun2021  "Tir" 0 23jul2021  "Mor"  0 23Aug2021  "Sha", size(small) color(black))
{res}{txt}
{com}. 
. graph save "graph 12a COVID-19 daily deaths, Iran, reference scenarios, 2020-12-01 on.gph", replace
{txt}(note: file graph 12a COVID-19 daily deaths, Iran, reference scenarios, 2020-12-01 on.gph not found)
{res}{txt}(file graph 12a COVID-19 daily deaths, Iran, reference scenarios, 2020-12-01 on.gph saved)

{com}. graph export "graph 12a COVID-19 daily deaths, Iran, reference scenarios, 2020-12-01 on.pdf", replace
{txt}(file /Users/farshadpourmalek/Downloads/covir2-main/20210507/code/merge/graph 12a COVID-19 daily deaths, Iran, reference scenarios, 2020-12-01 on.pdf written in PDF format)

{com}. 
. 
. 
. 
. * daily deaths, median or reference scenario, 2020-12-01 on, w CF
. 
. twoway ///
> (line DayDeaMeRaA00S00V00 date, sort lcolor(cyan) lwidth(vthick) lpattern(tight_dot)) /// 1 "JOHN"
> (line DayDeaMeRaA00S00V00_CF2 date, sort lcolor(cyan) lpattern(tight_dot)) /// 2 "JOHN" CF2
> (line DayDeaMeRaA00S00V00_CF5 date, sort lcolor(cyan) lpattern(tight_dot)) /// 3 "JOHN" CF5
> (line DayDeaMeRaA01S00V03 date, sort lcolor(red)) /// 4 "DELP"
> (line DayDeaMeSmA02S01V03 date, sort lcolor(black)) /// 5 "IHME"
> (line DayDeaMeRaA03S02V07 date, sort lcolor(magenta)) /// 6 "IMPE"
> (line DayDeaMeRaA04S00V02 date, sort lcolor(gold)) /// 7 "LANL"
> (line DayDeaMeRaA05S00V02 date, sort lcolor(green)) /// 8 "SRIV"
> if date >= td(30nov2020) & date <= td(23Aug2021) ///
> , xtitle(Date) xlabel(#9, format(%tdYY-NN-DD) labsize(small)) xlabel(, grid) xlabel(, grid) ///
> xlabel(, angle(forty_five)) ylabel(, format(%9.0fc) labsize(small))  ylabel(, labsize(small) angle(horizontal)) ///
> ytitle(Daily deaths) title("COVID-19 daily deaths, Iran, reference scenarios", size(medium)) /// 
> xscale(lwidth(vthin) lcolor(gray*.2)) yscale(lwidth(vthin) lcolor(gray*.2)) legend(region(lcolor(none))) legend(bexpand) ///
> legend(order(1 "JOHN" 2 "CF 2" 3 "CF 5" 4 "DELP" 5 "IHME" 6 "IMPE" 7 "LANL" 8 "SRIV") size(small) row(1)) ///
> subtitle("after 2020-12-01, with correction factors 2 and 5", size(small))
{res}{txt}
{com}. 
. graph save "graph 12b COVID-19 daily deaths, Iran, reference scenarios, 2020-12-01 on, w CF.gph", replace
{txt}(note: file graph 12b COVID-19 daily deaths, Iran, reference scenarios, 2020-12-01 on, w CF.gph not found)
{res}{txt}(file graph 12b COVID-19 daily deaths, Iran, reference scenarios, 2020-12-01 on, w CF.gph saved)

{com}. graph export "graph 12b COVID-19 daily deaths, Iran, reference scenarios, 2020-12-01 on, w CF.pdf", replace
{txt}(file /Users/farshadpourmalek/Downloads/covir2-main/20210507/code/merge/graph 12b COVID-19 daily deaths, Iran, reference scenarios, 2020-12-01 on, w CF.pdf written in PDF format)

{com}. 
. 
. 
. 
. * daily deaths, median or reference scenario, 2020-12-01 on, CI
. 
. twoway ///
> (line DayDeaMeRaA00S00V00 date, sort lcolor(cyan) lwidth(vthick) lpattern(tight_dot)) /// 1 JOHN
> (line DayDeaMeRaA01S00V03 date, sort lcolor(red)) /// 2 "DELP" mean
> (line DayDeaLoRaA01S00V03 date, sort lcolor(red) lpattern(dash)) /// 3 "DELP" lower
> (line DayDeaUpRaA01S00V03 date, sort lcolor(red) lpattern(dash)) /// 4 "DELP" upper
> (line DayDeaMeSmA02S02V03 date, sort lcolor(black)) /// 5 IHME mean
> (line DayDeaLoSmA02S02V03 date, sort lcolor(black) lpattern(dash)) /// 6 IHME lower
> (line DayDeaUpSmA02S02V03 date, sort lcolor(black) lpattern(dash)) /// 7 IHME upper
> (line DayDeaMeRaA03S02V07 date, sort lcolor(magenta)) /// 8 IMPE mean
> (line DayDeaLoRaA03S02V07 date, sort lcolor(magenta) lpattern(dash)) /// 9 IMPE lower
> (line DayDeaUpRaA03S02V07 date, sort lcolor(magenta) lpattern(dash)) /// 10 IMPE upper
> (line DayDeaMeRaA04S00V02 date, sort lcolor(gold)) /// 11 LANL mean
> (line DayDeaLoRaA04S00V02 date, sort lcolor(gold) lpattern(dash)) /// 12 LANL lower
> (line DayDeaUpRaA04S00V02 date, sort lcolor(gold) lpattern(dash)) /// 13 LANL upper
> (line DayDeaMeRaA05S00V02 date, sort lcolor(green)) /// 14 "SRIV" mean
> (line DayDeaMeRaA05S00V02 date, sort lcolor(green) lpattern(dash)) /// 15 "SRIV" lower
> (line DayDeaMeRaA05S00V02 date, sort lcolor(green) lpattern(dash)) /// 16 "SRIV" upper
> if date >= td(30nov2020) & date <= td(23Aug2021)  ///
> , xtitle(Date) xlabel(#9, format(%tdYY-NN-DD) labsize(small)) xlabel(, grid) xlabel(, grid) ///
> xlabel(, angle(forty_five)) ylabel(, format(%9.0fc) labsize(small))  ylabel(, labsize(small) angle(horizontal)) ///
> ytitle(Daily deaths) title("COVID-19 daily deaths, Iran, reference scenarios", size(medium)) ///
> xscale(lwidth(vthin) lcolor(gray*.2)) yscale(lwidth(vthin) lcolor(gray*.2)) legend(region(lcolor(none))) legend(bexpand) ///
> legend(order(1 "JOHN" 2 "DELP" 5 "IHME" 8 "IMPE" 11 "LANL" 14 "SRIV") size(small) row(1)) ///
> subtitle("after 2020-12-01, with uncertainty", size(small)) ///
> note("Uncertainty limits: dashed curves") 
{res}{txt}
{com}. 
. graph save "graph 13a COVID-19 daily deaths, Iran, reference scenarios, 2020-12-01 on, CI.gph", replace
{txt}(note: file graph 13a COVID-19 daily deaths, Iran, reference scenarios, 2020-12-01 on, CI.gph not found)
{res}{txt}(file graph 13a COVID-19 daily deaths, Iran, reference scenarios, 2020-12-01 on, CI.gph saved)

{com}. graph export "graph 13a COVID-19 daily deaths, Iran, reference scenarios, 2020-12-01 on, CI.pdf", replace
{txt}(file /Users/farshadpourmalek/Downloads/covir2-main/20210507/code/merge/graph 13a COVID-19 daily deaths, Iran, reference scenarios, 2020-12-01 on, CI.pdf written in PDF format)

{com}. 
. 
. 
. 
. * daily deaths, median or reference scenario, 2020-12-01 on, CI, w CF
. 
. twoway ///
> (line DayDeaMeRaA00S00V00 date, sort lcolor(cyan) lwidth(vthick) lpattern(tight_dot)) /// 1 JOHN
> (line DayDeaMeRaA00S00V00_CF2 date, sort lcolor(cyan) lpattern(tight_dot)) /// 2 "JOHN" CF2
> (line DayDeaMeRaA00S00V00_CF5 date, sort lcolor(cyan) lpattern(tight_dot)) /// 3 "JOHN" CF5
> (line DayDeaMeRaA01S00V03 date, sort lcolor(red)) /// 4 "DELP" mean
> (line DayDeaLoRaA01S00V03 date, sort lcolor(red) lpattern(dash)) /// 5 "DELP" lower
> (line DayDeaUpRaA01S00V03 date, sort lcolor(red) lpattern(dash)) /// 6 "DELP" upper
> (line DayDeaMeSmA02S02V03 date, sort lcolor(black)) /// 7 IHME mean
> (line DayDeaLoSmA02S02V03 date, sort lcolor(black) lpattern(dash)) /// 8 IHME lower
> (line DayDeaUpSmA02S02V03 date, sort lcolor(black) lpattern(dash)) /// 9 IHME upper
> (line DayDeaMeRaA03S02V07 date, sort lcolor(magenta)) /// 10 IMPE mean
> (line DayDeaLoRaA03S02V07 date, sort lcolor(magenta) lpattern(dash)) /// 11 IMPE lower
> (line DayDeaUpRaA03S02V07 date, sort lcolor(magenta) lpattern(dash)) /// 12 IMPE upper
> (line DayDeaMeRaA04S00V02 date, sort lcolor(gold)) /// 13 LANL mean
> (line DayDeaLoRaA04S00V02 date, sort lcolor(gold) lpattern(dash)) /// 14 LANL lower
> (line DayDeaUpRaA04S00V02 date, sort lcolor(gold) lpattern(dash)) /// 15 LANL upper
> (line DayDeaMeRaA05S00V02 date, sort lcolor(green)) /// 16 "SRIV" mean
> (line DayDeaMeRaA05S00V02 date, sort lcolor(green) lpattern(dash)) /// 17 "SRIV" lower
> (line DayDeaMeRaA05S00V02 date, sort lcolor(green) lpattern(dash)) /// 18 "SRIV" upper
> if date >= td(30nov2020) & date <= td(23Aug2021)  ///
> , xtitle(Date) xlabel(#9, format(%tdYY-NN-DD) labsize(small)) xlabel(, grid) xlabel(, grid) ///
> xlabel(, angle(forty_five)) ylabel(, format(%9.0fc) labsize(small))  ylabel(, labsize(small) angle(horizontal)) ///
> ytitle(Daily deaths) title("COVID-19 daily deaths, Iran, reference scenarios", size(medium)) ///
> xscale(lwidth(vthin) lcolor(gray*.2)) yscale(lwidth(vthin) lcolor(gray*.2)) legend(region(lcolor(none))) legend(bexpand) ///
> legend(order(1 "JOHN" 2 "CF 2" 3 "CF 5" 4 "DELP" 7 "IHME" 10 "IMPE" 13 "LANL" 16 "SRIV") size(small) row(1)) ///
> note("Uncertainty limits: dashed curves") ///
> subtitle("after 2020-12-01, with correction factors 2 and 5, with uncertainty", size(small))
{res}{txt}
{com}. 
. graph save "graph 13b COVID-19 daily deaths, Iran, reference scenarios, 2020-12-01 on, CI, w CF.gph", replace
{txt}(note: file graph 13b COVID-19 daily deaths, Iran, reference scenarios, 2020-12-01 on, CI, w CF.gph not found)
{res}{txt}(file graph 13b COVID-19 daily deaths, Iran, reference scenarios, 2020-12-01 on, CI, w CF.gph saved)

{com}. graph export "graph 13b COVID-19 daily deaths, Iran, reference scenarios, 2020-12-01 on, CI, w CF.pdf", replace
{txt}(file /Users/farshadpourmalek/Downloads/covir2-main/20210507/code/merge/graph 13b COVID-19 daily deaths, Iran, reference scenarios, 2020-12-01 on, CI, w CF.pdf written in PDF format)

{com}. 
. 
. 
. 
. ***********************
. 
. * Daily cases (graph numbers start with 21)
. 
. 
. * daily cases, median or reference scenario
. 
. twoway ///
> (line DayCasMeRaA00S00V00 date, sort lcolor(cyan) lwidth(vthick) lpattern(tight_dot)) /// 1 "JOHN"
> (line DayCasMeRaA01S00V03 date, sort lcolor(red)) /// 4 "DELP"
> (line DayCasMeRaA02S01V03 date, sort lcolor(black)) /// 5 "IHME"
> (line DayCasMeRaA03S02V07 date, sort lcolor(magenta)) /// 6 "IMPE"
> (line DayCasMeRaA04S00V02 date, sort lcolor(gold)) /// 7 "LANL"
> (line DayCasMeRaA05S00V02 date, sort lcolor(green)) /// 8 "SRIV"
> if date >= td(01feb2020) & date <= td(23Aug2021) ///
> , xtitle(Date) xlabel(21935 21965 21994 22025 22056 22087 22118 22149 ///
> 22180 22210 22240 22270 22300 22330 22360 22391 22422 22453 22484 22515, ///
> format(%tdYY-NN-DD) labsize(small)) xlabel(, grid) xlabel(, grid) ///
> xlabel(, angle(forty_five)) ylabel(, format(%9.0fc) labsize(small))  ylabel(, labsize(small) angle(horizontal)) ///
> ytitle(Daily cases) title("COVID-19 daily cases, Iran, reference scenarios", size(medium)) /// 
> xscale(lwidth(vthin) lcolor(gray*.2)) yscale(lwidth(vthin) lcolor(gray*.2)) legend(region(lcolor(none))) legend(bexpand) ///
> legend(order(1 "JOHN" 2 "DELP" 3 "IHME" 4 "IMPE" 5 "LANL" 6 "SRIV" ) size(small) row(1)) ///
> subtitle("  .", size(small) color(white)) ///
> ttext(0 21jan2020  "Bah" 0 20feb2020  "Esf" 0 20mar2020  "Far" 0 20apr2020  "Ord" 0 21may2020  "Kho" ///
> 0 21jun2020  "Tir" 0 22jul2020  "Mor" 0 22aug2020  "Sha" 0 22sep2020  "Meh" ///
> 0 22oct2020  "Aba" 0 21nov2020  "Aza" 0 21dec2020  "Dey" 0 20jan2021  "Bah" ///
> 0 19feb2021  "Esf" 0 21mar2021  "Far" 0 21apr2021  "Ord" 0 22may2021  "Kho" ///
> 0 22jun2021  "Tir" 0 23jul2021  "Mor" 0 23Aug2021  "Sha", size(small) color(black) placement(south))
{res}{txt}
{com}. 
. graph save "graph 21a COVID-19 daily cases, Iran, reference scenarios.gph", replace
{txt}(note: file graph 21a COVID-19 daily cases, Iran, reference scenarios.gph not found)
{res}{txt}(file graph 21a COVID-19 daily cases, Iran, reference scenarios.gph saved)

{com}. graph export "graph 21a COVID-19 daily cases, Iran, reference scenarios.pdf", replace
{txt}(file /Users/farshadpourmalek/Downloads/covir2-main/20210507/code/merge/graph 21a COVID-19 daily cases, Iran, reference scenarios.pdf written in PDF format)

{com}. 
. 
. 
. 
. * daily cases, median or reference scenario, w CF
. 
. twoway ///
> (line DayCasMeRaA00S00V00 date, sort lcolor(cyan) lwidth(vthick) lpattern(tight_dot)) /// 1 "JOHN"
> (line DayCasMeRaA00S00V00_CF2 date, sort lcolor(cyan) lpattern(tight_dot)) /// 2 "JOHN" CF2
> (line DayCasMeRaA00S00V00_CF5 date, sort lcolor(cyan) lpattern(tight_dot)) /// 3 "JOHN" CF5
> (line DayCasMeRaA01S00V03 date, sort lcolor(red)) /// 4 "DELP"
> (line DayCasMeRaA02S01V03 date, sort lcolor(black)) /// 5 "IHME"
> (line DayCasMeRaA03S02V07 date, sort lcolor(magenta)) /// 6 "IMPE"
> (line DayCasMeRaA04S00V02 date, sort lcolor(gold)) /// 7 "LANL"
> (line DayCasMeRaA05S00V02 date, sort lcolor(green)) /// 8 "SRIV"
> if date <= td(23Aug2021) ///
> , xtitle(Date) xlabel(#19, format(%tdYY-NN-DD) labsize(small)) xlabel(, grid) xlabel(, grid) ///
> xlabel(, angle(forty_five)) ylabel(, format(%9.0fc) labsize(small))  ylabel(, labsize(small) angle(horizontal)) ///
> ytitle(Daily cases) title("COVID-19 daily cases, Iran, reference scenarios", size(medium)) /// 
> xscale(lwidth(vthin) lcolor(gray*.2)) yscale(lwidth(vthin) lcolor(gray*.2)) legend(region(lcolor(none))) legend(bexpand) ///
> legend(order(1 "JOHN" 2 "CF 2" 3 "CF 5" 4 "DELP" 5 "IHME" 6 "IMPE" 7 "LANL" 8 "SRIV" ) size(small) row(1)) ///
> subtitle("with correction factors 2 and 5", size(small))
{res}{txt}
{com}. 
. graph save "graph 21b COVID-19 daily cases, Iran, reference scenarios, w CF.gph", replace
{txt}(note: file graph 21b COVID-19 daily cases, Iran, reference scenarios, w CF.gph not found)
{res}{txt}(file graph 21b COVID-19 daily cases, Iran, reference scenarios, w CF.gph saved)

{com}. graph export "graph 21b COVID-19 daily cases, Iran, reference scenarios, w CF.pdf", replace
{txt}(file /Users/farshadpourmalek/Downloads/covir2-main/20210507/code/merge/graph 21b COVID-19 daily cases, Iran, reference scenarios, w CF.pdf written in PDF format)

{com}. 
. 
. 
. 
. * daily cases, median or reference scenario, 2020-12-01 on
. 
. twoway ///
> (line DayCasMeRaA00S00V00 date, sort lcolor(cyan) lwidth(vthick) lpattern(tight_dot)) /// 1 "JOHN"
> (line DayCasMeRaA01S00V03 date, sort lcolor(red)) /// 2 "DELP"
> (line DayCasMeRaA02S01V03 date, sort lcolor(black)) /// 3 "IHME"
> (line DayCasMeRaA03S02V07 date, sort lcolor(magenta)) /// 4 "IMPE"
> (line DayCasMeRaA04S00V02 date, sort lcolor(gold)) /// 5 "LANL"
> (line DayCasMeRaA05S00V02 date, sort lcolor(green)) /// 6 "SRIV"
> if date >= td(01dec2020) & date <= td(23Aug2021) ///
> , xtitle(Date) xlabel(22270 22300 22330 22360 22391 22422 22453 22484 22515, ///
> format(%tdYY-NN-DD) labsize(small)) xlabel(, grid) xlabel(, grid) ///
> xlabel(, angle(forty_five)) ylabel(, format(%9.0fc) labsize(small))  ylabel(, labsize(small) angle(horizontal)) ///
> ytitle(Daily cases) title("COVID-19 daily cases, Iran, reference scenarios", size(medium)) /// 
> xscale(lwidth(vthin) lcolor(gray*.2)) yscale(lwidth(vthin) lcolor(gray*.2)) legend(region(lcolor(none))) legend(bexpand) ///
> legend(order(1 "JOHN" 2 "DELP" 3 "IHME" 4 "IMPE" 5 "LANL" 6 "SRIV" ) size(small) row(1)) ///
> subtitle("after 2020-12-01", size(small)) ///
> ttext(0 21dec2020  "Dey" 0 20jan2021  "Bah" ///
> 0 19feb2021  "Esf" 0 21mar2021  "Far" 0 21apr2021  "Ord" 0 22may2021  "Kho" ///
> 0 22jun2021  "Tir" 0 23jul2021  "Mor" 0 23Aug2021  "Sha", size(small) color(black))
{res}{txt}
{com}. 
. graph save "graph 22a COVID-19 daily cases, Iran, reference scenarios, 2020-12-01 on.gph", replace
{txt}(note: file graph 22a COVID-19 daily cases, Iran, reference scenarios, 2020-12-01 on.gph not found)
{res}{txt}(file graph 22a COVID-19 daily cases, Iran, reference scenarios, 2020-12-01 on.gph saved)

{com}. graph export "graph 22a COVID-19 daily cases, Iran, reference scenarios, 2020-12-01 on.pdf", replace
{txt}(file /Users/farshadpourmalek/Downloads/covir2-main/20210507/code/merge/graph 22a COVID-19 daily cases, Iran, reference scenarios, 2020-12-01 on.pdf written in PDF format)

{com}. 
. 
. 
. 
. * daily cases, median or reference scenario, 2020-12-01 on, w CF
. 
. twoway ///
> (line DayCasMeRaA00S00V00 date, sort lcolor(cyan) lwidth(vthick) lpattern(tight_dot)) /// 1 "JOHN"
> (line DayCasMeRaA00S00V00_CF2 date, sort lcolor(cyan) lpattern(tight_dot)) /// 2 "JOHN" CF2
> (line DayCasMeRaA00S00V00_CF5 date, sort lcolor(cyan) lpattern(tight_dot)) /// 3 "JOHN" CF5
> (line DayCasMeRaA01S00V03 date, sort lcolor(red)) /// 4 "DELP"
> (line DayCasMeRaA02S01V03 date, sort lcolor(black)) /// 5 "IHME"
> (line DayCasMeRaA03S02V07 date, sort lcolor(magenta)) /// 6 "IMPE"
> (line DayCasMeRaA04S00V02 date, sort lcolor(gold)) /// 7 "LANL"
> (line DayCasMeRaA05S00V02 date, sort lcolor(green)) /// 8 "SRIV"
> if date <= td(23Aug2021) & date >= td(30nov2020) ///
> , xtitle(Date) xlabel(#8, format(%tdYY-NN-DD) labsize(small)) xlabel(, grid) xlabel(, grid) ///
> xlabel(, angle(forty_five)) ylabel(, format(%9.0fc) labsize(small))  ylabel(, labsize(small) angle(horizontal)) ///
> ytitle(Daily cases) title("COVID-19 daily cases, Iran, reference scenarios", size(medium)) /// 
> xscale(lwidth(vthin) lcolor(gray*.2)) yscale(lwidth(vthin) lcolor(gray*.2)) legend(region(lcolor(none))) legend(bexpand) ///
> legend(order(1 "JOHN" 2 "CF 2" 3 "CF 5" 4 "DELP" 5 "IHME" 6 "IMPE" 7 "LANL" 8 "SRIV" ) size(small) row(1)) ///
> subtitle("after 2020-12-01, with correction factors 2 and 5", size(small))
{res}{txt}
{com}. 
. graph save "graph 22b COVID-19 daily cases, Iran, reference scenarios, 2020-12-01 on, w CF.gph", replace
{txt}(note: file graph 22b COVID-19 daily cases, Iran, reference scenarios, 2020-12-01 on, w CF.gph not found)
{res}{txt}(file graph 22b COVID-19 daily cases, Iran, reference scenarios, 2020-12-01 on, w CF.gph saved)

{com}. graph export "graph 22b COVID-19 daily cases, Iran, reference scenarios, 2020-12-01 on, w CF.pdf", replace
{txt}(file /Users/farshadpourmalek/Downloads/covir2-main/20210507/code/merge/graph 22b COVID-19 daily cases, Iran, reference scenarios, 2020-12-01 on, w CF.pdf written in PDF format)

{com}. 
. 
. 
. 
. * daily cases, median or reference scenario, 2020-12-01 on, CI
. 
. twoway ///
> (line DayCasMeRaA00S00V00 date, sort lcolor(cyan) lwidth(vthick) lpattern(tight_dot)) /// 1 JOHN
> (line DayCasMeRaA01S00V03  date, sort lcolor(red)) /// 2 DELP mean
> (line DayCasLoRaA01S00V03  date, sort lcolor(red) lpattern(dash)) /// 3 DELP lower
> (line DayCasUpRaA01S00V03  date, sort lcolor(red) lpattern(dash)) /// 4 DELP upper
> (line DayCasMeRaA02S01V03 date, sort lcolor(black)) /// 5 IHME mean
> (line DayCasLoRaA02S02V03 date, sort lcolor(black) lpattern(dash)) /// 6 IHME lower
> (line DayCasUpRaA02S02V03 date, sort lcolor(black) lpattern(dash)) /// 7 IHME upper
> (line DayCasMeRaA03S02V07 date, sort lcolor(magenta)) /// 8 IMPE mean
> (line DayCasLoRaA03S02V07 date, sort lcolor(magenta) lpattern(dash)) /// 9 IMPE lower
> (line DayCasUpRaA03S02V07 date, sort lcolor(magenta) lpattern(dash)) /// 10 IMPE upper
> (line DayCasMeRaA04S00V02 date, sort lcolor(gold)) /// 11 LANL mean
> (line DayCasLoRaA04S00V02 date, sort lcolor(gold) lpattern(dash)) /// 12 LANL lower
> (line DayCasUpRaA04S00V02 date, sort lcolor(gold) lpattern(dash)) /// 13 LANL upper
> (line DayCasMeRaA05S00V02 date, sort lcolor(green)) /// 14 "SRIV" mean
> (line DayCasLoRaA05S00V02 date, sort lcolor(green) lpattern(dash)) /// 15 "SRIV" lower
> (line DayCasUpRaA05S00V02 date, sort lcolor(green) lpattern(dash)) /// 16 "SRIV" upper
> if date <= td(23Aug2021) & date >= td(30nov2020) ///
> , xtitle(Date) xlabel(#12, format(%tdYY-NN-DD) labsize(small)) xlabel(, grid) xlabel(, grid) ///
> xlabel(, angle(forty_five)) ylabel(, format(%9.0fc) labsize(small))  ylabel(, labsize(small) angle(horizontal)) ///
> ytitle(Daily cases) title("COVID-19 daily cases, Iran, reference scenarios", size(medium)) ///
> xscale(lwidth(vthin) lcolor(gray*.2)) yscale(lwidth(vthin) lcolor(gray*.2)) legend(region(lcolor(none))) legend(bexpand) ///
> legend(order(1 "JOHN" 2 "DELP" 5 "IHME" 8 "IMPE" 11 "LANL" 14 "SRIV") size(small) row(1)) ///
> note("Uncertainty limits: dashed curves") ///
> subtitle("after 2020-12-01, with uncertainty", size(small))
{res}{txt}
{com}. 
. graph save "graph 23a COVID-19 daily cases, Iran, reference scenarios, 2020-12-01 on, CI.gph", replace
{txt}(note: file graph 23a COVID-19 daily cases, Iran, reference scenarios, 2020-12-01 on, CI.gph not found)
{res}{txt}(file graph 23a COVID-19 daily cases, Iran, reference scenarios, 2020-12-01 on, CI.gph saved)

{com}. graph export "graph 23a COVID-19 daily cases, Iran, reference scenarios, 2020-12-01 on, CI.pdf", replace
{txt}(file /Users/farshadpourmalek/Downloads/covir2-main/20210507/code/merge/graph 23a COVID-19 daily cases, Iran, reference scenarios, 2020-12-01 on, CI.pdf written in PDF format)

{com}. 
. 
. 
. 
. * daily cases, median or reference scenario, 2020-12-01 on, CI, w CF
. 
. twoway ///
> (line DayCasMeRaA00S00V00 date, sort lcolor(cyan) lwidth(vthick) lpattern(tight_dot)) /// 1 JOHN
> (line DayCasMeRaA00S00V00_CF2 date, sort lcolor(cyan) lpattern(tight_dot)) /// 2 "JOHN" CF2
> (line DayCasMeRaA00S00V00_CF5 date, sort lcolor(cyan) lpattern(tight_dot)) /// 3 "JOHN" CF5
> (line DayCasMeRaA01S00V03  date, sort lcolor(red)) /// 4 DELP mean
> (line DayCasLoRaA01S00V03  date, sort lcolor(red) lpattern(dash)) /// 5 DELP lower
> (line DayCasUpRaA01S00V03  date, sort lcolor(red) lpattern(dash)) /// 6 DELP upper
> (line DayCasMeRaA02S01V03 date, sort lcolor(black)) /// 7 IHME mean
> (line DayCasLoRaA02S02V03 date, sort lcolor(black) lpattern(dash)) /// 8 IHME lower
> (line DayCasUpRaA02S02V03 date, sort lcolor(black) lpattern(dash)) /// 9 IHME upper
> (line DayCasMeRaA03S02V07 date, sort lcolor(magenta)) /// 10 IMPE mean
> (line DayCasLoRaA03S02V07 date, sort lcolor(magenta) lpattern(dash)) /// 11 IMPE lower
> (line DayCasUpRaA03S02V07 date, sort lcolor(magenta) lpattern(dash)) /// 12 IMPE upper
> (line DayCasMeRaA04S00V02 date, sort lcolor(gold)) /// 13 LANL mean
> (line DayCasLoRaA04S00V02 date, sort lcolor(gold) lpattern(dash)) /// 14 LANL lower
> (line DayCasUpRaA04S00V02 date, sort lcolor(gold) lpattern(dash)) /// 15 LANL upper
> (line DayCasMeRaA05S00V02 date, sort lcolor(green)) /// 16 "SRIV" mean
> (line DayCasLoRaA05S00V02 date, sort lcolor(green) lpattern(dash)) /// 17 "SRIV" lower
> (line DayCasUpRaA05S00V02 date, sort lcolor(green) lpattern(dash)) /// 18 "SRIV" upper
> if date <= td(23Aug2021) & date >= td(30nov2020) ///
> , xtitle(Date) xlabel(#12, format(%tdYY-NN-DD) labsize(small)) xlabel(, grid) xlabel(, grid) ///
> xlabel(, angle(forty_five)) ylabel(, format(%9.0fc) labsize(small))  ylabel(, labsize(small) angle(horizontal)) ///
> ytitle(Daily cases) title("COVID-19 daily cases, Iran, reference scenarios", size(medium)) ///
> xscale(lwidth(vthin) lcolor(gray*.2)) yscale(lwidth(vthin) lcolor(gray*.2)) legend(region(lcolor(none))) legend(bexpand) ///
> legend(order(1 "JOHN" 2 "CF 2" 3 "CF 5" 4 "DELP" 7 "IHME" 10 "IMPE" 13 "LANL" 16 "SRIV") size(small) row(1)) ///
> note("Uncertainty limits: dashed curves") ///
> subtitle("after 2020-12-01, with correction factors 2 and 5, with uncertainty", size(small))
{res}{txt}
{com}. 
. graph save "graph 23b COVID-19 daily cases, Iran, reference scenarios, 2020-12-01 on, CI., w CF.gph", replace
{txt}(note: file graph 23b COVID-19 daily cases, Iran, reference scenarios, 2020-12-01 on, CI., w CF.gph not found)
{res}{txt}(file graph 23b COVID-19 daily cases, Iran, reference scenarios, 2020-12-01 on, CI., w CF.gph saved)

{com}. graph export "graph 23b COVID-19 daily cases, Iran, reference scenarios, 2020-12-01 on, CI, w CF.pdf", replace
{txt}(file /Users/farshadpourmalek/Downloads/covir2-main/20210507/code/merge/graph 23b COVID-19 daily cases, Iran, reference scenarios, 2020-12-01 on, CI, w CF.pdf written in PDF format)

{com}. 
. 
. 
. 
. *****************
. 
. * total deaths (graph numbers start with 31)
. 
. 
. * total deaths, median or reference scenario
. 
. twoway ///
> (line TotDeaMeRaA00S00V00 date, sort lcolor(cyan) lwidth(vthick) lpattern(tight_dot)) /// 1 "JOHN"
> (line TotDeaMeRaA01S00V03 date, sort lcolor(red)) /// 2 "DELP"
> (line TotDeaMeSmA02S01V03 date, sort lcolor(black)) /// 3 "IHME"
> (line TotDeaMeRaA03S02V07 date, sort lcolor(magenta)) /// 4 "IMPE"
> (line TotDeaMeRaA04S00V0 date, sort lcolor(gold)) /// 5 "LANL"
> (line TotDeaMeRaA05S00V02 date, sort lcolor(green)) /// 6 "SRIV"
> if date >= td(31dec2019) & date <= td(23Aug2021) ///
> , xtitle(Date) xlabel(#19, format(%tdYY-NN-DD) labsize(small)) xlabel(, grid) xlabel(, grid) ///
> xlabel(, angle(forty_five)) ylabel(, format(%9.0fc) labsize(small))  ylabel(, labsize(small) angle(horizontal)) ///
> ytitle(Total deaths) title("COVID-19 total deaths, Iran, reference scenarios", size(medium)) /// 
> xscale(lwidth(vthin) lcolor(gray*.2)) yscale(lwidth(vthin) lcolor(gray*.2)) legend(region(lcolor(none))) legend(bexpand) ///
> legend(order(1 "JOHN" 2 "DELP" 3 "IHME" 4 "IMPE" 5 "LANL" 6 "SRIV") size(small) row(1)) ///
> subtitle("  .", size(small) color(white))
{res}{txt}
{com}. 
. graph save "graph 31a COVID-19 total deaths, Iran, reference scenarios.gph", replace
{txt}(note: file graph 31a COVID-19 total deaths, Iran, reference scenarios.gph not found)
{res}{txt}(file graph 31a COVID-19 total deaths, Iran, reference scenarios.gph saved)

{com}. graph export "graph 31a COVID-19 total deaths, Iran, reference scenarios.pdf", replace
{txt}(file /Users/farshadpourmalek/Downloads/covir2-main/20210507/code/merge/graph 31a COVID-19 total deaths, Iran, reference scenarios.pdf written in PDF format)

{com}. 
. 
. 
. 
. * total deaths, median or reference scenariom, w CF
. 
. twoway ///
> (line TotDeaMeRaA00S00V00 date, sort lcolor(cyan) lwidth(vthick) lpattern(tight_dot)) /// 1 "JOHN"
> (line TotDeaMeRaA00S00V00_CF2 date, sort lcolor(cyan) lpattern(tight_dot)) /// 2 "JOHN" CF2
> (line TotDeaMeRaA00S00V00_CF5 date, sort lcolor(cyan) lpattern(tight_dot)) /// 3 "JOHN" CF5
> (line TotDeaMeRaA01S00V03 date, sort lcolor(red)) /// 4 "DELP"
> (line TotDeaMeSmA02S01V03 date, sort lcolor(black)) /// 5 "IHME"
> (line TotDeaMeRaA03S02V07 date, sort lcolor(magenta)) /// 6 "IMPE"
> (line TotDeaMeRaA04S00V0 date, sort lcolor(gold)) /// 7 "LANL"
> (line TotDeaMeRaA05S00V02 date, sort lcolor(green)) /// 8 "SRIV"
> if date >= td(31dec2019) & date <= td(23Aug2021) ///
> , xtitle(Date) xlabel(#19, format(%tdYY-NN-DD) labsize(small)) xlabel(, grid) xlabel(, grid) ///
> xlabel(, angle(forty_five)) ylabel(, format(%12.0fc) labsize(small))  ylabel(, labsize(small) angle(horizontal)) ///
> ytitle(Total deaths) title("COVID-19 total deaths, Iran, reference scenarios", size(medium)) /// 
> xscale(lwidth(vthin) lcolor(gray*.2)) yscale(lwidth(vthin) lcolor(gray*.2)) legend(region(lcolor(none))) legend(bexpand) ///
> legend(order(1 "JOHN" 2 "CF 2" 3 "CF 5" 4 "DELP" 5 "IHME" 6 "IMPE" 7 "LANL" 8 "SRIV") size(small) row(1)) ///
> subtitle("with correction factors 2 and 5", size(small))
{res}{txt}
{com}. 
. graph save "graph 31b COVID-19 total deaths, Iran, reference scenarios, w CF.gph", replace
{txt}(note: file graph 31b COVID-19 total deaths, Iran, reference scenarios, w CF.gph not found)
{res}{txt}(file graph 31b COVID-19 total deaths, Iran, reference scenarios, w CF.gph saved)

{com}. graph export "graph 31b COVID-19 total deaths, Iran, reference scenarios, w CF.pdf", replace
{txt}(file /Users/farshadpourmalek/Downloads/covir2-main/20210507/code/merge/graph 31b COVID-19 total deaths, Iran, reference scenarios, w CF.pdf written in PDF format)

{com}. 
. 
. 
. 
. * total deaths, median or reference scenario, 2020-12-01 on
. 
. twoway ///
> (line TotDeaMeRaA00S00V00 date, sort lcolor(cyan) lwidth(vthick) lpattern(tight_dot)) /// 1 "JOHN"
> (line TotDeaMeRaA01S00V03 date, sort lcolor(red)) /// 2 "DELP"
> (line TotDeaMeSmA02S01V03 date, sort lcolor(black)) /// 3 "IHME"
> (line TotDeaMeRaA03S02V07 date, sort lcolor(magenta)) /// 4 "IMPE"
> (line TotDeaMeRaA04S00V0 date, sort lcolor(gold)) /// 5 "LANL"
> (line TotDeaMeRaA05S00V02 date, sort lcolor(green)) /// 6 "SRIV"
> if date >= td(30nov2020) & date <= td(23Aug2021) ///
> , xtitle(Date) xlabel(#9, format(%tdYY-NN-DD) labsize(small)) xlabel(, grid) xlabel(, grid) ///
> xlabel(, angle(forty_five)) ylabel(, format(%9.0fc) labsize(small))  ylabel(, labsize(small) angle(horizontal)) ///
> ytitle(Total deaths) title("COVID-19 total deaths, Iran, reference scenarios", size(medium)) /// 
> xscale(lwidth(vthin) lcolor(gray*.2)) yscale(lwidth(vthin) lcolor(gray*.2)) legend(region(lcolor(none))) legend(bexpand) ///
> legend(order(1 "JOHN" 2 "DELP" 3 "IHME" 4 "IMPE" 5 "LANL" 6 "SRIV") size(small) row(1)) ///
> subtitle("after 2020-12-01", size(small))
{res}{txt}
{com}. 
. graph save "graph 32a COVID-19 total deaths, Iran, reference scenarios, 2020-12-01 on.gph", replace
{txt}(note: file graph 32a COVID-19 total deaths, Iran, reference scenarios, 2020-12-01 on.gph not found)
{res}{txt}(file graph 32a COVID-19 total deaths, Iran, reference scenarios, 2020-12-01 on.gph saved)

{com}. graph export "graph 32a COVID-19 total deaths, Iran, reference scenarios, 2020-12-01 on.pdf", replace
{txt}(file /Users/farshadpourmalek/Downloads/covir2-main/20210507/code/merge/graph 32a COVID-19 total deaths, Iran, reference scenarios, 2020-12-01 on.pdf written in PDF format)

{com}. 
. 
. 
. 
. * total deaths, median or reference scenario, 2020-12-01 on, w CF
. 
. twoway ///
> (line TotDeaMeRaA00S00V00 date, sort lcolor(cyan) lwidth(vthick) lpattern(tight_dot)) /// 1 "JOHN"
> (line TotCasMeRaA00S00V00_CF2 date, sort lcolor(cyan) lpattern(tight_dot)) /// 2 "JOHN" CF2
> (line TotCasMeRaA00S00V00_CF5 date, sort lcolor(cyan) lpattern(tight_dot)) /// 3 "JOHN" CF5
> (line TotDeaMeRaA01S00V03 date, sort lcolor(red)) /// 4 "DELP"
> (line TotDeaMeSmA02S01V03 date, sort lcolor(black)) /// 5 "IHME"
> (line TotDeaMeRaA03S02V07 date, sort lcolor(magenta)) /// 6 "IMPE"
> (line TotDeaMeRaA04S00V0 date, sort lcolor(gold)) /// 7 "LANL"
> (line TotDeaMeRaA05S00V02 date, sort lcolor(green)) /// 8 "SRIV"
> if date >= td(30nov2020) & date <= td(23Aug2021) ///
> , xtitle(Date) xlabel(#9, format(%tdYY-NN-DD) labsize(small)) xlabel(, grid) xlabel(, grid) ///
> xlabel(, angle(forty_five)) ylabel(, format(%12.0fc) labsize(small))  ylabel(, labsize(small) angle(horizontal)) ///
> ytitle(Total deaths) title("COVID-19 total deaths, Iran, reference scenarios", size(medium)) /// 
> xscale(lwidth(vthin) lcolor(gray*.2)) yscale(lwidth(vthin) lcolor(gray*.2)) legend(region(lcolor(none))) legend(bexpand) ///
> legend(order(1 "JOHN" 2 "CF 2" 3 "CF 5" 4 "DELP" 5 "IHME" 6 "IMPE" 7 "LANL" 8 "SRIV") size(small) row(1)) ///
> subtitle("after 2020-12-01, with correction factors 2 and 5", size(small))
{res}{txt}
{com}. 
. graph save "graph 32b COVID-19 total deaths, Iran, reference scenarios, 2020-12-01 on, w CF.gph", replace
{txt}(note: file graph 32b COVID-19 total deaths, Iran, reference scenarios, 2020-12-01 on, w CF.gph not found)
{res}{txt}(file graph 32b COVID-19 total deaths, Iran, reference scenarios, 2020-12-01 on, w CF.gph saved)

{com}. graph export "graph 32b COVID-19 total deaths, Iran, reference scenarios, 2020-12-01 on, w CF.pdf", replace
{txt}(file /Users/farshadpourmalek/Downloads/covir2-main/20210507/code/merge/graph 32b COVID-19 total deaths, Iran, reference scenarios, 2020-12-01 on, w CF.pdf written in PDF format)

{com}. 
. 
. 
. 
. * total deaths, median or reference scenario, 2020-12-01 on, CI
. 
. twoway ///
> (line TotDeaMeRaA00S00V00 date, sort lcolor(cyan) lwidth(vthick) lpattern(tight_dot)) /// 1 JOHN
> (line TotDeaMeRaA01S00V03 date, sort lcolor(red)) /// 2 DELP mean
> (line TotDeaLoRaA01S00V03 date, sort lcolor(red) lpattern(dash)) /// 3 DELP lower
> (line TotDeaUpRaA01S00V03 date, sort lcolor(red) lpattern(dash)) /// 4 DELP upper
> (line TotDeaMeSmA02S02V03 date, sort lcolor(black)) /// 5 IHME mean
> (line TotDeaLoSmA02S02V03 date, sort lcolor(black) lpattern(dash)) /// 6 IHME lower
> (line TotDeaUpSmA02S02V03 date, sort lcolor(black) lpattern(dash)) /// 7 IHME upper
> (line TotDeaMeRaA03S02V07 date, sort lcolor(magenta)) /// 8 IMPE mean
> (line TotDeaLoRaA03S02V07 date, sort lcolor(magenta) lpattern(dash)) /// 9 IMPE lower
> (line TotDeaUpRaA03S02V07 date, sort lcolor(magenta) lpattern(dash)) /// 10 IMPE upper
> (line TotDeaMeRaA04S00V0 date, sort lcolor(gold)) /// 11 LANL mean
> (line TotDeaLoRaA04S00V0 date, sort lcolor(gold) lpattern(dash)) /// 12 LANL lower
> (line TotDeaUpRaA04S00V0 date, sort lcolor(gold) lpattern(dash)) /// 13 LANL upper
> (line TotDeaMeRaA05S00V02 date, sort lcolor(green)) /// 14 "SRIV" mean
> (line TotDeaLoRaA05S00V02 date, sort lcolor(green) lpattern(dash)) /// 15 "SRIV" lower
> (line TotDeaUpRaA05S00V02 date, sort lcolor(green) lpattern(dash)) /// 16 "SRIV" upper
> if date >= td(30nov2020) & date <= td(23Aug2021) ///
> , xtitle(Date) xlabel(#9, format(%tdYY-NN-DD) labsize(small)) xlabel(, grid) xlabel(, grid) ///
> xlabel(, angle(forty_five)) ylabel(, format(%9.0fc) labsize(small))  ylabel(, labsize(small) angle(horizontal)) ///
> ytitle(Total deaths) title("COVID-19 total deaths, Iran, reference scenarios", size(medium)) ///
> xscale(lwidth(vthin) lcolor(gray*.2)) yscale(lwidth(vthin) lcolor(gray*.2)) legend(region(lcolor(none))) legend(bexpand) ///
> legend(order(1 "JOHN" 2 "DELP" 5 "IHME" 8 "IMPE" 11 "LANL" 14 "SRIV") size(small) row(1)) ///
> note("Uncertainty limits: dashed curves") ///
> subtitle("after 2020-12-01, with uncertainty", size(small))
{res}{txt}
{com}. 
. graph save "graph 34a COVID-19 total deaths, Iran, reference scenarios, 2020-12-01 on, CI.gph", replace
{txt}(note: file graph 34a COVID-19 total deaths, Iran, reference scenarios, 2020-12-01 on, CI.gph not found)
{res}{txt}(file graph 34a COVID-19 total deaths, Iran, reference scenarios, 2020-12-01 on, CI.gph saved)

{com}. graph export "graph 34a COVID-19 total deaths, Iran, reference scenarios, 2020-12-01 on, CI.pdf", replace
{txt}(file /Users/farshadpourmalek/Downloads/covir2-main/20210507/code/merge/graph 34a COVID-19 total deaths, Iran, reference scenarios, 2020-12-01 on, CI.pdf written in PDF format)

{com}. 
. 
. 
. 
. * total deaths, median or reference scenario, 2020-12-01 on, CI, w CF
. 
. twoway ///
> (line TotDeaMeRaA00S00V00 date, sort lcolor(cyan) lwidth(vthick) lpattern(tight_dot)) /// 1 JOHN
> (line TotDeaMeRaA00S00V00_CF2 date, sort lcolor(cyan) lpattern(tight_dot)) /// 2 "JOHN" CF2
> (line TotDeaMeRaA00S00V00_CF5 date, sort lcolor(cyan) lpattern(tight_dot)) /// 3 "JOHN" CF5
> (line TotDeaMeRaA01S00V03 date, sort lcolor(red)) /// 4 DELP mean
> (line TotDeaLoRaA01S00V03 date, sort lcolor(red) lpattern(dash)) /// 5 DELP lower
> (line TotDeaUpRaA01S00V03 date, sort lcolor(red) lpattern(dash)) /// 6 DELP upper
> (line TotDeaMeSmA02S02V03 date, sort lcolor(black)) /// 7 IHME mean
> (line TotDeaLoSmA02S02V03 date, sort lcolor(black) lpattern(dash)) /// 8 IHME lower
> (line TotDeaUpSmA02S02V03 date, sort lcolor(black) lpattern(dash)) /// 9 IHME upper
> (line TotDeaMeRaA03S02V07 date, sort lcolor(magenta)) /// 10 IMPE mean
> (line TotDeaLoRaA03S02V07 date, sort lcolor(magenta) lpattern(dash)) /// 11 IMPE lower
> (line TotDeaUpRaA03S02V07 date, sort lcolor(magenta) lpattern(dash)) /// 12 IMPE upper
> (line TotDeaMeRaA04S00V0 date, sort lcolor(gold)) /// 13 LANL mean
> (line TotDeaLoRaA04S00V0 date, sort lcolor(gold) lpattern(dash)) /// 14 LANL lower
> (line TotDeaUpRaA04S00V0 date, sort lcolor(gold) lpattern(dash)) /// 15 LANL upper
> (line TotDeaMeRaA05S00V02 date, sort lcolor(green)) /// 16 "SRIV" mean
> (line TotDeaLoRaA05S00V02 date, sort lcolor(green) lpattern(dash)) /// 17 "SRIV" lower
> (line TotDeaUpRaA05S00V02 date, sort lcolor(green) lpattern(dash)) /// 18 "SRIV" upper
> if date >= td(30nov2020) & date <= td(23Aug2021) ///
> , xtitle(Date) xlabel(#9, format(%tdYY-NN-DD) labsize(small)) xlabel(, grid) xlabel(, grid) ///
> xlabel(, angle(forty_five)) ylabel(, format(%9.0fc) labsize(small))  ylabel(, labsize(small) angle(horizontal)) ///
> ytitle(Total deaths) title("COVID-19 total deaths, Iran, reference scenarios", size(medium)) ///
> xscale(lwidth(vthin) lcolor(gray*.2)) yscale(lwidth(vthin) lcolor(gray*.2)) legend(region(lcolor(none))) legend(bexpand) ///
> legend(order(1 "JOHN" 2 "CF 2" 3 "CF 5" 4 "DELP" 7 "IHME" 10 "IMPE" 13 "LANL" 16 "SRIV") size(small) row(1)) ///
> note("Uncertainty limits: dashed curves") ///
> subtitle("after 2020-12-01, with correction factors 2 and 5, with uncertainty", size(small))
{res}{txt}
{com}. 
. graph save "graph 34b COVID-19 total deaths, Iran, reference scenarios, 2020-12-01 on, CI, w CF.gph", replace
{txt}(note: file graph 34b COVID-19 total deaths, Iran, reference scenarios, 2020-12-01 on, CI, w CF.gph not found)
{res}{txt}(file graph 34b COVID-19 total deaths, Iran, reference scenarios, 2020-12-01 on, CI, w CF.gph saved)

{com}. graph export "graph 34b COVID-19 total deaths, Iran, reference scenarios, 2020-12-01 on, CI, w CF.pdf", replace
{txt}(file /Users/farshadpourmalek/Downloads/covir2-main/20210507/code/merge/graph 34b COVID-19 total deaths, Iran, reference scenarios, 2020-12-01 on, CI, w CF.pdf written in PDF format)

{com}. 
. 
. 
. 
. *****************
. 
. * total cases (graph numbers start with 41)
. 
. 
. * total cases, median or reference scenario
. 
. twoway ///
> (line TotCasMeRaA00S00V00 date, sort lcolor(cyan) lwidth(vthick) lpattern(tight_dot)) /// 1 "JOHN"
> (line TotCasMeRaA01S00V03 date, sort lcolor(red)) /// 2 "DELP"
> (line TotCasMeRaA02S01V03 date, sort lcolor(black)) /// 3 "IHME"
> (line TotCasMeRaA03S02V07 date, sort lcolor(magenta)) /// 4 "IMPE"
> (line TotCasMeRaA04S00V0 date, sort lcolor(gold)) /// 5 "LANL"
> (line TotCasMeRaA05S00V02 date, sort lcolor(green)) /// 6 "SRIV"
> if date >= td(31dec2019) & date <= td(23Aug2021) ///
> , xtitle(Date) xlabel(#19, format(%tdYY-NN-DD) labsize(small)) xlabel(, grid) xlabel(, grid) ///
> xlabel(, angle(forty_five)) ylabel(, format(%12.0fc) labsize(small))  ylabel(, labsize(small) angle(horizontal)) ///
> ytitle(Total cases) title("COVID-19 total cases, Iran, reference scenarios", size(medium)) /// 
> xscale(lwidth(vthin) lcolor(gray*.2)) yscale(lwidth(vthin) lcolor(gray*.2)) legend(region(lcolor(none))) legend(bexpand) ///
> legend(order(1 "JOHN" 2 "DELP" 3 "IHME" 4 "IMPE" 5 "LANL" 6 "SRIV") size(small) row(1)) ///
> subtitle("  .", size(small) color(white))
{res}{txt}
{com}. 
. graph save "graph 41a COVID-19 total cases, Iran, reference scenarios.gph", replace
{txt}(note: file graph 41a COVID-19 total cases, Iran, reference scenarios.gph not found)
{res}{txt}(file graph 41a COVID-19 total cases, Iran, reference scenarios.gph saved)

{com}. graph export "graph 41a COVID-19 total cases, Iran, reference scenarios.pdf", replace
{txt}(file /Users/farshadpourmalek/Downloads/covir2-main/20210507/code/merge/graph 41a COVID-19 total cases, Iran, reference scenarios.pdf written in PDF format)

{com}. 
. 
. 
. 
. * total cases, median or reference scenario, w CF
. 
. twoway ///
> (line TotCasMeRaA00S00V00 date, sort lcolor(cyan) lwidth(vthick) lpattern(tight_dot)) /// 1 "JOHN"
> (line TotCasMeRaA00S00V00_CF2 date, sort lcolor(cyan) lpattern(tight_dot)) /// 2 "JOHN" CF2
> (line TotCasMeRaA00S00V00_CF5 date, sort lcolor(cyan) lpattern(tight_dot)) /// 3 "JOHN" CF5
> (line TotCasMeRaA01S00V03 date, sort lcolor(red)) /// 4 "DELP"
> (line TotCasMeRaA02S01V03 date, sort lcolor(black)) /// 5 "IHME"
> (line TotCasMeRaA03S02V07 date, sort lcolor(magenta)) /// 6 "IMPE"
> (line TotCasMeRaA04S00V0 date, sort lcolor(gold)) /// 7 "LANL"
> (line TotCasMeRaA05S00V02 date, sort lcolor(green)) /// 8 "SRIV"
> if date >= td(31dec2019) & date <= td(23Aug2021) ///
> , xtitle(Date) xlabel(#19, format(%tdYY-NN-DD) labsize(small)) xlabel(, grid) xlabel(, grid) ///
> xlabel(, angle(forty_five)) ylabel(, format(%12.0fc) labsize(small))  ylabel(, labsize(small) angle(horizontal)) ///
> ytitle(Total cases) title("COVID-19 total cases, Iran, reference scenarios", size(medium)) /// 
> xscale(lwidth(vthin) lcolor(gray*.2)) yscale(lwidth(vthin) lcolor(gray*.2)) legend(region(lcolor(none))) legend(bexpand) ///
> legend(order(1 "JOHN" 2 "CF 2" 3 "CF 5" 4 "DELP" 5 "IHME" 6 "IMPE" 7 "LANL" 8 "SRIV") size(small) row(1)) ///
> subtitle("with correction factors 2 and 5", size(small))
{res}{txt}
{com}. 
. graph save "graph 41b COVID-19 total cases, Iran, reference scenarios, w CF.gph", replace
{txt}(note: file graph 41b COVID-19 total cases, Iran, reference scenarios, w CF.gph not found)
{res}{txt}(file graph 41b COVID-19 total cases, Iran, reference scenarios, w CF.gph saved)

{com}. graph export "graph 41b COVID-19 total cases, Iran, reference scenarios, w CF.pdf", replace
{txt}(file /Users/farshadpourmalek/Downloads/covir2-main/20210507/code/merge/graph 41b COVID-19 total cases, Iran, reference scenarios, w CF.pdf written in PDF format)

{com}. 
. 
. 
. 
. * total cases, median or reference scenario, 2020-12-01 on
. 
. twoway ///
> (line TotCasMeRaA00S00V00 date, sort lcolor(cyan) lwidth(vthick) lpattern(tight_dot)) /// 1 "JOHN"
> (line TotCasMeRaA01S00V03 date, sort lcolor(red)) /// 2 "DELP"
> (line TotCasMeRaA02S01V03 date, sort lcolor(black)) /// 3 "IHME"
> (line TotCasMeRaA03S02V07 date, sort lcolor(magenta)) /// 4 "IMPE"
> (line TotCasMeRaA04S00V0 date, sort lcolor(gold)) /// 5 "LANL"
> (line TotCasMeRaA05S00V02 date, sort lcolor(green)) /// 6 "SRIV"
> if date >= td(30nov2020) & date <= td(23Aug2021) ///
> , xtitle(Date) xlabel(#9, format(%tdYY-NN-DD) labsize(small)) xlabel(, grid) xlabel(, grid) ///
> xlabel(, angle(forty_five)) ylabel(, format(%12.0fc) labsize(small))  ylabel(, labsize(small) angle(horizontal)) ///
> ytitle(Total cases) title("COVID-19 total cases, Iran, reference scenarios", size(medium)) /// 
> xscale(lwidth(vthin) lcolor(gray*.2)) yscale(lwidth(vthin) lcolor(gray*.2)) legend(region(lcolor(none))) legend(bexpand) ///
> legend(order(1 "JOHN" 2 "DELP" 3 "IHME" 4 "IMPE" 5 "LANL" 6 "SRIV") size(small) row(1)) ///
> subtitle("after 2020-12-01", size(small))
{res}{txt}
{com}. 
. graph save "graph 42a COVID-19 total cases, Iran, reference scenarios, 2020-12-01 on.gph", replace
{txt}(note: file graph 42a COVID-19 total cases, Iran, reference scenarios, 2020-12-01 on.gph not found)
{res}{txt}(file graph 42a COVID-19 total cases, Iran, reference scenarios, 2020-12-01 on.gph saved)

{com}. graph export "graph 42a COVID-19 total cases, Iran, reference scenarios, 2020-12-01 on.pdf", replace
{txt}(file /Users/farshadpourmalek/Downloads/covir2-main/20210507/code/merge/graph 42a COVID-19 total cases, Iran, reference scenarios, 2020-12-01 on.pdf written in PDF format)

{com}. 
. 
. 
. 
. * total cases, median or reference scenario, 2020-12-01 on, w CF
. 
. twoway ///
> (line TotCasMeRaA00S00V00 date, sort lcolor(cyan) lwidth(vthick) lpattern(tight_dot)) /// 1 "JOHN"
> (line TotCasMeRaA00S00V00_CF2 date, sort lcolor(cyan) lpattern(tight_dot)) /// 2 "JOHN" CF2
> (line TotCasMeRaA00S00V00_CF5 date, sort lcolor(cyan) lpattern(tight_dot)) /// 3 "JOHN" CF5
> (line TotCasMeRaA01S00V03 date, sort lcolor(red)) /// 4 "DELP"
> (line TotCasMeRaA02S01V03 date, sort lcolor(black)) /// 5 "IHME"
> (line TotCasMeRaA03S02V07 date, sort lcolor(magenta)) /// 6 "IMPE"
> (line TotCasMeRaA04S00V0 date, sort lcolor(gold)) /// 7 "LANL"
> (line TotCasMeRaA05S00V02 date, sort lcolor(green)) /// 8 "SRIV"
> if date >= td(30nov2020) & date <= td(23Aug2021) ///
> , xtitle(Date) xlabel(#9, format(%tdYY-NN-DD) labsize(small)) xlabel(, grid) xlabel(, grid) ///
> xlabel(, angle(forty_five)) ylabel(, format(%12.0fc) labsize(small))  ylabel(, labsize(small) angle(horizontal)) ///
> ytitle(Total cases) title("COVID-19 total cases, Iran, reference scenarios", size(medium)) /// 
> xscale(lwidth(vthin) lcolor(gray*.2)) yscale(lwidth(vthin) lcolor(gray*.2)) legend(region(lcolor(none))) legend(bexpand) ///
> legend(order(1 "JOHN" 2 "CF 2" 3 "CF 5" 4 "DELP" 5 "IHME" 6 "IMPE" 7 "LANL" 8 "SRIV") size(small) row(1)) ///
> subtitle("after 2020-12-01, with correction factors 2 and 5", size(small))
{res}{txt}
{com}. 
. graph save "graph 42b COVID-19 total cases, Iran, reference scenarios, 2020-12-01 on, w CF.gph", replace
{txt}(note: file graph 42b COVID-19 total cases, Iran, reference scenarios, 2020-12-01 on, w CF.gph not found)
{res}{txt}(file graph 42b COVID-19 total cases, Iran, reference scenarios, 2020-12-01 on, w CF.gph saved)

{com}. graph export "graph 42b COVID-19 total cases, Iran, reference scenarios, 2020-12-01 on, w CF.pdf", replace
{txt}(file /Users/farshadpourmalek/Downloads/covir2-main/20210507/code/merge/graph 42b COVID-19 total cases, Iran, reference scenarios, 2020-12-01 on, w CF.pdf written in PDF format)

{com}. 
. 
. 
. 
. * total cases, median or reference scenario, 2020-12-01 on, CI
. 
. twoway ///
> (line TotCasMeRaA00S00V00 date, sort lcolor(cyan) lwidth(vthick) lpattern(tight_dot)) /// 1 JOHN
> (line TotCasMeRaA01S00V03 date, sort lcolor(red)) /// 2 "DELP"
> (line TotCasLoRaA01S00V03 date, sort lcolor(red) lpattern(dash)) /// 3 "DELP"
> (line TotCasUpRaA01S00V03 date, sort lcolor(red) lpattern(dash)) /// 4 "DELP"
> (line TotCasMeRaA02S01V03 date, sort lcolor(black)) /// 5 IHME mean
> (line TotCasLoRaA02S01V03 date, sort lcolor(black) lpattern(dash)) /// 6 IHME lower
> (line TotCasUpRaA02S01V03 date, sort lcolor(black) lpattern(dash)) /// 7 IHME upper
> (line TotCasMeRaA03S02V07 date, sort lcolor(magenta)) /// 8 IMPE mean
> (line TotCasLoRaA03S02V07 date, sort lcolor(magenta) lpattern(dash)) /// 9 IMPE lower
> (line TotCasUpRaA03S02V07 date, sort lcolor(magenta) lpattern(dash)) /// 10 IMPE upper
> (line TotCasMeRaA04S00V0 date, sort lcolor(gold)) /// 11 LANL mean
> (line TotCasLoRaA04S00V0 date, sort lcolor(gold)  lpattern(dash)) /// 12 LANL lower
> (line TotCasUpRaA04S00V0 date, sort lcolor(gold)  lpattern(dash)) /// 13 LANL upper
> (line TotCasMeRaA05S00V02 date, sort lcolor(green)) /// 14 "SRIV" mean
> (line TotCasMeRaA05S00V02 date, sort lcolor(green) lpattern(dash)) /// 15 "SRIV" lower
> (line TotCasMeRaA05S00V02 date, sort lcolor(green) lpattern(dash)) /// 16 "SRIV" upper
> if date >= td(30nov2020) & date <= td(23Aug2021) ///
> , xtitle(Date) xlabel(#9, format(%tdYY-NN-DD) labsize(small)) xlabel(, grid) xlabel(, grid) ///
> xlabel(, angle(forty_five)) ylabel(, format(%12.0fc) labsize(small))  ylabel(, labsize(small) angle(horizontal)) ///
> ytitle(Total cases) title("COVID-19 total cases, Iran, reference scenarios", size(medium)) ///
> xscale(lwidth(vthin) lcolor(gray*.2)) yscale(lwidth(vthin) lcolor(gray*.2)) legend(region(lcolor(none))) legend(bexpand) ///
> legend(order(1 "JOHN" 2 "DELP" 5 "IHME" 8 "IMPE" 11 "LANL" 14 "SRIV") size(small) row(1)) ///
> note("Uncertainty limits: dashed curves") ///
> subtitle("after 2020-12-01, with uncertainty", size(small))
{res}{txt}
{com}. 
. graph save "graph 43a COVID-19 total cases, Iran, reference scenarios, 2020-12-01 on, CI.gph", replace
{txt}(note: file graph 43a COVID-19 total cases, Iran, reference scenarios, 2020-12-01 on, CI.gph not found)
{res}{txt}(file graph 43a COVID-19 total cases, Iran, reference scenarios, 2020-12-01 on, CI.gph saved)

{com}. graph export "graph 43a COVID-19 total cases, Iran, reference scenarios, 2020-12-01 on, CI.pdf", replace
{txt}(file /Users/farshadpourmalek/Downloads/covir2-main/20210507/code/merge/graph 43a COVID-19 total cases, Iran, reference scenarios, 2020-12-01 on, CI.pdf written in PDF format)

{com}. 
. 
. 
. 
. * total cases, median or reference scenario, 2020-12-01 on, CI, w CF
. 
. twoway ///
> (line TotCasMeRaA00S00V00 date, sort lcolor(cyan) lwidth(vthick) lpattern(tight_dot)) /// 1 JOHN
> (line TotCasMeRaA00S00V00_CF2 date, sort lcolor(cyan) lpattern(tight_dot)) /// 2 "JOHN" CF2
> (line TotCasMeRaA00S00V00_CF5 date, sort lcolor(cyan) lpattern(tight_dot)) /// 3 "JOHN" CF5
> (line TotCasMeRaA01S00V03 date, sort lcolor(red)) /// 4 "DELP"
> (line TotCasLoRaA01S00V03 date, sort lcolor(red) lpattern(dash)) /// 5 "DELP"
> (line TotCasUpRaA01S00V03 date, sort lcolor(red) lpattern(dash)) /// 6 "DELP"
> (line TotCasMeRaA02S01V03 date, sort lcolor(black)) /// 7 IHME mean
> (line TotCasLoRaA02S01V03 date, sort lcolor(black) lpattern(dash)) /// 8 IHME lower
> (line TotCasUpRaA02S01V03 date, sort lcolor(black) lpattern(dash)) /// 9 IHME upper
> (line TotCasMeRaA03S02V07 date, sort lcolor(magenta)) /// 10 IMPE mean
> (line TotCasLoRaA03S02V07 date, sort lcolor(magenta) lpattern(dash)) /// 11 IMPE lower
> (line TotCasUpRaA03S02V07 date, sort lcolor(magenta) lpattern(dash)) /// 12 IMPE upper
> (line TotCasMeRaA04S00V0 date, sort lcolor(gold)) /// 13 LANL mean
> (line TotCasLoRaA04S00V0 date, sort lcolor(gold)  lpattern(dash)) /// 14 LANL lower
> (line TotCasUpRaA04S00V0 date, sort lcolor(gold)  lpattern(dash)) /// 15 LANL upper
> (line TotCasMeRaA05S00V02 date, sort lcolor(green)) /// 16 "SRIV" mean
> (line TotCasMeRaA05S00V02 date, sort lcolor(green) lpattern(dash)) /// 17 "SRIV" lower
> (line TotCasMeRaA05S00V02 date, sort lcolor(green) lpattern(dash)) /// 18 "SRIV" upper
> if date >= td(30nov2020) & date <= td(23Aug2021) ///
> , xtitle(Date) xlabel(#9, format(%tdYY-NN-DD) labsize(small)) xlabel(, grid) xlabel(, grid) ///
> xlabel(, angle(forty_five)) ylabel(, format(%12.0fc) labsize(small))  ylabel(, labsize(small) angle(horizontal)) ///
> ytitle(Total cases) title("COVID-19 total cases, Iran, reference scenarios", size(medium)) ///
> xscale(lwidth(vthin) lcolor(gray*.2)) yscale(lwidth(vthin) lcolor(gray*.2)) legend(region(lcolor(none))) legend(bexpand) ///
> legend(order(1 "JOHN" 2 "CF 2" 3 "CF 5" 4 "DELP" 7 "IHME" 10 "IMPE" 13 "LANL" 16 "SRIV") size(small) row(1)) ///
> note("Uncertainty limits: dashed curves")  ///
> subtitle("after 2020-12-01, with correction factors 2 and 5, with uncertainty", size(small))
{res}{txt}
{com}. 
. graph save "graph 43b COVID-19 total cases, Iran, reference scenarios, 2020-12-01 on, CI, w CF.gph", replace
{txt}(note: file graph 43b COVID-19 total cases, Iran, reference scenarios, 2020-12-01 on, CI, w CF.gph not found)
{res}{txt}(file graph 43b COVID-19 total cases, Iran, reference scenarios, 2020-12-01 on, CI, w CF.gph saved)

{com}. graph export "graph 43b COVID-19 total cases, Iran, reference scenarios, 2020-12-01 on, CI, w CF.pdf", replace
{txt}(file /Users/farshadpourmalek/Downloads/covir2-main/20210507/code/merge/graph 43b COVID-19 total cases, Iran, reference scenarios, 2020-12-01 on, CI, w CF.pdf written in PDF format)

{com}. 
. 
. 
. 
. *****************
. 
. * daily cfr (graph numbers start with 51)
. 
. 
. * cfr all studies, all time, reference scenarios
. 
. twoway ///
> (line DayCfrMeRaA00S00V00 date, sort lcolor(cyan) lwidth(vthick) lpattern(tight_dot)) /// 1 "JOHN"
> (line DayCfrMeRaA01S00V03 date, sort lcolor(red)) /// 2 "DELP"
> (line DayCfrMeRaA02S01V03 date, sort lcolor(black)) /// 3 "IHME"
> (line DayCfrMeRaA03S02V07 date, sort lcolor(magenta)) /// 4 "IMPE"
> (line DayCfrMeRaA04S00V0 date, sort lcolor(gold)) /// 5 "LANL"
> (line DayCfrMeRaA05S00V02 date, sort lcolor(green)) /// 6 "SRIV"
> if date >= td(31dec2019) & date <= td(23Aug2021) ///
> , xtitle(Date) xlabel(#19, format(%tdYY-NN-DD) labsize(small)) xlabel(, grid) xlabel(, grid) ///
> xlabel(, angle(forty_five)) ylabel(, format(%12.0fc) labsize(small))  ylabel(, labsize(small) angle(horizontal)) ///
> ytitle(Daily CFR) title("COVID-19 daily CFR, Iran, reference scenarios", size(medium)) /// 
> xscale(lwidth(vthin) lcolor(gray*.2)) yscale(lwidth(vthin) lcolor(gray*.2)) legend(region(lcolor(none))) legend(bexpand) ///
> legend(order(1 "JOHN" 2 "DELP" 3 "IHME" 4 "IMPE" 5 "LANL" 6 "SRIV") size(small) row(1)) ///
> subtitle("  .", size(small) color(white))
{res}{txt}
{com}. 
. graph save "graph 51 COVID-19 daily CFR, Iran, reference scenarios.gph", replace
{txt}(note: file graph 51 COVID-19 daily CFR, Iran, reference scenarios.gph not found)
{res}{txt}(file graph 51 COVID-19 daily CFR, Iran, reference scenarios.gph saved)

{com}. graph export "graph 51 COVID-19 daily CFR, Iran, reference scenarios.pdf", replace
{txt}(file /Users/farshadpourmalek/Downloads/covir2-main/20210507/code/merge/graph 51 COVID-19 daily CFR, Iran, reference scenarios.pdf written in PDF format)

{com}. 
. 
. 
. 
. * cfr all studies, 01mar2020 on, reference scenarios
. 
. twoway ///
> (line DayCfrMeRaA00S00V00 date, sort lcolor(cyan) lwidth(vthick) lpattern(tight_dot)) /// 1 "JOHN"
> (line DayCfrMeRaA01S00V03 date, sort lcolor(red)) /// 2 "DELP"
> (line DayCfrMeRaA02S01V03 date, sort lcolor(black)) /// 3 "IHME"
> (line DayCfrMeRaA03S02V07 date, sort lcolor(magenta)) /// 4 "IMPE"
> (line DayCfrMeRaA04S00V0 date, sort lcolor(gold)) /// 5 "LANL"
> (line DayCfrMeRaA05S00V02 date, sort lcolor(green)) /// 6 "SRIV"
> if date >= td(01mar2020) & date <= td(23Aug2021) ///
> , xtitle(Date) xlabel(#16, format(%tdYY-NN-DD) labsize(small)) xlabel(, grid) xlabel(, grid) ///
> xlabel(, angle(forty_five)) ylabel(, format(%12.0fc) labsize(small))  ylabel(, labsize(small) angle(horizontal)) ///
> ytitle(Daily CFR) title("COVID-19 daily CFR, Iran, reference scenarios", size(medium)) /// 
> xscale(lwidth(vthin) lcolor(gray*.2)) yscale(lwidth(vthin) lcolor(gray*.2)) legend(region(lcolor(none))) legend(bexpand) ///
> legend(order(1 "JOHN" 2 "DELP" 3 "IHME" 4 "IMPE" 5 "LANL" 6 "SRIV") size(small) row(1)) ///
> subtitle("after 2020-03-01", size(small))
{res}{txt}
{com}. 
. graph save "graph 52 COVID-19 daily CFR, Iran, reference scenarios, 2020-03-01 on.gph", replace
{txt}(note: file graph 52 COVID-19 daily CFR, Iran, reference scenarios, 2020-03-01 on.gph not found)
{res}{txt}(file graph 52 COVID-19 daily CFR, Iran, reference scenarios, 2020-03-01 on.gph saved)

{com}. graph export "graph 52 COVID-19 daily CFR, Iran, reference scenarios, 2020-03-01 on.pdf", replace
{txt}(file /Users/farshadpourmalek/Downloads/covir2-main/20210507/code/merge/graph 52 COVID-19 daily CFR, Iran, reference scenarios, 2020-03-01 on.pdf written in PDF format)

{com}. 
. 
. 
. 
. * graph 53 placeholder (omitted in updates)
. 
. 
. 
. 
. * cfr wo JOHN LANL SRIV, 01mar2020 on, reference scenarios
. 
. twoway ///
> (line DayCfrMeRaA01S00V03 date, sort lcolor(red)) /// 1 "DELP"
> (line DayCfrMeRaA02S01V03 date, sort lcolor(black)) /// 2 "IHME"
> (line DayCfrMeRaA03S02V07 date, sort lcolor(magenta)) /// 3 "IMPE"
> (line DayCfrMeRaA05S00V02 date, sort lcolor(green)) /// 4 "SRIV"
> if date >= td(01mar2020) & date <= td(23Aug2021) ///
> , xtitle(Date) xlabel(#16, format(%tdYY-NN-DD) labsize(small)) xlabel(, grid) xlabel(, grid) ///
> xlabel(, angle(forty_five)) ylabel(, format(%12.2fc) labsize(small))  ylabel(, labsize(small) angle(horizontal)) ///
> ytitle(Daily CFR) title("COVID-19 daily CFR, Iran, reference scenarios", size(medium)) /// 
> xscale(lwidth(vthin) lcolor(gray*.2)) yscale(lwidth(vthin) lcolor(gray*.2)) legend(region(lcolor(none))) legend(bexpand) ///
> legend(order(1 "DELP" 2 "IHME" 3 "IMPE" 4 "SRIV") size(small) row(1)) ///
> subtitle("after 2020-03-01, without JOHN, LANL", size(small)) 
{res}{txt}
{com}. 
. graph save "graph 54 COVID-19 daily CFR, Iran, reference scenarios, 2020-03-01 on, wo JOHN LANL.gph", replace
{txt}(note: file graph 54 COVID-19 daily CFR, Iran, reference scenarios, 2020-03-01 on, wo JOHN LANL.gph not found)
{res}{txt}(file graph 54 COVID-19 daily CFR, Iran, reference scenarios, 2020-03-01 on, wo JOHN LANL.gph saved)

{com}. graph export "graph 54 COVID-19 daily CFR, Iran, reference scenarios, 2020-03-01 on,wo JOHN LANL.pdf", replace
{txt}(file /Users/farshadpourmalek/Downloads/covir2-main/20210507/code/merge/graph 54 COVID-19 daily CFR, Iran, reference scenarios, 2020-03-01 on,wo JOHN LANL.pdf written in PDF format)

{com}. 
. 
. 
. 
. * cfr wo JOHN LANL, 01mar2020 on, reference scenarios, with CIs
. 
. twoway ///
> (line DayCfrMeRaA01S00V03 date, sort lcolor(red)) /// 1 "DELP" mean
> (line DayCfrLoRaA01S00V03 date, sort lcolor(red*.3) lpattern(dash)) /// 2 "DELP" lower
> (line DayCfrUpRaA01S00V03 date, sort lcolor(red*.3) lpattern(dash)) /// 3 "DELP" upper
> (line DayCfrMeRaA02S01V03 date, sort lcolor(black)) /// 4 "IHME" mean
> (line DayCfrLoRaA02S01V03 date, sort lcolor(black*.2) lpattern(dash)) /// 5 "IHME" lower
> (line DayCfrUpRaA02S01V03 date, sort lcolor(black*.2) lpattern(dash)) /// 6 "IHME" upper
> (line DayCfrMeRaA03S02V07 date, sort lcolor(magenta)) /// 7 "IMPE" mean
> (line DayCfrLoRaA03S02V07 date, sort lcolor(magenta*.2) lpattern(dash)) /// 8 "IMPE" lower
> (line DayCfrUpRaA03S02V07 date, sort lcolor(magenta*.2) lpattern(dash)) /// 9 "IMPE" upper
> (line DayCfrMeRaA05S00V02 date, sort lcolor(green)) /// 10 "SRIV" mean
> (line DayCfrMeRaA05S00V02 date, sort lcolor(green*.2) lpattern(dash)) /// 11 "SRIV" lower
> (line DayCfrMeRaA05S00V02 date, sort lcolor(green*.2) lpattern(dash)) /// 12 "SRIV" upper
> if date >= td(01mar2020) & date <= td(23Aug2021) ///
> , xtitle(Date) xlabel(#16, format(%tdYY-NN-DD) labsize(small)) xlabel(, grid) xlabel(, grid) ///
> xlabel(, angle(forty_five)) ylabel(, format(%12.2fc) labsize(small))  ylabel(, labsize(small) angle(horizontal)) ///
> ytitle(Daily CFR) title("COVID-19 daily CFR, Iran, reference scenarios", size(medium)) /// 
> xscale(lwidth(vthin) lcolor(gray*.2)) yscale(lwidth(vthin) lcolor(gray*.2)) legend(region(lcolor(none))) legend(bexpand) ///
> legend(order(1 "DELP" 4 "IHME" 7 "IMPE" 10 "SRIV") size(small) row(1)) ///
> note("Uncertainty limits: dashed light curves.") ///
> subtitle("after 2020-03-01, without JOHN, LANL, with uncertainty", size(small))
{res}{txt}
{com}. 
. graph save "graph 55 COVID-19 daily CFR, Iran, reference scenarios, 2020-03-01 on, wo JOHN LANL, with CIs.gph", replace
{txt}(note: file graph 55 COVID-19 daily CFR, Iran, reference scenarios, 2020-03-01 on, wo JOHN LANL, with CIs.gph not found)
{res}{txt}(file graph 55 COVID-19 daily CFR, Iran, reference scenarios, 2020-03-01 on, wo JOHN LANL, with CIs.gph saved)

{com}. graph export "graph 55 COVID-19 daily CFR, Iran, reference scenarios, 2020-03-01 on,wo JOHN LANL, with CIs.pdf", replace
{txt}(file /Users/farshadpourmalek/Downloads/covir2-main/20210507/code/merge/graph 55 COVID-19 daily CFR, Iran, reference scenarios, 2020-03-01 on,wo JOHN LANL, with CIs.pdf written in PDF format)

{com}. 
. 
. 
. 
. 
. *****************
. 
. * daily active cases (graph numbers start with 61)
. 
. 
. * daily active cases, w GHAN
. 
. twoway ///
> (line DayActMeRaA00S00V00 date, sort lcolor(cyan) lwidth(vthick) lpattern(tight_dot)) /// 1 "JOHN" 
> (line DayActMeRaA01S00V03 date, sort lcolor(red)) /// 2 "DELP" 
> (line DayActMeRaA07S09V00 date, sort lcolor(black)) /// 3 "GHAN" 
> (line DayActMeRaA06S01V00 date, sort lcolor(red) lpattern(dash)) /// 4 "SOLT S1"
> (line DayActMeRaA06S02V00 date, sort lcolor(blue) lpattern(dash)) /// 5 "SOLT S2"
> if date >= td(01jan2020) & date <= td(01jan2022) ///
> , xtitle(Date) xlabel(#24, format(%tdYY-NN-DD) labsize(small)) xlabel(, grid) xlabel(, grid) ///
> xlabel(, angle(forty_five)) ylabel(, format(%12.0fc) labsize(small))  ylabel(, labsize(small) angle(horizontal)) ///
> ytitle(Daily active cases) title("COVID-19 daily active cases, Iran", size(medium)) /// 
> xscale(lwidth(vthin) lcolor(gray*.2)) yscale(lwidth(vthin) lcolor(gray*.2)) legend(region(lcolor(none))) legend(bexpand) ///
> legend(order(1 "JOHN" 2 "DELP" 3 "GHAN" 4 "SOLT S1" 5 "SOLT S2") size(small) row(1)) ///
> subtitle("  .", size(small) color(white))
{res}{txt}
{com}. 
. graph save "graph 61 COVID-19 daily active cases w GHAN.gph", replace
{txt}(note: file graph 61 COVID-19 daily active cases w GHAN.gph not found)
{res}{txt}(file graph 61 COVID-19 daily active cases w GHAN.gph saved)

{com}. graph export "graph 61 COVID-19 daily active cases w GHAN.pdf", replace
{txt}(file /Users/farshadpourmalek/Downloads/covir2-main/20210507/code/merge/graph 61 COVID-19 daily active cases w GHAN.pdf written in PDF format)

{com}. 
. 
. 
. 
. * daily active cases, wo GHAN
. 
. twoway ///
> (line DayActMeRaA00S00V00 date, sort lcolor(cyan) lwidth(vthick) lpattern(tight_dot)) /// 1 "JOHN" 
> (line DayActMeRaA01S00V03 date, sort lcolor(red)) /// 2 "DELP" 
> (line DayActMeRaA06S01V00 date, sort lcolor(red) lpattern(dash)) /// 3 "SOLT S1"
> (line DayActMeRaA06S02V00 date, sort lcolor(blue) lpattern(dash)) /// 4 "SOLT S2"
> if date >= td(01jan2020) & date <= td(01jan2022) ///
> , xtitle(Date) xlabel(#24, format(%tdYY-NN-DD) labsize(small)) xlabel(, grid) xlabel(, grid) ///
> xlabel(, angle(forty_five)) ylabel(, format(%12.0fc) labsize(small))  ylabel(, labsize(small) angle(horizontal)) ///
> ytitle(Daily active cases) title("COVID-19 daily active cases, Iran", size(medium)) /// 
> xscale(lwidth(vthin) lcolor(gray*.2)) yscale(lwidth(vthin) lcolor(gray*.2)) legend(region(lcolor(none))) legend(bexpand) ///
> legend(order(1 "JOHN" 2 "DELP" 3 "SOLT S1" 4 "SOLT S2") size(small) row(1)) ///
> subtitle("without GHAN", size(small))
{res}{txt}
{com}. 
. graph save "graph 62 COVID-19 daily active cases wo GHAN.gph", replace
{txt}(note: file graph 62 COVID-19 daily active cases wo GHAN.gph not found)
{res}{txt}(file graph 62 COVID-19 daily active cases wo GHAN.gph saved)

{com}. graph export "graph 62 COVID-19 daily active cases wo GHAN.pdf", replace
{txt}(file /Users/farshadpourmalek/Downloads/covir2-main/20210507/code/merge/graph 62 COVID-19 daily active cases wo GHAN.pdf written in PDF format)

{com}. 
. 
. 
. 
. * daily active cases, wo GHAN, Hijri
. 
. twoway ///
> (line DayActMeRaA00S00V00 date, sort lcolor(cyan) lwidth(vthick) lpattern(tight_dot)) /// 1 "JOHN" 
> (line DayActMeRaA01S00V03 date, sort lcolor(red)) /// 2 "DELP" 
> (line DayActMeRaA06S01V00 date, sort lcolor(red) lpattern(dash)) /// 3 "SOLT S1"
> (line DayActMeRaA06S02V00 date, sort lcolor(blue) lpattern(dash)) /// 4 "SOLT S2"
> if date >= td(20feb2020) & date <= td(23oct2021) ///
> , xtitle(Date) xlabel(21965 21994 22025 22056 22087 22118 22149 22180 22210 22240 22270 22300 22330 22360 22391 22422 22453 22484 22515 22546 22576 ///
> , format(%tdYY-NN-DD) labsize(small)) xlabel(, grid) xlabel(, grid) ///
> xlabel(, angle(forty_five)) ylabel(, format(%12.0fc) labsize(small))  ylabel(, labsize(small) angle(horizontal)) ///
> ytitle(Daily active cases) title("COVID-19 daily active cases, Iran", size(medium)) /// 
> xscale(lwidth(vthin) lcolor(gray*.2)) yscale(lwidth(vthin) lcolor(gray*.2)) legend(region(lcolor(none))) legend(bexpand) ///
> legend(order(1 "JOHN" 2 "DELP" 3 "SOLT S1" 4 "SOLT S2") size(small) row(1)) ///
> subtitle("without GHAN", size(small)) ///
> ttext(0 20feb2020  "Esf" 0 20mar2020  "Far" 0 20apr2020  "Ord" 0 21may2020  "Kho" 0 21jun2020  "Tir" 0 22jul2020  "Mor" ///
> 0 22aug2020  "Sha" 0 22sep2020  "Meh" 0 22oct2020  "Aba" 0 21nov2020  "Aza" 0 21dec2020  "Dey" 0 20jan2021  "Bah" ///
> 0 19feb2021  "Esf" 0 21mar2021  "Far" 0 21apr2021  "Ord" 0 22may2021  "Kho" 0 22jun2021  "Tir" 0 23jul2021  "Mor" ///
> 0 23aug2021  "Sha" 0 23sep2021  "Meh" 0 23oct2021  "Aba" , size(small) color(black) placement(south))
{res}{txt}
{com}. 
. graph save "graph 62.1 COVID-19 daily active cases wo GHAN Hijri.gph", replace
{txt}(note: file graph 62.1 COVID-19 daily active cases wo GHAN Hijri.gph not found)
{res}{txt}(file graph 62.1 COVID-19 daily active cases wo GHAN Hijri.gph saved)

{com}. graph export "graph 62.1 COVID-19 daily active cases wo GHAN Hijri.pdf", replace
{txt}(file /Users/farshadpourmalek/Downloads/covir2-main/20210507/code/merge/graph 62.1 COVID-19 daily active cases wo GHAN Hijri.pdf written in PDF format)

{com}. 
. 
. 
. 
. * daily active cases, wo GHAN, 2020-12-01 on
. 
. twoway ///
> (line DayActMeRaA00S00V00 date, sort lcolor(cyan) lwidth(vthick) lpattern(tight_dot)) /// 1 "JOHN" 
> (line DayActMeRaA01S00V03 date, sort lcolor(red)) /// 2 "DELP" 
> (line DayActMeRaA06S01V00 date, sort lcolor(red) lpattern(dash)) /// 3 "SOLT S1"
> (line DayActMeRaA06S02V00 date, sort lcolor(blue) lpattern(dash)) /// 4 "SOLT S2"
> if date >= td(30nov2020) & date <= td(01jan2022) ///
> , xtitle(Date) xlabel(#12, format(%tdYY-NN-DD) labsize(small)) xlabel(, grid) xlabel(, grid) ///
> xlabel(, angle(forty_five)) ylabel(, format(%12.0fc) labsize(small))  ylabel(, labsize(small) angle(horizontal)) ///
> ytitle(Daily active cases) title("COVID-19 daily active cases, Iran", size(medium)) /// 
> xscale(lwidth(vthin) lcolor(gray*.2)) yscale(lwidth(vthin) lcolor(gray*.2)) legend(region(lcolor(none))) legend(bexpand) ///
> legend(order(1 "JOHN" 2 "DELP" 3 "SOLT S1" 4 "SOLT S2") size(small) row(1)) ///
> subtitle("after 2020-12-01, without GHAN, ", size(small))
{res}{txt}
{com}. 
. graph save "graph 63 COVID-19 daily active cases wo GHAN 2020-12-01 on.gph", replace
{txt}(note: file graph 63 COVID-19 daily active cases wo GHAN 2020-12-01 on.gph not found)
{res}{txt}(file graph 63 COVID-19 daily active cases wo GHAN 2020-12-01 on.gph saved)

{com}. graph export "graph 63 COVID-19 daily active cases wo GHAN 2020-12-01 on.pdf", replace
{txt}(file /Users/farshadpourmalek/Downloads/covir2-main/20210507/code/merge/graph 63 COVID-19 daily active cases wo GHAN 2020-12-01 on.pdf written in PDF format)

{com}. 
. 
. 
. 
. ************************
. 
. * other outcomes (graph numbers start with 71)
. 
. 
. * base codes with IHME
. 
. * daily hospital-related outcomes, DELP, IHME, IMPE
. /*
> twoway ///
> (line DayHosMeRaA01S00V03 date, sort lcolor(red)  lwidth(thick)) /// 1 DELP Hospitalized (Daily Cases Active Hospitalized Mean DELP S0 V3)
> (line DayVenMeRaA01S00V03 date, sort lcolor(red) lpattern(dash)  lwidth(thick)) /// 2 DELP Ventilated (Daily Cases Active Ventilated Mean DELP S0 V3)
> (line DayBedMeSmA02S01V03 date, sort lcolor(black)) /// 3 IHME Bed need (Daily Beds needed Mean IHME S1)
> (line DayIcuMeSmA02S01V03 date, sort lcolor(green)) /// 4 IHME ICU need (Daily ICU beds needed Mean IHME S1)
> (line DayVenMeSmA02S01V03 date, sort lcolor(red)) /// 5 IHME Vent need (Daily invasive Ventilation needed Mean IHME S1)
> (line DayAdmMeSmA02S01V03 date, sort lcolor(yellow)) /// 6 IHME Admissions (Daily hospital admissions Mean IHME S1)
> (line DayIcnMeSmA02S01V03 date, sort lcolor(blue)) /// 7 IHME ICU new (Daily new people going to ICU Mean IHME S1)
> (line DayHodMeRaA03S01V07 date, sort lcolor(magenta)) /// 8 IMPE Hosp demand (Daily hospital demand Mean A03 S01 V07)
> (line DayHoiMeRaA03S01V07 date, sort lcolor(magenta) lpattern(dash)) /// 9 IMPE Hosp incidence (Daily hospital incidence Mean A03 S01 V07)
> (line DayIcdMeRaA03S01V07 date, sort lcolor(magenta) lpattern(dash_dot)) /// 10 IMPE ICU demand (Daily ICU demand Mean A03 S01 V07)
> (line DayIciMeRaA03S01V07 date, sort lcolor(magenta) lpattern(longdash_shortdash)) /// 11 IMPE ICU incidence (Daily ICU incidence Mean A03 S01 V07)
> if date >= td(30dec2019) & date <= td(23Aug2021) ///
> , xtitle(Date) xlabel(#19, format(%tdYY-NN-DD) labsize(small)) xlabel(, grid) xlabel(, grid) ///
> xlabel(, angle(forty_five)) ylabel(, format(%9.0fc) labsize(small))  ylabel(, labsize(small) angle(horizontal)) ///
> ytitle(Daily outcomes) title("COVID-19 daily hospital-related outcomes Iran, median scenarios", size(medium)) ///
> xscale(lwidth(vthin) lcolor(gray*.2)) yscale(lwidth(vthin) lcolor(gray*.2)) legend(region(lcolor(none))) legend(bexpand) ///
> legend(order(1 "DELP Hospitalized" 2 "DELP Ventilated" 3 "IHME Bed need" 4 "IHME ICU need" 5 "IHME Vent need" ///
> 6 "IHME Admissions" 7 "IHME ICU new" 8 "IMPE Hosp demand" ///
> 9 "IMPE Hosp incidence" 10 "IMPE ICU demand" 11 "IMPE ICU incidence") rows(4) size(small)) ///
> subtitle("  .", size(small) color(white))
> 
> graph save "graph 71 COVID-19 hospital-related outcomes.gph", replace
> graph export "graph 71 COVID-19 hospital-related outcomes.pdf", replace
> */
. 
. 
. 
. twoway ///
> (line DayHosMeRaA01S00V03 date, sort lcolor(red)  lwidth(thick)) /// 1 DELP Hospitalized (Daily Cases Active Hospitalized Mean DELP S0 V3)
> (line DayVenMeRaA01S00V03 date, sort lcolor(red) lpattern(dash)  lwidth(thick)) /// 2 DELP Ventilated (Daily Cases Active Ventilated Mean DELP S0 V3)
> (line DayBedMeSmA02S01V03 date, sort lcolor(black)) /// 3 IHME Bed need (Daily Beds needed Mean IHME S1)
> (line DayIcuMeSmA02S01V03 date, sort lcolor(green)) /// 4 IHME ICU need (Daily ICU beds needed Mean IHME S1)
> (line DayAdmMeSmA02S01V03 date, sort lcolor(yellow)) /// 5 IHME Admissions (Daily hospital admissions Mean IHME S1)
> (line DayIcnMeSmA02S01V03 date, sort lcolor(blue)) /// 6 IHME ICU new (Daily new people going to ICU Mean IHME S1)
> (line DayHodMeRaA03S01V07 date, sort lcolor(magenta)) /// 7 IMPE Hosp demand (Daily hospital demand Mean A03 S01 V07)
> (line DayHoiMeRaA03S01V07 date, sort lcolor(magenta) lpattern(dash)) /// 8 IMPE Hosp incidence (Daily hospital incidence Mean A03 S01 V07)
> (line DayIcdMeRaA03S01V07 date, sort lcolor(magenta) lpattern(dash_dot)) /// 9 IMPE ICU demand (Daily ICU demand Mean A03 S01 V07)
> (line DayIciMeRaA03S01V07 date, sort lcolor(magenta) lpattern(longdash_shortdash)) /// 10 IMPE ICU incidence (Daily ICU incidence Mean A03 S01 V07)
> if date >= td(30dec2019) & date <= td(23Aug2021) ///
> , xtitle(Date) xlabel(#19, format(%tdYY-NN-DD) labsize(small)) xlabel(, grid) xlabel(, grid) ///
> xlabel(, angle(forty_five)) ylabel(, format(%9.0fc) labsize(small))  ylabel(, labsize(small) angle(horizontal)) ///
> ytitle(Daily outcomes) title("COVID-19 daily hospital-related outcomes Iran, median scenarios", size(medium)) ///
> xscale(lwidth(vthin) lcolor(gray*.2)) yscale(lwidth(vthin) lcolor(gray*.2)) legend(region(lcolor(none))) legend(bexpand) ///
> legend(order(1 "DELP Hospitalized" 2 "DELP Ventilated" 3 "IHME Bed need" 4 "IHME ICU need" ///
> 5 "IHME Admissions" 6 "IHME ICU new" 7 "IMPE Hosp demand" ///
> 8 "IMPE Hosp incidence" 9 "IMPE ICU demand" 10 "IMPE ICU incidence") rows(4) size(small)) ///
> subtitle("  .", size(small) color(white))
{res}{txt}
{com}. 
. graph save "graph 71 COVID-19 hospital-related outcomes.gph", replace
{txt}(note: file graph 71 COVID-19 hospital-related outcomes.gph not found)
{res}{txt}(file graph 71 COVID-19 hospital-related outcomes.gph saved)

{com}. graph export "graph 71 COVID-19 hospital-related outcomes.pdf", replace
{txt}(file /Users/farshadpourmalek/Downloads/covir2-main/20210507/code/merge/graph 71 COVID-19 hospital-related outcomes.pdf written in PDF format)

{com}. 
. 
. * daily hospital-related outcomes, DELP, IHME, IMPE, wo IHME Bed need, IMPE Hosp demand
. /*
> twoway ///
> (line DayHosMeRaA01S00V03 date, sort lcolor(red)  lwidth(thick)) /// 1 DELP Hospitalized (Daily Cases Active Hospitalized Mean DELP S0 V3)
> (line DayVenMeRaA01S00V03 date, sort lcolor(red) lpattern(dash)  lwidth(thick)) /// 2 DELP Ventilated (Daily Cases Active Ventilated Mean DELP S0 V3)
> (line DayIcuMeSmA02S01V03 date, sort lcolor(green)) /// 3 IHME ICU need (Daily ICU beds needed Mean IHME S1)
> (line DayVenMeSmA02S01V03 date, sort lcolor(red)) /// 4 IHME Vent need (Daily invasive Ventilation needed Mean IHME S1)
> (line DayAdmMeSmA02S01V03 date, sort lcolor(yellow)) /// 5 IHME Admissions (Daily hospital admissions Mean IHME S1)
> (line DayIcnMeSmA02S01V03 date, sort lcolor(blue)) /// 6 IHME ICU new (Daily new people going to ICU Mean IHME S1)
> (line DayHoiMeRaA03S01V07 date, sort lcolor(magenta) lpattern(dash)) /// 7 IMPE Hosp incidence (Daily hospital incidence Mean A03 S01 V07)
> (line DayIcdMeRaA03S01V07 date, sort lcolor(magenta) lpattern(dash_dot)) /// 8 IMPE ICU demand (Daily ICU demand Mean A03 S01 V07)
> (line DayIciMeRaA03S01V07 date, sort lcolor(magenta) lpattern(longdash_shortdash)) /// 9 IMPE ICU incidence (Daily ICU incidence Mean A03 S01 V07)
> if date >= td(30dec2019) & date <= td(23Aug2021) ///
> , xtitle(Date) xlabel(#19, format(%tdYY-NN-DD) labsize(small)) xlabel(, grid) xlabel(, grid) ///
> xlabel(, angle(forty_five)) ylabel(, format(%9.0fc) labsize(small))  ylabel(, labsize(small) angle(horizontal)) ///
> ytitle(Daily outcomes) title("COVID-19 daily hospital-related outcomes Iran, median scenarios", size(medium)) ///
> xscale(lwidth(vthin) lcolor(gray*.2)) yscale(lwidth(vthin) lcolor(gray*.2)) legend(region(lcolor(none))) legend(bexpand) ///
> legend(order(1 "DELP Hospitalized" 2 "DELP Ventilated" 3 "IHME ICU need" 4 "IHME Vent need" ///
> 5 "IHME Admissions" 6 "IHME ICU new" 7 "IMPE Hosp incidence" 8 "IMPE ICU demand" 9 "IMPE ICU incidence") rows(3) size(small)) ///
> subtitle("without IHME Bed need, IMPE Hosp demand", size(small))
> 
> graph save "graph 72 COVID-19 hospital-related outcomes, wo extremes.gph", replace
> graph export "graph 72 COVID-19 hospital-related outcomes, wo extremes.pdf", replace
> */
. 
. 
. twoway ///
> (line DayHosMeRaA01S00V03 date, sort lcolor(red)  lwidth(thick)) /// 1 DELP Hospitalized (Daily Cases Active Hospitalized Mean DELP S0 V3)
> (line DayVenMeRaA01S00V03 date, sort lcolor(red) lpattern(dash)  lwidth(thick)) /// 2 DELP Ventilated (Daily Cases Active Ventilated Mean DELP S0 V3)
> (line DayIcuMeSmA02S01V03 date, sort lcolor(green)) /// 3 IHME ICU need (Daily ICU beds needed Mean IHME S1)
> (line DayAdmMeSmA02S01V03 date, sort lcolor(yellow)) /// 4 IHME Admissions (Daily hospital admissions Mean IHME S1)
> (line DayIcnMeSmA02S01V03 date, sort lcolor(blue)) /// 5 IHME ICU new (Daily new people going to ICU Mean IHME S1)
> (line DayHoiMeRaA03S01V07 date, sort lcolor(magenta) lpattern(dash)) /// 6 IMPE Hosp incidence (Daily hospital incidence Mean A03 S01 V07)
> (line DayIcdMeRaA03S01V07 date, sort lcolor(magenta) lpattern(dash_dot)) /// 7 IMPE ICU demand (Daily ICU demand Mean A03 S01 V07)
> (line DayIciMeRaA03S01V07 date, sort lcolor(magenta) lpattern(longdash_shortdash)) /// 8 IMPE ICU incidence (Daily ICU incidence Mean A03 S01 V07)
> if date >= td(30dec2019) & date <= td(23Aug2021) ///
> , xtitle(Date) xlabel(#19, format(%tdYY-NN-DD) labsize(small)) xlabel(, grid) xlabel(, grid) ///
> xlabel(, angle(forty_five)) ylabel(, format(%9.0fc) labsize(small))  ylabel(, labsize(small) angle(horizontal)) ///
> ytitle(Daily outcomes) title("COVID-19 daily hospital-related outcomes Iran, median scenarios", size(medium)) ///
> xscale(lwidth(vthin) lcolor(gray*.2)) yscale(lwidth(vthin) lcolor(gray*.2)) legend(region(lcolor(none))) legend(bexpand) ///
> legend(order(1 "DELP Hospitalized" 2 "DELP Ventilated" 3 "IHME ICU need" ///
> 4 "IHME Admissions" 5 "IHME ICU new" 6 "IMPE Hosp incidence" 7 "IMPE ICU demand" 8 "IMPE ICU incidence") rows(3) size(small)) ///
> subtitle("without IHME Bed need, IMPE Hosp demand", size(small))
{res}{txt}
{com}. 
. graph save "graph 72 COVID-19 hospital-related outcomes, wo extremes.gph", replace
{txt}(note: file graph 72 COVID-19 hospital-related outcomes, wo extremes.gph not found)
{res}{txt}(file graph 72 COVID-19 hospital-related outcomes, wo extremes.gph saved)

{com}. graph export "graph 72 COVID-19 hospital-related outcomes, wo extremes.pdf", replace
{txt}(file /Users/farshadpourmalek/Downloads/covir2-main/20210507/code/merge/graph 72 COVID-19 hospital-related outcomes, wo extremes.pdf written in PDF format)

{com}. 
. 
. 
. * daily hospital-related outcomes, DELP, IHME, IMPE, wo IHME Bed need, IMPE Hosp demand, 2020-12-01 on 
. /*
> twoway ///
> (line DayHosMeRaA01S00V03 date, sort lcolor(red)  lwidth(thick)) /// 1 DELP Hospitalized (Daily Cases Active Hospitalized Mean DELP S0 V3)
> (line DayVenMeRaA01S00V03 date, sort lcolor(red) lpattern(dash)  lwidth(thick)) /// 2 DELP Ventilated (Daily Cases Active Ventilated Mean DELP S0 V3)
> (line DayIcuMeSmA02S01V03 date, sort lcolor(green)) /// 3 IHME ICU need (Daily ICU beds needed Mean IHME S1)
> (line DayVenMeSmA02S01V03 date, sort lcolor(red)) /// 4 IHME Vent need (Daily invasive Ventilation needed Mean IHME S1)
> (line DayAdmMeSmA02S01V03 date, sort lcolor(yellow)) /// 5 IHME Admissions (Daily hospital admissions Mean IHME S1)
> (line DayIcnMeSmA02S01V03 date, sort lcolor(blue)) /// 6 IHME ICU new (Daily new people going to ICU Mean IHME S1)
> (line DayHoiMeRaA03S01V07 date, sort lcolor(magenta) lpattern(dash)) /// 7 IMPE Hosp incidence (Daily hospital incidence Mean A03 S01 V07)
> (line DayIcdMeRaA03S01V07 date, sort lcolor(magenta) lpattern(dash_dot)) /// 8 IMPE ICU demand (Daily ICU demand Mean A03 S01 V07)
> (line DayIciMeRaA03S01V07 date, sort lcolor(magenta) lpattern(longdash_shortdash)) /// 9 IMPE ICU incidence (Daily ICU incidence Mean A03 S01 V07)
> if date >= td(30nov2020) & date <= td(23Aug2021) ///
> , xtitle(Date) xlabel(#8, format(%tdYY-NN-DD) labsize(small)) xlabel(, grid) xlabel(, grid) ///
> xlabel(, angle(forty_five)) ylabel(, format(%9.0fc) labsize(small))  ylabel(, labsize(small) angle(horizontal)) ///
> ytitle(Daily outcomes) title("COVID-19 daily hospital-related outcomes Iran, median scenarios", size(medium)) ///
> xscale(lwidth(vthin) lcolor(gray*.2)) yscale(lwidth(vthin) lcolor(gray*.2)) legend(region(lcolor(none))) legend(bexpand) ///
> legend(order(1 "DELP Hospitalized" 2 "DELP Ventilated" 3 "IHME ICU need" 4 "IHME Vent need" ///
> 5 "IHME Admissions" 6 "IHME ICU new" 7 "IMPE Hosp incidence" 8 "IMPE ICU demand" 9 "IMPE ICU incidence") rows(3) size(small)) ///
> subtitle("after 2020-12-01, without IHME Bed need, IMPE Hosp demand", size(small))
> 
> graph save "graph 73 COVID-19 hospital-related outcomes, wo extremes, 2020-12-01 on.gph", replace
> graph export "graph 73 COVID-19 hospital-related outcomes, wo extremes, 2020-12-01 on.pdf", replace
> */
. 
. 
. 
. twoway ///
> (line DayHosMeRaA01S00V03 date, sort lcolor(red)  lwidth(thick)) /// 1 DELP Hospitalized (Daily Cases Active Hospitalized Mean DELP S0 V3)
> (line DayVenMeRaA01S00V03 date, sort lcolor(red) lpattern(dash)  lwidth(thick)) /// 2 DELP Ventilated (Daily Cases Active Ventilated Mean DELP S0 V3)
> (line DayIcuMeSmA02S01V03 date, sort lcolor(green)) /// 3 IHME ICU need (Daily ICU beds needed Mean IHME S1)
> (line DayAdmMeSmA02S01V03 date, sort lcolor(yellow)) /// 4 IHME Admissions (Daily hospital admissions Mean IHME S1)
> (line DayIcnMeSmA02S01V03 date, sort lcolor(blue)) /// 5 IHME ICU new (Daily new people going to ICU Mean IHME S1)
> (line DayHoiMeRaA03S01V07 date, sort lcolor(magenta) lpattern(dash)) /// 6 IMPE Hosp incidence (Daily hospital incidence Mean A03 S01 V07)
> (line DayIcdMeRaA03S01V07 date, sort lcolor(magenta) lpattern(dash_dot)) /// 7 IMPE ICU demand (Daily ICU demand Mean A03 S01 V07)
> (line DayIciMeRaA03S01V07 date, sort lcolor(magenta) lpattern(longdash_shortdash)) /// 8 IMPE ICU incidence (Daily ICU incidence Mean A03 S01 V07)
> if date >= td(30nov2020) & date <= td(23Aug2021) ///
> , xtitle(Date) xlabel(#8, format(%tdYY-NN-DD) labsize(small)) xlabel(, grid) xlabel(, grid) ///
> xlabel(, angle(forty_five)) ylabel(, format(%9.0fc) labsize(small))  ylabel(, labsize(small) angle(horizontal)) ///
> ytitle(Daily outcomes) title("COVID-19 daily hospital-related outcomes Iran, median scenarios", size(medium)) ///
> xscale(lwidth(vthin) lcolor(gray*.2)) yscale(lwidth(vthin) lcolor(gray*.2)) legend(region(lcolor(none))) legend(bexpand) ///
> legend(order(1 "DELP Hospitalized" 2 "DELP Ventilated" 3 "IHME ICU need" ///
> 4 "IHME Admissions" 5 "IHME ICU new" 6 "IMPE Hosp incidence" 7 "IMPE ICU demand" 8 "IMPE ICU incidence") rows(3) size(small)) ///
> subtitle("after 2020-12-01, without IHME Bed need, IMPE Hosp demand", size(small))
{res}{txt}
{com}. 
. graph save "graph 73 COVID-19 hospital-related outcomes, wo extremes, 2020-12-01 on.gph", replace
{txt}(note: file graph 73 COVID-19 hospital-related outcomes, wo extremes, 2020-12-01 on.gph not found)
{res}{txt}(file graph 73 COVID-19 hospital-related outcomes, wo extremes, 2020-12-01 on.gph saved)

{com}. graph export "graph 73 COVID-19 hospital-related outcomes, wo extremes, 2020-12-01 on.pdf", replace
{txt}(file /Users/farshadpourmalek/Downloads/covir2-main/20210507/code/merge/graph 73 COVID-19 hospital-related outcomes, wo extremes, 2020-12-01 on.pdf written in PDF format)

{com}. 
. 
. 
. *******************************
. 
. * daily cases to deaths (CTD) 
. 
. 
. * Daily cases to deaths (CTD) all studies, all time, reference scenarios
. 
. twoway ///
> (line DayCTDMeRaA00S00V00 date, sort lcolor(cyan) lwidth(vthick) lpattern(tight_dot)) /// 1 "JOHN"
> (line DayCTDMeRaA01S00V03 date, sort lcolor(red)) /// 2 "DELP"
> (line DayCTDMeRaA02S01V03 date, sort lcolor(black)) /// 3 "IHME"
> (line DayCTDMeRaA03S02V07 date, sort lcolor(magenta)) /// 4 "IMPE"
> (line DayCTDMeRaA04S00V02 date, sort lcolor(gold)) /// 5 "LANL"
> (line DayCTDMeRaA05S00V02 date, sort lcolor(green)) /// 6 "SRIV"
> if date >= td(31dec2019) & date <= td(02aug2021) ///
> , xtitle(Date) xlabel(#19, format(%tdYY-NN-DD) labsize(small)) xlabel(, grid) xlabel(, grid) ///
> xlabel(, angle(forty_five)) ylabel(, format(%12.0fc) labsize(small))  ylabel(, labsize(small) angle(horizontal)) ///
> ytitle(Daily cases to deaths) title("COVID-19 daily cases to deaths, Iran, reference scenarios", size(medium)) /// 
> xscale(lwidth(vthin) lcolor(gray*.2)) yscale(lwidth(vthin) lcolor(gray*.2)) legend(region(lcolor(none))) legend(bexpand) ///
> legend(order(1 "JOHN" 2 "DELP" 3 "IHME" 4 "IMPE" 5 "LANL" 6 "SRIV") size(small) row(1)) ///
> subtitle("  .", size(small) color(white))
{res}{txt}
{com}. 
. graph save "graph 81 COVID-19 daily cases to deaths, Iran, reference scenarios.gph", replace
{txt}(note: file graph 81 COVID-19 daily cases to deaths, Iran, reference scenarios.gph not found)
{res}{txt}(file graph 81 COVID-19 daily cases to deaths, Iran, reference scenarios.gph saved)

{com}. graph export "graph 81 COVID-19 daily cases to deaths, Iran, reference scenarios.pdf", replace
{txt}(file /Users/farshadpourmalek/Downloads/covir2-main/20210507/code/merge/graph 81 COVID-19 daily cases to deaths, Iran, reference scenarios.pdf written in PDF format)

{com}. 
. 
. 
. 
. * Daily cases to deaths (CTD) all studies, 2020-04-01 on, reference scenarios
. 
. twoway ///
> (line DayCTDMeRaA00S00V00 date, sort lcolor(cyan) lwidth(vthick) lpattern(tight_dot)) /// 1 "JOHN"
> (line DayCTDMeRaA01S00V03 date, sort lcolor(red)) /// 2 "DELP"
> (line DayCTDMeRaA02S01V03 date, sort lcolor(black)) /// 3 "IHME"
> (line DayCTDMeRaA03S02V07 date, sort lcolor(magenta)) /// 4 "IMPE"
> (line DayCTDMeRaA04S00V02 date, sort lcolor(gold)) /// 5 "LANL"
> (line DayCTDMeRaA05S00V02 date, sort lcolor(green)) /// 6 "SRIV"
> if date >= td(30mar2020) & date <= td(02aug2021) ///
> , xtitle(Date) xlabel(#16, format(%tdYY-NN-DD) labsize(small)) xlabel(, grid) xlabel(, grid) ///
> xlabel(, angle(forty_five)) ylabel(, format(%12.0fc) labsize(small))  ylabel(, labsize(small) angle(horizontal)) ///
> ytitle(Daily cases to deaths) title("COVID-19 daily cases to deaths, Iran, reference scenarios", size(medium)) /// 
> xscale(lwidth(vthin) lcolor(gray*.2)) yscale(lwidth(vthin) lcolor(gray*.2)) legend(region(lcolor(none))) legend(bexpand) ///
> legend(order(1 "JOHN" 2 "DELP" 3 "IHME" 4 "IMPE" 5 "LANL" 6 "SRIV") size(small) row(1)) ///
> subtitle("after 2020-04-01", size(small))
{res}{txt}
{com}. 
. graph save "graph 82 COVID-19 daily cases to deaths, Iran, reference scenarios, 2020-04-01 on.gph", replace
{txt}(note: file graph 82 COVID-19 daily cases to deaths, Iran, reference scenarios, 2020-04-01 on.gph not found)
{res}{txt}(file graph 82 COVID-19 daily cases to deaths, Iran, reference scenarios, 2020-04-01 on.gph saved)

{com}. graph export "graph 82 COVID-19 daily cases to deaths, Iran, reference scenarios, 2020-04-01 on.pdf", replace
{txt}(file /Users/farshadpourmalek/Downloads/covir2-main/20210507/code/merge/graph 82 COVID-19 daily cases to deaths, Iran, reference scenarios, 2020-04-01 on.pdf written in PDF format)

{com}. 
. 
. 
. 
. * Daily cases to deaths (CTD) all studies, 2020-04-01 on, 3 scenarios
. 
. twoway ///
> (line DayCTDMeRaA00S00V00 date, sort lcolor(cyan) lwidth(vthick) lpattern(tight_dot)) /// 1 "JOHN"
> (line DayCTDMeRaA01S00V03 date, sort lcolor(red)) /// 2 "DELP"
> (line DayCTDMeRaA02S01V03 date, sort lcolor(black)) /// 3 "IHME" S1
> (line DayCTDMeRaA02S02V03 date, sort lcolor(black*.2) lpattern(dash)) /// 4 "IHME" S2
> (line DayCTDMeRaA02S03V03 date, sort lcolor(black*.2) lpattern(dash)) /// 5 "IHME" S3
> (line DayCTDMeRaA03S02V07 date, sort lcolor(magenta)) /// 6 "IMPE" S2
> (line DayCTDMeRaA03S01V07 date, sort lcolor(magenta*.2) lpattern(dash)) /// 7 "IMPE" S1
> (line DayCTDMeRaA03S03V07 date, sort lcolor(magenta*.2) lpattern(dash)) /// 8 "IMPE" S3
> (line DayCTDMeRaA04S00V02 date, sort lcolor(gold)) /// 9 "LANL"
> (line DayCTDMeRaA05S00V02 date, sort lcolor(green)) /// 10 "SRIV"
> if date >= td(30mar2020) & date <= td(02aug2021) ///
> , xtitle(Date) xlabel(#16, format(%tdYY-NN-DD) labsize(small)) xlabel(, grid) xlabel(, grid) ///
> xlabel(, angle(forty_five)) ylabel(, format(%12.0fc) labsize(small))  ylabel(, labsize(small) angle(horizontal)) ///
> ytitle(Daily cases to deaths) title("COVID-19 daily cases to deaths, Iran, 3 scenarios", size(medium)) /// 
> xscale(lwidth(vthin) lcolor(gray*.2)) yscale(lwidth(vthin) lcolor(gray*.2)) legend(region(lcolor(none))) legend(bexpand) ///
> legend(order(1 "JOHN" 2 "DELP" 3 "IHME" 6 "IMPE" 9 "LANL" 10 "SRIV") size(small) row(1)) ///
> note("Current scenarios: solid curves. Best and worst scenarios: dashed curves") ///
> subtitle("after 2020-04-01, 3 scenarios", size(small))
{res}{txt}
{com}. 
. graph save "graph 83 COVID-19 daily cases to deaths, Iran, 3 scenarios, 2020-04-01 on.gph", replace
{txt}(note: file graph 83 COVID-19 daily cases to deaths, Iran, 3 scenarios, 2020-04-01 on.gph not found)
{res}{txt}(file graph 83 COVID-19 daily cases to deaths, Iran, 3 scenarios, 2020-04-01 on.gph saved)

{com}. graph export "graph 83 COVID-19 daily cases to deaths, Iran, 3 scenarios, 2020-04-01 on.pdf", replace
{txt}(file /Users/farshadpourmalek/Downloads/covir2-main/20210507/code/merge/graph 83 COVID-19 daily cases to deaths, Iran, 3 scenarios, 2020-04-01 on.pdf written in PDF format)

{com}. 
. 
. 
. 
. * Total cases to deaths (CTD) all studies, all time, reference scenarios
. 
. twoway ///
> (line TotCTDMeRaA00S00V00 date, sort lcolor(cyan) lwidth(vthick) lpattern(tight_dot)) /// 1 "JOHN"
> (line TotCTDMeRaA01S00V03 date, sort lcolor(red)) /// 2 "DELP"
> (line TotCTDMeRaA02S01V03 date, sort lcolor(black)) /// 3 "IHME"
> (line TotCTDMeRaA03S02V07 date, sort lcolor(magenta)) /// 4 "IMPE"
> (line TotCTDMeRaA04S00V02 date, sort lcolor(gold)) /// 5 "LANL"
> (line TotCTDMeRaA05S00V02 date, sort lcolor(green)) /// 6 "SRIV"
> if date >= td(31dec2019) & date <= td(02aug2021) ///
> , xtitle(Date) xlabel(#19, format(%tdYY-NN-DD) labsize(small)) xlabel(, grid) xlabel(, grid) ///
> xlabel(, angle(forty_five)) ylabel(, format(%12.0fc) labsize(small))  ylabel(, labsize(small) angle(horizontal)) ///
> ytitle(Total cases to deaths) title("COVID-19 total cases to deaths, Iran, reference scenarios", size(medium)) /// 
> xscale(lwidth(vthin) lcolor(gray*.2)) yscale(lwidth(vthin) lcolor(gray*.2)) legend(region(lcolor(none))) legend(bexpand) ///
> legend(order(1 "JOHN" 2 "DELP" 3 "IHME" 4 "IMPE" 5 "LANL" 6 "SRIV") size(small) row(1)) ///
> subtitle("  .", size(small) color(white))
{res}{txt}
{com}. 
. graph save "graph 84 COVID-19 total cases to deaths, Iran, reference scenarios.gph", replace
{txt}(note: file graph 84 COVID-19 total cases to deaths, Iran, reference scenarios.gph not found)
{res}{txt}(file graph 84 COVID-19 total cases to deaths, Iran, reference scenarios.gph saved)

{com}. graph export "graph 84 COVID-19 total cases to deaths, Iran, reference scenarios.pdf", replace
{txt}(file /Users/farshadpourmalek/Downloads/covir2-main/20210507/code/merge/graph 84 COVID-19 total cases to deaths, Iran, reference scenarios.pdf written in PDF format)

{com}. 
. 
. 
. 
. * Total cases to deaths (CTD) all studies, 2020-04-01 on, reference scenarios
. 
. twoway ///
> (line TotCTDMeRaA00S00V00 date, sort lcolor(cyan) lwidth(vthick) lpattern(tight_dot)) /// 1 "JOHN"
> (line TotCTDMeRaA01S00V03 date, sort lcolor(red)) /// 2 "DELP"
> (line TotCTDMeRaA02S01V03 date, sort lcolor(black)) /// 3 "IHME"
> (line TotCTDMeRaA03S02V07 date, sort lcolor(magenta)) /// 4 "IMPE"
> (line TotCTDMeRaA04S00V02 date, sort lcolor(gold)) /// 5 "LANL"
> (line TotCTDMeRaA05S00V02 date, sort lcolor(green)) /// 6 "SRIV"
> if date >= td(30mar2020) & date <= td(02aug2021) ///
> , xtitle(Date) xlabel(#16, format(%tdYY-NN-DD) labsize(small)) xlabel(, grid) xlabel(, grid) ///
> xlabel(, angle(forty_five)) ylabel(, format(%12.0fc) labsize(small))  ylabel(, labsize(small) angle(horizontal)) ///
> ytitle(Total cases to deaths) title("COVID-19 total cases to deaths, Iran, reference scenarios", size(medium)) /// 
> xscale(lwidth(vthin) lcolor(gray*.2)) yscale(lwidth(vthin) lcolor(gray*.2)) legend(region(lcolor(none))) legend(bexpand) ///
> legend(order(1 "JOHN" 2 "DELP" 3 "IHME" 4 "IMPE" 5 "LANL" 6 "SRIV") size(small) row(1)) ///
> subtitle("after 2020-04-01", size(small))
{res}{txt}
{com}. 
. graph save "graph 85 COVID-19 total cases to deaths, Iran, reference scenarios, 2020-04-01 on.gph", replace
{txt}(note: file graph 85 COVID-19 total cases to deaths, Iran, reference scenarios, 2020-04-01 on.gph not found)
{res}{txt}(file graph 85 COVID-19 total cases to deaths, Iran, reference scenarios, 2020-04-01 on.gph saved)

{com}. graph export "graph 85 COVID-19 total cases to deaths, Iran, reference scenarios, 2020-04-01 on.pdf", replace
{txt}(file /Users/farshadpourmalek/Downloads/covir2-main/20210507/code/merge/graph 85 COVID-19 total cases to deaths, Iran, reference scenarios, 2020-04-01 on.pdf written in PDF format)

{com}. 
. 
. 
. 
. *******************************
. 
. *  estimated to reported (graph numbers start with 91)
. 
. 
. * daily deaths estimated to reported  
. 
. 
. * daily deaths estimated to reported (DER) all studies, all time, reference scenarios
. 
. twoway ///
> (line DayDERMeRaA00S00V00 date, sort lcolor(cyan) lwidth(vthick) lpattern(tight_dot)) /// 1 "JOHN"
> (line DayDERMeRaA01S00V03 date, sort lcolor(red)) /// 2 "DELP"
> (line DayDERMeRaA02S01V03 date, sort lcolor(black)) /// 3 "IHME"
> (line DayDERMeRaA03S02V07 date, sort lcolor(magenta)) /// 4 "IMPE"
> (line DayDERMeRaA04S00V02 date, sort lcolor(gold)) /// 5 "LANL"
> (line DayDERMeRaA05S00V02 date, sort lcolor(green)) /// 6 "SRIV"
> if date >= td(01jan2020) & date <= td(01jan2022) ///
> , xtitle(Date) xlabel(#25, format(%tdYY-NN-DD) labsize(small)) xlabel(, grid) xlabel(, grid) ///
> xlabel(, angle(forty_five)) ylabel(, format(%12.1fc) labsize(small))  ylabel(, labsize(small) angle(horizontal)) ///
> ytitle(Daily deaths estimated to reported) title("COVID-19 daily deaths estimated to reported, Iran, reference scenarios", size(medium)) /// 
> xscale(lwidth(vthin) lcolor(gray*.2)) yscale(lwidth(vthin) lcolor(gray*.2)) legend(region(lcolor(none))) legend(bexpand) ///
> legend(order(1 "JOHN" 2 "DELP" 3 "IHME" 4 "IMPE" 5 "LANL" 6 "SRIV") size(small) row(1)) ///
> subtitle("  .", size(small) color(white))
{res}{txt}
{com}. 
. graph save "graph 91 COVID-19 daily deaths estimated to reported, Iran, reference scenarios.gph", replace
{txt}(note: file graph 91 COVID-19 daily deaths estimated to reported, Iran, reference scenarios.gph not found)
{res}{txt}(file graph 91 COVID-19 daily deaths estimated to reported, Iran, reference scenarios.gph saved)

{com}. graph export "graph 91 COVID-19 daily deaths estimated to reported, Iran, reference scenarios.pdf", replace
{txt}(file /Users/farshadpourmalek/Downloads/covir2-main/20210507/code/merge/graph 91 COVID-19 daily deaths estimated to reported, Iran, reference scenarios.pdf written in PDF format)

{com}. 
. 
. 
. 
. * daily deaths estimated to reported (DER) all studies, 2021-01-01 on, reference scenarios
. 
. twoway ///
> (line DayDERMeRaA00S00V00 date, sort lcolor(cyan) lwidth(vthick) lpattern(tight_dot)) /// 1 "JOHN"
> (line DayDERMeRaA01S00V03 date, sort lcolor(red)) /// 2 "DELP"
> (line DayDERMeRaA02S01V03 date, sort lcolor(black)) /// 3 "IHME"
> (line DayDERMeRaA03S02V07 date, sort lcolor(magenta)) /// 4 "IMPE"
> (line DayDERMeRaA04S00V02 date, sort lcolor(gold)) /// 5 "LANL"
> (line DayDERMeRaA05S00V02 date, sort lcolor(green)) /// 6 "SRIV"
> if date >= td(01jan2021) & date <= td(01jan2022) ///
> , xtitle(Date) xlabel(#12, format(%tdYY-NN-DD) labsize(small)) xlabel(, grid) xlabel(, grid) ///
> xlabel(, angle(forty_five)) ylabel(, format(%12.1fc) labsize(small))  ylabel(, labsize(small) angle(horizontal)) ///
> ytitle(Daily deaths estimated to reported) title("COVID-19 daily deaths estimated to reported, Iran, reference scenarios", size(medium)) /// 
> xscale(lwidth(vthin) lcolor(gray*.2)) yscale(lwidth(vthin) lcolor(gray*.2)) legend(region(lcolor(none))) legend(bexpand) ///
> legend(order(1 "JOHN" 2 "DELP" 3 "IHME" 4 "IMPE" 5 "LANL" 6 "SRIV") size(small) row(1)) ///
> subtitle("  .", size(small) color(white))
{res}{txt}
{com}. 
. graph save "graph 92 COVID-19 daily deaths estimated to reported, Iran, reference scenarios, 2021-01-01 on.gph", replace
{txt}(note: file graph 92 COVID-19 daily deaths estimated to reported, Iran, reference scenarios, 2021-01-01 on.gph not found)
{res}{txt}(file graph 92 COVID-19 daily deaths estimated to reported, Iran, reference scenarios, 2021-01-01 on.gph saved)

{com}. graph export "graph 92 COVID-19 daily deaths estimated to reported, Iran, reference scenarios, 2021-01-01 on.pdf", replace
{txt}(file /Users/farshadpourmalek/Downloads/covir2-main/20210507/code/merge/graph 92 COVID-19 daily deaths estimated to reported, Iran, reference scenarios, 2021-01-01 on.pdf written in PDF format)

{com}. 
. 
. 
. * daily cases estimated to reported  
. 
. 
. * daily cases estimated to reported (CER) all studies, all time, reference scenarios
. 
. twoway ///
> (line DayCERMeRaA00S00V00 date, sort lcolor(cyan) lwidth(vthick) lpattern(tight_dot)) /// 1 "JOHN"
> (line DayCERMeRaA01S00V03 date, sort lcolor(red)) /// 2 "DELP"
> (line DayCERMeRaA02S01V03 date, sort lcolor(black)) /// 3 "IHME"
> (line DayCERMeRaA03S02V07 date, sort lcolor(magenta)) /// 4 "IMPE"
> (line DayCERMeRaA04S00V02 date, sort lcolor(gold)) /// 5 "LANL"
> (line DayCERMeRaA05S00V02 date, sort lcolor(green)) /// 6 "SRIV"
> if date >= td(01jan2020) & date <= td(01jan2022) ///
> , xtitle(Date) xlabel(#25, format(%tdYY-NN-DD) labsize(small)) xlabel(, grid) xlabel(, grid) ///
> xlabel(, angle(forty_five)) ylabel(, format(%12.0fc) labsize(small))  ylabel(, labsize(small) angle(horizontal)) ///
> ytitle(Daily cases estimated to reported) title("COVID-19 daily cases estimated to reported, Iran, reference scenarios", size(medium)) /// 
> xscale(lwidth(vthin) lcolor(gray*.2)) yscale(lwidth(vthin) lcolor(gray*.2)) legend(region(lcolor(none))) legend(bexpand) ///
> legend(order(1 "JOHN" 2 "DELP" 3 "IHME" 4 "IMPE" 5 "LANL" 6 "SRIV") size(small) row(1)) ///
> subtitle("  .", size(small) color(white))
{res}{txt}
{com}. 
. graph save "graph 93 COVID-19 daily cases estimated to reported, Iran, reference scenarios.gph", replace
{txt}(note: file graph 93 COVID-19 daily cases estimated to reported, Iran, reference scenarios.gph not found)
{res}{txt}(file graph 93 COVID-19 daily cases estimated to reported, Iran, reference scenarios.gph saved)

{com}. graph export "graph 93 COVID-19 daily cases estimated to reported, Iran, reference scenarios.pdf", replace
{txt}(file /Users/farshadpourmalek/Downloads/covir2-main/20210507/code/merge/graph 93 COVID-19 daily cases estimated to reported, Iran, reference scenarios.pdf written in PDF format)

{com}. 
. 
. 
. 
. * daily cases estimated to reported (CER) all studies, 2021-01-01 on, reference scenarios
. 
. twoway ///
> (line DayCERMeRaA00S00V00 date, sort lcolor(cyan) lwidth(vthick) lpattern(tight_dot)) /// 1 "JOHN"
> (line DayCERMeRaA01S00V03 date, sort lcolor(red)) /// 2 "DELP"
> (line DayCERMeRaA02S01V03 date, sort lcolor(black)) /// 3 "IHME"
> (line DayCERMeRaA03S02V07 date, sort lcolor(magenta)) /// 4 "IMPE"
> (line DayCERMeRaA04S00V02 date, sort lcolor(gold)) /// 5 "LANL"
> (line DayCERMeRaA05S00V02 date, sort lcolor(green)) /// 6 "SRIV"
> if date >= td(01jan2021) & date <= td(01jan2022) ///
> , xtitle(Date) xlabel(#12, format(%tdYY-NN-DD) labsize(small)) xlabel(, grid) xlabel(, grid) ///
> xlabel(, angle(forty_five)) ylabel(, format(%12.1fc) labsize(small))  ylabel(, labsize(small) angle(horizontal)) ///
> ytitle(Daily cases estimated to reported) title("COVID-19 daily cases estimated to reported, Iran, reference scenarios", size(medium)) /// 
> xscale(lwidth(vthin) lcolor(gray*.2)) yscale(lwidth(vthin) lcolor(gray*.2)) legend(region(lcolor(none))) legend(bexpand) ///
> legend(order(1 "JOHN" 2 "DELP" 3 "IHME" 4 "IMPE" 5 "LANL" 6 "SRIV") size(small) row(1)) ///
> subtitle("  .", size(small) color(white))
{res}{txt}
{com}. 
. graph save "graph 93 COVID-19 daily cases estimated to reported, Iran, reference scenarios, 2021-01-01 on.gph", replace
{txt}(note: file graph 93 COVID-19 daily cases estimated to reported, Iran, reference scenarios, 2021-01-01 on.gph not found)
{res}{txt}(file graph 93 COVID-19 daily cases estimated to reported, Iran, reference scenarios, 2021-01-01 on.gph saved)

{com}. graph export "graph 93 COVID-19 daily cases estimated to reported, Iran, reference scenarios, 2021-01-01 on.pdf", replace
{txt}(file /Users/farshadpourmalek/Downloads/covir2-main/20210507/code/merge/graph 93 COVID-19 daily cases estimated to reported, Iran, reference scenarios, 2021-01-01 on.pdf written in PDF format)

{com}. 
. 
. 
. 
. * total deaths estimated to reported (DER) all studies, all time, reference scenarios
. 
. twoway ///
> (line TotDERMeRaA00S00V00 date, sort lcolor(cyan) lwidth(vthick) lpattern(tight_dot)) /// 1 "JOHN
> (line TotDERMeRaA01S00V03 date, sort lcolor(red)) /// 2 "DELP"
> (line TotDERMeRaA02S01V03 date, sort lcolor(black)) /// 3 "IHME"
> (line TotDERMeRaA03S02V07 date, sort lcolor(magenta)) /// 4 "IMPE"
> (line TotDERMeRaA04S00V02 date, sort lcolor(gold)) /// 5 "LANL"
> (line TotDERMeRaA05S00V02 date, sort lcolor(green)) /// 6 "SRIV"
> if date >= td(01jan2020) & date <= td(01jan2022) ///
> , xtitle(Date) xlabel(#25, format(%tdYY-NN-DD) labsize(small)) xlabel(, grid) xlabel(, grid) ///
> xlabel(, angle(forty_five)) ylabel(, format(%12.0fc) labsize(small))  ylabel(, labsize(small) angle(horizontal)) ///
> ytitle(Total deaths estimated to reported) title("COVID-19 total deaths estimated to reported, Iran, reference scenarios", size(medium)) /// 
> xscale(lwidth(vthin) lcolor(gray*.2)) yscale(lwidth(vthin) lcolor(gray*.2)) legend(region(lcolor(none))) legend(bexpand) ///
> legend(order(1 "JOHN" 2 "DELP" 3 "IHME" 4 "IMPE" 5 "LANL" 6 "SRIV") size(small) row(1)) ///
> subtitle("  .", size(small) color(white))
{res}{txt}
{com}. 
. graph save "graph 95 COVID-19 total deaths estimated to reported, Iran, reference scenarios.gph", replace
{txt}(note: file graph 95 COVID-19 total deaths estimated to reported, Iran, reference scenarios.gph not found)
{res}{txt}(file graph 95 COVID-19 total deaths estimated to reported, Iran, reference scenarios.gph saved)

{com}. graph export "graph 95 COVID-19 total deaths estimated to reported, Iran, reference scenarios.pdf", replace
{txt}(file /Users/farshadpourmalek/Downloads/covir2-main/20210507/code/merge/graph 95 COVID-19 total deaths estimated to reported, Iran, reference scenarios.pdf written in PDF format)

{com}. 
. 
. 
. 
. * total deaths estimated to reported (DER) all studies, 2021-01-01 on, reference scenarios
. 
. twoway ///
> (line TotDERMeRaA00S00V00 date, sort lcolor(cyan) lwidth(vthick) lpattern(tight_dot)) /// 1 "JOHN
> (line TotDERMeRaA01S00V03 date, sort lcolor(red)) /// 2 "DELP"
> (line TotDERMeRaA02S01V03 date, sort lcolor(black)) /// 3 "IHME"
> (line TotDERMeRaA03S02V07 date, sort lcolor(magenta)) /// 4 "IMPE"
> (line TotDERMeRaA04S00V02 date, sort lcolor(gold)) /// 5 "LANL"
> (line TotDERMeRaA05S00V02 date, sort lcolor(green)) /// 6 "SRIV"
> if date >= td(01jan2021) & date <= td(01jan2022) ///
> , xtitle(Date) xlabel(#12, format(%tdYY-NN-DD) labsize(small)) xlabel(, grid) xlabel(, grid) ///
> xlabel(, angle(forty_five)) ylabel(, format(%12.2fc) labsize(small))  ylabel(, labsize(small) angle(horizontal)) ///
> ytitle(Total deaths estimated to reported) title("COVID-19 total deaths estimated to reported, Iran, reference scenarios", size(medium)) /// 
> xscale(lwidth(vthin) lcolor(gray*.2)) yscale(lwidth(vthin) lcolor(gray*.2)) legend(region(lcolor(none))) legend(bexpand) ///
> legend(order(1 "JOHN" 2 "DELP" 3 "IHME" 4 "IMPE" 5 "LANL" 6 "SRIV") size(small) row(1)) ///
> subtitle("  .", size(small) color(white))
{res}{txt}
{com}. 
. graph save "graph 96 COVID-19 total deaths estimated to reported, Iran, reference scenarios, 2021-01-01 on.gph", replace
{txt}(note: file graph 96 COVID-19 total deaths estimated to reported, Iran, reference scenarios, 2021-01-01 on.gph not found)
{res}{txt}(file graph 96 COVID-19 total deaths estimated to reported, Iran, reference scenarios, 2021-01-01 on.gph saved)

{com}. graph export "graph 96 COVID-19 total deaths estimated to reported, Iran, reference scenarios, 2021-01-01 on.pdf", replace
{txt}(file /Users/farshadpourmalek/Downloads/covir2-main/20210507/code/merge/graph 96 COVID-19 total deaths estimated to reported, Iran, reference scenarios, 2021-01-01 on.pdf written in PDF format)

{com}. 
. 
. 
. 
. * total cases estimated to reported (CER) all studies, all time, reference scenarios
. 
. twoway ///
> (line TotCERMeRaA00S00V00 date, sort lcolor(cyan) lwidth(vthick) lpattern(tight_dot)) /// 1 "JOHN"
> (line TotCERMeRaA01S00V03 date, sort lcolor(red)) /// 2 "DELP"
> (line TotCERMeRaA02S01V03 date, sort lcolor(black)) /// 3 "IHME"
> (line TotCERMeRaA03S02V07 date, sort lcolor(magenta)) /// 4 "IMPE"
> (line TotCERMeRaA04S00V02 date, sort lcolor(gold)) /// 5 "LANL"
> (line TotCERMeRaA05S00V02 date, sort lcolor(green)) /// 6 "SRIV"
> if date >= td(01jan2020) & date <= td(01jan2022) ///
> , xtitle(Date) xlabel(#25, format(%tdYY-NN-DD) labsize(small)) xlabel(, grid) xlabel(, grid) ///
> xlabel(, angle(forty_five)) ylabel(, format(%12.0fc) labsize(small))  ylabel(, labsize(small) angle(horizontal)) ///
> ytitle(Total cases estimated to reported) title("COVID-19 total cases estimated to reported, Iran, reference scenarios", size(medium)) /// 
> xscale(lwidth(vthin) lcolor(gray*.2)) yscale(lwidth(vthin) lcolor(gray*.2)) legend(region(lcolor(none))) legend(bexpand) ///
> legend(order(1 "JOHN" 2 "DELP" 3 "IHME" 4 "IMPE" 5 "LANL" 6 "SRIV") size(small) row(1)) ///
> subtitle("  .", size(small) color(white))
{res}{txt}
{com}. 
. graph save "graph 97 COVID-19 total cases estimated to reported, Iran, reference scenarios.gph", replace
{txt}(note: file graph 97 COVID-19 total cases estimated to reported, Iran, reference scenarios.gph not found)
{res}{txt}(file graph 97 COVID-19 total cases estimated to reported, Iran, reference scenarios.gph saved)

{com}. graph export "graph 97 COVID-19 total cases estimated to reported, Iran, reference scenarios.pdf", replace
{txt}(file /Users/farshadpourmalek/Downloads/covir2-main/20210507/code/merge/graph 97 COVID-19 total cases estimated to reported, Iran, reference scenarios.pdf written in PDF format)

{com}. 
. 
. 
. 
. * total cases estimated to reported (CER) all studies, 2021-01-01 on, reference scenarios
. 
. twoway ///
> (line TotCERMeRaA00S00V00 date, sort lcolor(cyan) lwidth(vthick) lpattern(tight_dot)) /// 1 "JOHN"
> (line TotCERMeRaA01S00V03 date, sort lcolor(red)) /// 2 "DELP"
> (line TotCERMeRaA02S01V03 date, sort lcolor(black)) /// 3 "IHME"
> (line TotCERMeRaA03S02V07 date, sort lcolor(magenta)) /// 4 "IMPE"
> (line TotCERMeRaA04S00V02 date, sort lcolor(gold)) /// 5 "LANL"
> (line TotCERMeRaA05S00V02 date, sort lcolor(green)) /// 6 "SRIV"
> if date >= td(01jan2021) & date <= td(01jan2022) ///
> , xtitle(Date) xlabel(#12, format(%tdYY-NN-DD) labsize(small)) xlabel(, grid) xlabel(, grid) ///
> xlabel(, angle(forty_five)) ylabel(, format(%12.0fc) labsize(small))  ylabel(, labsize(small) angle(horizontal)) ///
> ytitle(Total cases estimated to reported) title("COVID-19 total cases estimated to reported, Iran, reference scenarios", size(medium)) /// 
> xscale(lwidth(vthin) lcolor(gray*.2)) yscale(lwidth(vthin) lcolor(gray*.2)) legend(region(lcolor(none))) legend(bexpand) ///
> legend(order(1 "JOHN" 2 "DELP" 3 "IHME" 4 "IMPE" 5 "LANL" 6 "SRIV") size(small) row(1)) ///
> subtitle("  .", size(small) color(white))
{res}{txt}
{com}. 
. graph save "graph 98 COVID-19 total cases estimated to reported, Iran, reference scenarios, 2021-01-01 on.gph", replace
{txt}(note: file graph 98 COVID-19 total cases estimated to reported, Iran, reference scenarios, 2021-01-01 on.gph not found)
{res}{txt}(file graph 98 COVID-19 total cases estimated to reported, Iran, reference scenarios, 2021-01-01 on.gph saved)

{com}. graph export "graph 98 COVID-19 total cases estimated to reported, Iran, reference scenarios, 2021-01-01 on.pdf", replace
{txt}(file /Users/farshadpourmalek/Downloads/covir2-main/20210507/code/merge/graph 98 COVID-19 total cases estimated to reported, Iran, reference scenarios, 2021-01-01 on.pdf written in PDF format)

{com}. 
. ***
. 
. 
. 
. 
. 
. 
. 
. 
. 
. ************
. 
. * restore native scheme (of the local machine)
. 
. set scheme $nativescheme
{txt}
{com}. 
. di c(scheme)
{res}_GRSTYLE_
{txt}
{com}. 
. 
. view "log Iran merge.smcl"
{txt}
{com}. 
. log close
      {txt}name:  {res}<unnamed>
       {txt}log:  {res}/Users/farshadpourmalek/Downloads/covir2-main/20210507/code/merge/log Iran merge.smcl
  {txt}log type:  {res}smcl
 {txt}closed on:  {res}13 May 2021, 02:10:18
{txt}{.-}
{smcl}
{txt}{sf}{ul off}