{smcl}
{txt}{sf}{ul off}{.-}
      name:  {res}<unnamed>
       {txt}log:  {res}/Users/farshadpourmalek/Downloads/covir2-main/20210413/code/IHME/log Iran IHME.smcl
  {txt}log type:  {res}smcl
 {txt}opened on:  {res}15 Apr 2021, 11:36:56
{txt}
{com}. 
. ***************************************************************************
. * This is "do Iran IHME.do"
. 
. * Project: Rapid review of estimates of COVID Iran - No 2
. * Person: Farshad Pourmalek pourmalek_farshad@yahoo.com
. * Time (initial): 2021-02-10
. 
. * OBJECTIVE: Get and prepare IHME study estimates for Iran, Locate peak dates and values
. ***************************************************************************
. 
. 
. clear 
{txt}
{com}.  
. *****************************
. 
. * get IHME estimates
. 
. *                                                           /2021_04_09/  Note: update  /latest/  to /2021_04_09/  when next IHME mdel update is released 
. copy https://ihmecovid19storage.blob.core.windows.net/latest/ihme-covid19.zip ihme-covid19.zip
{txt}
{com}. unzipfile ihme-covid19.zip, replace
{res}{txt}    inflating: 2021_04_09/best_masks_hospitalization_all_locs.csv
    inflating: 2021_04_09/IHME_COVID_19_Data_Release_Information_Sheet.pdf
    inflating: 2021_04_09/reference_hospitalization_all_locs.csv
    inflating: 2021_04_09/Summary_stats_all_locs.csv
    inflating: 2021_04_09/worse_hospitalization_all_locs.csv
successfully unzipped ihme-covid19.zip to current directory

{com}. erase ihme-covid19.zip
{txt}
{com}. 
. /* The following URL contains the latest IHME updates:
> copy https://ihmecovid19storage.blob.core.windows.net/latest/ihme-covid19.zip ihme-covid19.zip
> unzipfile ihme-covid19.zip, replace
> erase ihme-covid19.zip */
. 
. 
. ******************************
. 
. * import csv files
. 
. 
. /*
> 
> *!!! IMPORTANT NOTE !!!: 
> 
> Make sure that among different estimations updates which might be downloaded into this directory over a course of more than one to two weeks, 
> the only update directory whose directory name is like 2021_03_06 should be the latest estimate. 
> Might want to manually rename the previous directories (e.g., 2021_02_25 to some other format, like 2021-02-25). 
> 
>         
> * Note on scenario changes in IHME COVID-19 model updates:
> 
> Since early 2020, IHME COVID-19 model has had three versions of their set of scenarios. 
> The very first version had 3 scenarios, a next version had 6 scenarios and included vaccines, 
> another version modified vaccine scenarios and added new variants, 
> and as of updates 2021 02 25 and 2021 03 06, scenarios are back to the very first version with 3 scenarios. 
> 
> Once additional scenarios might be added, the code parts below would need to be updated in order to be able 
> to intake the new files' names. 
> 
> */
. 
. 
. dis "`c(username)'"
{res}farshadpourmalek
{txt}
{com}. local usrnam = "`c(username)'"
{txt}
{com}. di "`usrnam'"
{res}farshadpourmalek
{txt}
{com}. 
. 
. if regexm(c(os),"Mac") == 1 {c -(}
.         local path "/Users/`usrnam'/Downloads/covir2-main/20210413/code/IHME" 
.         di "`path'"
{res}/Users/farshadpourmalek/Downloads/covir2-main/20210413/code/IHME
{com}. {c )-}
{txt}
{com}. else if regexm(c(os),"Windows") == 1 local path "C:\Users\\`usrnam'\Downloads\covir2-main\20210413\code\IHME"
{txt}
{com}. di "`path'"
{res}/Users/farshadpourmalek/Downloads/covir2-main/20210413/code/IHME
{txt}
{com}. 
. 
. 
. if regexm(c(os),"Mac") == 1 {c -(}
.         local path "/Users/`usrnam'/Downloads/covir2-main/20210413/code/IHME" 
.         di "`path'"
{res}/Users/farshadpourmalek/Downloads/covir2-main/20210413/code/IHME
{com}. {c )-}
{txt}
{com}. else if regexm(c(os),"Windows") == 1 {c -(}
.         local path "C:\Users\\`usrnam'\Downloads\\covir2-main\20210413\code\IHME"
.         di "`path'"
. {c )-}
{txt}
{com}. *
. 
. * set local folderList and dir (for the latest estimates)
. 
. 
. local folderList : dir "`path'" dirs "2021_*"
{txt}
{com}. 
. 
. 
. foreach folder of local folderList {c -(}
{txt}  2{com}. 
.     di "`folder'"
{txt}  3{com}.         
.         * get reference_hospitalization_all_locs
.         
.         if regexm(c(os),"Mac") == 1 {c -(}
{txt}  4{com}.         import delimited using "`path'/`folder'/reference_hospitalization_all_locs.csv", clear varnames(1)
{txt}  5{com}.         save "$pathcovir2/IHME/Reference_hospitalization_all_locs.dta", replace
{txt}  6{com}.         {c )-}
{txt}  7{com}.         else if regexm(c(os),"Windows") == 1 {c -(}
{txt}  8{com}.         import delimited using "`path'\\`folder'\reference_hospitalization_all_locs.csv", clear varnames(1)
{txt}  9{com}.         capture save "$pathcovir2\IHME\Reference_hospitalization_all_locs.dta", replace
{txt} 10{com}.         {c )-}
{txt} 11{com}.         
.         
.         * get best_masks_hospitalization_all_locs
.         
.         if regexm(c(os),"Mac") == 1 {c -(}
{txt} 12{com}.         import delimited using "`path'/`folder'/best_masks_hospitalization_all_locs.csv", clear varnames(1)
{txt} 13{com}.         save "$pathcovir2/IHME/Best_masks_hospitalization_all_locs.dta", replace
{txt} 14{com}.         {c )-}
{txt} 15{com}.         else if regexm(c(os),"Windows") == 1 {c -(}
{txt} 16{com}.         import delimited using "`path'\\`folder'\best_masks_hospitalization_all_locs.csv", clear varnames(1)
{txt} 17{com}.         capture save "$pathcovir2\IHME\Best_masks_hospitalization_all_locs.dta", replace
{txt} 18{com}.         {c )-}
{txt} 19{com}.         
.         
.         * get worse_hospitalization_all_locs
.         
.         if regexm(c(os),"Mac") == 1 {c -(}
{txt} 20{com}.         import delimited using "`path'/`folder'/worse_hospitalization_all_locs.csv", clear varnames(1)
{txt} 21{com}.         save "$pathcovir2/IHME/Worse_hospitalization_all_locs.dta", replace
{txt} 22{com}.         {c )-}
{txt} 23{com}.         else if regexm(c(os),"Windows") == 1 {c -(}
{txt} 24{com}.         import delimited using "`path'\\`folder'\worse_hospitalization_all_locs.csv", clear varnames(1)
{txt} 25{com}.         capture save "$pathcovir2\IHME\Worse_hospitalization_all_locs.dta", replace     
{txt} 26{com}.         {c )-}
{txt} 27{com}. *
. {c )-}
2021_04_09
{res}{text}(73 vars, 208,406 obs)
(note: file /Users/farshadpourmalek/Downloads/covir2-main/20210413/code/IHME/Reference_hospitalization_all_locs.dta not found)
file /Users/farshadpourmalek/Downloads/covir2-main/20210413/code/IHME/Reference_hospitalization_all_locs.dta saved
{res}{text}(51 vars, 208,406 obs)
(note: file /Users/farshadpourmalek/Downloads/covir2-main/20210413/code/IHME/Best_masks_hospitalization_all_locs.dta not found)
file /Users/farshadpourmalek/Downloads/covir2-main/20210413/code/IHME/Best_masks_hospitalization_all_locs.dta saved
{res}{text}(51 vars, 208,406 obs)
(note: file /Users/farshadpourmalek/Downloads/covir2-main/20210413/code/IHME/Worse_hospitalization_all_locs.dta not found)
file /Users/farshadpourmalek/Downloads/covir2-main/20210413/code/IHME/Worse_hospitalization_all_locs.dta saved

{com}. *
. 
. 
.         
. 
. 
. 
. ******************************
. 
. * read scenario files
. 
. 
. **********************
. 
. * S1 Reference
. 
. use "Reference_hospitalization_all_locs.dta", clear
{txt}
{com}. 
. keep if strpos(location_name, "Iran")
{txt}(207,861 observations deleted)

{com}. 
. 
. * rename variables
. 
. * Total Deaths not smoothed
. rename totdea_mean  TotDeaMeRaA02S01V03
{res}{txt}
{com}. rename totdea_lower TotDeaLoRaA02S01V03
{res}{txt}
{com}. rename totdea_upper TotDeaUpRaA02S01V03
{res}{txt}
{com}. label var TotDeaMeRaA02S01V03 "Total Deaths Mean not smoothed IHME S1"
{txt}
{com}. label var TotDeaLoRaA02S01V03 "Total Deaths Lower not smoothed IHME S1"
{txt}
{com}. label var TotDeaUpRaA02S01V03 "Total Deaths Upper not smoothed IHME S1"
{txt}
{com}. 
. * Daily Deaths not smoothed
. rename deaths_mean  DayDeaMeRaA02S01V03
{res}{txt}
{com}. rename deaths_lower DayDeaLoRaA02S01V03
{res}{txt}
{com}. rename deaths_upper DayDeaUpRaA02S01V03
{res}{txt}
{com}. label var DayDeaMeRaA02S01V03 "Daily Deaths Mean not smoothed IHME S1"
{txt}
{com}. label var DayDeaLoRaA02S01V03 "Daily Deaths Lower not smoothed IHME S1"
{txt}
{com}. label var DayDeaUpRaA02S01V03 "Daily Deaths Upper not smoothed IHME S1"
{txt}
{com}.         
. * Total Cases not smoothed
. rename inf_cuml_mean  TotCasMeRaA02S01V03
{res}{txt}
{com}. rename inf_cuml_lower TotCasLoRaA02S01V03
{res}{txt}
{com}. rename inf_cuml_upper TotCasUpRaA02S01V03
{res}{txt}
{com}. label var TotCasMeRaA02S01V03 "Total Cases Mean not smoothed IHME S1"
{txt}
{com}. label var TotCasLoRaA02S01V03 "Total Cases Lower not smoothed IHME S1"
{txt}
{com}. label var TotCasUpRaA02S01V03 "Total Cases Upper not smoothed IHME S1"
{txt}
{com}. 
. * Daily Cases not smoothed
. rename est_infections_mean  DayCasMeRaA02S01V03
{res}{txt}
{com}. rename est_infections_lower DayCasLoRaA02S01V03
{res}{txt}
{com}. rename est_infections_upper DayCasUpRaA02S01V03
{res}{txt}
{com}. label var DayCasMeRaA02S01V03 "Daily Cases Mean not smoothed IHME S1"
{txt}
{com}. label var DayCasLoRaA02S01V03 "Daily Cases Lower not smoothed IHME S1"
{txt}
{com}. label var DayCasUpRaA02S01V03 "Daily Cases Upper not smoothed IHME S1"
{txt}
{com}. 
. * Total Deaths smoothed
. rename totdea_mean_smoothed   TotDeaMeSmA02S01V03
{res}{txt}
{com}. rename totdea_lower_smoothed  TotDeaLoSmA02S01V03
{res}{txt}
{com}. rename totdea_upper_smoothed  TotDeaUpSmA02S01V03
{res}{txt}
{com}. label var TotDeaMeSmA02S01V03 "Total Deaths Mean smoothed IHME S1"
{txt}
{com}. label var TotDeaLoSmA02S01V03 "Total Deaths Lower smoothed IHME S1"
{txt}
{com}. label var TotDeaUpSmA02S01V03 "Total Deaths Upper smoothed IHME S1"
{txt}
{com}. 
. * Daily Deaths smoothed
. rename deaths_mean_smoothed  DayDeaMeSmA02S01V03        
{res}{txt}
{com}. rename deaths_lower_smoothed DayDeaLoSmA02S01V03        
{res}{txt}
{com}. rename deaths_upper_smoothed DayDeaUpSmA02S01V03  
{res}{txt}
{com}. label var DayDeaMeSmA02S01V03 "Daily Deaths Mean smoothed IHME S1"
{txt}
{com}. label var DayDeaLoSmA02S01V03 "Daily Deaths Lower smoothed IHME S1"
{txt}
{com}. label var DayDeaUpSmA02S01V03 "Daily Deaths Upper smoothed IHME S1"
{txt}
{com}. 
. 
. 
. 
. 
. 
. 
. 
. * other outcomes 
. 
. /*
> allbed_mean             Mean covid beds needed by day
> allbed_lower    Lower uncertainty bound of covid beds needed by day
> allbed_upper    Upper uncertainty bound of covid beds needed by day
> icubed_mean             Mean ICU covid beds needed by day
> icubed_lower    Lower uncertainty bound of ICU covid beds needed by day
> icubed_upper    Upper uncertainty bound of ICU covid beds needed by day
> invven_mean             Mean invasive ventilation needed by day
> invven_lower    Lower uncertainty bound of invasive ventilation needed by day
> invven_upper    Upper uncertainty bound of invasive ventilation needed by day
> admis_mean              Mean hospital admissions by day
> admis_lower             Lower uncertainty bound of hospital admissions by day
> admis_upper             Upper uncertainty bound of hospital admissions by day
> newicu_mean             Mean number of new people going to the ICU by day
> newicu_lower    Lower uncertainty bound of the number of new people going to the ICU by day
> newicu_upper    Upper uncertainty bound of the number of new people going to the ICU by day
> bedover_mean    [covid all beds needed] - ([total bed capacity] - [average all bed usage])
> bedover_lower   Lower uncertainty bound of bedover (above)
> bedover_upper   Upper uncertainty bound of bedover (above)
> icuover_mean    [covid ICU beds needed] - ([total ICU capacity] - [average ICU bed usage])
> icuover_lower   Lower uncertainty bound of icuover (above)
> icuover_upper   Upper uncertainty bound of icuover (above)
> 
> total_tests             Total tests
> 
> seroprev_mean
> seroprev_lower
> seroprev_upper  
> 
> 
> ***********************
> * rename convention
> 
> allbed          Bed     covid beds needed by day
> icubed          Icu     ICU covid beds needed by day
> invven          Ven     invasive ventilation needed by day
> admis           Adm     hospital admissions by day
> newicu          Icn             number of new people going to the ICU by day
> bedover         Beo             [covid all beds needed] - ([total bed capacity] - [average all bed usage])
> icuover         Ico             [covid ICU beds needed] - ([total ICU capacity] - [average ICU bed usage])
> 
> total_tests             Tes     tests
> 
> seroprev_mean   Ser seroprevalence 
> 
> */
. 
. 
. rename allbed_mean              DayBedMeSmA02S01V03
{res}{txt}
{com}. rename allbed_lower             DayBedLoSmA02S01V03
{res}{txt}
{com}. rename allbed_upper             DayBedUpSmA02S01V03
{res}{txt}
{com}. 
. label var DayBedMeSmA02S01V03 "Daily Beds needed Mean IHME S1"
{txt}
{com}. label var DayBedLoSmA02S01V03 "Daily Beds needed Lower IHME S1"
{txt}
{com}. label var DayBedUpSmA02S01V03 "Daily Beds needed Upper IHME S1"
{txt}
{com}. 
. 
. 
. rename icubed_mean              DayIcuMeSmA02S01V03
{res}{txt}
{com}. rename icubed_lower             DayIcuLoSmA02S01V03
{res}{txt}
{com}. rename icubed_upper             DayIcuUpSmA02S01V03
{res}{txt}
{com}. 
. label var DayIcuMeSmA02S01V03 "Daily ICU beds needed Mean IHME S1"
{txt}
{com}. label var DayIcuLoSmA02S01V03 "Daily ICU beds needed Lower IHME S1"
{txt}
{com}. label var DayIcuUpSmA02S01V03 "Daily ICU beds needed Upper IHME S1"
{txt}
{com}. 
. 
. 
. rename invven_mean              DayVenMeSmA02S01V03
{res}{txt}
{com}. rename invven_lower             DayVenLoSmA02S01V03
{res}{txt}
{com}. rename invven_upper             DayVenUpSmA02S01V03
{res}{txt}
{com}. 
. label var DayVenMeSmA02S01V03 "Daily invasive Ventilation needed Mean IHME S1"
{txt}
{com}. label var DayVenLoSmA02S01V03 "Daily invasive Ventilation needed Lower IHME S1"
{txt}
{com}. label var DayVenUpSmA02S01V03 "Daily invasive Ventilation needed Upper IHME S1"
{txt}
{com}. 
. 
. 
. rename admis_mean               DayAdmMeSmA02S01V03
{res}{txt}
{com}. rename admis_lower              DayAdmLoSmA02S01V03
{res}{txt}
{com}. rename admis_upper              DayAdmUpSmA02S01V03
{res}{txt}
{com}. 
. label var DayAdmMeSmA02S01V03 "Daily hospital admissions Mean IHME S1"
{txt}
{com}. label var DayAdmLoSmA02S01V03 "Daily hospital admissions Lower IHME S1"
{txt}
{com}. label var DayAdmUpSmA02S01V03 "Daily hospital admissions Upper IHME S1"
{txt}
{com}. 
. 
. 
. rename newicu_mean              DayIcnMeSmA02S01V03
{res}{txt}
{com}. rename newicu_lower             DayIcnLoSmA02S01V03
{res}{txt}
{com}. rename newicu_upper             DayIcnUpSmA02S01V03
{res}{txt}
{com}. 
. label var DayIcnMeSmA02S01V03 "Daily new people going to ICU Mean IHME S1"
{txt}
{com}. label var DayIcnLoSmA02S01V03 "Daily new people going to ICU Lower IHME S1"
{txt}
{com}. label var DayIcnUpSmA02S01V03 "Daily new people going to ICU Upper IHME S1"
{txt}
{com}. 
. 
. 
. rename bedover_mean                     DayBeoMeSmA02S01V03
{res}{txt}
{com}. rename bedover_lower            DayBeoLoSmA02S01V03
{res}{txt}
{com}. rename bedover_upper            DayBeoUpSmA02S01V03
{res}{txt}
{com}. 
. label var DayBeoMeSmA02S01V03 "Daily bedover [covid all beds needed] - ([total bed capacity] - [average all bed usage]) Mean IHME S1"
{txt}note: label truncated to 80 characters

{com}. label var DayBeoLoSmA02S01V03 "Daily bedover [covid all beds needed] - ([total bed capacity] - [average all bed usage]) Lower IHME S1"
{txt}note: label truncated to 80 characters

{com}. label var DayBeoUpSmA02S01V03 "Daily bedover [covid all beds needed] - ([total bed capacity] - [average all bed usage]) Upper IHME S1"
{txt}note: label truncated to 80 characters

{com}. 
. 
. 
. rename icuover_mean                     DayIcoMeSmA02S01V03
{res}{txt}
{com}. rename icuover_lower            DayIcoLoSmA02S01V03
{res}{txt}
{com}. rename icuover_upper            DayIcoUpSmA02S01V03
{res}{txt}
{com}. 
. label var DayIcoMeSmA02S01V03 "Daily icuover [covid ICU beds needed] - ([total ICU capacity] - [average ICU bed usage]) Mean IHME S1"
{txt}note: label truncated to 80 characters

{com}. label var DayIcoLoSmA02S01V03 "Daily icuover [covid ICU beds needed] - ([total ICU capacity] - [average ICU bed usage]) Lower IHME S1"
{txt}note: label truncated to 80 characters

{com}. label var DayIcoUpSmA02S01V03 "Daily icuover [covid ICU beds needed] - ([total ICU capacity] - [average ICU bed usage]) Upper IHME S1"
{txt}note: label truncated to 80 characters

{com}. 
. 
. 
. rename total_tests TotTesMeSmA02S01V03
{res}{txt}
{com}. 
. label var TotTesMeSmA02S01V03 "Total Tests Mean IHME S1"
{txt}
{com}. 
. 
. 
. rename seroprev_mean            TotSerMeSmA02S01V03
{res}{txt}
{com}. rename seroprev_upper           TotSerLoSmA02S01V03
{res}{txt}
{com}. rename seroprev_lower           TotSerUpSmA02S01V03
{res}{txt}
{com}. 
. label var TotSerMeSmA02S01V03 "Total seroprevalence Mean IHME S1"
{txt}
{com}. label var TotSerLoSmA02S01V03 "Total seroprevalence Lower IHME S1"
{txt}
{com}. label var TotSerUpSmA02S01V03 "Total seroprevalence Upper IHME S1"
{txt}
{com}. 
. 
. save "Reference Iran.dta", replace
{txt}(note: file Reference Iran.dta not found)
file Reference Iran.dta saved

{com}. 
. 
. 
. 
. 
. 
. 
. **********************
. 
. * S2 Best
. 
. use "Best_masks_hospitalization_all_locs.dta", clear
{txt}
{com}. 
. keep if strpos(location_name, "Iran")
{txt}(207,861 observations deleted)

{com}. 
. 
. * rename variables
. 
. 
. * Total Deaths not smoothed
. rename totdea_mean  TotDeaMeRaA02S02V03
{res}{txt}
{com}. rename totdea_lower TotDeaLoRaA02S02V03
{res}{txt}
{com}. rename totdea_upper TotDeaUpRaA02S02V03
{res}{txt}
{com}. label var TotDeaMeRaA02S02V03 "Total Deaths Mean not smoothed IHME S2"
{txt}
{com}. label var TotDeaLoRaA02S02V03 "Total Deaths Lower not smoothed IHME S2"
{txt}
{com}. label var TotDeaUpRaA02S02V03 "Total Deaths Upper not smoothed IHME S2"
{txt}
{com}. 
. * Daily Deaths not smoothed
. rename deaths_mean  DayDeaMeRaA02S02V03
{res}{txt}
{com}. rename deaths_lower DayDeaLoRaA02S02V03
{res}{txt}
{com}. rename deaths_upper DayDeaUpRaA02S02V03
{res}{txt}
{com}. label var DayDeaMeRaA02S02V03 "Daily Deaths Mean not smoothed IHME S2"
{txt}
{com}. label var DayDeaLoRaA02S02V03 "Daily Deaths Lower not smoothed IHME S2"
{txt}
{com}. label var DayDeaUpRaA02S02V03 "Daily Deaths Upper not smoothed IHME S2"
{txt}
{com}.         
. * Total Cases not smoothed
. rename inf_cuml_mean  TotCasMeRaA02S02V03
{res}{txt}
{com}. rename inf_cuml_lower TotCasLoRaA02S02V03
{res}{txt}
{com}. rename inf_cuml_upper TotCasUpRaA02S02V03
{res}{txt}
{com}. label var TotCasMeRaA02S02V03 "Total Cases Mean not smoothed IHME S2"
{txt}
{com}. label var TotCasLoRaA02S02V03 "Total Cases Lower not smoothed IHME S2"
{txt}
{com}. label var TotCasUpRaA02S02V03 "Total Cases Upper not smoothed IHME S2"
{txt}
{com}. 
. * Daily Cases not smoothed
. rename est_infections_mean  DayCasMeRaA02S02V03
{res}{txt}
{com}. rename est_infections_lower DayCasLoRaA02S02V03
{res}{txt}
{com}. rename est_infections_upper DayCasUpRaA02S02V03
{res}{txt}
{com}. label var DayCasMeRaA02S02V03 "Daily Cases Mean not smoothed IHME S2"
{txt}
{com}. label var DayCasLoRaA02S02V03 "Daily Cases Lower not smoothed IHME S2"
{txt}
{com}. label var DayCasUpRaA02S02V03 "Daily Cases Upper not smoothed IHME S2"
{txt}
{com}. 
. * Total Deaths smoothed
. rename totdea_mean_smoothed   TotDeaMeSmA02S02V03
{res}{txt}
{com}. rename totdea_lower_smoothed  TotDeaLoSmA02S02V03
{res}{txt}
{com}. rename totdea_upper_smoothed  TotDeaUpSmA02S02V03
{res}{txt}
{com}. label var TotDeaMeSmA02S02V03 "Total Deaths Mean smoothed IHME S2"
{txt}
{com}. label var TotDeaLoSmA02S02V03 "Total Deaths Lower smoothed IHME S2"
{txt}
{com}. label var TotDeaUpSmA02S02V03 "Total Deaths Upper smoothed IHME S2"
{txt}
{com}. 
. * Daily Deaths smoothed
. rename deaths_mean_smoothed  DayDeaMeSmA02S02V03        
{res}{txt}
{com}. rename deaths_lower_smoothed DayDeaLoSmA02S02V03        
{res}{txt}
{com}. rename deaths_upper_smoothed DayDeaUpSmA02S02V03  
{res}{txt}
{com}. label var DayDeaMeSmA02S02V03 "Daily Deaths Mean smoothed IHME S2"
{txt}
{com}. label var DayDeaLoSmA02S02V03 "Daily Deaths Lower smoothed IHME S2"
{txt}
{com}. label var DayDeaUpSmA02S02V03 "Daily Deaths Upper smoothed IHME S2"
{txt}
{com}. 
. 
. 
. 
. * other outcomes
. 
. 
. rename total_tests TotTesMeSmA02S02V03
{res}{txt}
{com}. 
. label var TotTesMeSmA02S02V03 "Total Tests Mean IHME S2"
{txt}
{com}. 
. 
. 
. rename seroprev_mean            TotSerMeSmA02S02V03
{res}{txt}
{com}. rename seroprev_upper           TotSerLoSmA02S02V03
{res}{txt}
{com}. rename seroprev_lower           TotSerUpSmA02S02V03
{res}{txt}
{com}. 
. label var TotSerMeSmA02S02V03 "Total seroprevalence Mean IHME S2"
{txt}
{com}. label var TotSerLoSmA02S02V03 "Total seroprevalence Lower IHME S2"
{txt}
{com}. label var TotSerUpSmA02S02V03 "Total seroprevalence Upper IHME S2"
{txt}
{com}. 
. 
. save "Best Iran.dta", replace
{txt}(note: file Best Iran.dta not found)
file Best Iran.dta saved

{com}. 
. 
. 
. 
. 
. 
. 
. 
. **********************
. 
. * S3 Worse
. 
. use "Worse_hospitalization_all_locs.dta", clear
{txt}
{com}. 
. keep if strpos(location_name, "Iran")
{txt}(207,861 observations deleted)

{com}. 
. 
. 
. * Total Deaths not smoothed
. rename totdea_mean  TotDeaMeRaA02S03V03
{res}{txt}
{com}. rename totdea_lower TotDeaLoRaA02S03V03
{res}{txt}
{com}. rename totdea_upper TotDeaUpRaA02S03V03
{res}{txt}
{com}. label var TotDeaMeRaA02S03V03 "Total Deaths Mean not smoothed IHME S3"
{txt}
{com}. label var TotDeaLoRaA02S03V03 "Total Deaths Lower not smoothed IHME S3"
{txt}
{com}. label var TotDeaUpRaA02S03V03 "Total Deaths Upper not smoothed IHME S3"
{txt}
{com}. 
. * Daily Deaths not smoothed
. rename deaths_mean  DayDeaMeRaA02S03V03
{res}{txt}
{com}. rename deaths_lower DayDeaLoRaA02S03V03
{res}{txt}
{com}. rename deaths_upper DayDeaUpRaA02S03V03
{res}{txt}
{com}. label var DayDeaMeRaA02S03V03 "Daily Deaths Mean not smoothed IHME S3"
{txt}
{com}. label var DayDeaLoRaA02S03V03 "Daily Deaths Lower not smoothed IHME S3"
{txt}
{com}. label var DayDeaUpRaA02S03V03 "Daily Deaths Upper not smoothed IHME S3"
{txt}
{com}.         
. * Total Cases not smoothed
. rename inf_cuml_mean  TotCasMeRaA02S03V03
{res}{txt}
{com}. rename inf_cuml_lower TotCasLoRaA02S03V03
{res}{txt}
{com}. rename inf_cuml_upper TotCasUpRaA02S03V03
{res}{txt}
{com}. label var TotCasMeRaA02S03V03 "Total Cases Mean not smoothed IHME S3"
{txt}
{com}. label var TotCasLoRaA02S03V03 "Total Cases Lower not smoothed IHME S3"
{txt}
{com}. label var TotCasUpRaA02S03V03 "Total Cases Upper not smoothed IHME S3"
{txt}
{com}. 
. * Daily Cases not smoothed
. rename est_infections_mean  DayCasMeRaA02S03V03
{res}{txt}
{com}. rename est_infections_lower DayCasLoRaA02S03V03
{res}{txt}
{com}. rename est_infections_upper DayCasUpRaA02S03V03
{res}{txt}
{com}. label var DayCasMeRaA02S03V03 "Daily Cases Mean not smoothed IHME S3"
{txt}
{com}. label var DayCasLoRaA02S03V03 "Daily Cases Lower not smoothed IHME S3"
{txt}
{com}. label var DayCasUpRaA02S03V03 "Daily Cases Upper not smoothed IHME S3"
{txt}
{com}. 
. * Total Deaths smoothed
. rename totdea_mean_smoothed   TotDeaMeSmA02S03V03
{res}{txt}
{com}. rename totdea_lower_smoothed  TotDeaLoSmA02S03V03
{res}{txt}
{com}. rename totdea_upper_smoothed  TotDeaUpSmA02S03V03
{res}{txt}
{com}. label var TotDeaMeSmA02S03V03 "Total Deaths Mean smoothed IHME S3"
{txt}
{com}. label var TotDeaLoSmA02S03V03 "Total Deaths Lower smoothed IHME S3"
{txt}
{com}. label var TotDeaUpSmA02S03V03 "Total Deaths Upper smoothed IHME S3"
{txt}
{com}. 
. * Daily Deaths smoothed
. rename deaths_mean_smoothed  DayDeaMeSmA02S03V03        
{res}{txt}
{com}. rename deaths_lower_smoothed DayDeaLoSmA02S03V03        
{res}{txt}
{com}. rename deaths_upper_smoothed DayDeaUpSmA02S03V03  
{res}{txt}
{com}. label var DayDeaMeSmA02S03V03 "Daily Deaths Mean smoothed IHME S3"
{txt}
{com}. label var DayDeaLoSmA02S03V03 "Daily Deaths Lower smoothed IHME S3"
{txt}
{com}. label var DayDeaUpSmA02S03V03 "Daily Deaths Upper smoothed IHME S3"
{txt}
{com}. 
. 
. * other outcomes
. 
. rename total_tests TotTesMeSmA02S03V03
{res}{txt}
{com}. 
. label var TotTesMeSmA02S03V03 "Total Tests Mean IHME S3"
{txt}
{com}. 
. 
. 
. rename seroprev_mean            TotSerMeSmA02S03V03
{res}{txt}
{com}. rename seroprev_upper           TotSerLoSmA02S03V03
{res}{txt}
{com}. rename seroprev_lower           TotSerUpSmA02S03V03
{res}{txt}
{com}. 
. label var TotSerMeSmA02S03V03 "Total seroprevalence Mean IHME S3"
{txt}
{com}. label var TotSerLoSmA02S03V03 "Total seroprevalence Lower IHME S3"
{txt}
{com}. label var TotSerUpSmA02S03V03 "Total seroprevalence Upper IHME S3"
{txt}
{com}. 
. 
. 
. save "Worse Iran.dta", replace
{txt}(note: file Worse Iran.dta not found)
file Worse Iran.dta saved

{com}. 
. 
.  
.  
.  
. **********************
. 
.  
. * merge scenario files
. 
. 
. use "Reference Iran.dta", clear
{txt}
{com}. merge 1:1 location_name date using "Best Iran.dta"
{res}
{txt}{col 5}Result{col 38}# of obs.
{col 5}{hline 41}
{col 5}not matched{col 30}{res}               0
{txt}{col 5}matched{col 30}{res}             545{txt}  (_merge==3)
{col 5}{hline 41}

{com}. drop _merge
{txt}
{com}. merge 1:1 location_name date using "Worse Iran.dta"
{res}
{txt}{col 5}Result{col 38}# of obs.
{col 5}{hline 41}
{col 5}not matched{col 30}{res}               0
{txt}{col 5}matched{col 30}{res}             545{txt}  (_merge==3)
{col 5}{hline 41}

{com}. drop _merge
{txt}
{com}. 
. 
. rename date date_original
{res}{txt}
{com}. gen year = substr(date_original,1,4) 
{txt}
{com}. gen month = substr(date_original,6,2) 
{txt}
{com}. gen day = substr(date_original,9,2) 
{txt}
{com}. egen date2 = concat(day month year)
{txt}
{com}. gen date = date(date2, "DMY", 2050)
{txt}
{com}. format date %tdDDMonCCYY
{txt}
{com}. codebook date

{txt}{hline}
{res}date{right:(unlabeled)}
{txt}{hline}

{col 19}type:  numeric daily date ({res}float{txt})

{col 18}range:  [{res}21949{txt},{res}22493{txt}]{col 55}units:  {res}1
{col 8}{txt}or equivalently:  [{res}04feb2020{txt},{res}01aug2021{txt}]{col 55}units:  {res}days
{col 10}{txt}unique values:  {res}545{col 51}{txt}missing .:  {res}0{txt}/{res}545

{txt}{col 19}mean:{res}{col 26}   22221{txt} = {res}02nov2020{txt}
{col 15}std. dev:{res}{col 26} 157.472

{txt}{col 12}percentiles:{col 32}10%{col 42}25%{col 52}50%{col 62}75%{col 72}90%
{res}{col 27}   22003{col 37}   22085{col 47}   22221{col 57}   22357{col 67}   22439
{col 26}29mar2020{col 36}19jun2020{col 46}02nov2020{col 56}18mar2021{col 66}08jun2021
{txt}
{com}. drop year month day date2
{txt}
{com}. 
. 
. 
. rename location_name loc_grand_name
{res}{txt}
{com}. 
. replace loc_grand_name = "Iran"
{txt}(545 real changes made)

{com}. 
. 
. 
. 
. drop date_original v1 hosp_data_type deaths_data_type ///
> mobility_data_type mobility_composite ///
> confirmed_infections_data_type confirmed_infections est_infections_data_type ///
> total_pop seroprev_data_type
{txt}
{com}. 
. order deaths_mean_p100k_rate-est_infections_upper_p100k_rate, last
{txt}
{com}. 
. 
. sort date
{txt}
{com}. 
. compress
  {txt}variable {bf}location_id{sf} was {bf}{res}long{sf}{txt} now {bf}{res}int{sf}
  {txt}variable {bf}date{sf} was {bf}{res}float{sf}{txt} now {bf}{res}int{sf}
  {txt}variable {bf}loc_grand_name{sf} was {bf}{res}str48{sf}{txt} now {bf}{res}str4{sf}
{txt}  (26,160 bytes saved)

{com}. 
. 
. 
. * gen cfr
. 
. gen DayCfrMeRaA02S01V03 = 100 * DayDeaMeRaA02S01V03 / DayCasMeRaA02S01V03
{txt}
{com}. gen DayCfrLoRaA02S01V03 = 100 * DayDeaLoRaA02S01V03 / DayCasLoRaA02S01V03
{txt}
{com}. gen DayCfrUpRaA02S01V03 = 100 * DayDeaUpRaA02S01V03 / DayCasUpRaA02S01V03
{txt}
{com}. gen DayCfrMeRaA02S02V03 = 100 * DayDeaMeRaA02S02V03 / DayCasMeRaA02S02V03
{txt}(424 missing values generated)

{com}. gen DayCfrLoRaA02S02V03 = 100 * DayDeaLoRaA02S02V03 / DayCasLoRaA02S02V03
{txt}(424 missing values generated)

{com}. gen DayCfrUpRaA02S02V03 = 100 * DayDeaUpRaA02S02V03 / DayCasUpRaA02S02V03
{txt}(424 missing values generated)

{com}. gen DayCfrMeRaA02S03V03 = 100 * DayDeaMeRaA02S03V03 / DayCasMeRaA02S03V03
{txt}(424 missing values generated)

{com}. gen DayCfrLoRaA02S03V03 = 100 * DayDeaLoRaA02S03V03 / DayCasLoRaA02S03V03
{txt}(424 missing values generated)

{com}. gen DayCfrUpRaA02S03V03 = 100 * DayDeaUpRaA02S03V03 / DayCasUpRaA02S03V03
{txt}(424 missing values generated)

{com}. 
. label var DayCfrMeRaA02S01V03 "Daily CFR Mean Raw IHME S1" 
{txt}
{com}. label var DayCfrLoRaA02S01V03 "Daily CFR Lower Raw IHME S1" 
{txt}
{com}. label var DayCfrUpRaA02S01V03 "Daily CFR Upper Raw IHME S1" 
{txt}
{com}. label var DayCfrMeRaA02S02V03 "Daily CFR Mean Raw IHME S2" 
{txt}
{com}. label var DayCfrLoRaA02S02V03 "Daily CFR Lower Raw IHME S2" 
{txt}
{com}. label var DayCfrUpRaA02S02V03 "Daily CFR Upper Raw IHME S2" 
{txt}
{com}. label var DayCfrMeRaA02S03V03 "Daily CFR Mean Raw IHME S3" 
{txt}
{com}. label var DayCfrLoRaA02S03V03 "Daily CFR Lower Raw IHME S3" 
{txt}
{com}. label var DayCfrUpRaA02S03V03 "Daily CFR Upper Raw IHME S3" 
{txt}
{com}. 
. 
. 
. 
. 
. 
. 
. label var deaths_mean_p100k_rate "Daily deaths mean raw per 100k rate IHME"
{txt}
{com}. 
. label var deaths_lower_p100k_rate "Daily deaths lower raw per 100k rate IHME"
{txt}
{com}. 
. label var deaths_upper_p100k_rate "Daily deaths upper raw per 100k rate IHME"
{txt}
{com}. 
. label var totdea_mean_p100k_rate "Total deaths mean per raw 100k rate IHME"
{txt}
{com}. 
. label var totdea_lower_p100k_rate "Total deaths mean per raw 100k rate IHME"
{txt}
{com}. 
. label var totdea_upper_p100k_rate "Total deaths upper per raw 100k rate IHME"
{txt}
{com}. 
. label var deaths_mean_smoothed_p100k_rate "Daily deaths mean smoothed per 100k rate IHME"
{txt}
{com}. 
. label var deaths_lower_smoothed_p100k_rate "Daily deaths lower smoothed per 100k rate IHME"
{txt}
{com}. 
. label var deaths_upper_smoothed_p100k_rate "Daily deaths upper smoothed per 100k rate IHME"
{txt}
{com}. 
. label var totdea_mean_smoothed_p100k_rate "Total deaths mean smoothed per 100k rate IHME"
{txt}
{com}. 
. label var totdea_lower_smoothed_p100k_rate "Total deaths lower smoothed per 100k rate IHME"
{txt}
{com}. 
. label var totdea_upper_smoothed_p100k_rate "Total deaths upper smoothed per 100k rate IHME"
{txt}
{com}. 
. label var confirmed_infections_p100k_rate  "confirmed infections per 100k rate IHME"
{txt}
{com}. 
. label var est_infections_mean_p100k_rate "estimated infections mean per 100k rate IHME"
{txt}
{com}. 
. label var est_infections_lower_p100k_rate "estimated infections lower per 100k rate IHME"
{txt}
{com}. 
. label var est_infections_upper_p100k_rate "estimated infections upper per 100k rate IHME"
{txt}
{com}. 
. 
. 
. 
. *
. 
. 
. 
. * gen "Daily cases mean div by daily deaths mean IHME DayCbD" for visulization of temporal relation of deaths and cases peaks 
. 
. 
.         summ DayDeaMeSmA02S01V03 

{txt}    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayDeaMeSm.. {c |}{res}        545    142.5532     102.432          0   473.8135
{txt}
{com}.         gen DayDeMMeSmA02S01V03 = r(mean)
{txt}
{com}.         label var DayDeMMeSmA02S01V03 "Daily deaths mean IHME DayDeM"
{txt}
{com}. 
.         summ DayCasMeRaA02S01V03 

{txt}    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayCasM~1V03 {c |}{res}        545    31337.18    16963.65   424.0033   79374.28
{txt}
{com}.         gen DayCaMMeRaA02S01V03 = r(mean)
{txt}
{com}.         label var DayCaMMeRaA02S01V03 "Daily cases mean IHME DayCaM"
{txt}
{com}.                            
.         gen DayCbDMeRaA02S01V03 = DayCaMMeRaA02S01V03 / DayDeMMeSmA02S01V03
{txt}
{com}.         label var DayCbDMeRaA02S01V03 "Daily cases mean div by daily deaths mean IHME DayCbD"
{txt}
{com}.         summ DayCbDMeRaA02S01V03

{txt}    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayCbDMeR~03 {c |}{res}        545     219.828           0    219.828    219.828
{txt}
{com}.                                               
.         gen DayDMuMeRaA02S01V03 = DayDeaMeRaA02S01V03 * DayCbDMeRaA02S01V03
{txt}
{com}.     label var DayDMuMeRaA02S01V03 "Daily deaths scaled (times means of cases by deaths) IHME"
{txt}
{com}.         summ DayDMuMeRaA02S01V03

{txt}    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayDMuMeR~03 {c |}{res}        545    31328.82    22725.49          0   106836.4
{txt}
{com}. 
. 
. 
. 
. 
. 
. 
. ***********************
. 
. 
. * graphs
. 
. 
. grstyle init
{res}{txt}
{com}. 
. grstyle color background white
{txt}
{com}. 
. 
. * daily deaths
. 
. 
. * daily deaths, medain scenario = S1       
.            
.            
. twoway (rarea DayDeaLoSmA02S01V03 DayDeaUpSmA02S01V03 date, sort color(black*.2)) ///
> (line DayDeaMeSmA02S01V03 date, sort lcolor(black)) ///
> , xtitle(Date) xlabel(#17, format(%tdYY-NN-DD) labsize(small)) xlabel(, grid) xlabel(, grid) ///
> xlabel(, angle(forty_five)) ylabel(, format(%9.0fc) labsize(small))  ylabel(, labsize(small) angle(horizontal)) ///
> ytitle(Daily deaths) title("COVID-19 daily deaths, Iran, IHME, reference scenario", size(medium)) ///
> xscale(lwidth(vthin) lcolor(gray*.2)) yscale(lwidth(vthin) lcolor(gray*.2)) legend(off) 
{res}{txt}
{com}.            
. graph save "graph 1 COVID-19 daily deaths, reference scenario, Iran, IHME.gph", replace
{txt}(note: file graph 1 COVID-19 daily deaths, reference scenario, Iran, IHME.gph not found)
{res}{txt}(file graph 1 COVID-19 daily deaths, reference scenario, Iran, IHME.gph saved)

{com}. graph export "graph 1 COVID-19 daily deaths, reference scenario, Iran, IHME.pdf", replace
{txt}(file /Users/farshadpourmalek/Downloads/covir2-main/20210413/code/IHME/graph 1 COVID-19 daily deaths, reference scenario, Iran, IHME.pdf written in PDF format)

{com}. 
. 
. 
. * daily deaths, 3 scenarios  
.   
.   
. twoway ///
> (line DayDeaMeSmA02S01V03 date, sort lcolor(black) lwidth(vthick) lpattern(tight_dot)) ///
> (line DayDeaMeSmA02S02V03 date, sort lcolor(green)) ///
> (line DayDeaMeSmA02S03V03 date, sort lcolor(red)) ///
> , xtitle(Date) xlabel(#17, format(%tdYY-NN-DD) labsize(small)) xlabel(, grid) xlabel(, grid) ///
> xlabel(, angle(forty_five)) ylabel(, format(%9.0fc) labsize(small))  ylabel(, labsize(small) angle(horizontal)) ///
> ytitle(Daily deaths) title("COVID-19 daily deaths, Iran, IHME, 3 scenarios", size(medium)) ///
> xscale(lwidth(vthin) lcolor(gray*.2)) yscale(lwidth(vthin) lcolor(gray*.2)) legend(region(lcolor(none))) legend(bexpand) ///
> legend(order(1 "S1" 2 "S2" 3 "S3") rows(1))
{res}{txt}
{com}. 
. 
. graph save "graph 2 COVID-19 daily deaths, Iran 3 scenarios, IHME.gph", replace
{txt}(note: file graph 2 COVID-19 daily deaths, Iran 3 scenarios, IHME.gph not found)
{res}{txt}(file graph 2 COVID-19 daily deaths, Iran 3 scenarios, IHME.gph saved)

{com}. graph export "graph 2 COVID-19 daily deaths, Iran 3 scenarios, IHME.pdf", replace
{txt}(file /Users/farshadpourmalek/Downloads/covir2-main/20210413/code/IHME/graph 2 COVID-19 daily deaths, Iran 3 scenarios, IHME.pdf written in PDF format)

{com}. 
. 
. 
. * daily deaths, medain scenario = S1, CI
.   
.   
. twoway ///
> (line DayDeaMeSmA02S01V03 date, sort lcolor(black)) ///
> (line DayDeaLoSmA02S01V03 date, sort lcolor(green)) ///
> (line DayDeaUpSmA02S01V03 date, sort lcolor(red)) ///
> , xtitle(Date) xlabel(#17, format(%tdYY-NN-DD) labsize(small)) xlabel(, grid) xlabel(, grid) ///
> xlabel(, angle(forty_five)) ylabel(, format(%9.0fc) labsize(small))  ylabel(, labsize(small) angle(horizontal)) ///
> ytitle(Daily deaths) title("COVID-19 daily deaths, Iran, IHME, median scenario", size(medium)) ///
> xscale(lwidth(vthin) lcolor(gray*.2)) yscale(lwidth(vthin) lcolor(gray*.2)) legend(region(lcolor(none))) legend(bexpand) ///
> legend(order(1 "Mean" 2 "Lower" 3 "Upper") rows(1))
{res}{txt}
{com}. 
. graph save "graph 3 COVID-19 daily deaths, Iran median scenario CI, IHME.gph", replace
{txt}(note: file graph 3 COVID-19 daily deaths, Iran median scenario CI, IHME.gph not found)
{res}{txt}(file graph 3 COVID-19 daily deaths, Iran median scenario CI, IHME.gph saved)

{com}. graph export "graph 3 COVID-19 daily deaths, Iran median scenario CI, IHME.pdf", replace
{txt}(file /Users/farshadpourmalek/Downloads/covir2-main/20210413/code/IHME/graph 3 COVID-19 daily deaths, Iran median scenario CI, IHME.pdf written in PDF format)

{com}. 
. 
. 
. 
. * daily deaths, best scenario = S2, CI
.   
.   
. twoway ///
> (line DayDeaMeSmA02S02V03 date, sort lcolor(black)) ///
> (line DayDeaLoSmA02S02V03 date, sort lcolor(green)) ///
> (line DayDeaUpSmA02S02V03 date, sort lcolor(red)) ///
> , xtitle(Date) xlabel(#17, format(%tdYY-NN-DD) labsize(small)) xlabel(, grid) xlabel(, grid) ///
> xlabel(, angle(forty_five)) ylabel(, format(%9.0fc) labsize(small))  ylabel(, labsize(small) angle(horizontal)) ///
> ytitle(Daily deaths) title("COVID-19 daily deaths, Iran, IHME, best scenario", size(medium)) ///
> xscale(lwidth(vthin) lcolor(gray*.2)) yscale(lwidth(vthin) lcolor(gray*.2)) legend(region(lcolor(none))) legend(bexpand) ///
> legend(order(1 "Mean" 2 "Lower" 3 "Upper") rows(1))
{res}{txt}
{com}. 
. graph save "graph 4 COVID-19 daily deaths, Iran best scenario CI, IHME.gph", replace
{txt}(note: file graph 4 COVID-19 daily deaths, Iran best scenario CI, IHME.gph not found)
{res}{txt}(file graph 4 COVID-19 daily deaths, Iran best scenario CI, IHME.gph saved)

{com}. graph export "graph 4 COVID-19 daily deaths, Iran best scenario CI, IHME.pdf", replace
{txt}(file /Users/farshadpourmalek/Downloads/covir2-main/20210413/code/IHME/graph 4 COVID-19 daily deaths, Iran best scenario CI, IHME.pdf written in PDF format)

{com}. 
. 
. 
. * daily deaths, worst scenario = S3, CI
.   
.   
. twoway ///
> (line DayDeaMeSmA02S03V03 date, sort lcolor(black)) ///
> (line DayDeaLoSmA02S03V03 date, sort lcolor(green)) ///
> (line DayDeaUpSmA02S03V03 date, sort lcolor(red)) ///
> , xtitle(Date) xlabel(#17, format(%tdYY-NN-DD) labsize(small)) xlabel(, grid) xlabel(, grid) ///
> xlabel(, angle(forty_five)) ylabel(, format(%9.0fc) labsize(small))  ylabel(, labsize(small) angle(horizontal)) ///
> ytitle(Daily deaths) title("COVID-19 daily deaths, Iran, IHME, worst scenario", size(medium)) ///
> xscale(lwidth(vthin) lcolor(gray*.2)) yscale(lwidth(vthin) lcolor(gray*.2)) legend(region(lcolor(none))) legend(bexpand) ///
> legend(order(1 "Mean" 2 "Lower" 3 "Upper") rows(1))
{res}{txt}
{com}. 
. graph save "graph 5 COVID-19 daily deaths, Iran worst scenario CI, IHME.gph", replace
{txt}(note: file graph 5 COVID-19 daily deaths, Iran worst scenario CI, IHME.gph not found)
{res}{txt}(file graph 5 COVID-19 daily deaths, Iran worst scenario CI, IHME.gph saved)

{com}. graph export "graph 5 COVID-19 daily deaths, Iran worst scenario CI, IHME.pdf", replace
{txt}(file /Users/farshadpourmalek/Downloads/covir2-main/20210413/code/IHME/graph 5 COVID-19 daily deaths, Iran worst scenario CI, IHME.pdf written in PDF format)

{com}. 
. 
. * daily cases
. 
. 
. * daily cases, medain scenario = S1        
.            
.            
. twoway (rarea DayCasLoRaA02S01V03 DayCasUpRaA02S01V03 date, sort color(black*.2)) ///
> (line DayCasMeRaA02S01V03 date, sort lcolor(black)) ///
> , xtitle(Date) xlabel(#17, format(%tdYY-NN-DD) labsize(small)) xlabel(, grid) xlabel(, grid) ///
> xlabel(, angle(forty_five)) ylabel(, format(%9.0fc) labsize(small))  ylabel(, labsize(small) angle(horizontal)) ///
> ytitle(Daily cases) title("COVID-19 daily cases, Iran, IHME, reference scenario", size(medium)) ///
> xscale(lwidth(vthin) lcolor(gray*.2)) yscale(lwidth(vthin) lcolor(gray*.2)) legend(off) 
{res}{txt}
{com}.            
. graph save "graph 6 COVID-19 daily cases, reference scenario, Iran, IHME.gph", replace
{txt}(note: file graph 6 COVID-19 daily cases, reference scenario, Iran, IHME.gph not found)
{res}{txt}(file graph 6 COVID-19 daily cases, reference scenario, Iran, IHME.gph saved)

{com}. graph export "graph 6 COVID-19 daily cases, reference scenario, Iran, IHME.pdf", replace
{txt}(file /Users/farshadpourmalek/Downloads/covir2-main/20210413/code/IHME/graph 6 COVID-19 daily cases, reference scenario, Iran, IHME.pdf written in PDF format)

{com}. 
. 
. 
. 
. * daily cases, 3 scenarios  
.   
.   
. twoway ///
> (line DayCasMeRaA02S01V03 date, sort lcolor(black) lwidth(vthick) lpattern(tight_dot)) ///
> (line DayCasMeRaA02S02V03 date, sort lcolor(green)) ///
> (line DayCasMeRaA02S03V03 date, sort lcolor(red)) ///
> , xtitle(Date) xlabel(#17, format(%tdYY-NN-DD) labsize(small)) xlabel(, grid) xlabel(, grid) ///
> xlabel(, angle(forty_five)) ylabel(, format(%9.0fc) labsize(small))  ylabel(, labsize(small) angle(horizontal)) ///
> ytitle(Daily cases) title("COVID-19 daily cases, Iran, IHME, 3 scenarios", size(medium)) ///
> xscale(lwidth(vthin) lcolor(gray*.2)) yscale(lwidth(vthin) lcolor(gray*.2)) legend(region(lcolor(none))) legend(bexpand) ///
> legend(order(1 "S1" 2 "S2" 3 "S3") rows(1))
{res}{txt}
{com}. 
. 
. graph save "graph 7 COVID-19 daily cases, Iran 3 scenarios, IHME.gph", replace
{txt}(note: file graph 7 COVID-19 daily cases, Iran 3 scenarios, IHME.gph not found)
{res}{txt}(file graph 7 COVID-19 daily cases, Iran 3 scenarios, IHME.gph saved)

{com}. graph export "graph 7 COVID-19 daily cases, Iran 3 scenarios, IHME.pdf", replace
{txt}(file /Users/farshadpourmalek/Downloads/covir2-main/20210413/code/IHME/graph 7 COVID-19 daily cases, Iran 3 scenarios, IHME.pdf written in PDF format)

{com}. 
. 
. 
. * daily cases, medain scenario = S1, CI
.   
.   
. twoway ///
> (line DayCasMeRaA02S01V03 date, sort lcolor(black)) ///
> (line DayCasLoRaA02S01V03 date, sort lcolor(green)) ///
> (line DayCasUpRaA02S01V03 date, sort lcolor(red)) ///
> , xtitle(Date) xlabel(#17, format(%tdYY-NN-DD) labsize(small)) xlabel(, grid) xlabel(, grid) ///
> xlabel(, angle(forty_five)) ylabel(, format(%9.0fc) labsize(small))  ylabel(, labsize(small) angle(horizontal)) ///
> ytitle(Daily cases) title("COVID-19 daily cases, Iran, IHME, median scenario", size(medium)) ///
> xscale(lwidth(vthin) lcolor(gray*.2)) yscale(lwidth(vthin) lcolor(gray*.2)) legend(region(lcolor(none))) legend(bexpand) ///
> legend(order(1 "Mean" 2 "Lower" 3 "Upper") rows(1))
{res}{txt}
{com}. 
. graph save "graph 8 COVID-19 daily cases, Iran median scenario CI, IHME.gph", replace
{txt}(note: file graph 8 COVID-19 daily cases, Iran median scenario CI, IHME.gph not found)
{res}{txt}(file graph 8 COVID-19 daily cases, Iran median scenario CI, IHME.gph saved)

{com}. graph export "graph 8 COVID-19 daily cases, Iran median scenario CI, IHME.pdf", replace
{txt}(file /Users/farshadpourmalek/Downloads/covir2-main/20210413/code/IHME/graph 8 COVID-19 daily cases, Iran median scenario CI, IHME.pdf written in PDF format)

{com}. 
. 
. 
. 
. * daily cases, best scenario = S2, CI
.   
.   
. twoway ///
> (line DayCasMeRaA02S02V03 date, sort lcolor(black)) ///
> (line DayCasLoRaA02S02V03 date, sort lcolor(green)) ///
> (line DayCasUpRaA02S02V03 date, sort lcolor(red)) ///
> , xtitle(Date) xlabel(#17, format(%tdYY-NN-DD) labsize(small)) xlabel(, grid) xlabel(, grid) ///
> xlabel(, angle(forty_five)) ylabel(, format(%9.0fc) labsize(small))  ylabel(, labsize(small) angle(horizontal)) ///
> ytitle(Daily cases) title("COVID-19 daily cases, Iran, IHME, best scenario", size(medium)) ///
> xscale(lwidth(vthin) lcolor(gray*.2)) yscale(lwidth(vthin) lcolor(gray*.2)) legend(region(lcolor(none))) legend(bexpand) ///
> legend(order(1 "Mean" 2 "Lower" 3 "Upper") rows(1))
{res}{txt}
{com}. 
. graph save "graph 9 COVID-19 daily cases, Iran best scenario CI, IHME.gph", replace
{txt}(note: file graph 9 COVID-19 daily cases, Iran best scenario CI, IHME.gph not found)
{res}{txt}(file graph 9 COVID-19 daily cases, Iran best scenario CI, IHME.gph saved)

{com}. graph export "graph 9 COVID-19 daily cases, Iran best scenario CI, IHME.pdf", replace
{txt}(file /Users/farshadpourmalek/Downloads/covir2-main/20210413/code/IHME/graph 9 COVID-19 daily cases, Iran best scenario CI, IHME.pdf written in PDF format)

{com}. 
. 
. 
. * daily cases, worst scenario = S3, CI
.   
.   
. twoway ///
> (line DayCasMeRaA02S03V03 date, sort lcolor(black)) ///
> (line DayCasLoRaA02S03V03 date, sort lcolor(green)) ///
> (line DayCasUpRaA02S03V03 date, sort lcolor(red)) ///
> , xtitle(Date) xlabel(#17, format(%tdYY-NN-DD) labsize(small)) xlabel(, grid) xlabel(, grid) ///
> xlabel(, angle(forty_five)) ylabel(, format(%9.0fc) labsize(small))  ylabel(, labsize(small) angle(horizontal)) ///
> ytitle(Daily cases) title("COVID-19 daily cases, Iran, IHME, worst scenario", size(medium)) ///
> xscale(lwidth(vthin) lcolor(gray*.2)) yscale(lwidth(vthin) lcolor(gray*.2)) legend(region(lcolor(none))) legend(bexpand) ///
> legend(order(1 "Mean" 2 "Lower" 3 "Upper") rows(1))
{res}{txt}
{com}. 
. graph save "graph 10 COVID-19 daily cases, Iran worst scenario CI, IHME.gph", replace
{txt}(note: file graph 10 COVID-19 daily cases, Iran worst scenario CI, IHME.gph not found)
{res}{txt}(file graph 10 COVID-19 daily cases, Iran worst scenario CI, IHME.gph saved)

{com}. graph export "graph 10 COVID-19 daily cases, Iran worst scenario CI, IHME.pdf", replace
{txt}(file /Users/farshadpourmalek/Downloads/covir2-main/20210413/code/IHME/graph 10 COVID-19 daily cases, Iran worst scenario CI, IHME.pdf written in PDF format)

{com}. 
. 
. 
. * total deaths
. 
. 
. * total deaths, medain scenario = S1       
.            
.            
. twoway (rarea TotDeaLoSmA02S01V03 TotDeaUpSmA02S01V03 date, sort color(black*.2)) ///
> (line TotDeaMeSmA02S01V03 date, sort lcolor(black)) ///
> , xtitle(Date) xlabel(#17, format(%tdYY-NN-DD) labsize(small)) xlabel(, grid) xlabel(, grid) ///
> xlabel(, angle(forty_five)) ylabel(, format(%9.0fc) labsize(small))  ylabel(, labsize(small) angle(horizontal)) ///
> ytitle(Total deaths) title("COVID-19 total deaths, Iran, IHME, reference scenario", size(medium)) ///
> xscale(lwidth(vthin) lcolor(gray*.2)) yscale(lwidth(vthin) lcolor(gray*.2)) legend(off) 
{res}{txt}
{com}.            
. graph save "graph 11 COVID-19 total deaths, reference scenario, Iran, IHME.gph", replace
{txt}(note: file graph 11 COVID-19 total deaths, reference scenario, Iran, IHME.gph not found)
{res}{txt}(file graph 11 COVID-19 total deaths, reference scenario, Iran, IHME.gph saved)

{com}. graph export "graph 11 COVID-19 total deaths, reference scenario, Iran, IHME.pdf", replace
{txt}(file /Users/farshadpourmalek/Downloads/covir2-main/20210413/code/IHME/graph 11 COVID-19 total deaths, reference scenario, Iran, IHME.pdf written in PDF format)

{com}. 
. 
. 
. * total deaths, 3 scenarios  
.   
.   
. twoway ///
> (line TotDeaMeSmA02S01V03 date, sort lcolor(black) lwidth(vthick) lpattern(tight_dot)) ///
> (line TotDeaMeSmA02S02V03 date, sort lcolor(green)) ///
> (line TotDeaMeSmA02S03V03 date, sort lcolor(red)) ///
> , xtitle(Date) xlabel(#17, format(%tdYY-NN-DD) labsize(small)) xlabel(, grid) xlabel(, grid) ///
> xlabel(, angle(forty_five)) ylabel(, format(%9.0fc) labsize(small))  ylabel(, labsize(small) angle(horizontal)) ///
> ytitle(Total deaths) title("COVID-19 total deaths, Iran, IHME, 3 scenarios", size(medium)) ///
> xscale(lwidth(vthin) lcolor(gray*.2)) yscale(lwidth(vthin) lcolor(gray*.2)) legend(region(lcolor(none))) legend(bexpand) ///
> legend(order(1 "S1" 2 "S2" 3 "S3") rows(1))
{res}{txt}
{com}. 
. 
. graph save "graph 12 COVID-19 total deaths, Iran 3 scenarios, IHME.gph", replace
{txt}(note: file graph 12 COVID-19 total deaths, Iran 3 scenarios, IHME.gph not found)
{res}{txt}(file graph 12 COVID-19 total deaths, Iran 3 scenarios, IHME.gph saved)

{com}. graph export "graph 12 COVID-19 total deaths, Iran 3 scenarios, IHME.pdf", replace
{txt}(file /Users/farshadpourmalek/Downloads/covir2-main/20210413/code/IHME/graph 12 COVID-19 total deaths, Iran 3 scenarios, IHME.pdf written in PDF format)

{com}. 
. 
. 
. * total deaths, medain scenario = S1, CI
.   
.   
. twoway ///
> (line TotDeaMeSmA02S01V03 date, sort lcolor(black)) ///
> (line TotDeaLoSmA02S01V03 date, sort lcolor(green)) ///
> (line TotDeaUpSmA02S01V03 date, sort lcolor(red)) ///
> , xtitle(Date) xlabel(#17, format(%tdYY-NN-DD) labsize(small)) xlabel(, grid) xlabel(, grid) ///
> xlabel(, angle(forty_five)) ylabel(, format(%9.0fc) labsize(small))  ylabel(, labsize(small) angle(horizontal)) ///
> ytitle(Total deaths) title("COVID-19 total deaths, Iran, IHME, median scenario", size(medium)) ///
> xscale(lwidth(vthin) lcolor(gray*.2)) yscale(lwidth(vthin) lcolor(gray*.2)) legend(region(lcolor(none))) legend(bexpand) ///
> legend(order(1 "Mean" 2 "Lower" 3 "Upper") rows(1))
{res}{txt}
{com}. 
. graph save "graph 13 COVID-19 total deaths, Iran median scenario CI, IHME.gph", replace
{txt}(note: file graph 13 COVID-19 total deaths, Iran median scenario CI, IHME.gph not found)
{res}{txt}(file graph 13 COVID-19 total deaths, Iran median scenario CI, IHME.gph saved)

{com}. graph export "graph 13 COVID-19 total deaths, Iran median scenario CI, IHME.pdf", replace
{txt}(file /Users/farshadpourmalek/Downloads/covir2-main/20210413/code/IHME/graph 13 COVID-19 total deaths, Iran median scenario CI, IHME.pdf written in PDF format)

{com}. 
. 
. 
. 
. * total deaths, best scenario = S2, CI
.   
.   
. twoway ///
> (line TotDeaMeSmA02S02V03 date, sort lcolor(black)) ///
> (line TotDeaLoSmA02S02V03 date, sort lcolor(green)) ///
> (line TotDeaUpSmA02S02V03 date, sort lcolor(red)) ///
> , xtitle(Date) xlabel(#17, format(%tdYY-NN-DD) labsize(small)) xlabel(, grid) xlabel(, grid) ///
> xlabel(, angle(forty_five)) ylabel(, format(%9.0fc) labsize(small))  ylabel(, labsize(small) angle(horizontal)) ///
> ytitle(Total deaths) title("COVID-19 total deaths, Iran, IHME, best scenario", size(medium)) ///
> xscale(lwidth(vthin) lcolor(gray*.2)) yscale(lwidth(vthin) lcolor(gray*.2)) legend(region(lcolor(none))) legend(bexpand) ///
> legend(order(1 "Mean" 2 "Lower" 3 "Upper") rows(1))
{res}{txt}
{com}. 
. graph save "graph 14 COVID-19 total deaths, Iran best scenario CI, IHME.gph", replace
{txt}(note: file graph 14 COVID-19 total deaths, Iran best scenario CI, IHME.gph not found)
{res}{txt}(file graph 14 COVID-19 total deaths, Iran best scenario CI, IHME.gph saved)

{com}. graph export "graph 14 COVID-19 total deaths, Iran best scenario CI, IHME.pdf", replace
{txt}(file /Users/farshadpourmalek/Downloads/covir2-main/20210413/code/IHME/graph 14 COVID-19 total deaths, Iran best scenario CI, IHME.pdf written in PDF format)

{com}. 
. 
. 
. * total deaths, worst scenario = S3, CI
.   
.   
. twoway ///
> (line TotDeaMeSmA02S03V03 date, sort lcolor(black)) ///
> (line TotDeaLoSmA02S03V03 date, sort lcolor(green)) ///
> (line TotDeaUpSmA02S03V03 date, sort lcolor(red)) ///
> , xtitle(Date) xlabel(#17, format(%tdYY-NN-DD) labsize(small)) xlabel(, grid) xlabel(, grid) ///
> xlabel(, angle(forty_five)) ylabel(, format(%9.0fc) labsize(small))  ylabel(, labsize(small) angle(horizontal)) ///
> ytitle(Total deaths) title("COVID-19 total deaths, Iran, IHME, worst scenario", size(medium)) ///
> xscale(lwidth(vthin) lcolor(gray*.2)) yscale(lwidth(vthin) lcolor(gray*.2)) legend(region(lcolor(none))) legend(bexpand) ///
> legend(order(1 "Mean" 2 "Lower" 3 "Upper") rows(1))
{res}{txt}
{com}. 
. graph save "graph 15 COVID-19 total deaths, Iran worst scenario CI, IHME.gph", replace
{txt}(note: file graph 15 COVID-19 total deaths, Iran worst scenario CI, IHME.gph not found)
{res}{txt}(file graph 15 COVID-19 total deaths, Iran worst scenario CI, IHME.gph saved)

{com}. graph export "graph 15 COVID-19 total deaths, Iran worst scenario CI, IHME.pdf", replace
{txt}(file /Users/farshadpourmalek/Downloads/covir2-main/20210413/code/IHME/graph 15 COVID-19 total deaths, Iran worst scenario CI, IHME.pdf written in PDF format)

{com}. 
. 
. 
. * total cases
. 
. 
. * total cases, medain scenario = S1        
.            
.            
. twoway (rarea TotCasLoRaA02S01V03 TotCasUpRaA02S01V03 date, sort color(black*.2)) ///
> (line TotCasMeRaA02S01V03 date, sort lcolor(black)) ///
> , xtitle(Date) xlabel(#17, format(%tdYY-NN-DD) labsize(small)) xlabel(, grid) xlabel(, grid) ///
> xlabel(, angle(forty_five)) ylabel(, format(%12.0fc) labsize(small))  ylabel(, labsize(small) angle(horizontal)) ///
> ytitle(Total cases) title("COVID-19 total cases, Iran, IHME, reference scenario", size(medium)) ///
> xscale(lwidth(vthin) lcolor(gray*.2)) yscale(lwidth(vthin) lcolor(gray*.2)) legend(off) 
{res}{txt}
{com}.            
. graph save "graph 16 COVID-19 total cases, reference scenario, Iran, IHME.gph", replace
{txt}(note: file graph 16 COVID-19 total cases, reference scenario, Iran, IHME.gph not found)
{res}{txt}(file graph 16 COVID-19 total cases, reference scenario, Iran, IHME.gph saved)

{com}. graph export "graph 16 COVID-19 total cases, reference scenario, Iran, IHME.pdf", replace
{txt}(file /Users/farshadpourmalek/Downloads/covir2-main/20210413/code/IHME/graph 16 COVID-19 total cases, reference scenario, Iran, IHME.pdf written in PDF format)

{com}. 
. 
. 
. 
. * total cases, 3 scenarios  
.   
.   
. twoway ///
> (line TotCasMeRaA02S01V03 date, sort lcolor(black) lwidth(vthick) lpattern(tight_dot)) ///
> (line TotCasMeRaA02S02V03 date, sort lcolor(green)) ///
> (line TotCasMeRaA02S03V03 date, sort lcolor(red)) ///
> , xtitle(Date) xlabel(#17, format(%tdYY-NN-DD) labsize(small)) xlabel(, grid) xlabel(, grid) ///
> xlabel(, angle(forty_five)) ylabel(, format(%12.0fc) labsize(small))  ylabel(, labsize(small) angle(horizontal)) ///
> ytitle(Total cases) title("COVID-19 total cases, Iran, IHME, 3 scenarios", size(medium)) ///
> xscale(lwidth(vthin) lcolor(gray*.2)) yscale(lwidth(vthin) lcolor(gray*.2)) legend(region(lcolor(none))) legend(bexpand) ///
> legend(order(1 "S1" 2 "S2" 3 "S3") rows(1))
{res}{txt}
{com}. 
. 
. graph save "graph 17 COVID-19 total cases, Iran 3 scenarios, IHME.gph", replace
{txt}(note: file graph 17 COVID-19 total cases, Iran 3 scenarios, IHME.gph not found)
{res}{txt}(file graph 17 COVID-19 total cases, Iran 3 scenarios, IHME.gph saved)

{com}. graph export "graph 17 COVID-19 total cases, Iran 3 scenarios, IHME.pdf", replace
{txt}(file /Users/farshadpourmalek/Downloads/covir2-main/20210413/code/IHME/graph 17 COVID-19 total cases, Iran 3 scenarios, IHME.pdf written in PDF format)

{com}. 
. 
. 
. * total cases, medain scenario = S1, CI
.   
.   
. twoway ///
> (line TotCasMeRaA02S01V03 date, sort lcolor(black)) ///
> (line TotCasLoRaA02S01V03 date, sort lcolor(green)) ///
> (line TotCasUpRaA02S01V03 date, sort lcolor(red)) ///
> , xtitle(Date) xlabel(#17, format(%tdYY-NN-DD) labsize(small)) xlabel(, grid) xlabel(, grid) ///
> xlabel(, angle(forty_five)) ylabel(, format(%12.0fc) labsize(small))  ylabel(, labsize(small) angle(horizontal)) ///
> ytitle(Total cases) title("COVID-19 total cases, Iran, IHME, median scenario", size(medium)) ///
> xscale(lwidth(vthin) lcolor(gray*.2)) yscale(lwidth(vthin) lcolor(gray*.2)) legend(region(lcolor(none))) legend(bexpand) ///
> legend(order(1 "Mean" 2 "Lower" 3 "Upper") rows(1))
{res}{txt}
{com}. 
. graph save "graph 18 COVID-19 total cases, Iran median scenario CI, IHME.gph", replace
{txt}(note: file graph 18 COVID-19 total cases, Iran median scenario CI, IHME.gph not found)
{res}{txt}(file graph 18 COVID-19 total cases, Iran median scenario CI, IHME.gph saved)

{com}. graph export "graph 18 COVID-19 total cases, Iran median scenario CI, IHME.pdf", replace
{txt}(file /Users/farshadpourmalek/Downloads/covir2-main/20210413/code/IHME/graph 18 COVID-19 total cases, Iran median scenario CI, IHME.pdf written in PDF format)

{com}. 
. 
. 
. 
. * total cases, best scenario = S2, CI, not available
.  
. 
. * total cases, worst scenario = S3, CI, not available
.   
.   
. 
. 
. 
. * cfr
. 
. 
. 
. 
. * daily cfr, 3 scenarios  
.   
.   
. twoway ///
> (line DayCfrMeRaA02S01V03 date, sort lcolor(black) lwidth(vthick) lpattern(tight_dot)) ///
> (line DayCfrMeRaA02S02V03 date, sort lcolor(green)) ///
> (line DayCfrMeRaA02S03V03 date, sort lcolor(red)) ///
> , xtitle(Date) xlabel(#17, format(%tdYY-NN-DD) labsize(small)) xlabel(, grid) xlabel(, grid) ///
> xlabel(, angle(forty_five)) ylabel(, format(%9.2fc) labsize(small))  ylabel(, labsize(small) angle(horizontal)) ///
> ytitle(Daily CFR) title("COVID-19 daily CFR, Iran, IHME, 3 scenarios", size(medium)) ///
> xscale(lwidth(vthin) lcolor(gray*.2)) yscale(lwidth(vthin) lcolor(gray*.2)) legend(region(lcolor(none))) legend(bexpand) ///
> legend(order(1 "S1" 2 "S2" 3 "S3") rows(1))
{res}{txt}
{com}. 
. 
. graph save "graph 21 COVID-19 daily CFR, Iran 3 scenarios, IHME.gph", replace
{txt}(note: file graph 21 COVID-19 daily CFR, Iran 3 scenarios, IHME.gph not found)
{res}{txt}(file graph 21 COVID-19 daily CFR, Iran 3 scenarios, IHME.gph saved)

{com}. graph export "graph 21 COVID-19 daily CFR, Iran 3 scenarios, IHME.pdf", replace
{txt}(file /Users/farshadpourmalek/Downloads/covir2-main/20210413/code/IHME/graph 21 COVID-19 daily CFR, Iran 3 scenarios, IHME.pdf written in PDF format)

{com}. 
. 
. 
. 
. 
. * other outcomes 
. 
. 
. * daily beds needed, only in S1
. 
. 
. twoway (rarea DayBedLoSmA02S01V03 DayBedUpSmA02S01V03 date, sort color(black*.2)) ///
> (line DayBedMeSmA02S01V03 date, sort lcolor(black)) ///
> , xtitle(Date) xlabel(#17, format(%tdYY-NN-DD) labsize(small)) xlabel(, grid) xlabel(, grid) ///
> xlabel(, angle(forty_five)) ylabel(, format(%9.0fc) labsize(small))  ylabel(, labsize(small) angle(horizontal)) ///
> ytitle(Daily beds needed) title("COVID-19 daily beds needed, Iran, IHME, reference scenario", size(medium)) ///
> xscale(lwidth(vthin) lcolor(gray*.2)) yscale(lwidth(vthin) lcolor(gray*.2)) legend(off) 
{res}{txt}
{com}.            
. 
. graph save "graph 22 COVID-19 daily beds needed, Iran 3 scenarios, IHME.gph", replace
{txt}(note: file graph 22 COVID-19 daily beds needed, Iran 3 scenarios, IHME.gph not found)
{res}{txt}(file graph 22 COVID-19 daily beds needed, Iran 3 scenarios, IHME.gph saved)

{com}. graph export "graph 22 COVID-19 daily beds needed, Iran 3 scenarios, IHME.pdf", replace
{txt}(file /Users/farshadpourmalek/Downloads/covir2-main/20210413/code/IHME/graph 22 COVID-19 daily beds needed, Iran 3 scenarios, IHME.pdf written in PDF format)

{com}. 
. 
. 
. 
. * ICU beds needed, only in S1
. 
. 
. twoway (rarea DayIcuLoSmA02S01V03 DayIcuUpSmA02S01V03 date, sort color(black*.2)) ///
> (line DayIcuMeSmA02S01V03 date, sort lcolor(black)) ///
> , xtitle(Date) xlabel(#17, format(%tdYY-NN-DD) labsize(small)) xlabel(, grid) xlabel(, grid) ///
> xlabel(, angle(forty_five)) ylabel(, format(%9.0fc) labsize(small))  ylabel(, labsize(small) angle(horizontal)) ///
> ytitle(ICU beds needed) title("COVID-19 daily ICU beds needed, Iran, IHME, reference scenario", size(medium)) ///
> xscale(lwidth(vthin) lcolor(gray*.2)) yscale(lwidth(vthin) lcolor(gray*.2)) legend(off) 
{res}{txt}
{com}.            
. 
. 
. graph save "graph 23 COVID-19 daily ICU beds needed, Iran 3 scenarios, IHME.gph", replace
{txt}(note: file graph 23 COVID-19 daily ICU beds needed, Iran 3 scenarios, IHME.gph not found)
{res}{txt}(file graph 23 COVID-19 daily ICU beds needed, Iran 3 scenarios, IHME.gph saved)

{com}. graph export "graph 23 COVID-19 daily ICU beds needed, Iran 3 scenarios, IHME.pdf", replace
{txt}(file /Users/farshadpourmalek/Downloads/covir2-main/20210413/code/IHME/graph 23 COVID-19 daily ICU beds needed, Iran 3 scenarios, IHME.pdf written in PDF format)

{com}. 
. 
. 
. 
. 
. * daily invasive ventilation needed, only in S1
. 
. 
. twoway (rarea DayVenLoSmA02S01V03 DayVenUpSmA02S01V03 date, sort color(black*.2)) ///
> (line DayVenMeSmA02S01V03 date, sort lcolor(black)) ///
> , xtitle(Date) xlabel(#17, format(%tdYY-NN-DD) labsize(small)) xlabel(, grid) xlabel(, grid) ///
> xlabel(, angle(forty_five)) ylabel(, format(%9.0fc) labsize(small))  ylabel(, labsize(small) angle(horizontal)) ///
> ytitle(Daily invasive ventilation needed) title("COVID-19 daily invasive ventilation Iran, IHME, reference scenario", size(medium)) ///
> xscale(lwidth(vthin) lcolor(gray*.2)) yscale(lwidth(vthin) lcolor(gray*.2)) legend(off) 
{res}{txt}
{com}.            
. 
. 
. graph save "graph 24 COVID-19 daily invasive ventilation needed, Iran 3 scenarios, IHME.gph", replace
{txt}(note: file graph 24 COVID-19 daily invasive ventilation needed, Iran 3 scenarios, IHME.gph not found)
{res}{txt}(file graph 24 COVID-19 daily invasive ventilation needed, Iran 3 scenarios, IHME.gph saved)

{com}. graph export "graph 24 COVID-19 daily invasive ventilation needed, Iran 3 scenarios, IHME.pdf", replace
{txt}(file /Users/farshadpourmalek/Downloads/covir2-main/20210413/code/IHME/graph 24 COVID-19 daily invasive ventilation needed, Iran 3 scenarios, IHME.pdf written in PDF format)

{com}. 
. 
. 
. 
. * daily hospital admissions, only in S1
. 
. 
. twoway (rarea DayAdmLoSmA02S01V03 DayAdmUpSmA02S01V03 date, sort color(black*.2)) ///
> (line DayAdmMeSmA02S01V03 date, sort lcolor(black)) ///
> , xtitle(Date) xlabel(#17, format(%tdYY-NN-DD) labsize(small)) xlabel(, grid) xlabel(, grid) ///
> xlabel(, angle(forty_five)) ylabel(, format(%9.0fc) labsize(small))  ylabel(, labsize(small) angle(horizontal)) ///
> ytitle(Daily hospital admissions) title("COVID-19 daily hospital admissions Iran, IHME, reference scenario", size(medium)) ///
> xscale(lwidth(vthin) lcolor(gray*.2)) yscale(lwidth(vthin) lcolor(gray*.2)) legend(off) 
{res}{txt}
{com}.            
. 
. 
. graph save "graph 25 COVID-19 daily hospital admissions, Iran 3 scenarios, IHME.gph", replace
{txt}(note: file graph 25 COVID-19 daily hospital admissions, Iran 3 scenarios, IHME.gph not found)
{res}{txt}(file graph 25 COVID-19 daily hospital admissions, Iran 3 scenarios, IHME.gph saved)

{com}. graph export "graph 26 COVID-19 daily hospital admissions, Iran 3 scenarios, IHME.pdf", replace
{txt}(file /Users/farshadpourmalek/Downloads/covir2-main/20210413/code/IHME/graph 26 COVID-19 daily hospital admissions, Iran 3 scenarios, IHME.pdf written in PDF format)

{com}. 
. 
. 
. 
. * daily new people going to ICU
. 
. twoway (rarea DayIcnLoSmA02S01V03 DayIcnUpSmA02S01V03 date, sort color(black*.2)) ///
> (line DayIcnMeSmA02S01V03 date, sort lcolor(black)) ///
> , xtitle(Date) xlabel(#17, format(%tdYY-NN-DD) labsize(small)) xlabel(, grid) xlabel(, grid) ///
> xlabel(, angle(forty_five)) ylabel(, format(%9.0fc) labsize(small))  ylabel(, labsize(small) angle(horizontal)) ///
> ytitle(Daily new people going to ICU) title("COVID-19 daily new people going to ICU Iran, IHME, reference scenario", size(medium)) ///
> xscale(lwidth(vthin) lcolor(gray*.2)) yscale(lwidth(vthin) lcolor(gray*.2)) legend(off) 
{res}{txt}
{com}.            
. 
. 
. graph save "graph 26 COVID-19 daily new people going to ICU, Iran 3 scenarios, IHME.gph", replace
{txt}(note: file graph 26 COVID-19 daily new people going to ICU, Iran 3 scenarios, IHME.gph not found)
{res}{txt}(file graph 26 COVID-19 daily new people going to ICU, Iran 3 scenarios, IHME.gph saved)

{com}. graph export "graph 26 COVID-19 daily new people going to ICU, Iran 3 scenarios, IHME.pdf", replace
{txt}(file /Users/farshadpourmalek/Downloads/covir2-main/20210413/code/IHME/graph 26 COVID-19 daily new people going to ICU, Iran 3 scenarios, IHME.pdf written in PDF format)

{com}. 
. 
. 
. 
. 
. 
. * daily bed over 
. 
. 
. twoway (rarea DayBeoLoSmA02S01V03 DayBeoUpSmA02S01V03 date, sort color(black*.2)) ///
> (line DayBeoMeSmA02S01V03 date, sort lcolor(black)) ///
> , xtitle(Date) xlabel(#17, format(%tdYY-NN-DD) labsize(small)) xlabel(, grid) xlabel(, grid) ///
> xlabel(, angle(forty_five)) ylabel(, format(%9.0fc) labsize(small))  ylabel(, labsize(small) angle(horizontal)) ///
> ytitle(Daily bed over) title("COVID-19 daily bed over, IHME, reference scenario", size(medium)) ///
> xscale(lwidth(vthin) lcolor(gray*.2)) yscale(lwidth(vthin) lcolor(gray*.2)) legend(off) 
{res}{txt}
{com}.            
. 
. 
. graph save "graph 27 COVID-19 daily bed over, Iran 3 scenarios, IHME.gph", replace
{txt}(note: file graph 27 COVID-19 daily bed over, Iran 3 scenarios, IHME.gph not found)
{res}{txt}(file graph 27 COVID-19 daily bed over, Iran 3 scenarios, IHME.gph saved)

{com}. graph export "graph 27 COVID-19 daily bed over, Iran 3 scenarios, IHME.pdf", replace
{txt}(file /Users/farshadpourmalek/Downloads/covir2-main/20210413/code/IHME/graph 27 COVID-19 daily bed over, Iran 3 scenarios, IHME.pdf written in PDF format)

{com}. 
. 
. 
. 
. * daily ICU over (has same values as bed over)
. 
. 
. twoway (rarea DayIcoLoSmA02S01V03 DayIcoUpSmA02S01V03 date, sort color(black*.2)) ///
> (line DayIcoMeSmA02S01V03 date, sort lcolor(black)) ///
> , xtitle(Date) xlabel(#17, format(%tdYY-NN-DD) labsize(small)) xlabel(, grid) xlabel(, grid) ///
> xlabel(, angle(forty_five)) ylabel(, format(%9.0fc) labsize(small))  ylabel(, labsize(small) angle(horizontal)) ///
> ytitle(Daily ICU over) title("COVID-19 daily ICU over, IHME, reference scenario", size(medium)) ///
> xscale(lwidth(vthin) lcolor(gray*.2)) yscale(lwidth(vthin) lcolor(gray*.2)) legend(off) 
{res}{txt}
{com}.            
. 
. graph save "graph 28 COVID-19 ICU over, Iran 3 scenarios, IHME.gph", replace
{txt}(note: file graph 28 COVID-19 ICU over, Iran 3 scenarios, IHME.gph not found)
{res}{txt}(file graph 28 COVID-19 ICU over, Iran 3 scenarios, IHME.gph saved)

{com}. graph export "graph 28 COVID-19 ICU over Iran 3 scenarios, IHME.pdf", replace
{txt}(file /Users/farshadpourmalek/Downloads/covir2-main/20210413/code/IHME/graph 28 COVID-19 ICU over Iran 3 scenarios, IHME.pdf written in PDF format)

{com}. 
. 
. 
. 
. * total tests
. 
. twoway ///
> (line TotTesMeSmA02S01V03 date, sort lcolor(black)) ///
> (line TotTesMeSmA02S02V03 date, sort lcolor(green)) ///
> (line TotTesMeSmA02S03V03 date, sort lcolor(red)) ///
> , xtitle(Date) xlabel(#17, format(%tdYY-NN-DD) labsize(small)) xlabel(, grid) xlabel(, grid) ///
> xlabel(, angle(forty_five)) ylabel(, format(%9.0fc) labsize(small))  ylabel(, labsize(small) angle(horizontal)) ///
> ytitle(Total tests) title("COVID-19 total tests, Iran, IHME, 3 scenarios", size(medium)) ///
> xscale(lwidth(vthin) lcolor(gray*.2)) yscale(lwidth(vthin) lcolor(gray*.2)) legend(region(lcolor(none))) legend(bexpand) ///
> legend(order(1 "S1" 2 "S2" 3 "S3") rows(1))
{res}{txt}
{com}. 
. graph save "graph 29 COVID-19 total tests, Iran 3 scenarios, IHME.gph", replace
{txt}(note: file graph 29 COVID-19 total tests, Iran 3 scenarios, IHME.gph not found)
{res}{txt}(file graph 29 COVID-19 total tests, Iran 3 scenarios, IHME.gph saved)

{com}. graph export "graph 29 COVID-19 total tests, Iran 3 scenarios, IHME.pdf", replace
{txt}(file /Users/farshadpourmalek/Downloads/covir2-main/20210413/code/IHME/graph 29 COVID-19 total tests, Iran 3 scenarios, IHME.pdf written in PDF format)

{com}. 
. 
. 
. * seroprevalence
. 
. 
. twoway ///
> (line TotSerMeSmA02S01V03 date, sort lcolor(black)) ///
> (line TotSerMeSmA02S02V03 date, sort lcolor(green)) ///
> (line TotSerMeSmA02S03V03 date, sort lcolor(red)) ///
> , xtitle(Date) xlabel(#17, format(%tdYY-NN-DD) labsize(small)) xlabel(, grid) xlabel(, grid) ///
> xlabel(, angle(forty_five)) ylabel(, format(%9.2fc) labsize(small))  ylabel(, labsize(small) angle(horizontal)) ///
> ytitle(Total seroprevalence) title("COVID-19 total seroprevalence, Iran, IHME, median scenario", size(medium)) ///
> xscale(lwidth(vthin) lcolor(gray*.2)) yscale(lwidth(vthin) lcolor(gray*.2)) legend(region(lcolor(none))) legend(bexpand) ///
> legend(order(1 "S1" 2 "S2" 3 "S3") rows(1))
{res}{txt}
{com}. 
. graph save "graph 30 COVID-19 total seroprevalence, Iran 3 scenarios, IHME.gph", replace
{txt}(note: file graph 30 COVID-19 total seroprevalence, Iran 3 scenarios, IHME.gph not found)
{res}{txt}(file graph 30 COVID-19 total seroprevalence, Iran 3 scenarios, IHME.gph saved)

{com}. graph export "graph 30 COVID-19 total seroprevalence, Iran 3 scenarios, IHME.pdf", replace
{txt}(file /Users/farshadpourmalek/Downloads/covir2-main/20210413/code/IHME/graph 30 COVID-19 total seroprevalence, Iran 3 scenarios, IHME.pdf written in PDF format)

{com}. 
. 
. 
. 
. 
. 
. * daily hospital-related outcomes
. 
. twoway ///
> (line DayBedMeSmA02S01V03 date, sort lcolor(black)) ///
> (line DayIcuMeSmA02S01V03 date, sort lcolor(green)) ///
> (line DayVenMeSmA02S01V03 date, sort lcolor(red)) ///
> (line DayAdmMeSmA02S01V03 date, sort lcolor(yellow)) ///
> (line DayIcnMeSmA02S01V03 date, sort lcolor(blue)) ///
> (line DayBeoMeSmA02S01V03 date, sort lcolor(black) lwidth(vthick) lpattern(tight_dot)) ///
> , xtitle(Date) xlabel(#17, format(%tdYY-NN-DD) labsize(small)) xlabel(, grid) xlabel(, grid) ///
> xlabel(, angle(forty_five)) ylabel(, format(%9.0fc) labsize(small))  ylabel(, labsize(small) angle(horizontal)) ///
> ytitle(Daily outcomes) title("COVID-19 daily hospital-related outcomes Iran, IHME, median scenario", size(medium)) ///
> xscale(lwidth(vthin) lcolor(gray*.2)) yscale(lwidth(vthin) lcolor(gray*.2)) legend(region(lcolor(none))) legend(bexpand) ///
> legend(order(1 "Bed" 2 "ICU" 3 "Vent" 4 "Adm" 5 "ICU new" 6 "Bed over") rows(2))
{res}{txt}
{com}. 
. 
. graph save "graph 31 COVID-19 daily hospital-related outcomes, Iran median scenario, IHME.gph", replace
{txt}(note: file graph 31 COVID-19 daily hospital-related outcomes, Iran median scenario, IHME.gph not found)
{res}{txt}(file graph 31 COVID-19 daily hospital-related outcomes, Iran median scenario, IHME.gph saved)

{com}. graph export "graph 31 COVID-19 daily hospital-related outcomes, Iran median scenario, IHME.pdf", replace
{txt}(file /Users/farshadpourmalek/Downloads/covir2-main/20210413/code/IHME/graph 31 COVID-19 daily hospital-related outcomes, Iran median scenario, IHME.pdf written in PDF format)

{com}. 
. 
. 
. 
. 
. 
. * daily hospital-related outcomes, wo beds needed 
. 
. twoway ///
> (line DayIcuMeSmA02S01V03 date, sort lcolor(green)) ///
> (line DayVenMeSmA02S01V03 date, sort lcolor(red)) ///
> (line DayAdmMeSmA02S01V03 date, sort lcolor(yellow)) ///
> (line DayIcnMeSmA02S01V03 date, sort lcolor(blue)) ///
> (line DayBeoMeSmA02S01V03 date, sort lcolor(black) lwidth(vthick) lpattern(tight_dot)) ///
> , xtitle(Date) xlabel(#17, format(%tdYY-NN-DD) labsize(small)) xlabel(, grid) xlabel(, grid) ///
> xlabel(, angle(forty_five)) ylabel(, format(%9.0fc) labsize(small))  ylabel(, labsize(small) angle(horizontal)) ///
> ytitle(Daily outcomes) title("COVID-19 daily hospital-related outcomes Iran, IHME, median scenario", size(medium)) ///
> xscale(lwidth(vthin) lcolor(gray*.2)) yscale(lwidth(vthin) lcolor(gray*.2)) legend(region(lcolor(none))) legend(bexpand) ///
> legend(order(1 "ICU" 2 "Vent" 3 "Adm" 4 "ICU new" 5 "Bedover") rows(1)) ///
> subtitle("without beds needed", size(small))
{res}{txt}
{com}. 
. 
. graph save "graph 32 COVID-19 daily hospital-related outcomes, Iran median scenario, IHME, wo beds needed.gph", replace
{txt}(note: file graph 32 COVID-19 daily hospital-related outcomes, Iran median scenario, IHME, wo beds needed.gph not found)
{res}{txt}(file graph 32 COVID-19 daily hospital-related outcomes, Iran median scenario, IHME, wo beds needed.gph saved)

{com}. graph export "graph 32 COVID-19 daily hospital-related outcomes, Iran median scenario, IHME, wo beds needed.pdf", replace
{txt}(file /Users/farshadpourmalek/Downloads/covir2-main/20210413/code/IHME/graph 32 COVID-19 daily hospital-related outcomes, Iran median scenario, IHME, wo beds needed.pdf written in PDF format)

{com}. 
. 
. 
. 
. * rates
. 
. * daily deaths raw per 100k rate
. 
. twoway ///
> (line deaths_mean_p100k_rate date, sort lcolor(black)) ///
> (line deaths_lower_p100k_rate date, sort lcolor(green)) ///
> (line deaths_upper_p100k_rate date, sort lcolor(red)) ///
> , xtitle(Date) xlabel(#17, format(%tdYY-NN-DD) labsize(small)) xlabel(, grid) xlabel(, grid) ///
> xlabel(, angle(forty_five)) ylabel(, format(%9.2fc) labsize(small))  ylabel(, labsize(small) angle(horizontal)) ///
> ytitle(Daily deaths per 100k rate) title("COVID-19 daily deaths raw per 100k rate, Iran, IHME", size(medium)) ///
> xscale(lwidth(vthin) lcolor(gray*.2)) yscale(lwidth(vthin) lcolor(gray*.2)) legend(region(lcolor(none))) legend(bexpand) ///
> legend(order(1 "Mean" 2 "Lower" 3 "Upper") rows(1))
{res}{txt}
{com}. 
. graph save "graph 40 COVID-19 daily deaths raw per 100k rate, Iran, IHME.gph", replace
{txt}(note: file graph 40 COVID-19 daily deaths raw per 100k rate, Iran, IHME.gph not found)
{res}{txt}(file graph 40 COVID-19 daily deaths raw per 100k rate, Iran, IHME.gph saved)

{com}. graph export "graph 40 COVID-19 daily deaths raw per 100k rate, Iran, IHME.pdf", replace
{txt}(file /Users/farshadpourmalek/Downloads/covir2-main/20210413/code/IHME/graph 40 COVID-19 daily deaths raw per 100k rate, Iran, IHME.pdf written in PDF format)

{com}. 
. 
. 
. * daily deaths smoothed per 100k rate
. 
. twoway ///
> (line deaths_mean_smoothed_p100k_rate date, sort lcolor(black)) ///
> (line deaths_lower_smoothed_p100k_rate date, sort lcolor(green)) ///
> (line deaths_upper_smoothed_p100k_rate date, sort lcolor(red)) ///
> , xtitle(Date) xlabel(#17, format(%tdYY-NN-DD) labsize(small)) xlabel(, grid) xlabel(, grid) ///
> xlabel(, angle(forty_five)) ylabel(, format(%9.2fc) labsize(small))  ylabel(, labsize(small) angle(horizontal)) ///
> ytitle(Daily deaths per 100k rate) title("COVID-19 daily deaths smoothed per 100k rate, Iran, IHME", size(medium)) ///
> xscale(lwidth(vthin) lcolor(gray*.2)) yscale(lwidth(vthin) lcolor(gray*.2)) legend(region(lcolor(none))) legend(bexpand) ///
> legend(order(1 "Mean" 2 "Lower" 3 "Upper") rows(1))
{res}{txt}
{com}. 
. graph save "graph 41 COVID-19 daily deaths smoothed per 100k rate, Iran, IHME.gph", replace
{txt}(note: file graph 41 COVID-19 daily deaths smoothed per 100k rate, Iran, IHME.gph not found)
{res}{txt}(file graph 41 COVID-19 daily deaths smoothed per 100k rate, Iran, IHME.gph saved)

{com}. graph export "graph 41 COVID-19 daily deaths smoothed per 100k rate, Iran, IHME.pdf", replace
{txt}(file /Users/farshadpourmalek/Downloads/covir2-main/20210413/code/IHME/graph 41 COVID-19 daily deaths smoothed per 100k rate, Iran, IHME.pdf written in PDF format)

{com}. 
. 
. 
. 
. 
. * total deaths raw per 100k rate
. 
. twoway ///
> (line totdea_mean_p100k_rate date, sort lcolor(black)) ///
> (line totdea_lower_p100k_rate date, sort lcolor(green)) ///
> (line totdea_upper_p100k_rate date, sort lcolor(red)) ///
> , xtitle(Date) xlabel(#17, format(%tdYY-NN-DD) labsize(small)) xlabel(, grid) xlabel(, grid) ///
> xlabel(, angle(forty_five)) ylabel(, format(%9.0fc) labsize(small))  ylabel(, labsize(small) angle(horizontal)) ///
> ytitle(Total deaths per 100k rate) title("COVID-19 total deaths raw per 100k rate, Iran, IHME", size(medium)) ///
> xscale(lwidth(vthin) lcolor(gray*.2)) yscale(lwidth(vthin) lcolor(gray*.2)) legend(region(lcolor(none))) legend(bexpand) ///
> legend(order(1 "Mean" 2 "Lower" 3 "Upper") rows(1))
{res}{txt}
{com}. 
. graph save "graph 42 COVID-19 total deaths raw per 100k rate, Iran, IHME.gph", replace
{txt}(note: file graph 42 COVID-19 total deaths raw per 100k rate, Iran, IHME.gph not found)
{res}{txt}(file graph 42 COVID-19 total deaths raw per 100k rate, Iran, IHME.gph saved)

{com}. graph export "graph 42 COVID-19 total deaths raw per 100k rate, Iran, IHME.pdf", replace
{txt}(file /Users/farshadpourmalek/Downloads/covir2-main/20210413/code/IHME/graph 42 COVID-19 total deaths raw per 100k rate, Iran, IHME.pdf written in PDF format)

{com}. 
. 
. 
. 
. 
. * total deaths smoothed per 100k rate
. 
. twoway ///
> (line totdea_mean_smoothed_p100k_rate date, sort lcolor(black)) ///
> (line totdea_lower_smoothed_p100k_rate date, sort lcolor(green)) ///
> (line totdea_upper_smoothed_p100k_rate date, sort lcolor(red)) ///
> , xtitle(Date) xlabel(#17, format(%tdYY-NN-DD) labsize(small)) xlabel(, grid) xlabel(, grid) ///
> xlabel(, angle(forty_five)) ylabel(, format(%9.0fc) labsize(small))  ylabel(, labsize(small) angle(horizontal)) ///
> ytitle(Total deaths per 100k rate) title("COVID-19 total deaths smoothed per 100k rate, Iran, IHME", size(medium)) ///
> xscale(lwidth(vthin) lcolor(gray*.2)) yscale(lwidth(vthin) lcolor(gray*.2)) legend(region(lcolor(none))) legend(bexpand) ///
> legend(order(1 "Mean" 2 "Lower" 3 "Upper") rows(1))
{res}{txt}
{com}. 
. graph save "graph 43 COVID-19 total deaths smoothed per 100k rate, Iran, IHME.gph", replace
{txt}(note: file graph 43 COVID-19 total deaths smoothed per 100k rate, Iran, IHME.gph not found)
{res}{txt}(file graph 43 COVID-19 total deaths smoothed per 100k rate, Iran, IHME.gph saved)

{com}. graph export "graph 43 COVID-19 total deaths smoothed per 100k rate, Iran, IHME.pdf", replace
{txt}(file /Users/farshadpourmalek/Downloads/covir2-main/20210413/code/IHME/graph 43 COVID-19 total deaths smoothed per 100k rate, Iran, IHME.pdf written in PDF format)

{com}. 
. 
. 
. * estimated infections per 100k rate
. 
. twoway ///
> (line est_infections_mean_p100k_rate date, sort lcolor(black)) ///
> (line est_infections_lower_p100k_rate date, sort lcolor(green)) ///
> (line est_infections_upper_p100k_rate date, sort lcolor(red)) ///
> , xtitle(Date) xlabel(#17, format(%tdYY-NN-DD) labsize(small)) xlabel(, grid) xlabel(, grid) ///
> xlabel(, angle(forty_five)) ylabel(, format(%9.0fc) labsize(small))  ylabel(, labsize(small) angle(horizontal)) ///
> ytitle(Estimated infections per 100k rate) title("COVID-19 estimated infections per 100k rate, Iran, IHME", size(medium)) ///
> xscale(lwidth(vthin) lcolor(gray*.2)) yscale(lwidth(vthin) lcolor(gray*.2)) legend(region(lcolor(none))) legend(bexpand) ///
> legend(order(1 "Mean" 2 "Lower" 3 "Upper") rows(1))
{res}{txt}
{com}. 
. graph save "graph 44 COVID-19 estimated infections per 100k rate, Iran, IHME.gph", replace
{txt}(note: file graph 44 COVID-19 estimated infections per 100k rate, Iran, IHME.gph not found)
{res}{txt}(file graph 44 COVID-19 estimated infections per 100k rate, Iran, IHME.gph saved)

{com}. graph export "graph 44 COVID-19 estimated infections per 100k rate, Iran, IHME.pdf", replace
{txt}(file /Users/farshadpourmalek/Downloads/covir2-main/20210413/code/IHME/graph 44 COVID-19 estimated infections per 100k rate, Iran, IHME.pdf written in PDF format)

{com}. 
. 
. 
. 
. * confirmed infections per 100k rate
. 
. 
. twoway ///
> (line confirmed_infections_p100k_rate date, sort lcolor(black)) ///
> , xtitle(Date) xlabel(#17, format(%tdYY-NN-DD) labsize(small)) xlabel(, grid) xlabel(, grid) ///
> xlabel(, angle(forty_five)) ylabel(, format(%9.0fc) labsize(small))  ylabel(, labsize(small) angle(horizontal)) ///
> ytitle(Confirmed infections per 100k rate) title("COVID-19 confirmed infections per 100k rate, Iran, IHME", size(medium)) ///
> xscale(lwidth(vthin) lcolor(gray*.2)) yscale(lwidth(vthin) lcolor(gray*.2)) legend(region(lcolor(none))) legend(bexpand) ///
> legend(off)
{res}{txt}
{com}. 
. graph save "graph 44 COVID-19 confirmed per 100k rate, Iran, IHME.gph", replace
{txt}(note: file graph 44 COVID-19 confirmed per 100k rate, Iran, IHME.gph not found)
{res}{txt}(file graph 44 COVID-19 confirmed per 100k rate, Iran, IHME.gph saved)

{com}. graph export "graph 44 COVID-19 confirmed per 100k rate, Iran, IHME.pdf", replace
{txt}(file /Users/farshadpourmalek/Downloads/covir2-main/20210413/code/IHME/graph 44 COVID-19 confirmed per 100k rate, Iran, IHME.pdf written in PDF format)

{com}. 
. 
. 
. 
. 
. 
. *
. 
. 
. 
. * DayCas DayDeaDay Dea_multip
. 
. 
. twoway ///
> (line DayCasMeRaA02S01V03 date, sort lcolor(blue)) ///
> (line DayDeaMeRaA02S01V03 date, sort lcolor(red)) ///
> (line DayDMuMeRaA02S01V03 date, sort lpattern(dot) lcolor(red)) ///
> if date > td(01jan2020) ///
> , xtitle(Date) xlabel(, format(%tdYY-NN-DD) labsize(small)) xlabel(, grid) xlabel(, grid) ///
> xlabel(, angle(forty_five)) ylabel(, format(%12.0fc) labsize(small)) ylabel(, labsize(small) angle(horizontal)) ///
> ytitle(Daily cases and deaths) title("COVID-19 daily cases and deaths, Iran, IHME", size(medium)) ///
> xscale(lwidth(vthin) lcolor(gray*.2)) yscale(lwidth(vthin) lcolor(gray*.2)) yscale(titlegap(4)) legend(region(lcolor(none)))  ///
> legend(order(1 "Daily cases" 2 "Daily deaths" 3 "Daily deaths scaled for visualization") size(small)) ///
> subtitle("Daily deaths, scaled = times (means of cases divided by deaths) for visualization only", size(small)) ///
> note("Current scenario, mean estimate")
{res}{txt}
{com}. 
. graph save "graph 45 COVID-19 daily deaths and cases Iran, IHME.gph", replace
{txt}(note: file graph 45 COVID-19 daily deaths and cases Iran, IHME.gph not found)
{res}{txt}(file graph 45 COVID-19 daily deaths and cases Iran, IHME.gph saved)

{com}. qui graph export "graph 45 COVID-19 daily deaths and cases Iran, IHME.pdf", replace
{txt}
{com}. 
. 
. 
. 
. 
. 
. 
. *************************************
. 
. * Locate peak dates and values - deaths 
. 
. 
. * S1 Reference
. 
. 
. 
. * first peak
. 
. summ DayDeaMeRaA02S01V03 if date > td(01mar2020) & date < td(30apr2020) 

{txt}    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayDeaMeRa.. {c |}{res}         59    100.0508    40.48475         11        158
{txt}
{com}. 
. gen DayDeaMeRaA02S01V03P1V = r(max)
{txt}
{com}. 
. summ date if DayDeaMeRaA02S01V03 == DayDeaMeRaA02S01V03P1V & date > td(01mar2020) & date < td(30apr2020)

{txt}    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
{space 8}date {c |}{res}          1       22009           .      22009      22009
{txt}
{com}. 
. gen DayDeaMeRaA02S01V03P1D = r(max)
{txt}
{com}. 
. summ DayDeaLoRaA02S01V03 if date == DayDeaMeRaA02S01V03P1D

{txt}    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayDeaLoRa.. {c |}{res}          1         158           .        158        158
{txt}
{com}. 
. gen DayDeaLoRaA02S01V03P1V = r(max)
{txt}
{com}. 
. summ DayDeaUpRaA02S01V03 if date == DayDeaMeRaA02S01V03P1D

{txt}    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayDeaUpRa.. {c |}{res}          1         158           .        158        158
{txt}
{com}. 
. gen DayDeaUpRaA02S01V03P1V = r(max)
{txt}
{com}. 
. label var DayDeaMeRaA02S01V03P1V "DayDeaMeRaA02S01V03P1V Peak 1 Value"
{txt}
{com}. label var DayDeaMeRaA02S01V03P1D "DayDeaMeRaA02S01V03P1D Peak 1 Date"
{txt}
{com}. label var DayDeaLoRaA02S01V03P1V "DayDeaLoRaA02S01V03P1V Peak 1 Value"
{txt}
{com}. label var DayDeaUpRaA02S01V03P1V "DayDeaUpRaA02S01V03P1V Peak 1 Value"
{txt}
{com}. format DayDeaMeRaA02S01V03P1D %tdDDMonCCYY
{txt}
{com}. 
. tab1 DayDeaMeRaA02S01V03P1V DayDeaLoRaA02S01V03P1V DayDeaUpRaA02S01V03P1V DayDeaMeRaA02S01V03P1D

{res}-> tabulation of DayDeaMeRaA02S01V03P1V  

{txt}DayDeaMeRaA {c |}
02S01V03P1V {c |}
     Peak 1 {c |}
      Value {c |}      Freq.     Percent        Cum.
{hline 12}{c +}{hline 35}
        158 {c |}{res}        545      100.00      100.00
{txt}{hline 12}{c +}{hline 35}
      Total {c |}{res}        545      100.00

-> tabulation of DayDeaLoRaA02S01V03P1V  

{txt}DayDeaLoRaA {c |}
02S01V03P1V {c |}
     Peak 1 {c |}
      Value {c |}      Freq.     Percent        Cum.
{hline 12}{c +}{hline 35}
        158 {c |}{res}        545      100.00      100.00
{txt}{hline 12}{c +}{hline 35}
      Total {c |}{res}        545      100.00

-> tabulation of DayDeaUpRaA02S01V03P1V  

{txt}DayDeaUpRaA {c |}
02S01V03P1V {c |}
     Peak 1 {c |}
      Value {c |}      Freq.     Percent        Cum.
{hline 12}{c +}{hline 35}
        158 {c |}{res}        545      100.00      100.00
{txt}{hline 12}{c +}{hline 35}
      Total {c |}{res}        545      100.00

-> tabulation of DayDeaMeRaA02S01V03P1D  

{txt}DayDeaMeRaA {c |}
02S01V03P1D {c |}
Peak 1 Date {c |}      Freq.     Percent        Cum.
{hline 12}{c +}{hline 35}
  04Apr2020 {c |}{res}        545      100.00      100.00
{txt}{hline 12}{c +}{hline 35}
      Total {c |}{res}        545      100.00
{txt}
{com}. 
. 
. * second peak 
. 
. summ DayDeaMeRaA02S01V03 if date > td(01jul2020) & date < td(30jul2020) 

{txt}    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayDeaMeRa.. {c |}{res}         28    192.3214    27.09934        142        235
{txt}
{com}. 
. gen DayDeaMeRaA02S01V03P2V = r(max)
{txt}
{com}. 
. summ date if DayDeaMeRaA02S01V03 == DayDeaMeRaA02S01V03P2V & date > td(01jul2020) & date < td(30jul2020) 

{txt}    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
{space 8}date {c |}{res}          1       22124           .      22124      22124
{txt}
{com}. 
. gen DayDeaMeRaA02S01V03P2D = r(max)
{txt}
{com}. 
. summ DayDeaLoRaA02S01V03 if date == DayDeaMeRaA02S01V03P2D

{txt}    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayDeaLoRa.. {c |}{res}          1         235           .        235        235
{txt}
{com}. 
. gen DayDeaLoRaA02S01V03P2V = r(max)
{txt}
{com}. 
. summ DayDeaUpRaA02S01V03 if date == DayDeaMeRaA02S01V03P2D

{txt}    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayDeaUpRa.. {c |}{res}          1         235           .        235        235
{txt}
{com}. 
. gen DayDeaUpRaA02S01V03P2V = r(max)
{txt}
{com}. 
. label var DayDeaMeRaA02S01V03P2V "DayDeaMeRaA02S01V03P2V Peak 2 Value"
{txt}
{com}. label var DayDeaMeRaA02S01V03P2D "DayDeaMeRaA02S01V03P2D Peak 2 Date"
{txt}
{com}. label var DayDeaLoRaA02S01V03P2V "DayDeaLoRaA02S01V03P2V Peak 2 Value"
{txt}
{com}. label var DayDeaUpRaA02S01V03P2V "DayDeaUpRaA02S01V03P2V Peak 2 Value"
{txt}
{com}. format DayDeaMeRaA02S01V03P2D %tdDDMonCCYY
{txt}
{com}. 
. tab1 DayDeaMeRaA02S01V03P2V DayDeaLoRaA02S01V03P2V DayDeaLoRaA02S01V03P2V DayDeaMeRaA02S01V03P2D

{res}-> tabulation of DayDeaMeRaA02S01V03P2V  

{txt}DayDeaMeRaA {c |}
02S01V03P2V {c |}
     Peak 2 {c |}
      Value {c |}      Freq.     Percent        Cum.
{hline 12}{c +}{hline 35}
        235 {c |}{res}        545      100.00      100.00
{txt}{hline 12}{c +}{hline 35}
      Total {c |}{res}        545      100.00

-> tabulation of DayDeaLoRaA02S01V03P2V  

{txt}DayDeaLoRaA {c |}
02S01V03P2V {c |}
     Peak 2 {c |}
      Value {c |}      Freq.     Percent        Cum.
{hline 12}{c +}{hline 35}
        235 {c |}{res}        545      100.00      100.00
{txt}{hline 12}{c +}{hline 35}
      Total {c |}{res}        545      100.00

-> tabulation of DayDeaLoRaA02S01V03P2V  

{txt}DayDeaLoRaA {c |}
02S01V03P2V {c |}
     Peak 2 {c |}
      Value {c |}      Freq.     Percent        Cum.
{hline 12}{c +}{hline 35}
        235 {c |}{res}        545      100.00      100.00
{txt}{hline 12}{c +}{hline 35}
      Total {c |}{res}        545      100.00

-> tabulation of DayDeaMeRaA02S01V03P2D  

{txt}DayDeaMeRaA {c |}
02S01V03P2D {c |}
Peak 2 Date {c |}      Freq.     Percent        Cum.
{hline 12}{c +}{hline 35}
  28Jul2020 {c |}{res}        545      100.00      100.00
{txt}{hline 12}{c +}{hline 35}
      Total {c |}{res}        545      100.00
{txt}
{com}. 
. 
. * third peak 
. 
. summ DayDeaMeRaA02S01V03 if date > td(01nov2020) & date < td(30nov2020) 

{txt}    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayDeaMeRa.. {c |}{res}         28    449.1429    29.30392        388        486
{txt}
{com}. 
. gen DayDeaMeRaA02S01V03P3V = r(max)
{txt}
{com}. 
. summ date if DayDeaMeRaA02S01V03 == DayDeaMeRaA02S01V03P3V & date > td(01nov2020) & date < td(30nov2020) 

{txt}    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
{space 8}date {c |}{res}          1       22235           .      22235      22235
{txt}
{com}. 
. gen DayDeaMeRaA02S01V03P3D = r(max)
{txt}
{com}. 
. summ DayDeaLoRaA02S01V03 if date == DayDeaMeRaA02S01V03P3D

{txt}    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayDeaLoRa.. {c |}{res}          1         486           .        486        486
{txt}
{com}. 
. gen DayDeaLoRaA02S01V03P3V = r(max)
{txt}
{com}. 
. summ DayDeaUpRaA02S01V03 if date == DayDeaMeRaA02S01V03P3D

{txt}    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayDeaUpRa.. {c |}{res}          1         486           .        486        486
{txt}
{com}. 
. gen DayDeaUpRaA02S01V03P3V = r(max)
{txt}
{com}. 
. label var DayDeaMeRaA02S01V03P3V "DayDeaMeRaA02S01V03P2V Peak 3 Value"
{txt}
{com}. label var DayDeaMeRaA02S01V03P3D "DayDeaMeRaA02S01V03P3D Peak 3 Date"
{txt}
{com}. label var DayDeaLoRaA02S01V03P3V "DayDeaLoRaA02S01V03P3V Peak 3 Value"
{txt}
{com}. label var DayDeaUpRaA02S01V03P3V "DayDeaUpRaA02S01V03P3V Peak 3 Value"
{txt}
{com}. format DayDeaMeRaA02S01V03P3D %tdDDMonCCYY
{txt}
{com}. 
. tab1 DayDeaMeRaA02S01V03P3V DayDeaLoRaA02S01V03P3V DayDeaUpRaA02S01V03P3V DayDeaMeRaA02S01V03P3D

{res}-> tabulation of DayDeaMeRaA02S01V03P3V  

{txt}DayDeaMeRaA {c |}
02S01V03P2V {c |}
     Peak 3 {c |}
      Value {c |}      Freq.     Percent        Cum.
{hline 12}{c +}{hline 35}
        486 {c |}{res}        545      100.00      100.00
{txt}{hline 12}{c +}{hline 35}
      Total {c |}{res}        545      100.00

-> tabulation of DayDeaLoRaA02S01V03P3V  

{txt}DayDeaLoRaA {c |}
02S01V03P3V {c |}
     Peak 3 {c |}
      Value {c |}      Freq.     Percent        Cum.
{hline 12}{c +}{hline 35}
        486 {c |}{res}        545      100.00      100.00
{txt}{hline 12}{c +}{hline 35}
      Total {c |}{res}        545      100.00

-> tabulation of DayDeaUpRaA02S01V03P3V  

{txt}DayDeaUpRaA {c |}
02S01V03P3V {c |}
     Peak 3 {c |}
      Value {c |}      Freq.     Percent        Cum.
{hline 12}{c +}{hline 35}
        486 {c |}{res}        545      100.00      100.00
{txt}{hline 12}{c +}{hline 35}
      Total {c |}{res}        545      100.00

-> tabulation of DayDeaMeRaA02S01V03P3D  

{txt}DayDeaMeRaA {c |}
02S01V03P3D {c |}
Peak 3 Date {c |}      Freq.     Percent        Cum.
{hline 12}{c +}{hline 35}
  16Nov2020 {c |}{res}        545      100.00      100.00
{txt}{hline 12}{c +}{hline 35}
      Total {c |}{res}        545      100.00
{txt}
{com}. 
. 
. * fourth peak
. 
. summ DayDeaMeRaA02S01V03 if date > td(01mar2021) 

{txt}    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayDeaMeRa.. {c |}{res}        153    114.3253    46.76659   37.43903   188.8526
{txt}
{com}. 
. gen DayDeaMeRaA02S01V03P4V = r(max)
{txt}
{com}. 
. summ date if DayDeaMeRaA02S01V03 == DayDeaMeRaA02S01V03P4V & date > td(01mar2021) 

{txt}    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
{space 8}date {c |}{res}          1       22404           .      22404      22404
{txt}
{com}. 
. gen DayDeaMeRaA02S01V03P4D = r(max)
{txt}
{com}. 
. summ DayDeaLoRaA02S01V03 if date == DayDeaMeRaA02S01V03P4D

{txt}    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayDeaLoRa.. {c |}{res}          1    133.4576           .   133.4576   133.4576
{txt}
{com}. 
. gen DayDeaLoRaA02S01V03P4V = r(max)
{txt}
{com}. 
. summ DayDeaUpRaA02S01V03 if date == DayDeaMeRaA02S01V03P4D

{txt}    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayDeaUpRa.. {c |}{res}          1    270.4023           .   270.4023   270.4023
{txt}
{com}. 
. gen DayDeaUpRaA02S01V03P4V = r(max)
{txt}
{com}. 
. label var DayDeaMeRaA02S01V03P4V "DayDeaMeRaA02S01V03P4V Peak 4 Value"
{txt}
{com}. label var DayDeaMeRaA02S01V03P4D "DayDeaMeRaA02S01V03P4D Peak 4 Date"
{txt}
{com}. label var DayDeaLoRaA02S01V03P4V "DayDeaLoRaA02S01V03P4V Peak 4 Value"
{txt}
{com}. label var DayDeaUpRaA02S01V03P4V "DayDeaUpRaA02S01V03P4V Peak 4 Value"
{txt}
{com}. format DayDeaMeRaA02S01V03P4D %tdDDMonCCYY
{txt}
{com}. 
. tab1 DayDeaMeRaA02S01V03P4V DayDeaLoRaA02S01V03P4V DayDeaUpRaA02S01V03P4V DayDeaMeRaA02S01V03P4D

{res}-> tabulation of DayDeaMeRaA02S01V03P4V  

{txt}DayDeaMeRaA {c |}
02S01V03P4V {c |}
     Peak 4 {c |}
      Value {c |}      Freq.     Percent        Cum.
{hline 12}{c +}{hline 35}
   188.8526 {c |}{res}        545      100.00      100.00
{txt}{hline 12}{c +}{hline 35}
      Total {c |}{res}        545      100.00

-> tabulation of DayDeaLoRaA02S01V03P4V  

{txt}DayDeaLoRaA {c |}
02S01V03P4V {c |}
     Peak 4 {c |}
      Value {c |}      Freq.     Percent        Cum.
{hline 12}{c +}{hline 35}
   133.4576 {c |}{res}        545      100.00      100.00
{txt}{hline 12}{c +}{hline 35}
      Total {c |}{res}        545      100.00

-> tabulation of DayDeaUpRaA02S01V03P4V  

{txt}DayDeaUpRaA {c |}
02S01V03P4V {c |}
     Peak 4 {c |}
      Value {c |}      Freq.     Percent        Cum.
{hline 12}{c +}{hline 35}
   270.4023 {c |}{res}        545      100.00      100.00
{txt}{hline 12}{c +}{hline 35}
      Total {c |}{res}        545      100.00

-> tabulation of DayDeaMeRaA02S01V03P4D  

{txt}DayDeaMeRaA {c |}
02S01V03P4D {c |}
Peak 4 Date {c |}      Freq.     Percent        Cum.
{hline 12}{c +}{hline 35}
  04May2021 {c |}{res}        545      100.00      100.00
{txt}{hline 12}{c +}{hline 35}
      Total {c |}{res}        545      100.00
{txt}
{com}. 
. 
. * end date avialable (P8)
. 
. summ date if DayDeaMeRaA02S01V03 != . 

{txt}    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
{space 8}date {c |}{res}        545       22221    157.4722      21949      22493
{txt}
{com}. 
. gen A02DZ = r(max) 
{txt}
{com}. 
. summ DayDeaMeRaA02S01V03 if date == A02DZ

{txt}    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayDeaMeRa.. {c |}{res}          1    37.43903           .   37.43903   37.43903
{txt}
{com}. 
. gen DayDeaMeRaA02S01V03P8V = r(max)
{txt}
{com}. 
. summ DayDeaLoRaA02S01V03 if date == A02DZ

{txt}    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayDeaLoRa.. {c |}{res}          1    20.19389           .   20.19389   20.19389
{txt}
{com}. 
. gen DayDeaLoRaA02S01V03P8V = r(max)
{txt}
{com}. 
. summ DayDeaUpRaA02S01V03 if date == A02DZ

{txt}    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayDeaUpRa.. {c |}{res}          1    63.15673           .   63.15673   63.15673
{txt}
{com}. 
. gen DayDeaUpRaA02S01V03P8V = r(max)
{txt}
{com}. 
. label var DayDeaMeRaA02S01V03P8V "DayDeaMeRaA02S01V03P8V End Value"
{txt}
{com}. label var DayDeaLoRaA02S01V03P8V "DayDeaLoRaA02S01V03P8V End Value"
{txt}
{com}. label var DayDeaUpRaA02S01V03P8V "DayDeaUpRaA02S01V03P8V End Value"
{txt}
{com}. format A02DZ %tdDDMonCCYY
{txt}
{com}. 
. tab1 DayDeaMeRaA02S01V03P8V DayDeaLoRaA02S01V03P8V DayDeaUpRaA02S01V03P8V A02DZ

{res}-> tabulation of DayDeaMeRaA02S01V03P8V  

{txt}DayDeaMeRaA {c |}
02S01V03P8V {c |}
  End Value {c |}      Freq.     Percent        Cum.
{hline 12}{c +}{hline 35}
   37.43903 {c |}{res}        545      100.00      100.00
{txt}{hline 12}{c +}{hline 35}
      Total {c |}{res}        545      100.00

-> tabulation of DayDeaLoRaA02S01V03P8V  

{txt}DayDeaLoRaA {c |}
02S01V03P8V {c |}
  End Value {c |}      Freq.     Percent        Cum.
{hline 12}{c +}{hline 35}
   20.19389 {c |}{res}        545      100.00      100.00
{txt}{hline 12}{c +}{hline 35}
      Total {c |}{res}        545      100.00

-> tabulation of DayDeaUpRaA02S01V03P8V  

{txt}DayDeaUpRaA {c |}
02S01V03P8V {c |}
  End Value {c |}      Freq.     Percent        Cum.
{hline 12}{c +}{hline 35}
   63.15673 {c |}{res}        545      100.00      100.00
{txt}{hline 12}{c +}{hline 35}
      Total {c |}{res}        545      100.00

-> tabulation of A02DZ  

      {txt}A02DZ {c |}      Freq.     Percent        Cum.
{hline 12}{c +}{hline 35}
  01Aug2021 {c |}{res}        545      100.00      100.00
{txt}{hline 12}{c +}{hline 35}
      Total {c |}{res}        545      100.00
{txt}
{com}. 
. 
. 
. 
. 
. 
. 
. * S2 Best
. 
. * the first three peaks show same values for S1 and S2 
. 
. * fourth peak
. 
. summ DayDeaMeSmA02S02V03 if date > td(01mar2021) 

{txt}    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayDeaMeSm.. {c |}{res}        153    77.28341    56.08733   5.602275   186.6559
{txt}
{com}. 
. gen DayDeaMeSmA02S02V03P4V = r(max)
{txt}
{com}. 
. summ date if DayDeaMeSmA02S02V03 == DayDeaMeSmA02S02V03P4V & date > td(01mar2021) 

{txt}    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
{space 8}date {c |}{res}          1       22399           .      22399      22399
{txt}
{com}. 
. gen DayDeaMeSmA02S02V03P4D = r(max)
{txt}
{com}. 
. summ DayDeaLoSmA02S02V03 if date == DayDeaMeSmA02S02V03P4D

{txt}    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayDeaLoSm.. {c |}{res}          1    134.3242           .   134.3242   134.3242
{txt}
{com}. 
. gen DayDeaLoSmA02S02V03P4V = r(max)
{txt}
{com}. 
. summ DayDeaUpSmA02S02V03 if date == DayDeaMeSmA02S02V03P4D

{txt}    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayDeaUpSm.. {c |}{res}          1    260.2182           .   260.2182   260.2182
{txt}
{com}. 
. gen DayDeaUpSmA02S02V03P4V = r(max)
{txt}
{com}. 
. label var DayDeaMeSmA02S02V03P4V "DayDeaMeSmA02S02V03P4V Peak 4 Value"
{txt}
{com}. label var DayDeaMeSmA02S02V03P4D "DayDeaMeSmA02S02V03P4D Peak 4 Date"
{txt}
{com}. label var DayDeaLoSmA02S02V03P4V "DayDeaLoSmA02S02V03P4V Peak 4 Value"
{txt}
{com}. label var DayDeaUpSmA02S02V03P4V "DayDeaUpSmA02S02V03P4V Peak 4 Value"
{txt}
{com}. format DayDeaMeSmA02S02V03P4D %tdDDMonCCYY
{txt}
{com}. 
. tab1 DayDeaMeSmA02S02V03P4V DayDeaLoSmA02S02V03P4V DayDeaUpSmA02S02V03P4V DayDeaMeSmA02S02V03P4D

{res}-> tabulation of DayDeaMeSmA02S02V03P4V  

{txt}DayDeaMeSmA {c |}
02S02V03P4V {c |}
     Peak 4 {c |}
      Value {c |}      Freq.     Percent        Cum.
{hline 12}{c +}{hline 35}
   186.6559 {c |}{res}        545      100.00      100.00
{txt}{hline 12}{c +}{hline 35}
      Total {c |}{res}        545      100.00

-> tabulation of DayDeaLoSmA02S02V03P4V  

{txt}DayDeaLoSmA {c |}
02S02V03P4V {c |}
     Peak 4 {c |}
      Value {c |}      Freq.     Percent        Cum.
{hline 12}{c +}{hline 35}
   134.3242 {c |}{res}        545      100.00      100.00
{txt}{hline 12}{c +}{hline 35}
      Total {c |}{res}        545      100.00

-> tabulation of DayDeaUpSmA02S02V03P4V  

{txt}DayDeaUpSmA {c |}
02S02V03P4V {c |}
     Peak 4 {c |}
      Value {c |}      Freq.     Percent        Cum.
{hline 12}{c +}{hline 35}
   260.2182 {c |}{res}        545      100.00      100.00
{txt}{hline 12}{c +}{hline 35}
      Total {c |}{res}        545      100.00

-> tabulation of DayDeaMeSmA02S02V03P4D  

{txt}DayDeaMeSmA {c |}
02S02V03P4D {c |}
Peak 4 Date {c |}      Freq.     Percent        Cum.
{hline 12}{c +}{hline 35}
  29Apr2021 {c |}{res}        545      100.00      100.00
{txt}{hline 12}{c +}{hline 35}
      Total {c |}{res}        545      100.00
{txt}
{com}. 
. 
. * end date avialable (P8)
. 
. summ DayDeaMeSmA02S02V03 if date == A02DZ

{txt}    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayDeaMeSm.. {c |}{res}          1    5.602275           .   5.602275   5.602275
{txt}
{com}. 
. gen DayDeaMeSmA02S02V03P8V = r(max)
{txt}
{com}. 
. summ DayDeaLoSmA02S02V03 if date == A02DZ

{txt}    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayDeaLoSm.. {c |}{res}          1    1.526794           .   1.526794   1.526794
{txt}
{com}. 
. gen DayDeaLoSmA02S02V03P8V = r(max)
{txt}
{com}. 
. summ DayDeaUpSmA02S02V03 if date == A02DZ

{txt}    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayDeaUpSm.. {c |}{res}          1    12.82915           .   12.82915   12.82915
{txt}
{com}. 
. gen DayDeaUpSmA02S02V03P8V = r(max)
{txt}
{com}. 
. label var DayDeaMeSmA02S02V03P8V "DayDeaMeSmA02S02V03P8V End Value"
{txt}
{com}. label var DayDeaLoSmA02S02V03P8V "DayDeaLoSmA02S02V03P8V End Value"
{txt}
{com}. label var DayDeaUpSmA02S02V03P8V "DayDeaUpSmA02S02V03P8V End Value"
{txt}
{com}. 
. tab1 DayDeaMeSmA02S02V03P8V DayDeaLoSmA02S02V03P8V DayDeaUpSmA02S02V03P8V A02DZ

{res}-> tabulation of DayDeaMeSmA02S02V03P8V  

{txt}DayDeaMeSmA {c |}
02S02V03P8V {c |}
  End Value {c |}      Freq.     Percent        Cum.
{hline 12}{c +}{hline 35}
   5.602275 {c |}{res}        545      100.00      100.00
{txt}{hline 12}{c +}{hline 35}
      Total {c |}{res}        545      100.00

-> tabulation of DayDeaLoSmA02S02V03P8V  

{txt}DayDeaLoSmA {c |}
02S02V03P8V {c |}
  End Value {c |}      Freq.     Percent        Cum.
{hline 12}{c +}{hline 35}
   1.526794 {c |}{res}        545      100.00      100.00
{txt}{hline 12}{c +}{hline 35}
      Total {c |}{res}        545      100.00

-> tabulation of DayDeaUpSmA02S02V03P8V  

{txt}DayDeaUpSmA {c |}
02S02V03P8V {c |}
  End Value {c |}      Freq.     Percent        Cum.
{hline 12}{c +}{hline 35}
   12.82915 {c |}{res}        545      100.00      100.00
{txt}{hline 12}{c +}{hline 35}
      Total {c |}{res}        545      100.00

-> tabulation of A02DZ  

      {txt}A02DZ {c |}      Freq.     Percent        Cum.
{hline 12}{c +}{hline 35}
  01Aug2021 {c |}{res}        545      100.00      100.00
{txt}{hline 12}{c +}{hline 35}
      Total {c |}{res}        545      100.00
{txt}
{com}. 
. 
. 
. 
. * S3 Worse estiamtes 
. 
. * fourth peak 
. 
. summ DayDeaMeSmA02S03V03 if date > td(01apr2021) 

{txt}    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayDeaMeSm.. {c |}{res}        122    123.6265    47.71397   41.41245   188.9497
{txt}
{com}. 
. gen DayDeaMeSmA02S03V03P4V = r(max)
{txt}
{com}. 
. label var DayDeaMeSmA02S03V03P4V "DayDeaMeSmA02S03V03P4V Peak 4 Value"
{txt}
{com}. 
. summ date if DayDeaMeSmA02S03V03 == DayDeaMeSmA02S03V03P4V & date > td(01mar2021) 

{txt}    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
{space 8}date {c |}{res}          1       22404           .      22404      22404
{txt}
{com}. 
. gen DayDeaMeSmA02S03V03P4D = r(max)
{txt}
{com}. 
. label var DayDeaMeSmA02S03V03P4D "DayDeaMeSmA02S03V03P4V Peak 4 Date"
{txt}
{com}. 
. format DayDeaMeSmA02S03V03P4D %tdDDMonCCYY
{txt}
{com}. 
. summ DayDeaLoSmA02S03V03 if date == DayDeaMeSmA02S03V03P4D

{txt}    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayDeaLoSm.. {c |}{res}          1     133.526           .    133.526    133.526
{txt}
{com}. 
. gen DayDeaLoSmA02S03V03P4V = r(max)
{txt}
{com}. 
. label var DayDeaLoSmA02S03V03P4V "DayDeaLoSmA02S03V03 Peak 4 Value"
{txt}
{com}. 
. summ DayDeaUpSmA02S03V03 if date == DayDeaMeSmA02S03V03P4D

{txt}    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayDeaUpSm.. {c |}{res}          1    270.5503           .   270.5503   270.5503
{txt}
{com}. 
. gen DayDeaUpSmA02S03V03P4V = r(max)
{txt}
{com}. 
. label var DayDeaUpSmA02S03V03P4V "DayDeaUpSmA02S03V03 Peak 4 Value"
{txt}
{com}. 
. tab1 DayDeaMeSmA02S03V03P4V DayDeaLoSmA02S03V03P4V DayDeaUpSmA02S03V03P4V DayDeaMeSmA02S03V03P4D

{res}-> tabulation of DayDeaMeSmA02S03V03P4V  

{txt}DayDeaMeSmA {c |}
02S03V03P4V {c |}
     Peak 4 {c |}
      Value {c |}      Freq.     Percent        Cum.
{hline 12}{c +}{hline 35}
   188.9497 {c |}{res}        545      100.00      100.00
{txt}{hline 12}{c +}{hline 35}
      Total {c |}{res}        545      100.00

-> tabulation of DayDeaLoSmA02S03V03P4V  

{txt}DayDeaLoSmA {c |}
   02S03V03 {c |}
     Peak 4 {c |}
      Value {c |}      Freq.     Percent        Cum.
{hline 12}{c +}{hline 35}
    133.526 {c |}{res}        545      100.00      100.00
{txt}{hline 12}{c +}{hline 35}
      Total {c |}{res}        545      100.00

-> tabulation of DayDeaUpSmA02S03V03P4V  

{txt}DayDeaUpSmA {c |}
   02S03V03 {c |}
     Peak 4 {c |}
      Value {c |}      Freq.     Percent        Cum.
{hline 12}{c +}{hline 35}
   270.5503 {c |}{res}        545      100.00      100.00
{txt}{hline 12}{c +}{hline 35}
      Total {c |}{res}        545      100.00

-> tabulation of DayDeaMeSmA02S03V03P4D  

{txt}DayDeaMeSmA {c |}
02S03V03P4V {c |}
Peak 4 Date {c |}      Freq.     Percent        Cum.
{hline 12}{c +}{hline 35}
  04May2021 {c |}{res}        545      100.00      100.00
{txt}{hline 12}{c +}{hline 35}
      Total {c |}{res}        545      100.00
{txt}
{com}. 
. 
. 
. * end date avialable (P8)
. 
. summ DayDeaMeSmA02S03V03 if date == A02DZ

{txt}    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayDeaMeSm.. {c |}{res}          1    41.41245           .   41.41245   41.41245
{txt}
{com}. 
. gen DayDeaMeSmA02S03V03P8V = r(max) 
{txt}
{com}. 
. label var DayDeaMeSmA02S03V03P8V "DayDeaMeSmA02S03V03 End Value"
{txt}
{com}. 
. summ DayDeaLoSmA02S03V03 if date == A02DZ

{txt}    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayDeaLoSm.. {c |}{res}          1    22.60705           .   22.60705   22.60705
{txt}
{com}. 
. gen DayDeaLoSmA02S03V03P8V = r(max) 
{txt}
{com}. 
. label var DayDeaLoSmA02S03V03P8V "DayDeaLoSmA02S03V03 End Value"
{txt}
{com}. 
. summ DayDeaUpSmA02S03V03 if date == A02DZ

{txt}    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayDeaUpSm.. {c |}{res}          1    69.73744           .   69.73744   69.73744
{txt}
{com}. 
. gen DayDeaUpSmA02S03V03P8V = r(max) 
{txt}
{com}. 
. label var DayDeaUpSmA02S03V03P8V "DayDeaUpSmA02S03V03 End Value" 
{txt}
{com}. 
. format A02DZ %tdDDMonCCYY
{txt}
{com}. 
. tab1 DayDeaMeSmA02S03V03P8V DayDeaLoSmA02S03V03P8V DayDeaUpSmA02S03V03P8V A02DZ

{res}-> tabulation of DayDeaMeSmA02S03V03P8V  

{txt}DayDeaMeSmA {c |}
   02S03V03 {c |}
  End Value {c |}      Freq.     Percent        Cum.
{hline 12}{c +}{hline 35}
   41.41245 {c |}{res}        545      100.00      100.00
{txt}{hline 12}{c +}{hline 35}
      Total {c |}{res}        545      100.00

-> tabulation of DayDeaLoSmA02S03V03P8V  

{txt}DayDeaLoSmA {c |}
   02S03V03 {c |}
  End Value {c |}      Freq.     Percent        Cum.
{hline 12}{c +}{hline 35}
   22.60705 {c |}{res}        545      100.00      100.00
{txt}{hline 12}{c +}{hline 35}
      Total {c |}{res}        545      100.00

-> tabulation of DayDeaUpSmA02S03V03P8V  

{txt}DayDeaUpSmA {c |}
   02S03V03 {c |}
  End Value {c |}      Freq.     Percent        Cum.
{hline 12}{c +}{hline 35}
   69.73744 {c |}{res}        545      100.00      100.00
{txt}{hline 12}{c +}{hline 35}
      Total {c |}{res}        545      100.00

-> tabulation of A02DZ  

      {txt}A02DZ {c |}      Freq.     Percent        Cum.
{hline 12}{c +}{hline 35}
  01Aug2021 {c |}{res}        545      100.00      100.00
{txt}{hline 12}{c +}{hline 35}
      Total {c |}{res}        545      100.00
{txt}
{com}. 
. 
. 
. 
. 
. 
. *************************************
. 
. * Locate peak dates and values - cases 
. 
. 
. * S1 Reference
. 
. * first peak
. 
. summ DayCasMeRaA02S01V03 if date > td(01mar2020) & date < td(30may2020) 

{txt}    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayCasM~1V03 {c |}{res}         89    18893.78    4760.254   13328.39   27633.38
{txt}
{com}. 
. gen DayCasMeRaA02S01V03P1V = r(max)
{txt}
{com}. 
. summ date if DayCasMeRaA02S01V03 == DayCasMeRaA02S01V03P1V & date > td(01mar2020) & date < td(30may2020) 

{txt}    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
{space 8}date {c |}{res}          1       21984           .      21984      21984
{txt}
{com}. 
. gen DayCasMeRaA02S01V03P1D = r(max)
{txt}
{com}. 
. summ DayCasLoRaA02S01V03 if date == DayCasMeRaA02S01V03P1D

{txt}    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayCasL~1V03 {c |}{res}          1    20065.32           .   20065.32   20065.32
{txt}
{com}. 
. gen DayCasLoRaA02S01V03P1V = r(max)
{txt}
{com}. 
. summ DayCasUpRaA02S01V03 if date == DayCasMeRaA02S01V03P1D

{txt}    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayCasU~1V03 {c |}{res}          1    34975.21           .   34975.21   34975.21
{txt}
{com}. 
. gen DayCasUpRaA02S01V03P1V = r(max)
{txt}
{com}. 
. label var DayCasMeRaA02S01V03P1V "DayCasMeRaA02S01V03P1V Peak 1 Value"
{txt}
{com}. label var DayCasMeRaA02S01V03P1D "DayCasMeRaA02S01V03P1D Peak 1 Date"
{txt}
{com}. label var DayCasLoRaA02S01V03P1V "DayCasLoRaA02S01V03P1V Peak 1 Value"
{txt}
{com}. label var DayCasUpRaA02S01V03P1V "DayCasUpRaA02S01V03P1V Peak 1 Value"
{txt}
{com}. format DayCasMeRaA02S01V03P1D %tdDDMonCCYY
{txt}
{com}. 
. tab1 DayCasMeRaA02S01V03P1V DayCasLoRaA02S01V03P1V DayCasUpRaA02S01V03P1V DayCasMeRaA02S01V03P1D

{res}-> tabulation of DayCasMeRaA02S01V03P1V  

{txt}DayCasMeRaA {c |}
02S01V03P1V {c |}
     Peak 1 {c |}
      Value {c |}      Freq.     Percent        Cum.
{hline 12}{c +}{hline 35}
   27633.38 {c |}{res}        545      100.00      100.00
{txt}{hline 12}{c +}{hline 35}
      Total {c |}{res}        545      100.00

-> tabulation of DayCasLoRaA02S01V03P1V  

{txt}DayCasLoRaA {c |}
02S01V03P1V {c |}
     Peak 1 {c |}
      Value {c |}      Freq.     Percent        Cum.
{hline 12}{c +}{hline 35}
   20065.32 {c |}{res}        545      100.00      100.00
{txt}{hline 12}{c +}{hline 35}
      Total {c |}{res}        545      100.00

-> tabulation of DayCasUpRaA02S01V03P1V  

{txt}DayCasUpRaA {c |}
02S01V03P1V {c |}
     Peak 1 {c |}
      Value {c |}      Freq.     Percent        Cum.
{hline 12}{c +}{hline 35}
   34975.21 {c |}{res}        545      100.00      100.00
{txt}{hline 12}{c +}{hline 35}
      Total {c |}{res}        545      100.00

-> tabulation of DayCasMeRaA02S01V03P1D  

{txt}DayCasMeRaA {c |}
02S01V03P1D {c |}
Peak 1 Date {c |}      Freq.     Percent        Cum.
{hline 12}{c +}{hline 35}
  10Mar2020 {c |}{res}        545      100.00      100.00
{txt}{hline 12}{c +}{hline 35}
      Total {c |}{res}        545      100.00
{txt}
{com}. 
. 
. * second peak 
. 
. summ DayCasMeRaA02S01V03 if date > td(01jun2020) & date < td(30aug2020)

{txt}    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayCasM~1V03 {c |}{res}         89    26549.23    1901.304   23975.91   29412.52
{txt}
{com}. 
. gen DayCasMeRaA02S01V03P2V = r(max)
{txt}
{com}. 
. summ date if DayCasMeRaA02S01V03 == DayCasMeRaA02S01V03P2V & date > td(01jun2020) & date < td(30aug2020) 

{txt}    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
{space 8}date {c |}{res}          1       22093           .      22093      22093
{txt}
{com}. 
. gen DayCasMeRaA02S01V03P2D = r(max)
{txt}
{com}. 
. summ DayCasLoRaA02S01V03 if date == DayCasMeRaA02S01V03P2D

{txt}    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayCasL~1V03 {c |}{res}          1    21246.96           .   21246.96   21246.96
{txt}
{com}. 
. gen DayCasLoRaA02S01V03P2V = r(max)
{txt}
{com}. 
. summ DayCasUpRaA02S01V03 if date == DayCasMeRaA02S01V03P2D

{txt}    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayCasU~1V03 {c |}{res}          1    40451.97           .   40451.97   40451.97
{txt}
{com}. 
. gen DayCasUpRaA02S01V03P2V = r(max)
{txt}
{com}. 
. label var DayCasMeRaA02S01V03P2V "DayCasMeRaA02S01V03P2V Peak 2 Value"
{txt}
{com}. label var DayCasMeRaA02S01V03P2D "DayCasMeRaA02S01V03P2D Peak 2 Date"
{txt}
{com}. label var DayCasLoRaA02S01V03P2V "DayCasLoRaA02S01V03P2V Peak 2 Value"
{txt}
{com}. label var DayCasUpRaA02S01V03P2V "DayCasUpRaA02S01V03P2V Peak 2 Value"
{txt}
{com}. format DayCasMeRaA02S01V03P2D %tdDDMonCCYY
{txt}
{com}. 
. tab1 DayCasMeRaA02S01V03P2V DayCasLoRaA02S01V03P2V DayCasUpRaA02S01V03P2V DayCasMeRaA02S01V03P2D

{res}-> tabulation of DayCasMeRaA02S01V03P2V  

{txt}DayCasMeRaA {c |}
02S01V03P2V {c |}
     Peak 2 {c |}
      Value {c |}      Freq.     Percent        Cum.
{hline 12}{c +}{hline 35}
   29412.52 {c |}{res}        545      100.00      100.00
{txt}{hline 12}{c +}{hline 35}
      Total {c |}{res}        545      100.00

-> tabulation of DayCasLoRaA02S01V03P2V  

{txt}DayCasLoRaA {c |}
02S01V03P2V {c |}
     Peak 2 {c |}
      Value {c |}      Freq.     Percent        Cum.
{hline 12}{c +}{hline 35}
   21246.96 {c |}{res}        545      100.00      100.00
{txt}{hline 12}{c +}{hline 35}
      Total {c |}{res}        545      100.00

-> tabulation of DayCasUpRaA02S01V03P2V  

{txt}DayCasUpRaA {c |}
02S01V03P2V {c |}
     Peak 2 {c |}
      Value {c |}      Freq.     Percent        Cum.
{hline 12}{c +}{hline 35}
   40451.97 {c |}{res}        545      100.00      100.00
{txt}{hline 12}{c +}{hline 35}
      Total {c |}{res}        545      100.00

-> tabulation of DayCasMeRaA02S01V03P2D  

{txt}DayCasMeRaA {c |}
02S01V03P2D {c |}
Peak 2 Date {c |}      Freq.     Percent        Cum.
{hline 12}{c +}{hline 35}
  27Jun2020 {c |}{res}        545      100.00      100.00
{txt}{hline 12}{c +}{hline 35}
      Total {c |}{res}        545      100.00
{txt}
{com}. 
. 
. * third peak 
. 
. summ DayCasMeRaA02S01V03 if date > td(01oct2020) & date < td(30nov2020) 

{txt}    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayCasM~1V03 {c |}{res}         59    67981.15    9290.353   48684.77   79374.28
{txt}
{com}. 
. gen DayCasMeRaA02S01V03P3V = r(max)
{txt}
{com}. 
. summ date if DayCasMeRaA02S01V03 == DayCasMeRaA02S01V03P3V & date > td(01oct2020) & date < td(30nov2020) 

{txt}    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
{space 8}date {c |}{res}          1       22219           .      22219      22219
{txt}
{com}. 
. gen DayCasMeRaA02S01V03P3D = r(max)
{txt}
{com}. 
. summ DayCasLoRaA02S01V03 if date == DayCasMeRaA02S01V03P3D 

{txt}    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayCasL~1V03 {c |}{res}          1    61216.72           .   61216.72   61216.72
{txt}
{com}. 
. gen DayCasLoRaA02S01V03P3V = r(max)
{txt}
{com}. 
. summ DayCasUpRaA02S01V03 if date == DayCasMeRaA02S01V03P3D

{txt}    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayCasU~1V03 {c |}{res}          1    102796.3           .   102796.3   102796.3
{txt}
{com}. 
. gen DayCasUpRaA02S01V03P3V = r(max)
{txt}
{com}. 
. label var DayCasMeRaA02S01V03P3V "DayCasMeRaA02S01V03P3V Peak 3 Value"
{txt}
{com}. label var DayCasMeRaA02S01V03P3D "DayCasMeRaA02S01V03P3D Peak 3 Date"
{txt}
{com}. label var DayCasLoRaA02S01V03P3V "DayCasLoRaA02S01V03P3V Peak 3 Value"
{txt}
{com}. label var DayCasUpRaA02S01V03P3V "DayCasUpRaA02S01V03P3V Peak 3 Value"
{txt}
{com}. format DayCasMeRaA02S01V03P3D %tdDDMonCCYY
{txt}
{com}. 
. tab1 DayCasMeRaA02S01V03P3V DayCasLoRaA02S01V03P3V DayCasUpRaA02S01V03P3V DayCasMeRaA02S01V03P3D

{res}-> tabulation of DayCasMeRaA02S01V03P3V  

{txt}DayCasMeRaA {c |}
02S01V03P3V {c |}
     Peak 3 {c |}
      Value {c |}      Freq.     Percent        Cum.
{hline 12}{c +}{hline 35}
   79374.28 {c |}{res}        545      100.00      100.00
{txt}{hline 12}{c +}{hline 35}
      Total {c |}{res}        545      100.00

-> tabulation of DayCasLoRaA02S01V03P3V  

{txt}DayCasLoRaA {c |}
02S01V03P3V {c |}
     Peak 3 {c |}
      Value {c |}      Freq.     Percent        Cum.
{hline 12}{c +}{hline 35}
   61216.72 {c |}{res}        545      100.00      100.00
{txt}{hline 12}{c +}{hline 35}
      Total {c |}{res}        545      100.00

-> tabulation of DayCasUpRaA02S01V03P3V  

{txt}DayCasUpRaA {c |}
02S01V03P3V {c |}
     Peak 3 {c |}
      Value {c |}      Freq.     Percent        Cum.
{hline 12}{c +}{hline 35}
   102796.3 {c |}{res}        545      100.00      100.00
{txt}{hline 12}{c +}{hline 35}
      Total {c |}{res}        545      100.00

-> tabulation of DayCasMeRaA02S01V03P3D  

{txt}DayCasMeRaA {c |}
02S01V03P3D {c |}
Peak 3 Date {c |}      Freq.     Percent        Cum.
{hline 12}{c +}{hline 35}
  31Oct2020 {c |}{res}        545      100.00      100.00
{txt}{hline 12}{c +}{hline 35}
      Total {c |}{res}        545      100.00
{txt}
{com}. 
. 
. * fourth peak
. 
. summ DayCasMeRaA02S01V03 if date > td(01mar2021) 

{txt}    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayCasM~1V03 {c |}{res}        153    31716.61    14526.58    8218.17   52738.98
{txt}
{com}. 
. gen DayCasMeRaA02S01V03P4V = r(max)
{txt}
{com}. 
. summ date if DayCasMeRaA02S01V03 == DayCasMeRaA02S01V03P4V & date > td(01jan2021) 

{txt}    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
{space 8}date {c |}{res}          1       22384           .      22384      22384
{txt}
{com}. 
. gen DayCasMeRaA02S01V03P4D = r(max)
{txt}
{com}. 
. summ DayCasLoRaA02S01V03 if date == DayCasMeRaA02S01V03P4D

{txt}    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayCasL~1V03 {c |}{res}          1    38071.84           .   38071.84   38071.84
{txt}
{com}. 
. gen DayCasLoRaA02S01V03P4V = r(max)
{txt}
{com}. 
. summ DayCasUpRaA02S01V03 if date == DayCasMeRaA02S01V03P4D

{txt}    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayCasU~1V03 {c |}{res}          1    75387.16           .   75387.16   75387.16
{txt}
{com}. 
. gen DayCasUpRaA02S01V03P4V = r(max)
{txt}
{com}. 
. label var DayCasMeRaA02S01V03P4V "DayCasMeRaA02S01V03P4V Peak 4 Value"
{txt}
{com}. label var DayCasMeRaA02S01V03P4D "DayCasMeRaA02S01V03P4D Peak 4 Date"
{txt}
{com}. label var DayCasLoRaA02S01V03P4V "DayCasLoRaA02S01V03P4V Peak 4 Value"
{txt}
{com}. label var DayCasUpRaA02S01V03P4V "DayCasUpRaA02S01V03P4V Peak 4 Value"
{txt}
{com}. format DayCasMeRaA02S01V03P4D %tdDDMonCCYY
{txt}
{com}. 
. tab1 DayCasMeRaA02S01V03P4V DayCasLoRaA02S01V03P4V DayCasUpRaA02S01V03P4V DayCasMeRaA02S01V03P4D

{res}-> tabulation of DayCasMeRaA02S01V03P4V  

{txt}DayCasMeRaA {c |}
02S01V03P4V {c |}
     Peak 4 {c |}
      Value {c |}      Freq.     Percent        Cum.
{hline 12}{c +}{hline 35}
   52738.98 {c |}{res}        545      100.00      100.00
{txt}{hline 12}{c +}{hline 35}
      Total {c |}{res}        545      100.00

-> tabulation of DayCasLoRaA02S01V03P4V  

{txt}DayCasLoRaA {c |}
02S01V03P4V {c |}
     Peak 4 {c |}
      Value {c |}      Freq.     Percent        Cum.
{hline 12}{c +}{hline 35}
   38071.84 {c |}{res}        545      100.00      100.00
{txt}{hline 12}{c +}{hline 35}
      Total {c |}{res}        545      100.00

-> tabulation of DayCasUpRaA02S01V03P4V  

{txt}DayCasUpRaA {c |}
02S01V03P4V {c |}
     Peak 4 {c |}
      Value {c |}      Freq.     Percent        Cum.
{hline 12}{c +}{hline 35}
   75387.16 {c |}{res}        545      100.00      100.00
{txt}{hline 12}{c +}{hline 35}
      Total {c |}{res}        545      100.00

-> tabulation of DayCasMeRaA02S01V03P4D  

{txt}DayCasMeRaA {c |}
02S01V03P4D {c |}
Peak 4 Date {c |}      Freq.     Percent        Cum.
{hline 12}{c +}{hline 35}
  14Apr2021 {c |}{res}        545      100.00      100.00
{txt}{hline 12}{c +}{hline 35}
      Total {c |}{res}        545      100.00
{txt}
{com}. 
. 
. * end date avialable (P8)
. 
. summ DayCasMeRaA02S01V03 if date == A02DZ

{txt}    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayCasM~1V03 {c |}{res}          1     8218.17           .    8218.17    8218.17
{txt}
{com}. 
. gen DayCasMeRaA02S01V03P8V = r(max)
{txt}
{com}. 
. summ DayCasLoRaA02S01V03 if date == A02DZ

{txt}    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayCasL~1V03 {c |}{res}          1    2928.243           .   2928.243   2928.243
{txt}
{com}. 
. gen DayCasLoRaA02S01V03P8V = r(max)
{txt}
{com}. 
. summ DayCasUpRaA02S01V03 if date == A02DZ

{txt}    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayCasU~1V03 {c |}{res}          1    16967.09           .   16967.09   16967.09
{txt}
{com}. 
. gen DayCasUpRaA02S01V03P8V = r(max)
{txt}
{com}. 
. label var A02DZ "A02 End date"
{txt}
{com}. label var DayCasMeRaA02S01V03P8V "DayCasMeRaA02S01V03 End Value"
{txt}
{com}. label var DayCasLoRaA02S01V03P8V "DayCasLoRaA02S01V03 End Value"
{txt}
{com}. label var DayCasUpRaA02S01V03P8V "DayCasUpRaA02S01V03 End Value"
{txt}
{com}. format A02DZ %tdDDMonCCYY
{txt}
{com}. 
. tab1 DayCasMeRaA02S01V03P8V DayCasLoRaA02S01V03P8V DayCasUpRaA02S01V03P8V A02DZ

{res}-> tabulation of DayCasMeRaA02S01V03P8V  

{txt}DayCasMeRaA {c |}
   02S01V03 {c |}
  End Value {c |}      Freq.     Percent        Cum.
{hline 12}{c +}{hline 35}
    8218.17 {c |}{res}        545      100.00      100.00
{txt}{hline 12}{c +}{hline 35}
      Total {c |}{res}        545      100.00

-> tabulation of DayCasLoRaA02S01V03P8V  

{txt}DayCasLoRaA {c |}
   02S01V03 {c |}
  End Value {c |}      Freq.     Percent        Cum.
{hline 12}{c +}{hline 35}
   2928.243 {c |}{res}        545      100.00      100.00
{txt}{hline 12}{c +}{hline 35}
      Total {c |}{res}        545      100.00

-> tabulation of DayCasUpRaA02S01V03P8V  

{txt}DayCasUpRaA {c |}
   02S01V03 {c |}
  End Value {c |}      Freq.     Percent        Cum.
{hline 12}{c +}{hline 35}
   16967.09 {c |}{res}        545      100.00      100.00
{txt}{hline 12}{c +}{hline 35}
      Total {c |}{res}        545      100.00

-> tabulation of A02DZ  

    {txt}A02 End {c |}
       date {c |}      Freq.     Percent        Cum.
{hline 12}{c +}{hline 35}
  01Aug2021 {c |}{res}        545      100.00      100.00
{txt}{hline 12}{c +}{hline 35}
      Total {c |}{res}        545      100.00
{txt}
{com}. 
. 
. 
. * S2 Best
. 
. 
. * fourth peak
. 
. summ DayCasMeRaA02S02V03 if date > td(01apr2021) 

{txt}    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayCasM~2V03 {c |}{res}        121    13418.09    14402.46   1026.048   50769.68
{txt}
{com}. 
. gen DayCasMeRaA02S02V03P4V = r(max)
{txt}
{com}. 
. summ date if DayCasMeRaA02S02V03 == DayCasMeRaA02S02V03P4V & date > td(01jan2021) 

{txt}    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
{space 8}date {c |}{res}          1       22375           .      22375      22375
{txt}
{com}. 
. gen DayCasMeRaA02S02V03P4D = r(max)
{txt}
{com}. 
. summ DayCasLoRaA02S02V03 if date == DayCasMeRaA02S02V03P4D

{txt}    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayCasL~2V03 {c |}{res}          1    37719.84           .   37719.84   37719.84
{txt}
{com}. 
. gen DayCasLoRaA02S02V03P4V = r(max)
{txt}
{com}. 
. summ DayCasUpRaA02S02V03 if date == DayCasMeRaA02S02V03P4D

{txt}    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayCasU~2V03 {c |}{res}          1       68945           .      68945      68945
{txt}
{com}. 
. gen DayCasUpRaA02S02V03P4V = r(max)
{txt}
{com}. 
. label var DayCasMeRaA02S02V03P4V "DayCasMeRaA02S01V03P4V Peak 4 Value"
{txt}
{com}. label var DayCasMeRaA02S02V03P4D "DayCasMeRaA02S01V03P4D Peak 4 Date"
{txt}
{com}. label var DayCasLoRaA02S02V03P4V "DayCasLoRaA02S01V03P4V Peak 4 Value"
{txt}
{com}. label var DayCasUpRaA02S02V03P4V "DayCasUpRaA02S01V03P4V Peak 4 Value"
{txt}
{com}. format DayCasMeRaA02S02V03P4D %tdDDMonCCYY
{txt}
{com}. 
. tab1 DayCasMeRaA02S02V03P4V DayCasLoRaA02S02V03P4V DayCasUpRaA02S02V03P4V DayCasMeRaA02S02V03P4D

{res}-> tabulation of DayCasMeRaA02S02V03P4V  

{txt}DayCasMeRaA {c |}
02S01V03P4V {c |}
     Peak 4 {c |}
      Value {c |}      Freq.     Percent        Cum.
{hline 12}{c +}{hline 35}
   50769.68 {c |}{res}        545      100.00      100.00
{txt}{hline 12}{c +}{hline 35}
      Total {c |}{res}        545      100.00

-> tabulation of DayCasLoRaA02S02V03P4V  

{txt}DayCasLoRaA {c |}
02S01V03P4V {c |}
     Peak 4 {c |}
      Value {c |}      Freq.     Percent        Cum.
{hline 12}{c +}{hline 35}
   37719.84 {c |}{res}        545      100.00      100.00
{txt}{hline 12}{c +}{hline 35}
      Total {c |}{res}        545      100.00

-> tabulation of DayCasUpRaA02S02V03P4V  

{txt}DayCasUpRaA {c |}
02S01V03P4V {c |}
     Peak 4 {c |}
      Value {c |}      Freq.     Percent        Cum.
{hline 12}{c +}{hline 35}
      68945 {c |}{res}        545      100.00      100.00
{txt}{hline 12}{c +}{hline 35}
      Total {c |}{res}        545      100.00

-> tabulation of DayCasMeRaA02S02V03P4D  

{txt}DayCasMeRaA {c |}
02S01V03P4D {c |}
Peak 4 Date {c |}      Freq.     Percent        Cum.
{hline 12}{c +}{hline 35}
  05Apr2021 {c |}{res}        545      100.00      100.00
{txt}{hline 12}{c +}{hline 35}
      Total {c |}{res}        545      100.00
{txt}
{com}. 
. 
. * end date avialable (P8)
. 
. summ DayCasMeRaA02S02V03 if date == A02DZ

{txt}    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayCasM~2V03 {c |}{res}          1    1026.048           .   1026.048   1026.048
{txt}
{com}. 
. gen DayCasMeRaA02S02V03P8V = r(max)
{txt}
{com}. 
. summ DayCasLoRaA02S02V03 if date == A02DZ

{txt}    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayCasL~2V03 {c |}{res}          1    123.6742           .   123.6742   123.6742
{txt}
{com}. 
. gen DayCasLoRaA02S02V03P8V = r(max)
{txt}
{com}. 
. summ DayCasUpRaA02S02V03 if date == A02DZ

{txt}    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayCasU~2V03 {c |}{res}          1    2898.519           .   2898.519   2898.519
{txt}
{com}. 
. gen DayCasUpRaA02S02V03P8V = r(max)
{txt}
{com}. 
. label var DayCasMeRaA02S02V03P8V "DayCasMeRaA02S02V03 End Value"
{txt}
{com}. label var DayCasLoRaA02S02V03P8V "DayCasLoRaA02S02V03 End Value"
{txt}
{com}. label var DayCasUpRaA02S02V03P8V "DayCasUpRaA02S02V03 End Value"
{txt}
{com}. 
. tab1 DayCasMeRaA02S02V03P8V DayCasLoRaA02S02V03P8V DayCasUpRaA02S02V03P8V A02DZ

{res}-> tabulation of DayCasMeRaA02S02V03P8V  

{txt}DayCasMeRaA {c |}
   02S02V03 {c |}
  End Value {c |}      Freq.     Percent        Cum.
{hline 12}{c +}{hline 35}
   1026.048 {c |}{res}        545      100.00      100.00
{txt}{hline 12}{c +}{hline 35}
      Total {c |}{res}        545      100.00

-> tabulation of DayCasLoRaA02S02V03P8V  

{txt}DayCasLoRaA {c |}
   02S02V03 {c |}
  End Value {c |}      Freq.     Percent        Cum.
{hline 12}{c +}{hline 35}
   123.6742 {c |}{res}        545      100.00      100.00
{txt}{hline 12}{c +}{hline 35}
      Total {c |}{res}        545      100.00

-> tabulation of DayCasUpRaA02S02V03P8V  

{txt}DayCasUpRaA {c |}
   02S02V03 {c |}
  End Value {c |}      Freq.     Percent        Cum.
{hline 12}{c +}{hline 35}
   2898.519 {c |}{res}        545      100.00      100.00
{txt}{hline 12}{c +}{hline 35}
      Total {c |}{res}        545      100.00

-> tabulation of A02DZ  

    {txt}A02 End {c |}
       date {c |}      Freq.     Percent        Cum.
{hline 12}{c +}{hline 35}
  01Aug2021 {c |}{res}        545      100.00      100.00
{txt}{hline 12}{c +}{hline 35}
      Total {c |}{res}        545      100.00
{txt}
{com}. 
. 
. * S3 Worse estiamtes 
. 
. 
. * fourth peak
. 
. summ DayCasMeRaA02S03V03 if date > td(01mar2021) 

{txt}    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayCasM~3V03 {c |}{res}        121    30952.23    14964.24   10107.13   52781.04
{txt}
{com}. 
. gen DayCasMeRaA02S03V03P4V = r(max)
{txt}
{com}. 
. summ date if DayCasMeRaA02S03V03 == DayCasMeRaA02S03V03P4V & date > td(01mar2021) 

{txt}    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
{space 8}date {c |}{res}          1       22384           .      22384      22384
{txt}
{com}. 
. gen DayCasMeRaA02S03V03P4D = r(max)
{txt}
{com}. 
. summ DayCasLoRaA02S03V03 if date == DayCasMeRaA02S03V03P4D

{txt}    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayCasL~3V03 {c |}{res}          1    38101.77           .   38101.77   38101.77
{txt}
{com}. 
. gen DayCasLoRaA02S03V03P4V = r(max)
{txt}
{com}. 
. summ DayCasUpRaA02S03V03 if date == DayCasMeRaA02S03V03P4D

{txt}    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayCasU~3V03 {c |}{res}          1    75443.75           .   75443.75   75443.75
{txt}
{com}. 
. gen DayCasUpRaA02S03V03P4V = r(max)
{txt}
{com}. 
. label var DayCasMeRaA02S03V03P4V "DayCasMeRaA02S01V03P4V Peak 4 Value"
{txt}
{com}. label var DayCasMeRaA02S03V03P4D "DayCasMeRaA02S01V03P4D Peak 4 Date"
{txt}
{com}. label var DayCasLoRaA02S03V03P4V "DayCasLoRaA02S01V03P4V Peak 4 Value"
{txt}
{com}. label var DayCasUpRaA02S03V03P4V "DayCasUpRaA02S01V03P4V Peak 4 Value"
{txt}
{com}. format DayCasMeRaA02S03V03P4D %tdDDMonCCYY
{txt}
{com}. 
. tab1 DayCasMeRaA02S03V03P4V DayCasLoRaA02S03V03P4V DayCasUpRaA02S03V03P4V DayCasMeRaA02S03V03P4D

{res}-> tabulation of DayCasMeRaA02S03V03P4V  

{txt}DayCasMeRaA {c |}
02S01V03P4V {c |}
     Peak 4 {c |}
      Value {c |}      Freq.     Percent        Cum.
{hline 12}{c +}{hline 35}
   52781.04 {c |}{res}        545      100.00      100.00
{txt}{hline 12}{c +}{hline 35}
      Total {c |}{res}        545      100.00

-> tabulation of DayCasLoRaA02S03V03P4V  

{txt}DayCasLoRaA {c |}
02S01V03P4V {c |}
     Peak 4 {c |}
      Value {c |}      Freq.     Percent        Cum.
{hline 12}{c +}{hline 35}
   38101.77 {c |}{res}        545      100.00      100.00
{txt}{hline 12}{c +}{hline 35}
      Total {c |}{res}        545      100.00

-> tabulation of DayCasUpRaA02S03V03P4V  

{txt}DayCasUpRaA {c |}
02S01V03P4V {c |}
     Peak 4 {c |}
      Value {c |}      Freq.     Percent        Cum.
{hline 12}{c +}{hline 35}
   75443.75 {c |}{res}        545      100.00      100.00
{txt}{hline 12}{c +}{hline 35}
      Total {c |}{res}        545      100.00

-> tabulation of DayCasMeRaA02S03V03P4D  

{txt}DayCasMeRaA {c |}
02S01V03P4D {c |}
Peak 4 Date {c |}      Freq.     Percent        Cum.
{hline 12}{c +}{hline 35}
  14Apr2021 {c |}{res}        545      100.00      100.00
{txt}{hline 12}{c +}{hline 35}
      Total {c |}{res}        545      100.00
{txt}
{com}. 
. 
. * end date avialable (P8)
. 
. summ DayCasMeRaA02S03V03 if date == A02DZ

{txt}    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayCasM~3V03 {c |}{res}          1    10107.13           .   10107.13   10107.13
{txt}
{com}. 
. gen DayCasMeRaA02S03V03P8V = r(max)
{txt}
{com}. 
. summ DayCasLoRaA02S03V03 if date == A02DZ

{txt}    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayCasL~3V03 {c |}{res}          1    3809.769           .   3809.769   3809.769
{txt}
{com}. 
. gen DayCasLoRaA02S03V03P8V = r(max)
{txt}
{com}. 
. summ DayCasUpRaA02S03V03 if date == A02DZ

{txt}    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayCasU~3V03 {c |}{res}          1    20294.44           .   20294.44   20294.44
{txt}
{com}. 
. gen DayCasUpRaA02S03V03P8V = r(max)
{txt}
{com}. 
. label var DayCasMeRaA02S03V03P8V "DayCasMeRaA02S03V03 End Value"
{txt}
{com}. label var DayCasLoRaA02S03V03P8V "DayCasLoRaA02S03V03 End Value"
{txt}
{com}. label var DayCasUpRaA02S03V03P8V "DayCasUpRaA02S03V03 End Value"
{txt}
{com}. format A02DZ %tdDDMonCCYY
{txt}
{com}. 
. tab1 DayCasMeRaA02S03V03P8V DayCasLoRaA02S03V03P8V DayCasUpRaA02S03V03P8V A02DZ

{res}-> tabulation of DayCasMeRaA02S03V03P8V  

{txt}DayCasMeRaA {c |}
   02S03V03 {c |}
  End Value {c |}      Freq.     Percent        Cum.
{hline 12}{c +}{hline 35}
   10107.13 {c |}{res}        545      100.00      100.00
{txt}{hline 12}{c +}{hline 35}
      Total {c |}{res}        545      100.00

-> tabulation of DayCasLoRaA02S03V03P8V  

{txt}DayCasLoRaA {c |}
   02S03V03 {c |}
  End Value {c |}      Freq.     Percent        Cum.
{hline 12}{c +}{hline 35}
   3809.769 {c |}{res}        545      100.00      100.00
{txt}{hline 12}{c +}{hline 35}
      Total {c |}{res}        545      100.00

-> tabulation of DayCasUpRaA02S03V03P8V  

{txt}DayCasUpRaA {c |}
   02S03V03 {c |}
  End Value {c |}      Freq.     Percent        Cum.
{hline 12}{c +}{hline 35}
   20294.44 {c |}{res}        545      100.00      100.00
{txt}{hline 12}{c +}{hline 35}
      Total {c |}{res}        545      100.00

-> tabulation of A02DZ  

    {txt}A02 End {c |}
       date {c |}      Freq.     Percent        Cum.
{hline 12}{c +}{hline 35}
  01Aug2021 {c |}{res}        545      100.00      100.00
{txt}{hline 12}{c +}{hline 35}
      Total {c |}{res}        545      100.00
{txt}
{com}. 
. 
. 
. drop location_id total_tests_data_type
{txt}
{com}. 
. 
. 
. sort date
{txt}
{com}. 
. compress
  {txt}variable {bf}DayDeaMeRaA02S01V03P1V{sf} was {bf}{res}float{sf}{txt} now {bf}{res}int{sf}
  {txt}variable {bf}DayDeaMeRaA02S01V03P1D{sf} was {bf}{res}float{sf}{txt} now {bf}{res}int{sf}
  {txt}variable {bf}DayDeaLoRaA02S01V03P1V{sf} was {bf}{res}float{sf}{txt} now {bf}{res}int{sf}
  {txt}variable {bf}DayDeaUpRaA02S01V03P1V{sf} was {bf}{res}float{sf}{txt} now {bf}{res}int{sf}
  {txt}variable {bf}DayDeaMeRaA02S01V03P2V{sf} was {bf}{res}float{sf}{txt} now {bf}{res}int{sf}
  {txt}variable {bf}DayDeaMeRaA02S01V03P2D{sf} was {bf}{res}float{sf}{txt} now {bf}{res}int{sf}
  {txt}variable {bf}DayDeaLoRaA02S01V03P2V{sf} was {bf}{res}float{sf}{txt} now {bf}{res}int{sf}
  {txt}variable {bf}DayDeaUpRaA02S01V03P2V{sf} was {bf}{res}float{sf}{txt} now {bf}{res}int{sf}
  {txt}variable {bf}DayDeaMeRaA02S01V03P3V{sf} was {bf}{res}float{sf}{txt} now {bf}{res}int{sf}
  {txt}variable {bf}DayDeaMeRaA02S01V03P3D{sf} was {bf}{res}float{sf}{txt} now {bf}{res}int{sf}
  {txt}variable {bf}DayDeaLoRaA02S01V03P3V{sf} was {bf}{res}float{sf}{txt} now {bf}{res}int{sf}
  {txt}variable {bf}DayDeaUpRaA02S01V03P3V{sf} was {bf}{res}float{sf}{txt} now {bf}{res}int{sf}
  {txt}variable {bf}DayDeaMeRaA02S01V03P4D{sf} was {bf}{res}float{sf}{txt} now {bf}{res}int{sf}
  {txt}variable {bf}A02DZ{sf} was {bf}{res}float{sf}{txt} now {bf}{res}int{sf}
  {txt}variable {bf}DayDeaMeSmA02S02V03P4D{sf} was {bf}{res}float{sf}{txt} now {bf}{res}int{sf}
  {txt}variable {bf}DayDeaMeSmA02S03V03P4D{sf} was {bf}{res}float{sf}{txt} now {bf}{res}int{sf}
  {txt}variable {bf}DayCasMeRaA02S01V03P1D{sf} was {bf}{res}float{sf}{txt} now {bf}{res}int{sf}
  {txt}variable {bf}DayCasMeRaA02S01V03P2D{sf} was {bf}{res}float{sf}{txt} now {bf}{res}int{sf}
  {txt}variable {bf}DayCasMeRaA02S01V03P3D{sf} was {bf}{res}float{sf}{txt} now {bf}{res}int{sf}
  {txt}variable {bf}DayCasMeRaA02S01V03P4D{sf} was {bf}{res}float{sf}{txt} now {bf}{res}int{sf}
  {txt}variable {bf}DayCasMeRaA02S02V03P4D{sf} was {bf}{res}float{sf}{txt} now {bf}{res}int{sf}
  {txt}variable {bf}DayCasMeRaA02S03V03P4D{sf} was {bf}{res}float{sf}{txt} now {bf}{res}int{sf}
{txt}  (23,980 bytes saved)

{com}. 
. save "Iran IHME.dta", replace
{txt}(note: file Iran IHME.dta not found)
file Iran IHME.dta saved

{com}. 
. 
. capture shell mv -f "2021_04_09" ~/.Trash
{txt}
{com}. 
. 
. 
. capture shell mv -f "2021_04_09" ~/.Trash
{txt}
{com}. 
. 
. 
. 
. 
. view "log Iran IHME.smcl"
{txt}
{com}. 
. log close
      {txt}name:  {res}<unnamed>
       {txt}log:  {res}/Users/farshadpourmalek/Downloads/covir2-main/20210413/code/IHME/log Iran IHME.smcl
  {txt}log type:  {res}smcl
 {txt}closed on:  {res}15 Apr 2021, 11:38:18
{txt}{.-}
{smcl}
{txt}{sf}{ul off}