{smcl}
{txt}{sf}{ul off}{.-}
      name:  {res}<unnamed>
       {txt}log:  {res}/Users/farshadpourmalek/Downloads/covir2-main/20220701/code/merge/log country merge.smcl
  {txt}log type:  {res}smcl
 {txt}opened on:  {res} 1 Jul 2022, 06:47:33
{txt}
{com}. 
. 
. ***************************************************************************
. * This is "do country merge.do"
. 
. * Project: CovidVisualized country - countries without subnational estimates
. * Person: Farshad Pourmalek pourmalek_farshad at yahoo dot com
. * Time (initial): 2021-02-10
. 
. * OBJECTIVE: Merge component studies' estimates for country, graphs
. ***************************************************************************
. 
. 
. 
. /* 
> 
> List of component studies:
> 
> JOHN A00
> 
> DELP A01
> IHME A02
> IMPE A03
> LANL A04 // The LANL COVID-19 Team made its last real-time forecast on September 27th, 2021. [for 20210926]. This is more than two weeks old and will not be used. 
> SRIV A05 
> 
> */
. 
. 
. clear 
{txt}
{com}. 
. * JOHN
. 
. if regexm(c(os),"Mac") == 1 {c -(}
. 
.         use "$pathcovir2/JOHN/country JOHN.dta", clear 
. {c )-}
{txt}
{com}. else if regexm(c(os),"Windows") == 1 use "$pathcovir2\JOHN\country JOHN.dta", clear 
{txt}
{com}. 
. 
. 
. * DELP 
. 
. if regexm(c(os),"Mac") == 1 {c -(}
. 
.         merge 1:1 date using "$pathcovir2/DELP/country DELP.dta"
{res}
{txt}{col 5}Result{col 38}# of obs.
{col 5}{hline 41}
{col 5}not matched{col 30}{res}             860
{txt}{col 9}from master{col 30}{res}             783{txt}  (_merge==1)
{col 9}from using{col 30}{res}              77{txt}  (_merge==2)

{col 5}matched{col 30}{res}             108{txt}  (_merge==3)
{col 5}{hline 41}
{com}. {c )-}
{txt}
{com}. else if regexm(c(os),"Windows") == 1 merge 1:1 date using "$pathcovir2\DELP\country DELP.dta"
{txt}
{com}. 
. drop _merge
{txt}
{com}. 
. 
. 
. * IHME
. 
. if regexm(c(os),"Mac") == 1 {c -(}
. 
.         merge 1:1 date using "$pathcovir2/IHME/country IHME.dta"
{res}
{txt}{col 5}Result{col 38}# of obs.
{col 5}{hline 41}
{col 5}not matched{col 30}{res}              29
{txt}{col 9}from master{col 30}{res}              13{txt}  (_merge==1)
{col 9}from using{col 30}{res}              16{txt}  (_merge==2)

{col 5}matched{col 30}{res}             955{txt}  (_merge==3)
{col 5}{hline 41}
{com}. {c )-}
{txt}
{com}. else if regexm(c(os),"Windows") == 1 merge 1:1 date using "$pathcovir2\IHME\country IHME.dta"
{txt}
{com}. 
. drop _merge
{txt}
{com}. 
. 
. 
. /* IMPE
> 
> if regexm(c(os),"Mac") == 1 {c -(}
> 
>         merge 1:1 date using "$pathcovir2/IMPE/country IMPE.dta"
> {c )-}
> else if regexm(c(os),"Windows") == 1 merge 1:1 date using "$pathcovir2\IMPE\country IMPE.dta"
> 
> drop _merge
> */
. 
. 
. /* LANL
> 
> if regexm(c(os),"Mac") == 1 {c -(}
> 
>         merge 1:1 date using "$pathcovir2/LANL/country LANL.dta"
> {c )-}
> else if regexm(c(os),"Windows") == 1 merge 1:1 date using "$pathcovir2\LANL\country LANL.dta"
> 
> drop _merge */
. 
. 
. * SRIV
. 
. if regexm(c(os),"Mac") == 1 {c -(}
. 
.         merge 1:1 date using "$pathcovir2/SRIV/country SRIV.dta"
{res}
{txt}{col 5}Result{col 38}# of obs.
{col 5}{hline 41}
{col 5}not matched{col 30}{res}             899
{txt}{col 9}from master{col 30}{res}             891{txt}  (_merge==1)
{col 9}from using{col 30}{res}               8{txt}  (_merge==2)

{col 5}matched{col 30}{res}              93{txt}  (_merge==3)
{col 5}{hline 41}
{com}. {c )-}
{txt}
{com}. else if regexm(c(os),"Windows") == 1 merge 1:1 date using "$pathcovir2\SRIV\country SRIV.dta"
{txt}
{com}. 
. drop _merge 
{txt}
{com}. 
. 
. 
. * 
. 
. label var loc_grand_name "Location"
{txt}
{com}. 
. 
. 
. 
. 
. 
. 
. *************************************
. 
. 
. * cases or infections to deaths ratio
. 
. 
. gen DayCTDMeRaA00S00 =  DayCasMeRaA00 / DayDeaMeRaA00
{txt}(135 missing values generated)

{com}. 
. label var DayCTDMeRaA00S00  "Daily Cases to Deaths S0 JOHN"
{txt}
{com}. 
. gen TotCTDMeRaA00S00 =  TotCasMeRaA00 / TotDeaMeRaA00
{txt}(129 missing values generated)

{com}. 
. label var TotCTDMeRaA00S00  "Total Cases to Deaths S0 JOHN"
{txt}
{com}. 
. 
. 
. 
. gen DayCTDMeRaA01S00 =  DayCasMeRaA01S00 / DayDeaMeRaA01S00
{txt}(877 missing values generated)

{com}. 
. label var DayCTDMeRaA01S00  "Daily Cases to Deaths S0 DELP"
{txt}
{com}. 
. gen TotCTDMeRaA01S00 =  TotCasMeRaA01S00 / TotDeaMeRaA01S00
{txt}(807 missing values generated)

{com}. 
. label var TotCTDMeRaA01S00  "Total Cases to Deaths S0 DELP"  
{txt}
{com}. 
. 
. 
. 
. 
. gen DayITDMeRaA02S01  =  DayINFMeSmA02S01  / DayDeaMeSmA02S01 
{txt}(40 missing values generated)

{com}. 
. label var DayITDMeRaA02S01   "Daily Infections to Deaths S1 IHME"
{txt}
{com}. 
. gen TotITDMeRaA02S01  =  TotINFMeSmA02S01  / TotDeaMeSmA02S01 
{txt}(40 missing values generated)

{com}. 
. label var TotITDMeRaA02S01   "Total Infections to Deaths S1 IHME"
{txt}
{com}. 
. 
. 
. 
. gen DayITDMeRaA02S02 = DayINFMeSmA02S02 / DayDeaMeSmA02S02  
{txt}(40 missing values generated)

{com}. 
. label var DayITDMeRaA02S02 "Daily Infections to Deaths S2 IHME"
{txt}
{com}. 
. gen TotITDMeRaA02S02 = TotINFMeSmA02S02 / TotDeaMeSmA02S02  
{txt}(40 missing values generated)

{com}. 
. label var TotITDMeRaA02S02 "Total Infections to Deaths S2 IHME"
{txt}
{com}. 
. 
. 
. 
. 
. 
. /*
> gen DayITDMeRaA03S01  = DayINFMeRaA03S01  / DayDeaMeRaA03S01   
> 
> label var DayITDMeRaA03S01  "Daily Infections to Deaths S1 IMPE"
> 
> gen TotITDMeRaA03S01  = TotINFMeRaA03S01  / TotDeaMeRaA03S01   
> 
> label var TotITDMeRaA03S01  "Total Infections to Deaths S1 IMPE"
> 
> 
> 
> gen DayITDMeRaA03S02  = DayINFMeRaA03S02  / DayDeaMeRaA03S02   
> 
> label var DayITDMeRaA03S02  "Daily Infections to Deaths S2 IMPE"
> 
> gen TotITDMeRaA03S02  = TotINFMeRaA03S02  / TotDeaMeRaA03S02   
> 
> label var TotITDMeRaA03S02  "Total Infections to Deaths S2 IMPE"
> 
> 
> 
> gen DayITDMeRaA03S03  = DayINFMeRaA03S03  / DayDeaMeRaA03S03   
> 
> label var DayITDMeRaA03S03  "Daily Infections to Deaths S3 IMPE"
> 
> gen TotITDMeRaA03S03  = TotINFMeRaA03S03  / TotDeaMeRaA03S03   
> 
> label var TotITDMeRaA03S03  "Total Infections to Deaths S3 IMPE"
> */
. 
. 
. 
. gen DayCTDMeRaA05S00  = DayCasMeRaA05S00  / DayDeaMeRaA05S00   
{txt}(892 missing values generated)

{com}. 
. label var DayCTDMeRaA05S00  "Daily Cases to Deaths S0 SRIV"
{txt}
{com}. 
. gen TotCTDMeRaA05S00  = TotCasMeRaA05S00  / TotDeaMeRaA05S00   
{txt}(891 missing values generated)

{com}. 
. label var TotCTDMeRaA05S00  "Total Cases to Deaths S0 SRIV"
{txt}
{com}. 
. 
. 
. 
. 
. 
. ***********************
. 
. * daily deaths estimated to reported  
. 
.     
. gen DayDERMeRaA00S00 = DayDeaMeRaA00 / DayDeaMeRaA00
{txt}(135 missing values generated)

{com}. 
. label var DayDERMeRaA00S00 "Daily Deaths estim to reported JOHN = 1" 
{txt}
{com}. 
. 
. gen DayDERMeRaA01S00 = DayDeaMeRaA01S00 / DayDeaMeRaA00
{txt}(890 missing values generated)

{com}. 
. label var DayDERMeRaA01S00 "Daily Deaths estim to reported Mean DELP S0"
{txt}
{com}. 
. 
. 
. 
. gen DayDERMeRaA02S01 = DayDeaMeSmA02S01 / DayDeaMeRaA00
{txt}(135 missing values generated)

{com}. 
. label var DayDERMeRaA02S01 "Daily Deaths estim to reported Mean not smoothed IHME S1"
{txt}
{com}. 
. 
. gen DayDERMeRaA02S02 = DayDeaMeSmA02S02 / DayDeaMeRaA00
{txt}(135 missing values generated)

{com}. 
. label var DayDERMeRaA02S02 "Daily Deaths estim to reported Mean not smoothed IHME S2"
{txt}
{com}. 
. 
. 
. /*
> gen DayDERMeRaA03S01 = DayDeaMeRaA03S01 / DayDeaMeRaA00
> 
> label var DayDERMeRaA03S01 "Daily Deaths estim to reported Mean S1 IMPE"
> 
> 
> gen DayDERMeRaA03S02 = DayDeaMeRaA03S02 / DayDeaMeRaA00
> 
> label var DayDERMeRaA03S02 "Daily Deaths estim to reported Mean S2 IMPE"
> 
> 
> gen DayDERMeRaA03S03 = DayDeaMeRaA03S03 / DayDeaMeRaA00
> 
> label var DayDERMeRaA03S03 "Daily Deaths estim to reported Mean S3 IMPE"
> */
. 
. 
. gen DayDERMeRaA05S00  = DayDeaMeRaA05S00 / DayDeaMeRaA00
{txt}(992 missing values generated)

{com}. 
. label var DayDERMeRaA05S00 "Daily Deaths estim to reported S0 SRIV"
{txt}
{com}. 
. 
. 
. 
. 
. 
. 
. * daily cases or infections estimated to reported  
. 
. 
. gen DayCERMeRaA00S00 = DayCasMeRaA00 / DayCasMeRaA00
{txt}(129 missing values generated)

{com}. 
. label var DayCERMeRaA00S00 "Daily Cases estim to reported JOHN = 1" 
{txt}
{com}. 
. 
. 
. gen DayCERMeRaA01S00 = DayCasMeRaA01S00 / DayCasMeRaA00
{txt}(885 missing values generated)

{com}. 
. label var DayCERMeRaA01S00 "Daily Cases estim to reported Mean DELP S0"
{txt}
{com}. 
. 
. 
. 
. 
. 
. gen DayIERMeRaA02S01 = DayINFMeSmA02S01 / DayCasMeRaA00
{txt}(129 missing values generated)

{com}. 
. label var DayIERMeRaA02S01 "Daily Infections estim to reported Mean not smoothed IHME S1"
{txt}
{com}. 
. 
. gen DayIERMeRaA02S02 = DayINFMeSmA02S02 / DayCasMeRaA00
{txt}(129 missing values generated)

{com}. 
. label var DayIERMeRaA02S02 "Daily Infections estim to reported Mean not smoothed IHME S2"
{txt}
{com}. 
. 
. /*
> gen DayIERMeRaA03S01 = DayINFMeRaA03S01 / DayCasMeRaA00
> 
> label var DayIERMeRaA03S01 "Daily Infections estim to reported Mean S1 IMPE"
> 
> 
> gen DayIERMeRaA03S02 = DayINFMeRaA03S02 / DayCasMeRaA00
> 
> label var DayIERMeRaA03S02 "Daily Infections estim to reported Mean S2 IMPE"
> 
> 
> gen DayIERMeRaA03S03 = DayINFMeRaA03S03 / DayCasMeRaA00
> 
> label var DayIERMeRaA03S03 "Daily Infections estim to reported Mean S3 IMPE"
> */
. 
. gen DayCERMeRaA05S00  = DayCasMeRaA05S00 / DayCasMeRaA00
{txt}(992 missing values generated)

{com}. 
. label var DayCERMeRaA05S00 "Daily Cases estim to reported S0 SRIV"
{txt}
{com}. 
. 
. 
. 
. 
. 
. 
. * Total deaths estimated to reported  
. 
. 
. gen TotDERMeRaA00S00 = TotDeaMeRaA00 / TotDeaMeRaA00
{txt}(129 missing values generated)

{com}. 
. label var TotDERMeRaA00S00 "Total Deaths estim to reported JOHN = 1" 
{txt}
{com}. 
. 
. 
. gen TotDERMeRaA01S00 = TotDeaMeRaA01S00 / TotDeaMeRaA00
{txt}(884 missing values generated)

{com}. 
. label var TotDERMeRaA01S00 "Total Deaths estim to reported Mean DELP S0"
{txt}
{com}. 
. 
. 
. gen TotDERMeRaA02S01 = TotDeaMeSmA02S01 / TotDeaMeRaA00
{txt}(129 missing values generated)

{com}. 
. label var TotDERMeRaA02S01 "Total Deaths estim to reported Mean not smoothed IHME S1"
{txt}
{com}. 
. 
. gen TotDERMeRaA02S02 = TotDeaMeSmA02S02 / TotDeaMeRaA00
{txt}(129 missing values generated)

{com}. 
. label var TotDERMeRaA02S02 "Total Deaths estim to reported Mean not smoothed IHME S2"
{txt}
{com}. 
. 
. 
. /*
> gen TotDERMeRaA03S01 = TotDeaMeRaA03S01 / TotDeaMeRaA00
> 
> label var TotDERMeRaA03S01 "Total Deaths estim to reported Mean S1 IMPE"
> 
> 
> gen TotDERMeRaA03S02 = TotDeaMeRaA03S02 / TotDeaMeRaA00
> 
> label var TotDERMeRaA03S02 "Total Deaths estim to reported Mean S2 IMPE"
> 
> 
> gen TotDERMeRaA03S03 = TotDeaMeRaA03S03 / TotDeaMeRaA00
> 
> label var TotDERMeRaA03S03 "Total Deaths estim to reported Mean S3 IMPE"
> */
. 
. gen TotDERMeRaA05S00  = TotDeaMeRaA05S00 / TotDeaMeRaA00
{txt}(992 missing values generated)

{com}. 
. label var TotDERMeRaA05S00 "Total Deaths estim to reported S0 SRIV"
{txt}
{com}. 
. 
. 
. 
. 
. 
. 
. * Total cases or infections estimated to reported  
. 
. 
. gen TotCERMeRaA00S00 = TotCasMeRaA00 / TotCasMeRaA00
{txt}(129 missing values generated)

{com}. 
. label var TotCERMeRaA00S00 "Total Cases estim to reported JOHN = 1" 
{txt}
{com}. 
. 
. gen TotCERMeRaA01S00 = TotCasMeRaA01S00 / TotCasMeRaA00
{txt}(884 missing values generated)

{com}. 
. label var TotCERMeRaA01S00 "Total Cases estim to reported Mean DELP S0"
{txt}
{com}. 
. 
. 
. gen TotIERMeRaA02S01 = TotINFMeSmA02S01 / TotCasMeRaA00
{txt}(129 missing values generated)

{com}. 
. label var TotIERMeRaA02S01 "Total Infections estim to reported Mean not smoothed IHME S1"
{txt}
{com}. 
. 
. gen TotIERMeRaA02S02 = TotINFMeSmA02S02 / TotCasMeRaA00
{txt}(129 missing values generated)

{com}. 
. label var TotIERMeRaA02S02 "Total Infections estim to reported Mean not smoothed IHME S2"
{txt}
{com}. 
. 
. 
. /*
> gen TotIERMeRaA03S01 = TotINFMeRaA03S01 / TotCasMeRaA00
> 
> label var TotIERMeRaA03S01 "Total Infections estim to reported Mean S1 IMPE"
> 
> 
> gen TotIERMeRaA03S02 = TotINFMeRaA03S02 / TotCasMeRaA00
> 
> label var TotIERMeRaA03S02 "Total Infections estim to reported Mean S2 IMPE"
> 
> 
> gen TotIERMeRaA03S03 = TotINFMeRaA03S03 / TotCasMeRaA00
> 
> label var TotIERMeRaA03S03 "Total Infections estim to reported Mean S3 IMPE"
> */
. 
. 
. gen TotCERMeRaA05S00  = TotCasMeRaA05S00 / TotCasMeRaA00
{txt}(992 missing values generated)

{com}. 
. label var TotCERMeRaA05S00 "Total Cases estim to reported S0 SRIV"
{txt}
{com}. 
. 
. 
. 
. 
. 
. 
. 
. *
. 
. di in red "********* Description of vars in final combined file country.dta *********" 
{res}{err}********* Description of vars in final combined file country.dta *********
{txt}
{com}. 
. 
. desc, fullnames

{txt}Contains data from {res}/Users/farshadpourmalek/Downloads/covir2-main/20220701/code/JOHN/country JOHN.dta
{txt}  obs:{res}           992                          
{txt} vars:{res}           291                          1 Jul 2022 06:40
{txt} size:{res}     1,184,448                          
{txt}{hline}
              storage   display    value
variable name   type    format     label      variable label
{hline}
{p 0 48}{res}{bind:date           }{txt}{bind: int     }{bind:{txt}%td       }{space 1}{bind:         }{bind:  }{res}{res}{p_end}
{p 0 48}{bind:loc_grand_name }{txt}{bind: str4    }{bind:{txt}%9s       }{space 1}{bind:         }{bind:  }{res}{res}Location{p_end}
{p 0 48}{bind:DayDeaMeRaA00  }{txt}{bind: int     }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Daily deaths raw A00 JOHN{p_end}
{p 0 48}{bind:TotDeaMeRaA00  }{txt}{bind: long    }{bind:{txt}%10.0g    }{space 1}{bind:         }{bind:  }{res}{res}Total deaths raw A00 JOHN{p_end}
{p 0 48}DayDeaMeRaA00_CF2{p_end}
{p 0 48}{space 15}{txt}{bind: int     }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Daily Deaths JOHN correction factor 2{p_end}
{p 0 48}DayDeaMeRaA00_CF5{p_end}
{p 0 48}{space 15}{txt}{bind: int     }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Daily Deaths JOHN correction factor 5{p_end}
{p 0 48}TotDeaMeRaA00_CF2{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Total Deaths JOHN correction factor 2{p_end}
{p 0 48}TotDeaMeRaA00_CF5{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Total Deaths JOHN correction factor 5{p_end}
{p 0 48}{bind:DayCasMeRaA00  }{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Daily cases raw A00 JOHN{p_end}
{p 0 48}{bind:TotCasMeRaA00  }{txt}{bind: long    }{bind:{txt}%10.0g    }{space 1}{bind:         }{bind:  }{res}{res}Total cases raw A00 JOHN{p_end}
{p 0 48}DayCasMeRaA00_CF2{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Daily Cases JOHN correction factor 2{p_end}
{p 0 48}DayCasMeRaA00_CF5{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Daily Cases JOHN correction factor 5{p_end}
{p 0 48}TotCasMeRaA00_CF2{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Total Cases JOHN correction factor 2{p_end}
{p 0 48}TotCasMeRaA00_CF5{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Total Cases JOHN correction factor 5{p_end}
{p 0 48}{bind:DayCfrMeRaA00  }{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Daily CFR JOHN{p_end}
{p 0 48}{bind:DayDeaMeSmA00  }{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Daily deaths smooth A00 JOHN{p_end}
{p 0 48}{bind:DayCasMeSmA00  }{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Daily cases smooth A00 JOHN{p_end}
{p 0 48}today_numericdailydate{p_end}
{p 0 48}{space 15}{txt}{bind: int     }{bind:{txt}%td..     }{space 1}{bind:         }{bind:  }{res}{res}{p_end}
{p 0 48}monthspast01jan2020{p_end}
{p 0 48}{space 15}{txt}{bind: byte    }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}{p_end}
{p 0 48}monthspast01jan2021{p_end}
{p 0 48}{space 15}{txt}{bind: byte    }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}{p_end}
{p 0 48}monthspast01jan2022{p_end}
{p 0 48}{space 15}{txt}{bind: byte    }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}{p_end}
{p 0 48}TotDeaMeRaA01S00{p_end}
{p 0 48}{space 15}{txt}{bind: long    }{bind:{txt}%8.0g     }{space 1}{bind:         }{bind:  }{res}{res}Total Deaths Mean DELP S0{p_end}
{p 0 48}TotDeaLoRaA01S00{p_end}
{p 0 48}{space 15}{txt}{bind: long    }{bind:{txt}%8.0g     }{space 1}{bind:         }{bind:  }{res}{res}Total Deaths Lower DELP S0{p_end}
{p 0 48}TotDeaUpRaA01S00{p_end}
{p 0 48}{space 15}{txt}{bind: long    }{bind:{txt}%8.0g     }{space 1}{bind:         }{bind:  }{res}{res}Total Deaths Upper DELP S0{p_end}
{p 0 48}DayDeaMeRaA01S00{p_end}
{p 0 48}{space 15}{txt}{bind: byte    }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Daily Deaths Mean DELP S0{p_end}
{p 0 48}DayDeaLoRaA01S00{p_end}
{p 0 48}{space 15}{txt}{bind: byte    }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Daily Deaths Lower DELP S0{p_end}
{p 0 48}DayDeaUpRaA01S00{p_end}
{p 0 48}{space 15}{txt}{bind: byte    }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Daily Deaths Upper DELP S0{p_end}
{p 0 48}TotCasMeRaA01S00{p_end}
{p 0 48}{space 15}{txt}{bind: long    }{bind:{txt}%12.0g    }{space 1}{bind:         }{bind:  }{res}{res}Total Cases Mean DELP S0{p_end}
{p 0 48}TotCasLoRaA01S00{p_end}
{p 0 48}{space 15}{txt}{bind: long    }{bind:{txt}%12.0g    }{space 1}{bind:         }{bind:  }{res}{res}Total Cases Lower DELP S0{p_end}
{p 0 48}TotCasUpRaA01S00{p_end}
{p 0 48}{space 15}{txt}{bind: long    }{bind:{txt}%12.0g    }{space 1}{bind:         }{bind:  }{res}{res}Total Cases Upper DELP S0{p_end}
{p 0 48}DayCasMeRaA01S00{p_end}
{p 0 48}{space 15}{txt}{bind: int     }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Daily Cases Mean DELP S0{p_end}
{p 0 48}DayCasLoRaA01S00{p_end}
{p 0 48}{space 15}{txt}{bind: int     }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Daily Cases Lower DELP S0{p_end}
{p 0 48}DayCasUpRaA01S00{p_end}
{p 0 48}{space 15}{txt}{bind: int     }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Daily Cases Upper DELP S0{p_end}
{p 0 48}DayActMeRaA01S00{p_end}
{p 0 48}{space 15}{txt}{bind: long    }{bind:{txt}%12.0g    }{space 1}{bind:         }{bind:  }{res}{res}Daily Cases Active Mean DELP S0{p_end}
{p 0 48}DayHosMeRaA01S00{p_end}
{p 0 48}{space 15}{txt}{bind: int     }{bind:{txt}%12.0g    }{space 1}{bind:         }{bind:  }{res}{res}Daily Cases Active Hospitalized Mean DELP S0{p_end}
{p 0 48}DayVenMeRaA01S00{p_end}
{p 0 48}{space 15}{txt}{bind: int     }{bind:{txt}%8.0g     }{space 1}{bind:         }{bind:  }{res}{res}Daily Cases Active Ventilated Mean DELP S0{p_end}
{p 0 48}TotHosMeRaA01S00{p_end}
{p 0 48}{space 15}{txt}{bind: int     }{bind:{txt}%12.0g    }{space 1}{bind:         }{bind:  }{res}{res}Total Cases Active Mean DELP S0{p_end}
{p 0 48}DayCfrMeRaA01S00{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Daily CFR Mean DELP S0 V4{p_end}
{p 0 48}DayCfrLoRaA01S00{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Daily CFR Lower DELP S0 V4{p_end}
{p 0 48}DayCfrUpRaA01S00{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Daily CFR Upper DELP S0 V4{p_end}
{p 0 48}DayDeMMeRaA01S00{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Daily deaths mean DELP DayDeM{p_end}
{p 0 48}DayCaMMeRaA01S00{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Daily cases mean DELP DayCaM{p_end}
{p 0 48}DayCbDMeRaA01S00{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Daily cases mean div by daily deaths mean DELP DayCbD{p_end}
{p 0 48}DayDMuMeRaA01S00{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Daily deaths scaled (times means of cases by deaths) only for visualization DELP{p_end}
{p 0 48}DayDeaMeSmA01S00{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Daily deaths smooth mean DELP{p_end}
{p 0 48}DayCasMeSmA01S00{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Daily cases smooth mean DELP{p_end}
{p 0 48}DayDeaLoSmA01S00{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Daily deaths smooth lower DELP{p_end}
{p 0 48}DayCasLoSmA01S00{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Daily cases smooth lower DELP{p_end}
{p 0 48}DayDeaUpSmA01S00{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Daily deaths smooth upper DELP{p_end}
{p 0 48}DayCasUpSmA01S00{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Daily cases smooth upper DELP{p_end}
{p 0 48}{bind:epoch_DELP     }{txt}{bind: int     }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}DELP Forecast start date{p_end}
{p 0 48}DayDeaFOREA01S00{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Daily Forecasted Deaths Mean smooth DELP{p_end}
{p 0 48}DayCasFOREA01S00{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Daily Forecasted Cases Mean smooth DELP{p_end}
{p 0 48}DayINFMeSmA02S01{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Daily infections Mean smoothed IHME S1{p_end}
{p 0 48}DayINFUpSmA02S01{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Daily infections Upper smoothed IHME S1{p_end}
{p 0 48}DayINFLoSmA02S01{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Daily infections Lower smoothed IHME S1{p_end}
{p 0 48}TotDeXMeSmA02S01{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Total Excess Deaths Mean smoothed IHME S1{p_end}
{p 0 48}TotDeXLoSmA02S01{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Total Excess Deaths Lower smoothed IHME S1{p_end}
{p 0 48}TotDeXUpSmA02S01{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Total Excess Deaths Upper smoothed IHME S1{p_end}
{p 0 48}TotINFMeSmA02S01{p_end}
{p 0 48}{space 15}{txt}{bind: double  }{bind:{txt}%10.0g    }{space 1}{bind:         }{bind:  }{res}{res}Total infections Mean smoothed IHME S1{p_end}
{p 0 48}TotINFLoSmA02S01{p_end}
{p 0 48}{space 15}{txt}{bind: double  }{bind:{txt}%10.0g    }{space 1}{bind:         }{bind:  }{res}{res}Total infections Lower smoothed IHME S1{p_end}
{p 0 48}TotINFUpSmA02S01{p_end}
{p 0 48}{space 15}{txt}{bind: double  }{bind:{txt}%10.0g    }{space 1}{bind:         }{bind:  }{res}{res}Total infections Upper smoothed IHME S1{p_end}
{p 0 48}DayDeXMeSmA02S01{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Daily Excess Deaths Mean smoothed IHME S1{p_end}
{p 0 48}DayDeXLoSmA02S01{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Daily Excess Deaths Lower smoothed IHME S1{p_end}
{p 0 48}DayDeXUpSmA02S01{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Daily Excess Deaths Upper smoothed IHME S1{p_end}
{p 0 48}DayDeaMeSmA02S01{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Daily Reported Deaths Mean smoothed IHME S1{p_end}
{p 0 48}DayDeaLoSmA02S01{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Daily Reported Deaths Lower smoothed IHME S1{p_end}
{p 0 48}DayDeaUpSmA02S01{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Daily Reported Deaths Upper smoothed IHME S1{p_end}
{p 0 48}TotDeaMeSmA02S01{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Total Reported Deaths Mean smoothed IHME S1{p_end}
{p 0 48}TotDeaLoSmA02S01{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Total Reported Deaths Lower smoothed IHME S1{p_end}
{p 0 48}TotDeaUpSmA02S01{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Total Reported Deaths Upper smoothed IHME S1{p_end}
{p 0 48}{bind:cases_mean     }{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}{p_end}
{p 0 48}{bind:cases_lower    }{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}{p_end}
{p 0 48}{bind:cases_upper    }{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}{p_end}
{p 0 48}reff_mean_A02S01{p_end}
{p 0 48}{space 15}{txt}{bind: double  }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}IHME R effective (mean estimate) S1{p_end}
{p 0 48}reff_lower_A02S01{p_end}
{p 0 48}{space 15}{txt}{bind: double  }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}IHME R effective (lower 95% confidence interval) S1{p_end}
{p 0 48}reff_upper_A02S01{p_end}
{p 0 48}{space 15}{txt}{bind: double  }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}IHME R effective (upper 95% confidence interval) S1{p_end}
{p 0 48}inf_cuml_mean_vax{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}{p_end}
{p 0 48}inf_cuml_lower_vax{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}{p_end}
{p 0 48}inf_cuml_upper_vax{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}{p_end}
{p 0 48}inf_cuml_mean_unvax{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}{p_end}
{p 0 48}inf_cuml_lower_unvax{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}{p_end}
{p 0 48}inf_cuml_upper_unvax{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}{p_end}
{p 0 48}{bind:inf_mean_vax   }{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}{p_end}
{p 0 48}{bind:inf_lower_vax  }{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}{p_end}
{p 0 48}{bind:inf_upper_vax  }{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}{p_end}
{p 0 48}{bind:inf_mean_unvax }{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}{p_end}
{p 0 48}{bind:inf_lower_unvax}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}{p_end}
{p 0 48}{bind:inf_upper_unvax}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}{p_end}
{p 0 48}cumulative_deaths_A02S01{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}IHME Cumulative deaths (raw data with excess mortality scalar applied) S1{p_end}
{p 0 48}daily_deaths_A02S01{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}IHME Daily deaths (raw data with excess mortality scalar applied) S1{p_end}
{p 0 48}cumulative_cases_A02S01{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}IHME Cumulative cases (raw data) S1{p_end}
{p 0 48}cumulative_hosp_A02S01{p_end}
{p 0 48}{space 15}{txt}{bind: byte    }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}IHME Cumulative hospitalizations (raw data) S1{p_end}
{p 0 48}cumul_deaths_unscaled_A02S01{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}IHME umulative deaths (raw data without excess mortality scalar applied) S1{p_end}
{p 0 48}dai_dea_unscaled_A02S01{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}IHME Daily deaths (raw data without excess mortality scalar applied) S1{p_end}
{p 0 48}{bind:daily_cases    }{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}{p_end}
{p 0 48}{bind:population     }{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}IHME Population size{p_end}
{p 0 48}mobility_mean_A02S01{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}IHME Percent change in mobility from baseline (mean)  S1{p_end}
{p 0 48}{bind:mobility_obs   }{txt}{bind: byte    }{bind:{txt}%8.0g     }{space 1}{bind:         }{bind:  }{res}{res}IHME Indicator for whether mobility estimate comes from observed data (1) or mod{p_end}
{p 0 48}{bind:testing_mean   }{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}IHME Tests per 100,000 (mean estimate){p_end}
{p 0 48}{bind:testing_lower  }{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}IHME Tests per 100,000 (lower 95% confidence interval){p_end}
{p 0 48}{bind:testing_upper  }{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}IHME Tests per 100,000 (upper 95% confidence interval){p_end}
{p 0 48}{bind:testing_obs    }{txt}{bind: byte    }{bind:{txt}%8.0g     }{space 1}{bind:         }{bind:  }{res}{res}IHME Indicator for whether testing estimate comes from observed data (1) or mode{p_end}
{p 0 48}{bind:pneumonia_mean }{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}IHME Ratio of pneumonia deaths in a given week to the average weekly pneumonia d{p_end}
{p 0 48}{bind:pneumonia_obs  }{txt}{bind: byte    }{bind:{txt}%8.0g     }{space 1}{bind:         }{bind:  }{res}{res}IHME Indicator for whether pneumonia estimate comes from observed data (1) or mo{p_end}
{p 0 48}mask_use_mean_A02S01{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}IHME Percent of population reporting always wearing a mask when leaving home  S1{p_end}
{p 0 48}{bind:mask_use_obs   }{txt}{bind: byte    }{bind:{txt}%8.0g     }{space 1}{bind:         }{bind:  }{res}{res}IHME Indicator for whether mask estimate comes from observed data (1) or modelle{p_end}
{p 0 48}cumulative_all_vaccinated{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}IHME Initially vaccinated (one dose of two doses){p_end}
{p 0 48}cumulative_all_fully_vaccinated{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}IHME Fully vaccinated (one of one and†two†of two doses){p_end}
{p 0 48}cumulative_all_effectively_vacci{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}IHME Effectively vaccinated (one and two dose with efficacy){p_end}
{p 0 48}DayBedMeSmA02S01{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}IHME Daily COVID-19 hospital beds needed (mean estimate) S1{p_end}
{p 0 48}DayBedLoSmA02S01{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}IHME Daily COVID-19 hospital beds needed (upper 95% confidence interval) S1{p_end}
{p 0 48}DayBedUpSmA02S01{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}IHME Daily COVID-19 hospital beds needed (lower 95% confidence interval) S1{p_end}
{p 0 48}DayIcuMeSmA02S01{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}IHME Daily COVID-19 ICU beds needed (mean estimate) S1{p_end}
{p 0 48}DayIcuUpSmA02S01{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}IHME Daily COVID-19 ICU beds needed (lower 95% confidence interval) S1{p_end}
{p 0 48}DayIcuLoSmA02S01{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}IHME Daily COVID-19 ICU beds needed (upper 95% confidence interval) S1{p_end}
{p 0 48}DayAdmMeSmA02S01{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}IHME Daily COVID-19 hospital admissions (mean estimate) S1{p_end}
{p 0 48}DayAdmUpSmA02S01{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}IHME Daily COVID-19 hospital admissions (mean estimate) S1{p_end}
{p 0 48}DayAdmLoSmA02S01{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}IHME Daily COVID-19 hospital admissions (mean estimate) S1{p_end}
{p 0 48}{bind:admis_mean_vax }{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}{p_end}
{p 0 48}{bind:admis_upper_vax}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}{p_end}
{p 0 48}{bind:admis_lower_vax}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}{p_end}
{p 0 48}admis_mean_unvax{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}{p_end}
{p 0 48}admis_upper_unvax{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}{p_end}
{p 0 48}admis_lower_unvax{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}{p_end}
{p 0 48}{bind:DayBEDMeSmA02  }{txt}{bind: long    }{bind:{txt}%12.0g    }{space 1}{bind:         }{bind:  }{res}{res}IHME Total number of beds that exist at a location{p_end}
{p 0 48}{bind:DayICUMeSmA02  }{txt}{bind: int     }{bind:{txt}%12.0g    }{space 1}{bind:         }{bind:  }{res}{res}IHME Total number of ICU beds that exist at a location{p_end}
{p 0 48}infection_fatality_A02S01{p_end}
{p 0 48}{space 15}{txt}{bind: double  }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}IHME Infection fatality ratio S1{p_end}
{p 0 48}infection_detection_A02S01{p_end}
{p 0 48}{space 15}{txt}{bind: double  }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}IHME Infection detection ratio S1{p_end}
{p 0 48}infection_hospitalization_A02S01{p_end}
{p 0 48}{space 15}{txt}{bind: double  }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}IHME Infection hospitalization ratio S1{p_end}
{p 0 48}DayINFMeSmA02S02{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Daily infections Mean smoothed IHME S2{p_end}
{p 0 48}DayINFUpSmA02S02{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Daily infections Upper smoothed IHME S2{p_end}
{p 0 48}DayINFLoSmA02S02{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Daily infections Lower smoothed IHME S2{p_end}
{p 0 48}TotDeXMeSmA02S02{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Total Excess Deaths Mean smoothed IHME S2{p_end}
{p 0 48}TotDeXLoSmA02S02{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Total Excess Deaths Lower smoothed IHME S2{p_end}
{p 0 48}TotDeXUpSmA02S02{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Total Excess Deaths Upper smoothed IHME S2{p_end}
{p 0 48}TotINFMeSmA02S02{p_end}
{p 0 48}{space 15}{txt}{bind: double  }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Total infections Mean smoothed IHME S2{p_end}
{p 0 48}TotINFLoSmA02S02{p_end}
{p 0 48}{space 15}{txt}{bind: double  }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Total infections Lower smoothed IHME S2{p_end}
{p 0 48}TotINFUpSmA02S02{p_end}
{p 0 48}{space 15}{txt}{bind: double  }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Total infections Upper smoothed IHME S2{p_end}
{p 0 48}DayDeXMeSmA02S02{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Daily Excess Deaths Mean smoothed IHME S2{p_end}
{p 0 48}DayDeXLoSmA02S02{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Daily Excess Deaths Lower smoothed IHME S2{p_end}
{p 0 48}DayDeXUpSmA02S02{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Daily Excess Deaths Upper smoothed IHME S2{p_end}
{p 0 48}DayDeaMeSmA02S02{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Daily Reported Deaths Mean smoothed IHME S2{p_end}
{p 0 48}DayDeaLoSmA02S02{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Daily Reported Deaths Lower smoothed IHME S2{p_end}
{p 0 48}DayDeaUpSmA02S02{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Daily Reported Deaths Upper smoothed IHME S2{p_end}
{p 0 48}TotDeaMeSmA02S02{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Total Reported Deaths Mean smoothed IHME S2{p_end}
{p 0 48}TotDeaLoSmA02S02{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Total Reported Deaths Lower smoothed IHME S2{p_end}
{p 0 48}TotDeaUpSmA02S02{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Total Reported Deaths Upper smoothed IHME S2{p_end}
{p 0 48}reff_mean_A02S02{p_end}
{p 0 48}{space 15}{txt}{bind: double  }{bind:{txt}%10.0g    }{space 1}{bind:         }{bind:  }{res}{res}IHME R effective (mean estimate) S2{p_end}
{p 0 48}reff_lower_A02S02{p_end}
{p 0 48}{space 15}{txt}{bind: double  }{bind:{txt}%10.0g    }{space 1}{bind:         }{bind:  }{res}{res}IHME R effective (lower 95% confidence interval) S2{p_end}
{p 0 48}reff_upper_A02S02{p_end}
{p 0 48}{space 15}{txt}{bind: double  }{bind:{txt}%10.0g    }{space 1}{bind:         }{bind:  }{res}{res}IHME R effective (upper 95% confidence interval) S2{p_end}
{p 0 48}cumulative_deaths_A02S02{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}IHME Cumulative deaths (raw data with excess mortality scalar applied) S2{p_end}
{p 0 48}daily_deaths_A02S02{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}IHME Daily deaths (raw data with excess mortality scalar applied) S2{p_end}
{p 0 48}cumulative_cases_A02S02{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}IHME Cumulative cases (raw data) S2{p_end}
{p 0 48}cumulative_hosp_A02S02{p_end}
{p 0 48}{space 15}{txt}{bind: byte    }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}IHME Cumulative hospitalizations (raw data) S2{p_end}
{p 0 48}cumul_deaths_unscaled_A02S02{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}IHME umulative deaths (raw data without excess mortality scalar applied) S2{p_end}
{p 0 48}dai_dea_unscaled_A02S02{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}IHME Daily deaths (raw data without excess mortality scalar applied) S2{p_end}
{p 0 48}mobility_mean_A02S02{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}IHME Percent change in mobility from baseline (mean)  S2{p_end}
{p 0 48}mask_use_mean_A02S02{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}IHME Percent of population reporting always wearing a mask when leaving home  S2{p_end}
{p 0 48}DayBedMeSmA02S02{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}IHME Daily COVID-19 hospital beds needed (mean estimate) S2{p_end}
{p 0 48}DayBedLoSmA02S02{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}IHME Daily COVID-19 hospital beds needed (upper 95% confidence interval) S2{p_end}
{p 0 48}DayBedUpSmA02S02{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}IHME Daily COVID-19 hospital beds needed (lower 95% confidence interval) S2{p_end}
{p 0 48}DayIcuMeSmA02S02{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}IHME Daily COVID-19 ICU beds needed (mean estimate) S2{p_end}
{p 0 48}DayIcuUpSmA02S02{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}IHME Daily COVID-19 ICU beds needed (lower 95% confidence interval) S2{p_end}
{p 0 48}DayIcuLoSmA02S02{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}IHME Daily COVID-19 ICU beds needed (upper 95% confidence interval) S2{p_end}
{p 0 48}DayAdmMeSmA02S02{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}IHME Daily COVID-19 hospital admissions (mean estimate) S2{p_end}
{p 0 48}DayAdmUpSmA02S02{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}IHME Daily COVID-19 hospital admissions (mean estimate) S2{p_end}
{p 0 48}DayAdmLoSmA02S02{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}IHME Daily COVID-19 hospital admissions (mean estimate) S2{p_end}
{p 0 48}infection_fatality_A02S02{p_end}
{p 0 48}{space 15}{txt}{bind: double  }{bind:{txt}%10.0g    }{space 1}{bind:         }{bind:  }{res}{res}IHME Infection fatality ratio S2{p_end}
{p 0 48}infection_detection_A02S02{p_end}
{p 0 48}{space 15}{txt}{bind: double  }{bind:{txt}%10.0g    }{space 1}{bind:         }{bind:  }{res}{res}IHME Infection detection ratio S2{p_end}
{p 0 48}infection_hospitalization_A02S02{p_end}
{p 0 48}{space 15}{txt}{bind: double  }{bind:{txt}%10.0g    }{space 1}{bind:         }{bind:  }{res}{res}IHME Infection hospitalization ratio S2{p_end}
{p 0 48}DayINFMeSmA02S03{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Daily infections Mean smoothed IHME S3{p_end}
{p 0 48}DayINFUpSmA02S03{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Daily infections Upper smoothed IHME S3{p_end}
{p 0 48}DayINFLoSmA02S03{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Daily infections Lower smoothed IHME S3{p_end}
{p 0 48}TotDeXMeSmA02S03{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Total Excess Deaths Mean smoothed IHME S3{p_end}
{p 0 48}TotDeXLoSmA02S03{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Total Excess Deaths Lower smoothed IHME S3{p_end}
{p 0 48}TotDeXUpSmA02S03{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Total Excess Deaths Upper smoothed IHME S3{p_end}
{p 0 48}TotINFMeSmA02S03{p_end}
{p 0 48}{space 15}{txt}{bind: double  }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Total infections Mean smoothed IHME S3{p_end}
{p 0 48}TotINFLoSmA02S03{p_end}
{p 0 48}{space 15}{txt}{bind: double  }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Total infections Lower smoothed IHME S3{p_end}
{p 0 48}TotINFUpSmA02S03{p_end}
{p 0 48}{space 15}{txt}{bind: double  }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Total infections Upper smoothed IHME S3{p_end}
{p 0 48}DayDeXMeSmA02S03{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Daily Excess Deaths Mean smoothed IHME S3{p_end}
{p 0 48}DayDeXLoSmA02S03{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Daily Excess Deaths Lower smoothed IHME S3{p_end}
{p 0 48}DayDeXUpSmA02S03{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Daily Excess Deaths Upper smoothed IHME S3{p_end}
{p 0 48}DayDeaMeSmA02S03{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Daily Reported Deaths Mean smoothed IHME S3{p_end}
{p 0 48}DayDeaLoSmA02S03{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Daily Reported Deaths Lower smoothed IHME S3{p_end}
{p 0 48}DayDeaUpSmA02S03{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Daily Reported Deaths Upper smoothed IHME S3{p_end}
{p 0 48}TotDeaMeSmA02S03{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Total Reported Deaths Mean smoothed IHME S3{p_end}
{p 0 48}TotDeaLoSmA02S03{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Total Reported Deaths Lower smoothed IHME S3{p_end}
{p 0 48}TotDeaUpSmA02S03{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Total Reported Deaths Upper smoothed IHME S3{p_end}
{p 0 48}reff_mean_A02S03{p_end}
{p 0 48}{space 15}{txt}{bind: double  }{bind:{txt}%10.0g    }{space 1}{bind:         }{bind:  }{res}{res}IHME R effective (mean estimate) S3{p_end}
{p 0 48}reff_lower_A02S03{p_end}
{p 0 48}{space 15}{txt}{bind: double  }{bind:{txt}%10.0g    }{space 1}{bind:         }{bind:  }{res}{res}IHME R effective (lower 95% confidence interval) S3{p_end}
{p 0 48}reff_upper_A02S03{p_end}
{p 0 48}{space 15}{txt}{bind: double  }{bind:{txt}%10.0g    }{space 1}{bind:         }{bind:  }{res}{res}IHME R effective (upper 95% confidence interval) S3{p_end}
{p 0 48}cumulative_deaths_A02S03{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}IHME Cumulative deaths (raw data with excess mortality scalar applied) S3{p_end}
{p 0 48}daily_deaths_A02S03{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}IHME Daily deaths (raw data with excess mortality scalar applied) S3{p_end}
{p 0 48}cumulative_cases_A02S03{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}IHME Cumulative cases (raw data) S3{p_end}
{p 0 48}cumulative_hosp_A02S03{p_end}
{p 0 48}{space 15}{txt}{bind: byte    }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}IHME Cumulative hospitalizations (raw data) S3{p_end}
{p 0 48}cumul_deaths_unscaled_A02S03{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}IHME umulative deaths (raw data without excess mortality scalar applied) S3{p_end}
{p 0 48}dai_dea_unscaled_A02S03{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}IHME Daily deaths (raw data without excess mortality scalar applied) S3{p_end}
{p 0 48}mobility_mean_A02S03{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}IHME Percent change in mobility from baseline (mean)  S3{p_end}
{p 0 48}mask_use_mean_A02S03{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}IHME Percent of population reporting always wearing a mask when leaving home  S3{p_end}
{p 0 48}DayBedMeSmA02S03{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}IHME Daily COVID-19 hospital beds needed (mean estimate) S3{p_end}
{p 0 48}DayBedLoSmA02S03{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}IHME Daily COVID-19 hospital beds needed (upper 95% confidence interval) S3{p_end}
{p 0 48}DayBedUpSmA02S03{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}IHME Daily COVID-19 hospital beds needed (lower 95% confidence interval) S3{p_end}
{p 0 48}DayIcuMeSmA02S03{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}IHME Daily COVID-19 ICU beds needed (mean estimate) S3{p_end}
{p 0 48}DayIcuUpSmA02S03{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}IHME Daily COVID-19 ICU beds needed (lower 95% confidence interval) S3{p_end}
{p 0 48}DayIcuLoSmA02S03{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}IHME Daily COVID-19 ICU beds needed (upper 95% confidence interval) S3{p_end}
{p 0 48}DayAdmMeSmA02S03{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}IHME Daily COVID-19 hospital admissions (mean estimate) S3{p_end}
{p 0 48}DayAdmUpSmA02S03{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}IHME Daily COVID-19 hospital admissions (mean estimate) S3{p_end}
{p 0 48}DayAdmLoSmA02S03{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}IHME Daily COVID-19 hospital admissions (mean estimate) S3{p_end}
{p 0 48}infection_fatality_A02S03{p_end}
{p 0 48}{space 15}{txt}{bind: double  }{bind:{txt}%10.0g    }{space 1}{bind:         }{bind:  }{res}{res}IHME Infection fatality ratio S3{p_end}
{p 0 48}infection_detection_A02S03{p_end}
{p 0 48}{space 15}{txt}{bind: double  }{bind:{txt}%10.0g    }{space 1}{bind:         }{bind:  }{res}{res}IHME Infection detection ratio S3{p_end}
{p 0 48}infection_hospitalization_A02S03{p_end}
{p 0 48}{space 15}{txt}{bind: double  }{bind:{txt}%10.0g    }{space 1}{bind:         }{bind:  }{res}{res}IHME Infection hospitalization ratio S3{p_end}
{p 0 48}DayDeMMeSmA02S01{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Daily deaths mean IHME DayDeM{p_end}
{p 0 48}DayCaMMeSmA02S01{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Daily infections mean IHME DayCaM{p_end}
{p 0 48}DayCbDMeSmA02S01{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Daily infections mean div by daily deaths mean IHME DayCbD{p_end}
{p 0 48}DayDMuMeSmA02S01{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Daily deaths scaled (times means of infections by deaths) IHME{p_end}
{p 0 48}cumulative_all_vaccin_pct{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}% population IHME Initially vaccinated (one dose of two doses){p_end}
{p 0 48}cumul_all_effect_vacci_pct{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}% population IHME Effectively vaccinated (one and two dose with efficacy){p_end}
{p 0 48}cumul_all_fully_vacci_pct{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}% population IHME Fully vaccinated (one of one and two of two doses){p_end}
{p 0 48}daily_all_vaccinated{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Daily population IHME Initially vaccinated (one dose of two doses){p_end}
{p 0 48}daily_all_effectively_vacci{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Daily population IHME Effectively vaccinated (one and two dose with efficacy){p_end}
{p 0 48}daily_all_fully_vaccinated{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Daily population IHME Fully vaccinated (one of one and two of two doses){p_end}
{p 0 48}daily_all_vaccin_pct{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}% Daily population IHME Initially vaccinated (one dose of two doses){p_end}
{p 0 48}daily_all_effect_vacci_pct{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}% Daily population IHME Effectively vaccinated (one and two dose with efficacy){p_end}
{p 0 48}daily_all_fully_vacci_pct{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}% Daily population IHME Fully vaccinated (one of one and two of two doses){p_end}
{p 0 48}DayINFDetMeSmA02S01{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Daily Detected Infections Mean smoothed IHME S1{p_end}
{p 0 48}DayINFDetLoSmA02S01{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Daily Detected Infections Lower smoothed IHME S1{p_end}
{p 0 48}DayINFDetUpSmA02S01{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Daily Detected Infections Upper smoothed IHME S1{p_end}
{p 0 48}DayINFHosMeSmA02S01{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Daily Hospitalized Infections Mean smoothed IHME S1{p_end}
{p 0 48}DayINFHosLoSmA02S01{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Daily Hospitalized Infections Lower smoothed IHME S1{p_end}
{p 0 48}DayINFHosUpSmA02S01{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Daily Hospitalized Infections Upper smoothed IHME S1{p_end}
{p 0 48}DayINFFatMeSmA02S01{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Daily Fatal Infections Mean smoothed IHME S1{p_end}
{p 0 48}DayINFFatLoSmA02S01{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Daily Fatal Infections Lower smoothed IHME S1{p_end}
{p 0 48}DayINFFatUpSmA02S01{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Daily Fatal Infections Upper smoothed IHME S1{p_end}
{p 0 48}{bind:epoch_IHME     }{txt}{bind: int     }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}IHME Forecast start date{p_end}
{p 0 48}DayDeaFOREA02S01{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Daily Forecasted Deaths Mean smoothed IHME S1{p_end}
{p 0 48}DayINFFOREA02S01{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Daily Forecasted infections Mean smoothed IHME S1{p_end}
{p 0 48}TotCasUpRaA05S00{p_end}
{p 0 48}{space 15}{txt}{bind: long    }{bind:{txt}%10.0g    }{space 1}{bind:         }{bind:  }{res}{res}Total Cases Upper SRIV{p_end}
{p 0 48}TotDeaMeRaA05S00{p_end}
{p 0 48}{space 15}{txt}{bind: long    }{bind:{txt}%12.0g    }{space 1}{bind:         }{bind:  }{res}{res}Total Deaths Mean SRIV{p_end}
{p 0 48}TotDeaLoRaA05S00{p_end}
{p 0 48}{space 15}{txt}{bind: long    }{bind:{txt}%12.0g    }{space 1}{bind:         }{bind:  }{res}{res}Total Deaths Lower SRIV{p_end}
{p 0 48}TotDeaUpRaA05S00{p_end}
{p 0 48}{space 15}{txt}{bind: long    }{bind:{txt}%12.0g    }{space 1}{bind:         }{bind:  }{res}{res}Total Deaths Upper SRIV{p_end}
{p 0 48}TotCasMeRaA05S00{p_end}
{p 0 48}{space 15}{txt}{bind: long    }{bind:{txt}%10.0g    }{space 1}{bind:         }{bind:  }{res}{res}Total Cases Mean SRIV{p_end}
{p 0 48}TotCasLoRaA05S00{p_end}
{p 0 48}{space 15}{txt}{bind: long    }{bind:{txt}%10.0g    }{space 1}{bind:         }{bind:  }{res}{res}Total Cases Lower SRIV{p_end}
{p 0 48}DayDeaMeRaA05S00{p_end}
{p 0 48}{space 15}{txt}{bind: int     }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Daily Deaths Mean SRIV{p_end}
{p 0 48}DayDeaLoRaA05S00{p_end}
{p 0 48}{space 15}{txt}{bind: byte    }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Daily Deaths Lower SRIV{p_end}
{p 0 48}DayDeaUpRaA05S00{p_end}
{p 0 48}{space 15}{txt}{bind: int     }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Daily Deaths Upper SRIV{p_end}
{p 0 48}DayCasMeRaA05S00{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Daily Cases Mean SRIV{p_end}
{p 0 48}DayCasLoRaA05S00{p_end}
{p 0 48}{space 15}{txt}{bind: int     }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Daily Cases Lower SRIV{p_end}
{p 0 48}DayCasUpRaA05S00{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Daily Cases Upper SRIV{p_end}
{p 0 48}DayCfrMeRaA05S00{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Daily CFR Mean SRIV{p_end}
{p 0 48}DayCfrLoRaA05S00{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Daily CFR Lower SRIV{p_end}
{p 0 48}DayCfrUpRaA05S00{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Daily CFR Upper SRIV{p_end}
{p 0 48}DayDeMMeRaA05S00{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Daily deaths mean SRIV  DayDeM{p_end}
{p 0 48}DayCaMMeRaA05S00{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Daily cases mean SRIV  DayCaM{p_end}
{p 0 48}DayCbDMeRaA05S00{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Daily cases mean div by daily deaths mean SRIV  DayCbD{p_end}
{p 0 48}DayDMuMeRaA05S00{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Daily deaths scaled (times means of cases by deaths) SRIV {p_end}
{p 0 48}DayDeaMeSmA05S00{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Daily deaths smooth A05 SRIV{p_end}
{p 0 48}DayCasMeSmA05S00{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Daily cases smooth A05 SRIV{p_end}
{p 0 48}{bind:epoch_SRIV     }{txt}{bind: int     }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}SRIV Forecast start date{p_end}
{p 0 48}DayDeaFOREA05S00{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Daily Forecasted Deaths Mean smoothed SRIV{p_end}
{p 0 48}DayCasFOREA05S00{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Daily Forecasted Cases Mean smoothed SRIV{p_end}
{p 0 48}DayCTDMeRaA00S00{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Daily Cases to Deaths S0 JOHN{p_end}
{p 0 48}TotCTDMeRaA00S00{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Total Cases to Deaths S0 JOHN{p_end}
{p 0 48}DayCTDMeRaA01S00{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Daily Cases to Deaths S0 DELP{p_end}
{p 0 48}TotCTDMeRaA01S00{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Total Cases to Deaths S0 DELP{p_end}
{p 0 48}DayITDMeRaA02S01{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Daily Infections to Deaths S1 IHME{p_end}
{p 0 48}TotITDMeRaA02S01{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Total Infections to Deaths S1 IHME{p_end}
{p 0 48}DayITDMeRaA02S02{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Daily Infections to Deaths S2 IHME{p_end}
{p 0 48}TotITDMeRaA02S02{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Total Infections to Deaths S2 IHME{p_end}
{p 0 48}DayCTDMeRaA05S00{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Daily Cases to Deaths S0 SRIV{p_end}
{p 0 48}TotCTDMeRaA05S00{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Total Cases to Deaths S0 SRIV{p_end}
{p 0 48}DayDERMeRaA00S00{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Daily Deaths estim to reported JOHN = 1{p_end}
{p 0 48}DayDERMeRaA01S00{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Daily Deaths estim to reported Mean DELP S0{p_end}
{p 0 48}DayDERMeRaA02S01{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Daily Deaths estim to reported Mean not smoothed IHME S1{p_end}
{p 0 48}DayDERMeRaA02S02{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Daily Deaths estim to reported Mean not smoothed IHME S2{p_end}
{p 0 48}DayDERMeRaA05S00{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Daily Deaths estim to reported S0 SRIV{p_end}
{p 0 48}DayCERMeRaA00S00{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Daily Cases estim to reported JOHN = 1{p_end}
{p 0 48}DayCERMeRaA01S00{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Daily Cases estim to reported Mean DELP S0{p_end}
{p 0 48}DayIERMeRaA02S01{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Daily Infections estim to reported Mean not smoothed IHME S1{p_end}
{p 0 48}DayIERMeRaA02S02{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Daily Infections estim to reported Mean not smoothed IHME S2{p_end}
{p 0 48}DayCERMeRaA05S00{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Daily Cases estim to reported S0 SRIV{p_end}
{p 0 48}TotDERMeRaA00S00{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Total Deaths estim to reported JOHN = 1{p_end}
{p 0 48}TotDERMeRaA01S00{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Total Deaths estim to reported Mean DELP S0{p_end}
{p 0 48}TotDERMeRaA02S01{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Total Deaths estim to reported Mean not smoothed IHME S1{p_end}
{p 0 48}TotDERMeRaA02S02{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Total Deaths estim to reported Mean not smoothed IHME S2{p_end}
{p 0 48}TotDERMeRaA05S00{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Total Deaths estim to reported S0 SRIV{p_end}
{p 0 48}TotCERMeRaA00S00{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Total Cases estim to reported JOHN = 1{p_end}
{p 0 48}TotCERMeRaA01S00{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Total Cases estim to reported Mean DELP S0{p_end}
{p 0 48}TotIERMeRaA02S01{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Total Infections estim to reported Mean not smoothed IHME S1{p_end}
{p 0 48}TotIERMeRaA02S02{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Total Infections estim to reported Mean not smoothed IHME S2{p_end}
{p 0 48}TotCERMeRaA05S00{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Total Cases estim to reported S0 SRIV{p_end}
{txt}{hline}
Sorted by: 
{res}     Note: Dataset has changed since last saved.
{txt}
{com}.  
.  
. *
. 
. sort date
{txt}
{com}. 
. qui compress
{txt}
{com}. 
. save "country.dta", replace
{txt}(note: file country.dta not found)
file country.dta saved

{com}. 
. export delimited using "country.csv", replace 
{res}{txt}(note: file country.csv not found)
{txt}file country.csv saved

{com}. 
. 
. *
. 
. 
. 
. 
. 
. ***************
. 
. * graphs 
. 
. 
. grstyle init
{res}{txt}
{com}. 
. grstyle color background white
{txt}
{com}. 
. 
. 
. 
. 
. 
. 
. **********
. 
. * gen monthspast vars for #thicknumber of graphs
. 
. 
. summ date

{txt}    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
{space 8}date {c |}{res}        992     22431.5      286.51      21936      22927
{txt}
{com}. 
. gen mergemaxdate = r(max)
{txt}
{com}. 
. 
. gen monthspast01jan2020merge = ((mergemaxdate - td(01jan2020)) / 30)
{txt}
{com}. 
. replace monthspast01jan2020merge = round(monthspast01jan2020merge)
{txt}(992 real changes made)

{com}. 
. global monthspast01jan2020merge = monthspast01jan2020merge
{txt}
{com}. 
. di $monthspast01jan2020merge
{res}34
{txt}
{com}. 
. 
. 
. gen monthspast01jan2021merge = ((mergemaxdate - td(01jan2021)) / 30)
{txt}
{com}. 
. replace monthspast01jan2021merge = round(monthspast01jan2021merge)
{txt}(992 real changes made)

{com}. 
. global monthspast01jan2021merge = monthspast01jan2021merge
{txt}
{com}. 
. di $monthspast01jan2021merge
{res}22
{txt}
{com}. 
. 
. 
. gen monthspast01jan2022merge = ((mergemaxdate - td(01jan2022)) / 30)
{txt}
{com}. 
. replace monthspast01jan2022merge = round(monthspast01jan2022merge)
{txt}(992 real changes made)

{com}. 
. global monthspast01jan2022merge = monthspast01jan2022merge
{txt}
{com}. 
. di $monthspast01jan2022merge
{res}9
{txt}
{com}. 
. 
. 
. 
. 
. 
. * gen monthspast vars for #thicknumber of graphs JOHN
. 
. gen monthspast01jan2020JOHN = ((today_numericdailydate - td(01jan2020)) / 30) + 1
{txt}(101 missing values generated)

{com}. 
. replace monthspast01jan2020JOHN = round(monthspast01jan2020)
{txt}(891 real changes made)

{com}. 
. global monthspast01jan2020JOHN = monthspast01jan2020JOHN
{txt}
{com}. 
. di $monthspast01jan2020JOHN
{res}31
{txt}
{com}. 
. 
. 
. gen monthspast01jan2021JOHN = ((today_numericdailydate - td(01jan2021)) / 30) + 1
{txt}(101 missing values generated)

{com}. 
. replace monthspast01jan2021JOHN = round(monthspast01jan2021)
{txt}(891 real changes made)

{com}. 
. global monthspast01jan2021JOHN = monthspast01jan2021JOHN
{txt}
{com}. 
. di $monthspast01jan2021JOHN
{res}19
{txt}
{com}. 
. 
. 
. gen monthspast01jan2022JOHN = ((today_numericdailydate - td(01jan2022)) / 30) + 1
{txt}(101 missing values generated)

{com}. 
. replace monthspast01jan2022JOHN = round(monthspast01jan2022JOHN)
{txt}(891 real changes made)

{com}. 
. global monthspast01jan2022JOHN = monthspast01jan2022JOHN
{txt}
{com}. 
. di $monthspast01jan2022JOHN
{res}7
{txt}
{com}. 
. 
. 
. * end date of graphs JOHN
. 
. gen nextmonthspast01jan2020JOHN = monthspast01jan2020JOHN 
{txt}(101 missing values generated)

{com}. 
. gen nextmonthdayspast01jan2020JOHN = nextmonthspast01jan2020JOHN * 30
{txt}(101 missing values generated)

{com}. 
. gen nextmonthdatespast01jan2020JOHN = td(01jan2020) + nextmonthdayspast01jan2020JOHN
{txt}(101 missing values generated)

{com}. 
. local nextmonthdatespast01jan2020JOHN = nextmonthdatespast01jan2020JOHN
{txt}
{com}. 
. 
. 
. gen nextmonthspast01jan2022JOHN = monthspast01jan2022JOHN 
{txt}(101 missing values generated)

{com}. 
. gen nextmonthdayspast01jan2022JOHN = nextmonthspast01jan2022JOHN * 30
{txt}(101 missing values generated)

{com}. 
. gen nextmonthdatespast01jan2022JOHN = td(01jan2022) + nextmonthdayspast01jan2022JOHN
{txt}(101 missing values generated)

{com}. 
. local nextmonthdatespast01jan2022JOHN = nextmonthdatespast01jan2022JOHN
{txt}
{com}. 
. 
. 
. 
. 
. 
. 
. ****************************
. 
. * daily deaths, JOHN, 2020 on
. 
. twoway ///
> (line DayDeaMeRaA00 date, sort lcolor(black) lwidth(medium)) /// 1 "JOHN raw"
> (line DayDeaMeSmA00 date, sort lcolor(cyan*1.2) lwidth(thick)) /// 2 "JOHN smooth"
> if date >= td(01jan2020) & date <= `nextmonthdatespast01jan2020JOHN' ///
> , xtitle(Date) xlabel(#$monthspast01jan2020JOHN, format(%tdYY-NN-DD) labsize(small)) xlabel(, grid) xlabel(, grid) ///
> xlabel(, angle(forty_five)) ylabel(, format(%9.0fc) labsize(small))  ylabel(, labsize(small) angle(horizontal)) ///
> ytitle(Daily reported deaths) title("COVID-19 daily reported deaths, $country, Johns Hopkins", size(medium)) ///
> xscale(lwidth(vthin) lcolor(gray*.2)) yscale(lwidth(vthin) lcolor(gray*.2)) legend(region(lcolor(none))) legend(bexpand) ///
> legend(order(1 "Raw deaths" 2 "Smooth deaths") size(small) row(1)) 
{res}{txt}
{com}. 
. graph export "graph 1 COVID-19 daily deaths, $country, Johns Hopkins.pdf", replace
{txt}(file /Users/farshadpourmalek/Downloads/covir2-main/20220701/code/merge/graph 1 COVID-19 daily deaths, Iran, Johns Hopkins.pdf written in PDF format)

{com}. 
. 
. 
. ****************************
. 
. * daily cases, JOHN, 2020 on
. 
. twoway ///
> (line DayCasMeRaA00 date, sort lcolor(black) lwidth(medium)) /// 1 "JOHN raw"
> (line DayCasMeSmA00 date, sort lcolor(cyan*1.2) lwidth(thick)) /// 2 "JOHN smooth"
> if date >= td(01jan2020) & date <= `nextmonthdatespast01jan2020JOHN' ///
> , xtitle(Date) xlabel(#$monthspast01jan2020JOHN, format(%tdYY-NN-DD) labsize(small)) xlabel(, grid) xlabel(, grid) ///
> xlabel(, angle(forty_five)) ylabel(, format(%9.0fc) labsize(small))  ylabel(, labsize(small) angle(horizontal)) ///
> ytitle(Daily reported cases) title("COVID-19 daily reported cases, $country, Johns Hopkins", size(medium)) ///
> xscale(lwidth(vthin) lcolor(gray*.2)) yscale(lwidth(vthin) lcolor(gray*.2)) legend(region(lcolor(none))) legend(bexpand) ///
> legend(order(1 "Raw cases" 2 "Smooth cases") size(small) row(1)) ///
> 
{res}{txt}
{com}. 
. graph export "graph 2 COVID-19 daily cases, $country, Johns Hopkins.pdf", replace
{txt}(file /Users/farshadpourmalek/Downloads/covir2-main/20220701/code/merge/graph 2 COVID-19 daily cases, Iran, Johns Hopkins.pdf written in PDF format)

{com}. 
. 
. 
. 
. 
. 
. ****************************
. 
. * daily deaths, JOHN, 2022 on
. 
. twoway ///
> (line DayDeaMeRaA00 date, sort lcolor(black) lwidth(medium)) /// 1 "JOHN raw"
> (line DayDeaMeSmA00 date, sort lcolor(cyan*1.2) lwidth(thick)) /// 2 "JOHN smooth"
> if date >= td(01jan2022) & date <= `nextmonthdatespast01jan2022JOHN' ///
> , xtitle(Date) xlabel(#$monthspast01jan2022JOHN, format(%tdYY-NN-DD) labsize(small)) xlabel(, grid) xlabel(, grid) ///
> xlabel(, angle(forty_five)) ylabel(, format(%9.0fc) labsize(small)) ylabel(, labsize(small) angle(horizontal)) ///
> ytitle(Daily reported deaths) title("COVID-19 daily reported deaths, $country, Johns Hopkins, 2022", size(medium)) ///
> xscale(lwidth(vthin) lcolor(gray*.2)) yscale(lwidth(vthin) lcolor(gray*.2)) legend(region(lcolor(none))) legend(bexpand) ///
> legend(order(1 "Raw deaths" 2 "Smooth deaths") size(small) row(1)) 
{res}{txt}
{com}. 
. graph export "graph 3 COVID-19 daily deaths, $country, Johns Hopkins, 2022 on.pdf", replace
{txt}(file /Users/farshadpourmalek/Downloads/covir2-main/20220701/code/merge/graph 3 COVID-19 daily deaths, Iran, Johns Hopkins, 2022 on.pdf written in PDF format)

{com}. 
. 
. 
. ****************************
. 
. * daily cases, JOHN, 2022 on
. 
. twoway ///
> (line DayCasMeRaA00 date, sort lcolor(black) lwidth(medium)) /// 1 "JOHN raw"
> (line DayCasMeSmA00 date, sort lcolor(cyan*1.2) lwidth(thick)) /// 2 "JOHN smooth"
> if date >= td(01jan2022) & date <= `nextmonthdatespast01jan2022JOHN' ///
> , xtitle(Date) xlabel(#$monthspast01jan2022JOHN, format(%tdYY-NN-DD) labsize(small)) xlabel(, grid) xlabel(, grid) ///
> xlabel(, angle(forty_five)) ylabel(, format(%9.0fc) labsize(small))  ylabel(, labsize(small) angle(horizontal)) ///
> ytitle(Daily reported cases) title("COVID-19 daily reported cases, $country, Johns Hopkins, 2022", size(medium)) ///
> xscale(lwidth(vthin) lcolor(gray*.2)) yscale(lwidth(vthin) lcolor(gray*.2)) legend(region(lcolor(none))) legend(bexpand) ///
> legend(order(1 "Raw cases" 2 "Smooth cases") size(small) row(1)) 
{res}{txt}
{com}. 
. graph export "graph 4 COVID-19 daily cases, $country, Johns Hopkins, 2022 on.pdf", replace
{txt}(file /Users/farshadpourmalek/Downloads/covir2-main/20220701/code/merge/graph 4 COVID-19 daily cases, Iran, Johns Hopkins, 2022 on.pdf written in PDF format)

{com}. 
. 
. 
. 
. 
. 
. 
. ******************
. 
. 
. 
. * daily deaths (graph numbers start with 11)
. 
. 
. ****
. * daily deaths, reference scenario, all time
. 
. twoway ///
> (line DayDeaMeSmA00 date, sort lcolor(cyan) lwidth(thick)) /// 1 "JOHN smooth"
> (line DayDeaFOREA01S00 date, sort lcolor(red) lpattern(tight_dot) lwidth(vthick)) /// 2 "DELP" Forecast only
> (line DayDeaMeSmA01S00 date, sort lcolor(red)) /// 3 "DELP"
> (line DayDeaFOREA02S01 date, sort lcolor(black) lpattern(tight_dot) lwidth(vthick)) /// 4 "IHME" Forecast only
> (line DayDeaMeSmA02S01 date, sort lcolor(black)) /// 5 "IHME"
> (line DayDeXMeSmA02S01 date, sort lcolor(brown) lpattern(dash)) /// 6 "IHME" Excess
> (line DayDeaFOREA05S00 date, sort lcolor(green) lpattern(tight_dot) lwidth(vthick)) /// 7 "SRIV" Forecast only
> (line DayDeaMeSmA05S00 date, sort lcolor(green)) /// 8 "SRIV"
> if date >= td(01jan2020) ///
> , xtitle(Date) xlabel(#$monthspast01jan2020merge, format(%tdYY-NN-DD) labsize(small)) xlabel(, grid) ///
> xlabel(, angle(forty_five)) ylabel(, format(%9.0fc) labsize(small)) ylabel(, labsize(small) angle(horizontal)) ///
> ytitle(Daily deaths) title("COVID-19 daily deaths, $country", size(medium)) /// 
> xscale(lwidth(vthin) lcolor(gray*.2)) yscale(lwidth(vthin) lcolor(gray*.2)) legend(region(lcolor(none))) legend(bexpand) ///
> legend(order(1 "JOHN" 3 "DELP" 5 "IHME" 6 "IHME excess" 8 "SRIV") size(small) row(2)) ///
> subtitle("reference scenarios", size(small)) 
{res}{txt}
{com}. 
. graph export "graph 11 COVID-19 daily deaths, $country, reference scenarios, all time.pdf", replace
{txt}(file /Users/farshadpourmalek/Downloads/covir2-main/20220701/code/merge/graph 11 COVID-19 daily deaths, Iran, reference scenarios, all time.pdf written in PDF format)

{com}. 
. 
. 
. ****
. * daily deaths, reference scenario, 2021
. 
. twoway ///
> (line DayDeaMeSmA00 date, sort lcolor(cyan) lwidth(thick)) /// 1 "JOHN smooth"
> (line DayDeaFOREA01S00 date, sort lcolor(red) lpattern(tight_dot) lwidth(vthick)) /// 2 "DELP" Forecast only
> (line DayDeaMeSmA01S00 date, sort lcolor(red)) /// 3 "DELP"
> (line DayDeaFOREA02S01 date, sort lcolor(black) lpattern(tight_dot) lwidth(vthick)) /// 4 "IHME" Forecast only
> (line DayDeaMeSmA02S01 date, sort lcolor(black)) /// 5 "IHME"
> (line DayDeXMeSmA02S01 date, sort lcolor(brown) lpattern(dash)) /// 6 "IHME" Excess
> (line DayDeaFOREA05S00 date, sort lcolor(green) lpattern(tight_dot) lwidth(vthick)) /// 7 "SRIV" Forecast only
> (line DayDeaMeSmA05S00 date, sort lcolor(green)) /// 8 "SRIV"
> if date >= td(01jan2021) ///
> , xtitle(Date) xlabel(#$monthspast01jan2021merge, format(%tdYY-NN-DD) labsize(small)) xlabel(, grid) ///
> xlabel(, angle(forty_five)) ylabel(, format(%9.0fc) labsize(small))  ylabel(, labsize(small) angle(horizontal)) ///
> ytitle(Daily deaths) title("COVID-19 daily deaths, $country", size(medium)) /// 
> xscale(lwidth(vthin) lcolor(gray*.2)) yscale(lwidth(vthin) lcolor(gray*.2)) legend(region(lcolor(none))) legend(bexpand) ///
> legend(order(1 "JOHN" 3 "DELP" 5 "IHME" 6 "IHME excess" 8 "SRIV") size(small) rows(1)) ///
> subtitle("2021 on, reference scenarios", size(small)) ///
> note("Reference scenario forecasts are marked with |||||||||||| " , size(small))  
{res}{txt}
{com}. 
. graph export "graph 12 COVID-19 daily deaths, $country, reference scenarios.pdf", replace
{txt}(file /Users/farshadpourmalek/Downloads/covir2-main/20220701/code/merge/graph 12 COVID-19 daily deaths, Iran, reference scenarios.pdf written in PDF format)

{com}. 
. 
. 
. 
. ****
. * daily deaths, reference scenario, 2021, CI
. 
. twoway ///
> (line DayDeaMeSmA00 date, sort lcolor(cyan) lwidth(thick)) /// 1 "JOHN smooth"
> (line DayDeaMeRaA01S00 date, sort lcolor(red)) /// 2 "DELP" mean
> (line DayDeaLoRaA01S00 date, sort lcolor(red) lpattern(dash)) /// 3 "DELP" lower
> (line DayDeaUpRaA01S00 date, sort lcolor(red) lpattern(dash)) /// 4 "DELP" upper
> (line DayDeaMeSmA02S01 date, sort lcolor(black)) /// 5 IHME mean
> (line DayDeaLoSmA02S01 date, sort lcolor(black) lpattern(dash)) /// 6 IHME lower
> (line DayDeaUpSmA02S01 date, sort lcolor(black) lpattern(dash)) /// 7 IHME upper
> (line DayDeaMeRaA05S00 date, sort lcolor(green)) /// 8 SRIV mean
> (line DayDeaLoRaA05S00 date, sort lcolor(green) lpattern(dash)) /// 9 SRIV lower
> (line DayDeaUpRaA05S00 date, sort lcolor(green) lpattern(dash)) /// 10 SRIV upper
> if date >= td(01jan2021) ///
> , xtitle(Date) xlabel(#$monthspast01jan2021merge, format(%tdYY-NN-DD) labsize(small)) xlabel(, grid)  ///
> xlabel(, angle(forty_five)) ylabel(, format(%9.0fc) labsize(small))  ylabel(, labsize(small) angle(horizontal)) ///
> ytitle(Daily deaths) title("COVID-19 daily deaths, $country", size(medium)) ///
> xscale(lwidth(vthin) lcolor(gray*.2)) yscale(lwidth(vthin) lcolor(gray*.2)) legend(region(lcolor(none))) legend(bexpand) ///
> legend(order(1 "JOHN" 2 "DELP" 5 "IHME" 8 "SRIV") size(small) row(1)) ///
> subtitle("2021 on, reference scenarios with uncertainty", size(small)) ///
> note("Uncertainty limits: dashed curves", size(small))
{res}{txt}
{com}. 
. graph export "graph 13 COVID-19 daily deaths, $country, reference scenarios, CI.pdf", replace
{txt}(file /Users/farshadpourmalek/Downloads/covir2-main/20220701/code/merge/graph 13 COVID-19 daily deaths, Iran, reference scenarios, CI.pdf written in PDF format)

{com}. 
. 
. 
. 
. ****
. * daily deaths, reference scenario with uncertainty, IHME, 2021 
. 
. twoway ///
> (line DayDeaMeSmA00 date, sort lcolor(cyan) lwidth(thick)) /// 1 "JOHN smooth"
> (line DayDeaMeSmA02S01 date, sort lcolor(black)) /// 2 IHME reference mean
> (line DayDeaLoSmA02S01 date, sort lcolor(green) lpattern(dash)) /// 3 IHME reference lower
> (line DayDeaUpSmA02S01 date, sort lcolor(red) lpattern(dash)) /// 4 IHME reference upper
> (line DayDeXLoSmA02S01 date, sort lcolor(green) lpattern(dash_dot)) /// 5 "IHME excess lower"
> (line DayDeXUpSmA02S01 date, sort lcolor(red) lpattern(dash_dot)) /// 6 "IHME excess upper"
> (line DayDeXMeSmA02S01 date, sort lcolor(black) lpattern(dash_dot) lwidth(medthick)) /// 7 "IHME excess mean"
> if date >= td(01jan2021) ///
> , xtitle(Date) xlabel(#$monthspast01jan2021merge, format(%tdYY-NN-DD) labsize(small)) xlabel(, grid) ///
> xlabel(, angle(forty_five)) ylabel(, format(%9.0fc) labsize(small)) ylabel(, labsize(small) angle(horizontal)) ///
> ytitle(Daily deaths) title("COVID-19 daily deaths, $country, IHME", size(medium)) ///
> xscale(lwidth(vthin) lcolor(gray*.2)) yscale(lwidth(vthin) lcolor(gray*.2)) legend(region(lcolor(none))) legend(bexpand) ///
> legend(order(1 "JOHN" 2 "IHME reference scenario, mean" ///
> 3 "IHME reference scenario, lower" 4 "IHME reference scenario, upper" 5 "IHME excess lower" ///
> 6 "IHME excess upper" 7 "IHME excess mean") size(small) row(4)) ///
> subtitle("2021 on, reference scenario with uncertainty", size(small)) ///
> note("Uncertainty limits: dashed (– – –) curves", size(small)) 
{res}{txt}
{com}. 
. graph export "graph 14 COVID-19 daily deaths, $country, reference scenario with uncertainty, IHME.pdf", replace
{txt}(file /Users/farshadpourmalek/Downloads/covir2-main/20220701/code/merge/graph 14 COVID-19 daily deaths, Iran, reference scenario with uncertainty, IHME.pdf written in PDF format)

{com}. 
. 
. 
. ****
. * daily deaths, all scenarios, IHME, 2021
. 
. twoway ///
> (line DayDeaMeSmA00 date, sort lcolor(cyan) lwidth(thick)) /// 1
> (line DayDeaFOREA02S01 date, sort lcolor(black*0.6) lpattern(tight_dot) lwidth(vthick)) /// 2 "IHME" Forecast only
> (line DayDeaMeSmA02S01 date, sort lcolor(black) lwidth(medthick)) /// 3 "IHME" 
> (line DayDeaMeSmA02S02 date, sort lcolor(blue)) /// 4
> (line DayDeaMeSmA02S03 date, sort lcolor(green)) /// 5
> if date >= td(01jan2021) ///
> , xtitle(Date) xlabel(#$monthspast01jan2021merge, format(%tdYY-NN-DD) labsize(small)) xlabel(, grid) xlabel(, grid) ///
> xlabel(, angle(forty_five)) ylabel(, format(%12.0fc) labsize(small))  ylabel(, labsize(small) angle(horizontal)) ///
> ytitle(Daily reported deaths) title("COVID-19 daily reported deaths, $country, IHME, all scenarios", size(medium)) ///
> xscale(lwidth(vthin) lcolor(gray*.2)) yscale(lwidth(vthin) lcolor(gray*.2)) legend(region(lcolor(none))) legend(bexpand) ///
> legend(order(1 "JOHN" 3 "IHME Reference" 4 "IHME Masks" 5 "IHME Antivirals") size(small) rows(1)) ///
> note("Reference scenario forecasts are marked with |||||||||||| " , size(small))
{res}{txt}
{com}. 
. graph export "graph 15 COVID-19 daily deaths, $country, all scenarios, IHME.pdf", replace
{txt}(file /Users/farshadpourmalek/Downloads/covir2-main/20220701/code/merge/graph 15 COVID-19 daily deaths, Iran, all scenarios, IHME.pdf written in PDF format)

{com}. 
. 
. /*
> ****
> * daily deaths, reference scenario with uncertainty, IMPE, 2021
> 
> twoway ///
> (line DayDeaMeSmA00 date, sort lcolor(cyan) lwidth(thick)) /// 1 "JOHN smooth"
> (line DayDeaFOREA03S02 date, sort lcolor(black*0.6) lpattern(tight_dot) lwidth(vthick)) /// 2 "IMPE" Forecast only
> (line DayDeaMeSmA03S02 date, sort lcolor(black)) /// 3 IMPE reference mean
> (line DayDeaLoSmA03S02 date, sort lcolor(green) lpattern(dash)) /// 4 IMPE reference lower
> (line DayDeaUpSmA03S02 date, sort lcolor(red) lpattern(dash)) /// 5 IMPE reference upper
> if date >= td(01jan2021) ///
> , xtitle(Date) xlabel(#$monthspast01jan2021merge, format(%tdYY-NN-DD) labsize(small)) xlabel(, grid) ///
> xlabel(, angle(forty_five)) ylabel(, format(%9.0fc) labsize(small)) ylabel(, labsize(small) angle(horizontal)) ///
> ytitle(Daily deaths) title("COVID-19 daily deaths, $country, IMPE", size(medium)) ///
> xscale(lwidth(vthin) lcolor(gray*.2)) yscale(lwidth(vthin) lcolor(gray*.2)) legend(region(lcolor(none))) legend(bexpand) ///
> legend(order(1 "JOHN smooth" 3 "IMPE reference scenario, mean" ///
> 4 "IMPE reference scenario, lower" 5 "IMPE reference scenario, upper") size(small) row(3)) ///
> subtitle("2021 on, reference scenario with uncertainty", size(small)) ///
> note("Reference scenario forecasts are marked with |||||||||||| " , size(small))
> 
> graph export "graph 16 COVID-19 daily deaths, $country, reference scenario with uncertainty, IMPE.pdf", replace
> 
> 
> 
> ****
> * daily deaths, 3 scenarios, IMPE, 2021
> 
> twoway ///
> (line DayDeaMeSmA00 date, sort lcolor(cyan) lwidth(thick)) /// 1 "JOHN smooth"
> (line DayDeaMeSmA03S02 date, sort lcolor(black)) /// 2 IMPE reference mean
> (line DayDeaMeSmA03S01 date, sort lcolor(green) lwidth(thick) lpattern(tight_dot)) /// 3 IMPE better mean
> (line DayDeaMeSmA03S03 date, sort lcolor(red) lwidth(thick) lpattern(tight_dot)) /// 4 IMPE worse mean
> (line DayDeaUpSmA03S03 date, sort lcolor(red) lpattern(dash)) /// 5 IMPE worse upper
> if date >= td(01jan2021) ///
> , xtitle(Date) xlabel(#$monthspast01jan2021merge, format(%tdYY-NN-DD) labsize(small)) xlabel(, grid) ///
> xlabel(, angle(forty_five)) ylabel(, format(%9.0fc) labsize(small)) ylabel(, labsize(small) angle(horizontal)) ///
> ytitle(Daily deaths) title("COVID-19 daily deaths, $country, IMPE", size(medium)) ///
> xscale(lwidth(vthin) lcolor(gray*.2)) yscale(lwidth(vthin) lcolor(gray*.2)) legend(region(lcolor(none))) legend(bexpand) ///
> legend(order(1 "JOHN" 2 "IMPE reference scenario, mean" 3 "IMPE better scenario, mean" ///
> 4 "IMPE worse scenario, mean" 5 "IMPE worse scenario, upper uncertainty limit") size(small) row(3)) ///
> subtitle("2021 on, 3 scenarios", size(small)) ///
> note("Better and worse scenarios: tight dot (|||||) curves; Uncertainty limits: dashed (– – –) curves.")
> 
> graph export "graph 17 COVID-19 daily deaths, $country, 3 scenarios, IMPE.pdf", replace
> */
. 
. 
. 
. ****
. * daily deaths, reference scenario, 2022 on
. 
. twoway ///
> (line DayDeaMeSmA00 date, sort lcolor(cyan) lwidth(vthick)) /// 1 "JOHN smooth"
> (line DayDeaFOREA01S00 date, sort lcolor(red) lpattern(tight_dot) lwidth(vthick)) /// 2 "DELP" Forecast only
> (line DayDeaMeSmA01S00 date, sort lcolor(red)) /// 3 "DELP"
> (line DayDeaFOREA02S01 date, sort lcolor(black) lpattern(tight_dot) lwidth(vthick)) /// 4 "IHME" Forecast only
> (line DayDeaMeSmA02S01 date, sort lcolor(black)) /// 5 "IHME"
> (line DayDeXMeSmA02S01 date, sort lcolor(brown) lpattern(dash)) /// 6 "IHME"
> (line DayDeaFOREA05S00 date, sort lcolor(green) lpattern(tight_dot) lwidth(vthick)) /// 7 "SRIV" Forecast only
> (line DayDeaMeSmA05S00 date, sort lcolor(green)) /// 8 "SRIV"
> if date >= td(01jan2022) ///
> , xtitle(Date) xlabel(#$monthspast01jan2022merge, format(%tdYY-NN-DD) labsize(small)) xlabel(, grid) ///
> xlabel(, angle(forty_five)) ylabel(, format(%9.0fc) labsize(small)) ylabel(, labsize(small) angle(horizontal)) ///
> ytitle(Daily deaths) title("COVID-19 daily deaths, $country", size(medium)) /// 
> xscale(lwidth(vthin) lcolor(gray*.2)) yscale(lwidth(vthin) lcolor(gray*.2)) legend(region(lcolor(none))) legend(bexpand) ///
> legend(order(1 "JOHN" 3 "DELP" 5 "IHME" 6 "IHME excess" 8 "SRIV") size(small) rows(1)) ///
> subtitle("reference scenarios, 2022 on", size(small)) ///
> note("Reference scenario forecasts are marked with |||||||||||| " , size(small))  
{res}{txt}
{com}. 
. graph export "graph 18 COVID-19 daily deaths, $country, reference scenarios, 2022 on.pdf", replace
{txt}(file /Users/farshadpourmalek/Downloads/covir2-main/20220701/code/merge/graph 18 COVID-19 daily deaths, Iran, reference scenarios, 2022 on.pdf written in PDF format)

{com}. 
. 
. 
. ***********************
. 
. * daily cases or infections (graph numbers start with 21)
. 
. twoway ///
> (line DayCasMeSmA00 date, sort lcolor(cyan) lwidth(thick)) /// 1 "JOHN"
> (line DayCasFOREA01S00 date, sort lcolor(red) lpattern(tight_dot) lwidth(vthick)) /// 2 "DELP" Forecast only
> (line DayCasMeSmA01S00 date, sort lcolor(red)) /// 3 "DELP"
> (line DayINFFOREA02S01 date, sort lcolor(black) lpattern(tight_dot) lwidth(vthick)) /// 4 "IHME" Forecast only
> (line DayINFMeSmA02S01 date, sort lcolor(black)) /// 5 "IHME"
> (line DayCasFOREA05S00 date, sort lcolor(green) lpattern(tight_dot) lwidth(vthick)) /// 6 "SRIV" Forecast only
> (line DayCasMeSmA05S00 date, sort lcolor(green)) /// 7 "SRIV"
> if date >= td(01jan2020) ///
> , xtitle(Date) xlabel(#$monthspast01jan2020merge, format(%tdYY-NN-DD) labsize(small)) xlabel(, grid)  ///
> xlabel(, angle(forty_five)) ylabel(, format(%9.0fc) labsize(small)) ylabel(, labsize(small) angle(horizontal)) ///
> ytitle(Daily cases or infections) title("COVID-19 daily cases or infections, $country", size(medium)) /// 
> xscale(lwidth(vthin) lcolor(gray*.2)) yscale(lwidth(vthin) lcolor(gray*.2)) legend(region(lcolor(none))) legend(bexpand) ///
> legend(order(1 "JOHN cases" 3 "DELP cases" 5 "IHME infections" 7 "SRIV cases") size(small) row(2)) ///
> subtitle("reference scenarios", size(small)) ///
> note("Reference scenario forecasts are marked with |||||||||||| " , size(small))
{res}{txt}
{com}. 
. graph export "graph 21 COVID-19 daily cases, $country, reference scenarios, all time.pdf", replace
{txt}(file /Users/farshadpourmalek/Downloads/covir2-main/20220701/code/merge/graph 21 COVID-19 daily cases, Iran, reference scenarios, all time.pdf written in PDF format)

{com}. 
. 
. 
. 
. ****
. * daily cases or infections, reference scenario, 2021
. 
. twoway ///
> (line DayCasMeSmA00 date, sort lcolor(cyan) lwidth(thick)) /// 1 "JOHN"
> (line DayCasFOREA01S00 date, sort lcolor(red) lpattern(tight_dot) lwidth(vthick)) /// 2 "DELP" Forecast only
> (line DayCasMeSmA01S00 date, sort lcolor(red)) /// 3 "DELP"
> (line DayINFFOREA02S01 date, sort lcolor(black) lpattern(tight_dot) lwidth(vthick)) /// 4 "IHME" Forecast only
> (line DayINFMeSmA02S01 date, sort lcolor(black)) /// 5 "IHME"
> (line DayCasFOREA05S00 date, sort lcolor(green) lpattern(tight_dot) lwidth(vthick)) /// 6 "SRIV" Forecast only
> (line DayCasMeSmA05S00 date, sort lcolor(green)) /// 7 "SRIV"
> if date >= td(01jan2021) ///
> , xtitle(Date) xlabel(#$monthspast01jan2021merge, format(%tdYY-NN-DD) labsize(small)) xlabel(, grid)  ///
> xlabel(, angle(forty_five)) ylabel(, format(%9.0fc) labsize(small)) ylabel(, labsize(small) angle(horizontal)) ///
> ytitle(Daily cases or infections) title("COVID-19 daily cases or infections, $country", size(medium)) /// 
> xscale(lwidth(vthin) lcolor(gray*.2)) yscale(lwidth(vthin) lcolor(gray*.2)) legend(region(lcolor(none))) legend(bexpand) ///
> legend(order(1 "JOHN cases" 3 "DELP cases" 5 "IHME infections" 7 "SRIV cases") size(small) row(2)) ///
> subtitle("2021 on, reference scenarios", size(small)) ///
> note("Reference scenario forecasts are marked with |||||||||||| " , size(small))
{res}{txt}
{com}. 
. graph export "graph 22 COVID-19 daily cases, $country, reference scenarios.pdf", replace
{txt}(file /Users/farshadpourmalek/Downloads/covir2-main/20220701/code/merge/graph 22 COVID-19 daily cases, Iran, reference scenarios.pdf written in PDF format)

{com}. 
. 
. 
. ****
. * daily cases, reference scenario, 2021
. 
. twoway ///
> (line DayCasMeSmA00 date, sort lcolor(cyan) lwidth(thick)) /// 1 "JOHN"
> (line DayCasFOREA01S00 date, sort lcolor(red) lpattern(tight_dot) lwidth(vthick)) /// 2 "DELP" Forecast only
> (line DayCasMeSmA01S00 date, sort lcolor(red)) /// 3 "DELP"
> (line DayCasFOREA05S00 date, sort lcolor(green) lpattern(tight_dot) lwidth(vthick)) /// 4 "SRIV" Forecast only
> (line DayCasMeSmA05S00 date, sort lcolor(green)) /// 5 "SRIV"
> if date >= td(01jan2021) ///
> , xtitle(Date) xlabel(#$monthspast01jan2021merge, format(%tdYY-NN-DD) labsize(small)) xlabel(, grid) ///
> xlabel(, angle(forty_five)) ylabel(, format(%9.0fc) labsize(small))  ylabel(, labsize(small) angle(horizontal)) ///
> ytitle(Daily cases) title("COVID-19 daily cases, $country", size(medium)) /// 
> xscale(lwidth(vthin) lcolor(gray*.2)) yscale(lwidth(vthin) lcolor(gray*.2)) legend(region(lcolor(none))) legend(bexpand) ///
> legend(order(1 "JOHN cases" 3 "DELP cases" 5 "SRIV cases") size(small) row(1)) ///
> subtitle("2021 on, reference scenarios", size(small)) 
{res}{txt}
{com}. 
. graph export "graph 22b COVID-19 daily cases, $country, reference scenarios.pdf", replace
{txt}(file /Users/farshadpourmalek/Downloads/covir2-main/20220701/code/merge/graph 22b COVID-19 daily cases, Iran, reference scenarios.pdf written in PDF format)

{com}. 
. 
. 
. 
. 
. 
. ****
. * daily cases, reference scenario, 2022
. 
. twoway ///
> (line DayCasMeSmA00 date, sort lcolor(cyan) lwidth(thick)) /// 1 "JOHN"
> (line DayCasFOREA01S00 date, sort lcolor(red) lpattern(tight_dot) lwidth(vthick)) /// 2 "DELP" Forecast only
> (line DayCasMeSmA01S00 date, sort lcolor(red)) /// 3 "DELP"
> (line DayCasFOREA05S00 date, sort lcolor(green) lpattern(tight_dot) lwidth(vthick)) /// 4 "SRIV" Forecast only
> (line DayCasMeSmA05S00 date, sort lcolor(green)) /// 5 "SRIV"
> if date >= td(01jan2022) ///
> , xtitle(Date) xlabel(#$monthspast01jan2022merge, format(%tdYY-NN-DD) labsize(small)) xlabel(, grid) ///
> xlabel(, angle(forty_five)) ylabel(, format(%9.0fc) labsize(small))  ylabel(, labsize(small) angle(horizontal)) ///
> ytitle(Daily cases) title("COVID-19 daily cases, $country", size(medium)) /// 
> xscale(lwidth(vthin) lcolor(gray*.2)) yscale(lwidth(vthin) lcolor(gray*.2)) legend(region(lcolor(none))) legend(bexpand) ///
> legend(order(1 "JOHN cases" 3 "DELP cases" 5 "SRIV cases") size(small) row(1)) ///
> subtitle("2022 on, reference scenarios", size(small)) 
{res}{txt}
{com}. 
. graph export "graph 22b2 COVID-19 daily cases, $country, reference scenarios.pdf", replace
{txt}(file /Users/farshadpourmalek/Downloads/covir2-main/20220701/code/merge/graph 22b2 COVID-19 daily cases, Iran, reference scenarios.pdf written in PDF format)

{com}. 
. 
. 
. 
. 
. 
. ****
. * daily cases or infections, reference scenarios, 2021, CI
. 
. twoway ///
> (line DayCasMeRaA00 date, sort lcolor(cyan) lwidth(thick)) /// 1 JOHN
> (line DayCasMeRaA01S00 date, sort lcolor(red)) /// 2 "DELP" mean
> (line DayCasLoRaA01S00 date, sort lcolor(red) lpattern(dash)) /// 3 "DELP" lower
> (line DayCasUpRaA01S00 date, sort lcolor(red) lpattern(dash)) /// 4 "DELP" upper
> (line DayINFMeSmA02S01 date, sort lcolor(black)) /// 5 IHME mean
> (line DayINFLoSmA02S01 date, sort lcolor(black) lpattern(dash)) /// 6 IHME lower
> (line DayINFUpSmA02S01 date, sort lcolor(black) lpattern(dash)) /// 7 IHME upper
> (line DayCasMeRaA05S00 date, sort lcolor(green)) /// 8 SRIV mean
> (line DayCasLoRaA05S00 date, sort lcolor(green) lpattern(dash)) /// 9 SRIV lower
> (line DayCasUpRaA05S00 date, sort lcolor(green) lpattern(dash)) /// 10 SRIV upper
> if date >= td(01jan2021) ///
> , xtitle(Date) xlabel(#$monthspast01jan2021merge, format(%tdYY-NN-DD) labsize(small)) xlabel(, grid) ///
> xlabel(, angle(forty_five)) ylabel(, format(%9.0fc) labsize(small)) ylabel(, labsize(small) angle(horizontal)) ///
> ytitle(Daily cases or infections) title("COVID-19 daily cases or infections, $country", size(medium)) ///
> xscale(lwidth(vthin) lcolor(gray*.2)) yscale(lwidth(vthin) lcolor(gray*.2)) legend(region(lcolor(none))) legend(bexpand) ///
> legend(order(1 "JOHN cases" 2 "DELP cases" 5 "IHME infections" ///
> 8 "SRIV cases") size(small) row(2)) /// 
> subtitle("2021 on, reference scenarios with uncertainty", size(small)) ///
> 
{res}{txt}
{com}. graph export "graph 23 COVID-19 daily cases, $country, reference scenarios, CI.pdf", replace
{txt}(file /Users/farshadpourmalek/Downloads/covir2-main/20220701/code/merge/graph 23 COVID-19 daily cases, Iran, reference scenarios, CI.pdf written in PDF format)

{com}. 
. 
. 
. ****
. * daily cases or infections, full scenarios, with uncertainty, 2021
. 
. twoway ///
> (line DayCasMeRaA00 date, sort lcolor(cyan) lwidth(thick)) /// 1 JOHN
> (line DayCasMeRaA01S00 date, sort lcolor(red)) /// 2 "DELP" mean
> (line DayCasLoRaA01S00 date, sort lcolor(red) lpattern(dash)) /// 3 "DELP" lower
> (line DayCasUpRaA01S00 date, sort lcolor(red) lpattern(dash)) /// 4 "DELP" upper
> (line DayINFMeSmA02S01 date, sort lcolor(black)) /// 5 IHME reference mean
> (line DayINFLoSmA02S01 date, sort lcolor(black) lpattern(dash)) /// 6 IHME reference lower
> (line DayINFUpSmA02S01 date, sort lcolor(black) lpattern(dash)) /// 7 IHME reference upper
> (line DayINFMeSmA02S02 date, sort lcolor(black) lwidth(thick) lpattern(tight_dot)) /// 8 IHME better mean
> (line DayCasMeRaA05S00 date, sort lcolor(green)) /// 9 SRIV mean
> (line DayCasLoRaA05S00 date, sort lcolor(green) lpattern(dash)) /// 10 SRIV lower
> (line DayCasUpRaA05S00 date, sort lcolor(green) lpattern(dash)) /// 11 SRIV upper
> if date >= td(01jan2021) ///
> , xtitle(Date) xlabel(#$monthspast01jan2021merge, format(%tdYY-NN-DD) labsize(small)) xlabel(, grid) ///
> xlabel(, angle(forty_five)) ylabel(, format(%9.0fc) labsize(small)) ylabel(, labsize(small) angle(horizontal)) ///
> ytitle(Daily cases or infections) title("COVID-19 daily cases or infections, $country", size(medium)) ///
> xscale(lwidth(vthin) lcolor(gray*.2)) yscale(lwidth(vthin) lcolor(gray*.2)) legend(region(lcolor(none))) legend(bexpand) ///
> legend(order(1 "JOHN cases" 2 "DELP cases" 5 "IHME reference, mean" 6 "IHME ref, uncertainty" 8 "IHME better" ///
> 9 "SRIV ref, mean") size(small) row(4)) ///
> subtitle("2021 on, full scenarios, with uncertainty; IHME: infections", size(small))
{res}{txt}
{com}. 
. graph export "graph 23 COVID-19 daily cases, $country, full scenarios, CI.pdf", replace
{txt}(file /Users/farshadpourmalek/Downloads/covir2-main/20220701/code/merge/graph 23 COVID-19 daily cases, Iran, full scenarios, CI.pdf written in PDF format)

{com}. 
. 
. 
. ****
. * daily infections, reference scenario with uncertainty, IHME, 2021
. 
. twoway ///
> (line DayCasMeRaA00 date, sort lcolor(cyan) lwidth(thick)) /// 1 JOHN
> (line DayINFMeSmA02S01 date, sort lcolor(black)) /// 2 IHME reference mean
> (line DayINFLoSmA02S01 date, sort lcolor(green) lpattern(dash)) /// 3 IHME reference lower
> (line DayINFUpSmA02S01 date, sort lcolor(red) lpattern(dash)) /// 4 IHME reference upper
> if date >= td(01jan2021) ///
> , xtitle(Date) xlabel(#$monthspast01jan2021merge, format(%tdYY-NN-DD) labsize(small)) xlabel(, grid) ///
> xlabel(, angle(forty_five)) ylabel(, format(%9.0fc) labsize(small)) ylabel(, labsize(small) angle(horizontal)) ///
> ytitle(Daily cases or infections) title("COVID-19 daily cases JOHN, and infections IHME, $country", size(medium)) ///
> xscale(lwidth(vthin) lcolor(gray*.2)) yscale(lwidth(vthin) lcolor(gray*.2)) legend(region(lcolor(none))) legend(bexpand) ///
> legend(order(1 "JOHN cases" 2 "IHME reference, mean" 3 "IHME reference, lower" 4 "IHME reference, upper") size(small) row(2)) ///
> subtitle("2021 on, IHME infections reference scenario with uncertainty", size(small)) ///
> note("Uncertainty limits: dashed (– – –) curves", size(small))
{res}{txt}
{com}. 
. graph export "graph 24 COVID-19 daily cases, $country, reference scenario with uncertainty, IHME.pdf", replace
{txt}(file /Users/farshadpourmalek/Downloads/covir2-main/20220701/code/merge/graph 24 COVID-19 daily cases, Iran, reference scenario with uncertainty, IHME.pdf written in PDF format)

{com}. 
. 
. 
. 
. ****
. * daily infections, all scenarios, IHME, 2021
. 
. twoway ///
> (line DayINFMeSmA02S01 date, sort lcolor(black) lwidth(medthick)) ///
> (line DayINFMeSmA02S02 date, sort lcolor(blue)) ///
> (line DayINFMeSmA02S03 date, sort lcolor(green)) /// 
> if date >= td(01jan2021) ///
> , xtitle(Date) xlabel(#$monthspast01jan2021merge, format(%tdYY-NN-DD) labsize(small)) xlabel(, grid) xlabel(, grid) ///
> xlabel(, angle(forty_five)) ylabel(, format(%12.0fc) labsize(small))  ylabel(, labsize(small) angle(horizontal)) ///
> ytitle(Daily infections) title("COVID-19 daily infections, $country, IHME, all scenarios", size(medium)) ///
> xscale(lwidth(vthin) lcolor(gray*.2)) yscale(lwidth(vthin) lcolor(gray*.2)) legend(region(lcolor(none))) legend(bexpand) ///
> legend(order(1 "Reference" 2 "Masks" 3 "Antivirals") size(small) rows(1))
{res}{txt}
{com}. 
. graph export "graph 25 1 COVID-19 daily cases, $country, all scenarios, IHME.pdf", replace
{txt}(file /Users/farshadpourmalek/Downloads/covir2-main/20220701/code/merge/graph 25 1 COVID-19 daily cases, Iran, all scenarios, IHME.pdf written in PDF format)

{com}. 
. 
. /*
> ****
> * daily infections, reference scenario with uncertainty, IMPE, 2021
> 
> twoway ///
> (line DayCasMeRaA00 date, sort lcolor(cyan) lwidth(thick)) /// 1 JOHN
> (line DayINFMeRaA03S02 date, sort lcolor(black)) /// 2 IMPE reference mean
> (line DayINFLoSmA03S02 date, sort lcolor(green) lpattern(dash)) /// 3 IMPE reference lower
> (line DayINFUpSmA03S02 date, sort lcolor(red) lpattern(dash)) /// 4 IMPE reference upper
> if date >= td(01jan2021) ///
> , xtitle(Date) xlabel(#$monthspast01jan2021merge, format(%tdYY-NN-DD) labsize(small)) xlabel(, grid) ///
> xlabel(, angle(forty_five)) ylabel(, format(%9.0fc) labsize(small)) ylabel(, labsize(small) angle(horizontal)) ///
> ytitle(Daily cases or infections) title("COVID-19 daily cases JOHN, and infections IMPE, $country", size(medium)) ///
> xscale(lwidth(vthin) lcolor(gray*.2)) yscale(lwidth(vthin) lcolor(gray*.2)) legend(region(lcolor(none))) legend(bexpand) ///
> legend(order(1 "JOHN cases" 2 "IMPE reference, mean" 3 "IMPE reference, lower" 4 "IMPE reference, upper") size(small) row(2)) ///
> subtitle("2021 on, IMPE infections reference scenario with uncertainty", size(small))  ///
> note("Uncertainty limits: dashed (– – –) curves", size(small))
> 
> graph export "graph 26 COVID-19 daily cases, $country, reference scenario with uncertainty, IMPE.pdf", replace
> 
> 
> 
> ****
> * daily infections, 2 scenarios, IMPE 
> 
> twoway ///
> (line DayCasMeRaA00 date, sort lcolor(cyan) lwidth(thick)) /// 1 JOHN
> (line DayINFMeRaA03S02 date, sort lcolor(black)) /// 2 IMPE reference mean
> (line DayINFMeRaA03S01 date, sort lcolor(green) lwidth(thick) lpattern(tight_dot)) /// 3 IMPE better mean
> (line DayINFMeRaA03S03 date, sort lcolor(red) lwidth(thick) lpattern(tight_dot)) /// 4 IMPE worse mean
> (line DayINFUpSmA03S03 date, sort lcolor(red) lpattern(dash)) /// 5 IMPE worse upper
> if date >= td(01jan2021) ///
> , xtitle(Date) xlabel(#$monthspast01jan2021merge, format(%tdYY-NN-DD) labsize(small)) xlabel(, grid) ///
> xlabel(, angle(forty_five)) ylabel(, format(%9.0fc) labsize(small)) ylabel(, labsize(small) angle(horizontal)) ///
> ytitle(Daily cases or infections) title("COVID-19 daily JOHN, and infections IMPE, $country", size(medium)) ///
> xscale(lwidth(vthin) lcolor(gray*.2)) yscale(lwidth(vthin) lcolor(gray*.2)) legend(region(lcolor(none))) legend(bexpand) ///
> legend(order(1 "JOHN cases" 2 "IMPE reference, mean" 3 "IMPE better, mean" 4 "IMPE worse, mean" ///
> 5 "IMPE worse scenario, upper uncertainty limit") size(small) row(3)) ///
> subtitle("2021 on, 2 scenarios", size(small)) ///
> note("Better and worse scenarios: tight dot (|||||) curves; Uncertainty limits: dashed (– – –) curves", size(small))
> 
> graph export "graph 27 COVID-19 daily cases, $country, 2 scenarios, IMPE.pdf", replace
> */
. 
. 
. 
. ****
. * daily estimated infections to reported cases IHME, all time
. 
. 
. gen DayITCMeSmA02S01 =  DayINFMeSmA02S01 / DayCasMeRaA00
{txt}(129 missing values generated)

{com}. 
. label var DayITCMeSmA02S01  "Daily Infections IHME to cases JOHN"
{txt}
{com}. 
. /*
> gen DayITCMeRaA03S02 =  DayINFMeRaA03S02 / DayCasMeRaA00
> 
> label var DayITCMeRaA03S02  "Daily Infections IMPE to cases JOHN"
> */
. 
. twoway ///
> (line DayITCMeSmA02S01 date, sort lcolor(black)) /// 1 "IHME"
> if date >= td(01jan2020) ///
> , xtitle(Date) xlabel(#$monthspast01jan2020merge, format(%tdYY-NN-DD) labsize(small)) xlabel(, grid) xlabel(, grid) ///
> xlabel(, angle(forty_five)) ylabel(, format(%15.0fc) labsize(small))  ylabel(, labsize(small) angle(horizontal)) ///
> ytitle(Daily estimated infections to reported cases) title("COVID-19 daily estimated infections to reported cases, $country, IHME", size(medium)) /// 
> xscale(lwidth(vthin) lcolor(gray*.2)) yscale(lwidth(vthin) lcolor(gray*.2)) legend(off) ///
> subtitle("reference scenarios", size(small)) 
{res}{txt}
{com}. 
. graph export "graph 28 C19 daily estimated infections to reported cases, $country, reference scenarios.pdf", replace
{txt}(file /Users/farshadpourmalek/Downloads/covir2-main/20220701/code/merge/graph 28 C19 daily estimated infections to reported cases, Iran, reference scenarios.pdf written in PDF format)

{com}. 
. 
. 
. 
. ****
. * daily estimated infections to reported cases IHME, 2021
. 
. 
. * smooth Infections to cases ratio of IHME and IMPE
. 
. tsset date, daily   
{res}{txt}{col 9}time variable:  {res}{col 25}date, 22jan2020 to 09oct2022
{txt}{col 17}delta:  {res}1 day
{txt}
{com}. 
. 
. foreach var of varlist ///
> DayITCMeSmA02S01 {c -(}
{txt}  2{com}. 
. // DayITCMeRaA03S02
. 
. tssmooth ma `var'_window = `var', window(3 1 3)
{txt}  3{com}. 
. tssmooth ma `var'sm = `var'_window, weights( 1 2 3 <4> 3 2 1) replace
{txt}  4{com}. 
. drop `var'_window
{txt}  5{com}. 
. {c )-}
{txt}The smoother applied was
{res}{p 5 5 5}(1/7)*[x(t-3) + x(t-2) + x(t-1) + 1*x(t) + x(t+1) + x(t+2) + x(t+3)]; x(t)= DayITCMeSmA02S01{p_end}
{txt}The smoother applied was
{res}{p 5 5 5}(1/16)*[1*x(t-3) + 2*x(t-2) + 3*x(t-1) + 4*x(t) + 3*x(t+1) + 2*x(t+2) + ...; x(t)= DayITCMeSmA02S01_window
{txt}
{smcl}
{com}. *
. 
. tsset, clear
{txt}
{com}. 
. ssc install labutil2
{txt}checking {hilite:labutil2} consistency and verifying not already installed...
all files already exist and are up to date.

{com}. 
. // labvars DayITCMeSmA02S01sm DayITCMeRaA03S02sm ,names
. 
.           
. qui summ DayITCMeSmA02S01sm if date >= td(01jan2021) , detail
{txt}
{com}. 
. gen DayITCMeSmA02S01sm_median = r(p50)
{txt}
{com}. 
. replace DayITCMeSmA02S01sm_median = round(DayITCMeSmA02S01sm_median)
{txt}(992 real changes made)

{com}. 
. local DayITCMeSmA02S01sm_median = DayITCMeSmA02S01sm_median
{txt}
{com}. 
. /*
> qui summ DayITCMeRaA03S02sm if date >= td(01jan2021) , detail
> 
> gen DayITCMeRaA03S02sm_median = r(p50)
> 
> replace DayITCMeRaA03S02sm_median = round(DayITCMeRaA03S02sm_median)
> 
> local DayITCMeRaA03S02sm_median = DayITCMeRaA03S02sm_median
> */
. 
. twoway ///
> (line DayITCMeSmA02S01 date, sort lcolor(black*0.2)) /// 1 "IHME"
> (line DayITCMeSmA02S01sm date, sort lcolor(black) lwidth(thick)) /// 2 "IHME"
> if date >= td(01jan2021) ///
> , xtitle(Date) xlabel(#$monthspast01jan2021merge, format(%tdYY-NN-DD) labsize(small)) xlabel(, grid) xlabel(, grid) ///
> xlabel(, angle(forty_five)) ylabel(, format(%15.0fc) labsize(small))  ylabel(, labsize(small) angle(horizontal)) ///
> ytitle(Daily estimated infections to reported cases) title("COVID-19 daily estimated infections to reported cases, $country", size(medium)) /// 
> xscale(lwidth(vthin) lcolor(gray*.2)) yscale(lwidth(vthin) lcolor(gray*.2)) legend(region(lcolor(none))) legend(bexpand) ///
> legend(order(1 "IHME" 2 "IHME smooth") size(small) row(1)) ///
> subtitle("reference scenarios", size(small)) ///
> note("IHME smooth median 2021 on = `DayITCMeSmA02S01sm_median'")
{res}{txt}
{com}. 
. graph export "graph 29 C19 daily estimated infections to reported cases, $country, reference scenarios 2021.pdf", replace
{txt}(file /Users/farshadpourmalek/Downloads/covir2-main/20220701/code/merge/graph 29 C19 daily estimated infections to reported cases, Iran, reference scenarios 2021.pdf written in PDF format)

{com}. 
. 
. 
. 
. 
. 
. *****************
. 
. * total deaths (graph numbers start with 31)
. 
. 
. ****
. * total deaths, reference scenario, all time
. 
. twoway ///
> (line TotDeaMeRaA00 date, sort lcolor(cyan) lwidth(vthick)) /// 1 "JOHN"
> (line TotDeaMeRaA01S00 date, sort lcolor(red)) /// 2 "DELP"
> (line TotDeaMeSmA02S01 date, sort lcolor(black)) /// 3 "IHME"
> (line TotDeaMeRaA05S00 date, sort lcolor(green)) /// 4 "SRIV"
> if date >= td(01jan2020) ///
> , xtitle(Date) xlabel(#$monthspast01jan2020merge, format(%tdYY-NN-DD) labsize(small)) xlabel(, grid) ///
> xlabel(, angle(forty_five)) ylabel(, format(%9.0fc) labsize(small))  ylabel(, labsize(small) angle(horizontal)) ///
> ytitle(Total deaths) title("COVID-19 total deaths, $country", size(medium)) /// 
> xscale(lwidth(vthin) lcolor(gray*.2)) yscale(lwidth(vthin) lcolor(gray*.2)) legend(region(lcolor(none))) legend(bexpand) ///
> legend(order(1 "JOHN" 2 "DELP" 3 "IHME" 4 "SRIV") size(small) row(1)) ///
> subtitle("reference scenarios", size(small)) 
{res}{txt}
{com}. 
. graph export "graph 31a COVID-19 total deaths, $country, reference scenarios, all time.pdf", replace
{txt}(file /Users/farshadpourmalek/Downloads/covir2-main/20220701/code/merge/graph 31a COVID-19 total deaths, Iran, reference scenarios, all time.pdf written in PDF format)

{com}. 
. 
. 
. ****
. * total deaths, reference scenario, all time, with IHME excess mortality 
. 
. twoway ///
> (line TotDeaMeRaA00 date, sort lcolor(cyan) lwidth(vthick)) /// 1 "JOHN"
> (line TotDeaMeRaA01S00 date, sort lcolor(red)) /// 2 "DELP"
> (line TotDeaMeSmA02S01 date, sort lcolor(black)) /// 3 "IHME"
> (line TotDeXMeSmA02S01 date, sort lcolor(black) lpattern(dash)) /// 4 "IHME excess"
> (line TotDeaMeRaA05S00 date, sort lcolor(green)) /// 5 "SRIV"
> if date >= td(01jan2020) ///
> , xtitle(Date) xlabel(#$monthspast01jan2020merge, format(%tdYY-NN-DD) labsize(small)) xlabel(, grid) ///
> xlabel(, angle(forty_five)) ylabel(, format(%9.0fc) labsize(small))  ylabel(, labsize(small) angle(horizontal)) ///
> ytitle(Total deaths) title("COVID-19 total deaths, $country", size(medium)) /// 
> xscale(lwidth(vthin) lcolor(gray*.2)) yscale(lwidth(vthin) lcolor(gray*.2)) legend(region(lcolor(none))) legend(bexpand) ///
> legend(order(1 "JOHN" 2 "DELP" 3 "IHME" 4 "IHME excess" 5 "SRIV") size(small) row(1)) ///
> subtitle("reference scenarios", size(small)) 
{res}{txt}
{com}. 
. graph export "graph 31b COVID-19 total deaths, $country, reference scenarios, all time.pdf", replace
{txt}(file /Users/farshadpourmalek/Downloads/covir2-main/20220701/code/merge/graph 31b COVID-19 total deaths, Iran, reference scenarios, all time.pdf written in PDF format)

{com}. 
. 
. 
. ****
. * total deaths, reference scenario, 2021
. 
. twoway ///
> (line TotDeaMeRaA00 date, sort lcolor(cyan) lwidth(vthick)) /// 1 "JOHN"
> (line TotDeaMeRaA01S00 date, sort lcolor(red)) /// 2 "DELP"
> (line TotDeaMeSmA02S01 date, sort lcolor(black)) /// 3 "IHME"
> (line TotDeaMeRaA05S00 date, sort lcolor(green)) /// 4 "SRIV"
> if date >= td(01jan2021) ///
> , xtitle(Date) xlabel(#$monthspast01jan2021merge, format(%tdYY-NN-DD) labsize(small)) xlabel(, grid) ///
> xlabel(, angle(forty_five)) ylabel(, format(%9.0fc) labsize(small)) ylabel(, labsize(small) angle(horizontal)) ///
> ytitle(Total deaths) title("COVID-19 total deaths, $country", size(medium)) /// 
> xscale(lwidth(vthin) lcolor(gray*.2)) yscale(lwidth(vthin) lcolor(gray*.2)) legend(region(lcolor(none))) legend(bexpand) ///
> legend(order(1 "JOHN" 2 "DELP" 3 "IHME" 4 "SRIV") size(small) row(1)) ///
> subtitle("2021 on, reference scenarios", size(small)) 
{res}{txt}
{com}. 
. graph export "graph 32a COVID-19 total deaths, $country, reference scenarios.pdf", replace
{txt}(file /Users/farshadpourmalek/Downloads/covir2-main/20220701/code/merge/graph 32a COVID-19 total deaths, Iran, reference scenarios.pdf written in PDF format)

{com}. 
. 
. 
. ****
. * total deaths, reference scenario, 2021, with IHME excess mortality 
. 
. twoway ///
> (line TotDeaMeRaA00 date, sort lcolor(cyan) lwidth(vthick)) /// 1 "JOHN"
> (line TotDeaMeRaA01S00 date, sort lcolor(red)) /// 2 "DELP"
> (line TotDeaMeSmA02S01 date, sort lcolor(black)) /// 3 "IHME"
> (line TotDeXMeSmA02S01 date, sort lcolor(black) lpattern(dash)) /// 4 "IHME excess"
> (line TotDeaMeRaA05S00 date, sort lcolor(green)) /// 5 "SRIV"
> if date >= td(01jan2021) ///
> , xtitle(Date) xlabel(#$monthspast01jan2021merge, format(%tdYY-NN-DD) labsize(small)) xlabel(, grid) ///
> xlabel(, angle(forty_five)) ylabel(, format(%9.0fc) labsize(small)) ylabel(, labsize(small) angle(horizontal)) ///
> ytitle(Total deaths) title("COVID-19 total deaths, $country", size(medium)) /// 
> xscale(lwidth(vthin) lcolor(gray*.2)) yscale(lwidth(vthin) lcolor(gray*.2)) legend(region(lcolor(none))) legend(bexpand) ///
> legend(order(1 "JOHN" 2 "DELP" 3 "IHME" 4 "IHME excess" 5 "SRIV") size(small) row(1)) ///
> subtitle("2021 on, reference scenarios", size(small)) 
{res}{txt}
{com}. 
. graph export "graph 32b COVID-19 total deaths, $country, reference scenarios.pdf", replace
{txt}(file /Users/farshadpourmalek/Downloads/covir2-main/20220701/code/merge/graph 32b COVID-19 total deaths, Iran, reference scenarios.pdf written in PDF format)

{com}. 
. 
. 
. ****
. * total deaths, reference scenario, CI, 2021
. 
. twoway ///
> (line TotDeaMeRaA00 date, sort lcolor(cyan) lwidth(vthick)) /// 1 JOHN
> (line TotDeaMeRaA01S00 date, sort lcolor(red)) /// 2 DELP mean
> (line TotDeaLoRaA01S00 date, sort lcolor(red) lpattern(dash)) /// 3 DELP lower
> (line TotDeaUpRaA01S00 date, sort lcolor(red) lpattern(dash)) /// 4 DELP upper
> (line TotDeaMeSmA02S01 date, sort lcolor(black)) /// 5 IHME mean
> (line TotDeaLoSmA02S01 date, sort lcolor(black) lpattern(dash)) /// 6 IHME lower
> (line TotDeaUpSmA02S01 date, sort lcolor(black) lpattern(dash)) /// 7 IHME upper
> (line TotDeaMeRaA05S00 date, sort lcolor(green)) /// 8 SRIV mean
> (line TotDeaLoRaA05S00 date, sort lcolor(green) lpattern(dash)) /// 9 SRIV lower
> (line TotDeaUpRaA05S00 date, sort lcolor(green) lpattern(dash)) /// 10 SRIV upper
> if date >= td(01jan2021) ///
> , xtitle(Date) xlabel(#$monthspast01jan2021merge, format(%tdYY-NN-DD) labsize(small)) xlabel(, grid) ///
> xlabel(, angle(forty_five)) ylabel(, format(%9.0fc) labsize(small))  ylabel(, labsize(small) angle(horizontal)) ///
> ytitle(Total deaths) title("COVID-19 total deaths, $country", size(medium)) ///
> xscale(lwidth(vthin) lcolor(gray*.2)) yscale(lwidth(vthin) lcolor(gray*.2)) legend(region(lcolor(none))) legend(bexpand) ///
> legend(order(1 "JOHN" 2 "DELP" 5 "IHME" 8 "SRIV") size(small) row(1)) ///
> note("Uncertainty limits: dashed curves") ///
> subtitle("2021 on, reference scenarios with uncertainty", size(small)) 
{res}{txt}
{com}. 
. graph export "graph 33 COVID-19 total deaths, $country, reference scenarios, CI.pdf", replace
{txt}(file /Users/farshadpourmalek/Downloads/covir2-main/20220701/code/merge/graph 33 COVID-19 total deaths, Iran, reference scenarios, CI.pdf written in PDF format)

{com}. 
. 
. 
. 
. *****************
. 
. * total cases or infections (graph numbers start with 41)
. 
. 
. ****
. * total cases or infections, reference scenario, all time
. 
. twoway ///
> (line TotCasMeRaA00 date, sort lcolor(cyan) lwidth(vthick)) /// 1 "JOHN"
> (line TotCasMeRaA01S00 date, sort lcolor(red)) /// 2 "DELP"
> (line TotINFMeSmA02S01 date, sort lcolor(black)) /// 3 "IHME"
> (line TotCasMeRaA05S00 date, sort lcolor(green)) /// 4 "SRIV"
> if date >= td(01jan2020) ///
> , xtitle(Date) xlabel(#$monthspast01jan2020merge, format(%tdYY-NN-DD) labsize(small)) xlabel(, grid) ///
> xlabel(, angle(forty_five)) ylabel(, format(%12.0fc) labsize(small))  ylabel(, labsize(small) angle(horizontal)) ///
> ytitle(Total cases or infections) title("COVID-19 total cases or infections, $country", size(medium)) /// 
> xscale(lwidth(vthin) lcolor(gray*.2)) yscale(lwidth(vthin) lcolor(gray*.2)) legend(region(lcolor(none))) legend(bexpand) ///
> legend(order(1 "JOHN cases" 2 "DELP cases" 3 "IHME infections" ///
> 4 "SRIV cases") size(small) row(2)) ///
> subtitle("reference scenarios", size(small)) 
{res}{txt}
{com}. 
. graph export "graph 41 COVID-19 total cases, $country, reference scenarios, all time.pdf", replace
{txt}(file /Users/farshadpourmalek/Downloads/covir2-main/20220701/code/merge/graph 41 COVID-19 total cases, Iran, reference scenarios, all time.pdf written in PDF format)

{com}. 
. 
. 
. ****
. * total cases or infections, reference scenario, 2021
. 
. twoway ///
> (line TotCasMeRaA00 date, sort lcolor(cyan) lwidth(vthick)) /// 1 "JOHN"
> (line TotCasMeRaA01S00 date, sort lcolor(red)) /// 2 "DELP"
> (line TotINFMeSmA02S01 date, sort lcolor(black)) /// 3 "IHME"
> (line TotCasMeRaA05S00 date, sort lcolor(green)) /// 4 "SRIV"
> if date >= td(01jan2021) ///
> , xtitle(Date) xlabel(#$monthspast01jan2021merge, format(%tdYY-NN-DD) labsize(small)) xlabel(, grid) ///
> xlabel(, angle(forty_five)) ylabel(, format(%12.0fc) labsize(small))  ylabel(, labsize(small) angle(horizontal)) ///
> ytitle(Total cases or infections) title("COVID-19 total cases or infections, $country", size(medium)) /// 
> xscale(lwidth(vthin) lcolor(gray*.2)) yscale(lwidth(vthin) lcolor(gray*.2)) legend(region(lcolor(none))) legend(bexpand) ///
> legend(order(1 "JOHN cases" 2 "DELP cases" 3 "IHME infections" ///
> 4 "SRIV cases") size(small) row(1)) ///
> subtitle("2021 on, reference scenarios", size(small)) 
{res}{txt}
{com}. 
. graph export "graph 42 COVID-19 total cases, $country, reference scenarios.pdf", replace
{txt}(file /Users/farshadpourmalek/Downloads/covir2-main/20220701/code/merge/graph 42 COVID-19 total cases, Iran, reference scenarios.pdf written in PDF format)

{com}. 
. 
. 
. ****
. * total cases or infections, reference scenario, CI, 2021
. 
. twoway ///
> (line TotCasMeRaA00 date, sort lcolor(cyan) lwidth(vthick)) /// 1 JOHN
> (line TotCasMeRaA01S00 date, sort lcolor(red)) /// 2 "DELP"
> (line TotCasLoRaA01S00 date, sort lcolor(red) lpattern(dash)) /// 3 "DELP"
> (line TotCasUpRaA01S00 date, sort lcolor(red) lpattern(dash)) /// 4 "DELP"
> (line TotINFMeSmA02S01 date, sort lcolor(black)) /// 5 IHME mean
> (line TotINFLoSmA02S01 date, sort lcolor(black) lpattern(dash)) /// 6 IHME lower
> (line TotINFUpSmA02S01 date, sort lcolor(black) lpattern(dash)) /// 7 IHME upper
> (line TotCasMeRaA05S00 date, sort lcolor(green)) /// 8 SRIV mean
> (line TotCasLoRaA05S00 date, sort lcolor(green) lpattern(dash)) /// 9 SRIV lower
> (line TotCasUpRaA05S00 date, sort lcolor(green) lpattern(dash)) /// 10 SRIV upper
> if date >= td(01jan2021) ///
> , xtitle(Date) xlabel(`dates2021', format(%tdYY-NN-DD) labsize(small)) xlabel(, grid) ///
> xlabel(, angle(forty_five)) ylabel(, format(%12.0fc) labsize(small))  ylabel(, labsize(small) angle(horizontal)) ///
> ytitle(Total cases or infections) title("COVID-19 total cases or infections, $country", size(medium)) ///
> xscale(lwidth(vthin) lcolor(gray*.2)) yscale(lwidth(vthin) lcolor(gray*.2)) legend(region(lcolor(none))) legend(bexpand) ///
> legend(order(1 "JOHN cases" 2 "DELP cases" 5 "IHME infections" ///
> 8 "SRIV cases") size(small) row(2)) ///
> subtitle("2021 on, reference scenarios with uncertainty", size(small)) ///
> note("Uncertainty limits: dashed curves")
{res}{txt}
{com}. 
. graph export "graph 43 COVID-19 total cases, $country, reference scenarios, CI.pdf", replace
{txt}(file /Users/farshadpourmalek/Downloads/covir2-main/20220701/code/merge/graph 43 COVID-19 total cases, Iran, reference scenarios, CI.pdf written in PDF format)

{com}. 
. 
. 
. ****************
. 
. * daily CFR / IFR (graph numbers start with 51)
. 
. 
. ****
. * CFR / IFR all studies, all time, reference scenarios, all time
. 
. twoway ///
> (line DayCfrMeRaA00 date, sort lcolor(cyan) lwidth(thick)) /// 1 "JOHN"
> (line DayCfrMeRaA01S00 date, sort lcolor(red)) /// 2 "DELP"
> (line infection_fatality_A02S01 date, sort lcolor(black)) /// 3 "IHME"
> (line DayCfrMeRaA05S00 date, sort lcolor(green)) /// 4 "SRIV"
> if date >= td(01jan2020) ///
> , xtitle(Date) xlabel(#$monthspast01jan2020merge, format(%tdYY-NN-DD) labsize(small)) xlabel(, grid) ///
> xlabel(, angle(forty_five)) ylabel(, format(%12.0fc) labsize(small))  ylabel(, labsize(small) angle(horizontal)) ///
> ytitle(Daily CFR or IFR) title("COVID-19 daily CFR or IFR, $country", size(medium)) /// 
> xscale(lwidth(vthin) lcolor(gray*.2)) yscale(lwidth(vthin) lcolor(gray*.2)) legend(region(lcolor(none))) legend(bexpand) ///
> legend(order(1 "JOHN CFR" 2 "DELP CFR" 3 "IHME IFR" 4 "SRIV CFR") size(small) row(2)) ///
> subtitle("reference scenarios", size(small) color(white))
{res}{txt}
{com}. 
. graph export "graph 51 COVID-19 daily CFR, $country, reference scenarios, all time.pdf", replace
{txt}(file /Users/farshadpourmalek/Downloads/covir2-main/20220701/code/merge/graph 51 COVID-19 daily CFR, Iran, reference scenarios, all time.pdf written in PDF format)

{com}. 
. 
. 
. ****
. * cfr all studies, reference scenarios, 2021
. 
. twoway ///
> (line DayCfrMeRaA00 date, sort lcolor(cyan) lwidth(thick)) /// 1 "JOHN"
> (line DayCfrMeRaA01S00 date, sort lcolor(red)) /// 2 "DELP"
> (line infection_fatality_A02S01 date, sort lcolor(black)) /// 3 "IHME"
> (line DayCfrMeRaA05S00 date, sort lcolor(green)) /// 4 "SRIV"
> if date >= td(01jan2021) ///
> , xtitle(Date) xlabel(#$monthspast01jan2021merge, format(%tdYY-NN-DD) labsize(small)) xlabel(, grid) ///
> xlabel(, angle(forty_five)) ylabel(, format(%12.0fc) labsize(small))  ylabel(, labsize(small) angle(horizontal)) ///
> ytitle(Daily CFR or IFR) title("COVID-19 daily CFR or IFR, $country", size(medium)) /// 
> xscale(lwidth(vthin) lcolor(gray*.2)) yscale(lwidth(vthin) lcolor(gray*.2)) legend(region(lcolor(none))) legend(bexpand) ///
> legend(order(1 "JOHN CFR" 2 "DELP CFR" 3 "IHME IFR" 4 "SRIV CFR") size(small) row(2)) ///
> subtitle("2021 on, reference scenarios", size(small))
{res}{txt}
{com}. 
. graph export "graph 52 COVID-19 daily CFR, $country, reference scenarios.pdf", replace
{txt}(file /Users/farshadpourmalek/Downloads/covir2-main/20220701/code/merge/graph 52 COVID-19 daily CFR, Iran, reference scenarios.pdf written in PDF format)

{com}. 
. 
. 
. 
. 
. ************************
. 
. * other outcomes (graph numbers start with 71)
. 
. 
. * all hospital-related outcomes, all time
. 
. twoway ///
> (line DayHosMeRaA01S00 date, sort lcolor(red) lwidth(thick)) /// 1 DELP Hospitalized (Daily Cases Active Hospitalized Mean DELP S0)
> (line DayVenMeRaA01S00 date, sort lcolor(red) lpattern(dash)  lwidth(thick)) /// 2 DELP Ventilated (Daily Cases Active Ventilated Mean DELP S0)
> (line DayBedMeSmA02S01 date, sort lcolor(black)) /// 3 IHME Bed need (Daily Beds needed Mean IHME S1)
> (line DayIcuMeSmA02S01 date, sort lcolor(green)) /// 4 IHME ICU need (Daily ICU beds needed Mean IHME S1)
> (line DayAdmMeSmA02S01 date, sort lcolor(yellow)) /// 5 IHME Admissions (Daily hospital admissions Mean IHME S1)
> if date >= td(01jan2020) ///
> , xtitle(Date) xlabel(#$monthspast01jan2020merge, format(%tdYY-NN-DD) labsize(small)) xlabel(, grid) ///
> xlabel(, angle(forty_five)) ylabel(, format(%9.0fc) labsize(small))  ylabel(, labsize(small) angle(horizontal)) ///
> ytitle(Daily outcomes) title("COVID-19 daily hospital-related outcomes $country", size(medium)) ///
> xscale(lwidth(vthin) lcolor(gray*.2)) yscale(lwidth(vthin) lcolor(gray*.2)) legend(region(lcolor(none))) legend(bexpand) ///
> legend(order(1 "DELP Hospitalized" 2 "DELP Ventilated" 3 "IHME Bed need" 4 "IHME ICU need" ///
> 5 "IHME Admissions") rows(3) size(small)) ///
> subtitle("reference scenarios", size(small) color(white)) 
{res}{txt}
{com}. 
. graph export "graph 71a COVID-19 hospital-related outcomes, all time.pdf", replace
{txt}(file /Users/farshadpourmalek/Downloads/covir2-main/20220701/code/merge/graph 71a COVID-19 hospital-related outcomes, all time.pdf written in PDF format)

{com}. 
. 
. 
. 
. 
. 
. * all hospital-related outcomes, all time
. 
. twoway ///
> (line DayHosMeRaA01S00 date, sort lcolor(red) lwidth(thick)) /// 1 DELP Hospitalized (Daily Cases Active Hospitalized Mean DELP S0)
> (line DayVenMeRaA01S00 date, sort lcolor(red) lpattern(dash)  lwidth(thick)) /// 2 DELP Ventilated (Daily Cases Active Ventilated Mean DELP S0)
> (line DayBedMeSmA02S01 date, sort lcolor(black)) /// 3 IHME Bed need (Daily Beds needed Mean IHME S1)
> (line DayIcuMeSmA02S01 date, sort lcolor(green)) /// 4 IHME ICU need (Daily ICU beds needed Mean IHME S1)
> (line DayAdmMeSmA02S01 date, sort lcolor(yellow)) /// 5 IHME Admissions (Daily hospital admissions Mean IHME S1)
> (line DayBEDMeSmA02    date, sort lcolor(black) lpattern(dash)) /// 6
> (line DayICUMeSmA02    date, sort lcolor(cyan) lpattern(dash)) /// 7
> if date >= td(01jan2020) ///
> , xtitle(Date) xlabel(#$monthspast01jan2020merge, format(%tdYY-NN-DD) labsize(small)) xlabel(, grid) ///
> xlabel(, angle(forty_five)) ylabel(, format(%9.0fc) labsize(small))  ylabel(, labsize(small) angle(horizontal)) ///
> ytitle(Daily outcomes) title("COVID-19 daily hospital-related outcomes $country", size(medium)) ///
> xscale(lwidth(vthin) lcolor(gray*.2)) yscale(lwidth(vthin) lcolor(gray*.2)) legend(region(lcolor(none))) legend(bexpand) ///
> legend(order(1 "DELP Hospitalized" 2 "DELP Ventilated" 3 "IHME Bed need" 4 "IHME ICU need" ///
> 5 "IHME Admissions" 6 "IHME All bed capcity" 7 "IHME ICU bed capacity") rows(3) size(small)) ///
> subtitle("reference scenarios", size(small) color(white)) 
{res}{txt}
{com}. 
. graph export "graph 71b COVID-19 hospital-related outcomes, all time.pdf", replace
{txt}(file /Users/farshadpourmalek/Downloads/covir2-main/20220701/code/merge/graph 71b COVID-19 hospital-related outcomes, all time.pdf written in PDF format)

{com}. 
. 
. 
. 
. 
. 
. * daily hospital-related outcomes, DELP, IHME, wo IHME Bed need
. 
. twoway ///
> (line DayHosMeRaA01S00 date, sort lcolor(red) lwidth(thick)) /// 1 DELP Hospitalized (Daily Cases Active Hospitalized Mean DELP S0)
> (line DayVenMeRaA01S00 date, sort lcolor(red) lpattern(dash)  lwidth(thick)) /// 2 DELP Ventilated (Daily Cases Active Ventilated Mean DELP S0)
> (line DayIcuMeSmA02S01 date, sort lcolor(green)) /// 3 IHME ICU need (Daily ICU beds needed Mean IHME S1)
> (line DayAdmMeSmA02S01 date, sort lcolor(yellow)) /// 4 IHME Admissions (Daily hospital admissions Mean IHME S1)
> (line DayICUMeSmA02    date, sort lcolor(cyan) lpattern(dash)) /// 6
> if date >= td(01jan2021) ///
> , xtitle(Date) xlabel(#$monthspast01jan2021merge, format(%tdYY-NN-DD) labsize(small)) xlabel(, grid) ///
> xlabel(, angle(forty_five)) ylabel(, format(%9.0fc) labsize(small))  ylabel(, labsize(small) angle(horizontal)) ///
> ytitle(Daily outcomes) title("COVID-19 daily hospital-related outcomes $country", size(medium)) ///
> xscale(lwidth(vthin) lcolor(gray*.2)) yscale(lwidth(vthin) lcolor(gray*.2)) legend(region(lcolor(none))) legend(bexpand) ///
> legend(order(1 "DELP Hospitalized" 2 "DELP Ventilated" 3 "IHME ICU need" ///
> 4 "IHME Admissions" 5 "IHME All bed capcity") rows(3) size(small)) ///
> subtitle("2021 on, without IHME Bed need, reference scenarios", size(small)) ///
> note("Uncertainty limits: dashed curves")
{res}{txt}
{com}. 
. graph export "graph 72 COVID-19 hospital-related outcomes, wo extremes, 2021.pdf", replace
{txt}(file /Users/farshadpourmalek/Downloads/covir2-main/20220701/code/merge/graph 72 COVID-19 hospital-related outcomes, wo extremes, 2021.pdf written in PDF format)

{com}. 
. 
. 
. *******************************
. 
. * daily cases to deaths (CTD) 
. 
. 
. ****
. * Daily cases or infections to deaths (CTD / ITD) all studies, reference scenarios, all time
. 
. twoway ///
> (line DayCTDMeRaA00S00 date, sort lcolor(cyan) lwidth(vthick)) /// 1 "JOHN"
> (line DayCTDMeRaA01S00 date, sort lcolor(red)) /// 2 "DELP"
> (line DayITDMeRaA02S01 date, sort lcolor(black)) /// 3 "IHME"
> (line DayCTDMeRaA05S00 date, sort lcolor(green)) /// 4 "SRIV"
> if date >= td(01jan2020) ///
> , xtitle(Date) xlabel(#$monthspast01jan2020merge, format(%tdYY-NN-DD) labsize(small)) xlabel(, grid) ///
> xlabel(, angle(forty_five)) ylabel(, format(%12.0fc) labsize(small))  ylabel(, labsize(small) angle(horizontal)) ///
> ytitle(Daily cases or infections to deaths) title("COVID-19 daily cases or infections, to deaths, $country", size(medium)) /// 
> xscale(lwidth(vthin) lcolor(gray*.2)) yscale(lwidth(vthin) lcolor(gray*.2) titlegap(2)) legend(region(lcolor(none))) legend(bexpand) ///
> legend(order(1 "JOHN cases" 2 "DELP cases" 3 "IHME infections" 4 "SRIV cases") size(small) row(1)) ///
> subtitle("reference scenarios", size(small))
{res}{txt}
{com}. 
. graph export "graph 81 COVID-19 daily cases to deaths, $country, reference scenarios, all time.pdf", replace
{txt}(file /Users/farshadpourmalek/Downloads/covir2-main/20220701/code/merge/graph 81 COVID-19 daily cases to deaths, Iran, reference scenarios, all time.pdf written in PDF format)

{com}. 
. 
. 
. ****
. * Daily cases or infections to deaths (CTD / ITD) all studies, reference scenarios, 2021
. 
. twoway ///
> (line DayCTDMeRaA00S00 date, sort lcolor(cyan) lwidth(thick)) /// 1 "JOHN"
> (line DayCTDMeRaA01S00 date, sort lcolor(red)) /// 2 "DELP"
> (line DayITDMeRaA02S01 date, sort lcolor(black)) /// 3 "IHME"
> (line DayCTDMeRaA05S00 date, sort lcolor(green)) /// 4 "SRIV"
> if date >= td(01jan2021) ///
> , xtitle(Date) xlabel(#$monthspast01jan2021merge, format(%tdYY-NN-DD) labsize(small)) xlabel(, grid) ///
> xlabel(, angle(forty_five)) ylabel(, format(%12.0fc) labsize(small))  ylabel(, labsize(small) angle(horizontal)) ///
> ytitle(Daily cases or infections to deaths) title("COVID-19 daily cases or infections, to deaths, $country", size(medium)) /// 
> xscale(lwidth(vthin) lcolor(gray*.2)) yscale(lwidth(vthin) lcolor(gray*.2) titlegap(2)) legend(region(lcolor(none))) legend(bexpand) ///
> legend(order(1 "JOHN cases" 2 "DELP cases" 3 "IHME infections" 4 "SRIV cases") size(small) row(1)) ///
> subtitle("2021 on, reference scenarios", size(small))
{res}{txt}
{com}. 
. graph export "graph 82 COVID-19 daily cases to deaths, $country, reference scenarios.pdf", replace
{txt}(file /Users/farshadpourmalek/Downloads/covir2-main/20220701/code/merge/graph 82 COVID-19 daily cases to deaths, Iran, reference scenarios.pdf written in PDF format)

{com}. 
. 
. 
. ****
. * Total cases to deaths (CTD / ITD) all studies, all time, reference scenarios, all time
. 
. twoway ///
> (line TotCTDMeRaA00S00 date, sort lcolor(cyan) lwidth(vthick)) /// 1 "JOHN"
> (line TotCTDMeRaA01S00 date, sort lcolor(red)) /// 2 "DELP"
> (line TotITDMeRaA02S01 date, sort lcolor(black)) /// 3 "IHME"
> (line TotCTDMeRaA05S00 date, sort lcolor(green)) /// 4 "SRIV"
> if date >= td(01jan2020) ///
> , xtitle(Date) xlabel(#$monthspast01jan2020merge, format(%tdYY-NN-DD) labsize(small)) xlabel(, grid) ///
> xlabel(, angle(forty_five)) ylabel(, format(%12.0fc) labsize(small))  ylabel(, labsize(small) angle(horizontal)) ///
> ytitle(Total cases or infections to deaths) title("COVID-19 total cases or infections, to deaths, $country", size(medium)) /// 
> xscale(lwidth(vthin) lcolor(gray*.2)) yscale(lwidth(vthin) lcolor(gray*.2) titlegap(2)) legend(region(lcolor(none))) legend(bexpand) ///
> legend(order(1 "JOHN cases" 2 "DELP cases" 3 "IHME infections" 4 "SRIV cases") size(small) row(1)) ///
> subtitle("reference scenarios", size(small))
{res}{txt}
{com}. 
. graph export "graph 83 COVID-19 total cases to deaths, $country, reference scenarios, all time.pdf", replace
{txt}(file /Users/farshadpourmalek/Downloads/covir2-main/20220701/code/merge/graph 83 COVID-19 total cases to deaths, Iran, reference scenarios, all time.pdf written in PDF format)

{com}. 
. 
. 
. ****
. * Total cases to deaths (CTD / ITD) all studies, reference scenarios, 2021
. 
. twoway ///
> (line TotCTDMeRaA00S00 date, sort lcolor(cyan) lwidth(vthick)) /// 1 "JOHN"
> (line TotCTDMeRaA01S00 date, sort lcolor(red)) /// 2 "DELP"
> (line TotITDMeRaA02S01 date, sort lcolor(black)) /// 3 "IHME"
> (line TotCTDMeRaA05S00 date, sort lcolor(green)) /// 4 "SRIV"
> if date >= td(01jan2021) ///
> , xtitle(Date) xlabel(#$monthspast01jan2021merge, format(%tdYY-NN-DD) labsize(small)) xlabel(, grid) ///
> xlabel(, angle(forty_five)) ylabel(, format(%12.0fc) labsize(small))  ylabel(, labsize(small) angle(horizontal)) ///
> ytitle(Total cases or infections to deaths) title("COVID-19 total cases or infections, to deaths, $country", size(medium)) /// 
> xscale(lwidth(vthin) lcolor(gray*.2)) yscale(lwidth(vthin) lcolor(gray*.2) titlegap(2)) legend(region(lcolor(none))) legend(bexpand) ///
> legend(order(1 "JOHN cases" 2 "DELP cases" 3 "IHME infections" 4 "SRIV cases") size(small) row(1)) ///
> subtitle("2021 on, reference scenarios", size(small))
{res}{txt}
{com}. 
. graph export "graph 84 COVID-19 total cases to deaths, $country, reference scenarios.pdf", replace
{txt}(file /Users/farshadpourmalek/Downloads/covir2-main/20220701/code/merge/graph 84 COVID-19 total cases to deaths, Iran, reference scenarios.pdf written in PDF format)

{com}. 
. 
. 
. 
. *******************************
. 
. *  estimated to reported (graph numbers start with 91)
. 
. 
. * daily deaths estimated to reported  
. 
. 
. ****
. * daily deaths estimated to reported (DER) all studies, reference scenarios, all time
. 
. twoway ///
> (line DayDERMeRaA00S00 date, sort lcolor(cyan) lwidth(vthick)) /// 1 "JOHN"
> (line DayDERMeRaA01S00 date, sort lcolor(red)) /// 2 "DELP"
> (line DayDERMeRaA02S01 date, sort lcolor(black)) /// 3 "IHME"
> (line DayDERMeRaA05S00 date, sort lcolor(green)) /// 4 "SRIV"
> if date >= td(01jan2020) ///
> , xtitle(Date) xlabel(#$monthspast01jan2020merge, format(%tdYY-NN-DD) labsize(small)) xlabel(, grid) ///
> xlabel(, angle(forty_five)) ylabel(, format(%12.0fc) labsize(small))  ylabel(, labsize(small) angle(horizontal)) ///
> ytitle(Daily deaths estimated to reported) title("COVID-19 daily deaths, estimated to reported, $country", size(medium)) /// 
> xscale(lwidth(vthin) lcolor(gray*.2)) yscale(lwidth(vthin) lcolor(gray*.2) titlegap(2)) legend(region(lcolor(none))) legend(bexpand) ///
> legend(order(1 "JOHN" 2 "DELP" 3 "IHME" 4 "SRIV") size(small) row(1)) ///
> subtitle("reference scenarios", size(small))
{res}{txt}
{com}. 
. graph export "graph 91 COVID-19 daily deaths estimated to reported, $country, reference scenarios, all time.pdf", replace
{txt}(file /Users/farshadpourmalek/Downloads/covir2-main/20220701/code/merge/graph 91 COVID-19 daily deaths estimated to reported, Iran, reference scenarios, all time.pdf written in PDF format)

{com}. 
. 
. 
. ****
. * daily deaths estimated to reported (DER) all studies, reference scenarios, 2021
. 
. twoway ///
> (line DayDERMeRaA00S00 date, sort lcolor(cyan) lwidth(vthick)) /// 1 "JOHN"
> (line DayDERMeRaA01S00 date, sort lcolor(red)) /// 2 "DELP"
> (line DayDERMeRaA02S01 date, sort lcolor(black)) /// 3 "IHME"
> (line DayDERMeRaA05S00 date, sort lcolor(green)) /// 4 "SRIV"
> if date >= td(01jan2021) ///
> , xtitle(Date) xlabel(#$monthspast01jan2021merge, format(%tdYY-NN-DD) labsize(small)) xlabel(, grid) ///
> xlabel(, angle(forty_five)) ylabel(, format(%12.1fc) labsize(small))  ylabel(, labsize(small) angle(horizontal)) ///
> ytitle(Daily deaths estimated to reported) title("COVID-19 daily deaths, estimated to reported, $country", size(medium)) /// 
> xscale(lwidth(vthin) lcolor(gray*.2)) yscale(lwidth(vthin) lcolor(gray*.2) titlegap(2)) legend(region(lcolor(none))) legend(bexpand) ///
> legend(order(1 "JOHN" 2 "DELP" 3 "IHME" 4 "SRIV") size(small) row(1)) ///
> subtitle("reference scenarios", size(small))
{res}{txt}
{com}. 
. graph export "graph 92 COVID-19 daily deaths estimated to reported, $country, reference scenarios.pdf", replace
{txt}(file /Users/farshadpourmalek/Downloads/covir2-main/20220701/code/merge/graph 92 COVID-19 daily deaths estimated to reported, Iran, reference scenarios.pdf written in PDF format)

{com}. 
. 
. 
. * daily cases or infections estimated to reported cases
. 
. 
. ****
. * daily cases or infections estimated to reported cases (CER / IER) all studies, reference scenarios, all time 
. 
. twoway ///
> (line DayCERMeRaA00S00 date, sort lcolor(cyan) lwidth(vthick)) /// 1 "JOHN"
> (line DayCERMeRaA01S00 date, sort lcolor(red)) /// 2 "DELP"
> (line DayIERMeRaA02S01 date, sort lcolor(black)) /// 3 "IHME"
> (line DayCERMeRaA05S00 date, sort lcolor(green)) /// 4 "SRIV"
> if date >= td(01jan2020) ///
> , xtitle(Date) xlabel(#$monthspast01jan2020merge, format(%tdYY-NN-DD) labsize(small)) xlabel(, grid) ///
> xlabel(, angle(forty_five)) ylabel(, format(%12.0fc) labsize(small))  ylabel(, labsize(small) angle(horizontal)) ///
> ytitle(Daily cases or infections estimated to reported) title("COVID-19 daily cases estimated to reported, $country", size(medium)) /// 
> xscale(lwidth(vthin) lcolor(gray*.2)) yscale(lwidth(vthin) lcolor(gray*.2) titlegap(3)) legend(region(lcolor(none))) legend(bexpand) ///
> legend(order(1 "JOHN cases" 2 "DELP cases" 3 "IHME infections" 4 "SRIV cases") size(small) row(1)) ///
> subtitle("daily cases or infections estimated, to reported cases; reference scenarios", size(small))
{res}{txt}
{com}. 
. graph export "graph 93 COVID-19 daily cases estimated to reported, $country, reference scenarios, all time .pdf", replace
{txt}(file /Users/farshadpourmalek/Downloads/covir2-main/20220701/code/merge/graph 93 COVID-19 daily cases estimated to reported, Iran, reference scenarios, all time .pdf written in PDF format)

{com}. 
. 
. 
. ****
. * daily cases or infections estimated to reported cases (CER / IER) all studies, 2021-01-01 on, reference scenarios
. 
. twoway ///
> (line DayCERMeRaA00S00 date, sort lcolor(cyan) lwidth(vthick)) /// 1 "JOHN"
> (line DayCERMeRaA01S00 date, sort lcolor(red)) /// 2 "DELP"
> (line DayIERMeRaA02S01 date, sort lcolor(black)) /// 3 "IHME"
> (line DayCERMeRaA05S00 date, sort lcolor(green)) /// 4 "SRIV"
> if date >= td(01jan2021) ///
> , xtitle(Date) xlabel(#$monthspast01jan2021merge, format(%tdYY-NN-DD) labsize(small)) xlabel(, grid) ///
> xlabel(, angle(forty_five)) ylabel(, format(%12.0fc) labsize(small))  ylabel(, labsize(small) angle(horizontal)) ///
> ytitle(Daily cases or infections estimated to reported) title("COVID-19 daily cases estimated to reported, $country", size(medium)) /// 
> xscale(lwidth(vthin) lcolor(gray*.2)) yscale(lwidth(vthin) lcolor(gray*.2) titlegap(3)) legend(region(lcolor(none))) legend(bexpand) ///
> legend(order(1 "JOHN cases" 2 "DELP cases" 3 "IHME infections" 4 "SRIV cases") size(small) row(1)) ///
> subtitle("daily cases or infections estimated, to reported cases; reference scenarios", size(small))
{res}{txt}
{com}. 
. graph export "graph 94 COVID-19 daily cases estimated to reported, $country, reference scenarios.pdf", replace
{txt}(file /Users/farshadpourmalek/Downloads/covir2-main/20220701/code/merge/graph 94 COVID-19 daily cases estimated to reported, Iran, reference scenarios.pdf written in PDF format)

{com}. 
. 
. 
. ****
. * total deaths estimated to reported (DER) all studies, reference scenarios, all time
. 
. twoway ///
> (line TotDERMeRaA00S00 date, sort lcolor(cyan) lwidth(vthick)) /// 1 "JOHN
> (line TotDERMeRaA01S00 date, sort lcolor(red)) /// 2 "DELP"
> (line TotDERMeRaA02S01 date, sort lcolor(black)) /// 3 "IHME"
> (line TotDERMeRaA05S00 date, sort lcolor(green)) /// 4 "SRIV"
> if date >= td(01jan2020) ///
> , xtitle(Date) xlabel(#$monthspast01jan2020merge, format(%tdYY-NN-DD) labsize(small)) xlabel(, grid) ///
> xlabel(, angle(forty_five)) ylabel(, format(%12.0fc) labsize(small))  ylabel(, labsize(small) angle(horizontal)) ///
> ytitle(Total deaths estimated to reported) title("COVID-19 total deaths, estimated to reported, $country", size(medium)) /// 
> xscale(lwidth(vthin) lcolor(gray*.2)) yscale(lwidth(vthin) lcolor(gray*.2) titlegap(5)) legend(region(lcolor(none))) legend(bexpand) ///
> legend(order(1 "JOHN" 2 "DELP" 3 "IHME" 4 "SRIV") size(small) row(1)) ///
> subtitle("reference scenarios", size(small))
{res}{txt}
{com}. 
. graph export "graph 95 COVID-19 total deaths estimated to reported, $country, reference scenarios, all time.pdf", replace
{txt}(file /Users/farshadpourmalek/Downloads/covir2-main/20220701/code/merge/graph 95 COVID-19 total deaths estimated to reported, Iran, reference scenarios, all time.pdf written in PDF format)

{com}. 
. 
. 
. ****
. * total deaths estimated to reported (DER) all studies, reference scenarios, 2021
. 
. twoway ///
> (line TotDERMeRaA00S00 date, sort lcolor(cyan) lwidth(vthick)) /// 1 "JOHN
> (line TotDERMeRaA01S00 date, sort lcolor(red)) /// 2 "DELP"
> (line TotDERMeRaA02S01 date, sort lcolor(black)) /// 3 "IHME"
> (line TotDERMeRaA05S00 date, sort lcolor(green)) /// 4 "SRIV"
> if date >= td(01jan2021) ///
> , xtitle(Date) xlabel(#$monthspast01jan2021merge, format(%tdYY-NN-DD) labsize(small)) xlabel(, grid) ///
> xlabel(, angle(forty_five)) ylabel(, format(%12.2fc) labsize(small))  ylabel(, labsize(small) angle(horizontal)) ///
> ytitle(Total deaths estimated to reported) title("COVID-19 total deaths, estimated to reported, $country", size(medium)) /// 
> xscale(lwidth(vthin) lcolor(gray*.2)) yscale(lwidth(vthin) lcolor(gray*.2) titlegap(5)) legend(region(lcolor(none))) legend(bexpand) ///
> legend(order(1 "JOHN" 2 "DELP" 3 "IHME" 4 "SRIV") size(small) row(1)) ///
> subtitle("reference scenarios", size(small))
{res}{txt}
{com}. 
. graph export "graph 96 COVID-19 total deaths estimated to reported, $country, reference scenarios.pdf", replace
{txt}(file /Users/farshadpourmalek/Downloads/covir2-main/20220701/code/merge/graph 96 COVID-19 total deaths estimated to reported, Iran, reference scenarios.pdf written in PDF format)

{com}. 
. 
. 
. ****
. * total cases or infections or infections estimated to reported cases (CER / IER) all studies, reference scenarios, all time
. 
. twoway ///
> (line TotCERMeRaA00S00 date, sort lcolor(cyan) lwidth(vthick)) /// 1 "JOHN"
> (line TotCERMeRaA01S00 date, sort lcolor(red)) /// 2 "DELP"
> (line TotIERMeRaA02S01 date, sort lcolor(black)) /// 3 "IHME"
> (line TotCERMeRaA05S00 date, sort lcolor(green)) /// 4 "SRIV"
> if date >= td(01jan2020) ///
> , xtitle(Date) xlabel(#$monthspast01jan2020merge, format(%tdYY-NN-DD) labsize(small)) xlabel(, grid) ///
> xlabel(, angle(forty_five)) ylabel(, format(%12.0fc) labsize(small))  ylabel(, labsize(small) angle(horizontal)) ///
> ytitle(Total cases or infections estimated to reported) title("COVID-19 total cases estimated to reported, $country", size(medium)) /// 
> xscale(lwidth(vthin) lcolor(gray*.2)) yscale(lwidth(vthin) lcolor(gray*.2) titlegap(5)) legend(region(lcolor(none))) legend(bexpand) ///
> legend(order(1 "JOHN cases" 2 "DELP cases" 3 "IHME infections" 4 "SRIV cases") size(small) row(1)) ///
> subtitle("total cases or infections estimated, to reported cases; reference scenarios", size(small))
{res}{txt}
{com}. 
. graph export "graph 97 COVID-19 total cases estimated to reported, $country, reference scenarios.pdf", replace
{txt}(file /Users/farshadpourmalek/Downloads/covir2-main/20220701/code/merge/graph 97 COVID-19 total cases estimated to reported, Iran, reference scenarios.pdf written in PDF format)

{com}. 
. 
. 
. ****
. * total cases or infections or infections estimated to reported cases (CER / IER) all studies, reference scenarios, 2021
. 
. twoway ///
> (line TotCERMeRaA00S00 date, sort lcolor(cyan) lwidth(vthick)) /// 1 "JOHN"
> (line TotCERMeRaA01S00 date, sort lcolor(red)) /// 2 "DELP"
> (line TotIERMeRaA02S01 date, sort lcolor(black)) /// 3 "IHME"
> (line TotCERMeRaA05S00 date, sort lcolor(green)) /// 4 "SRIV"
> if date >= td(01jan2021) ///
> , xtitle(Date) xlabel(#$monthspast01jan2021merge, format(%tdYY-NN-DD) labsize(small)) xlabel(, grid) ///
> xlabel(, angle(forty_five)) ylabel(, format(%12.0fc) labsize(small))  ylabel(, labsize(small) angle(horizontal)) ///
> ytitle(Total cases or infections estimated to reported) title("COVID-19 total cases estimated to reported, $country", size(medium)) /// 
> xscale(lwidth(vthin) lcolor(gray*.2)) yscale(lwidth(vthin) lcolor(gray*.2) titlegap(5)) legend(region(lcolor(none))) legend(bexpand) ///
> legend(order(1 "JOHN cases" 2 "DELP cases" 3 "IHME infections" 4 "SRIV cases") size(small) row(2)) ///
> subtitle("total cases or infections estimated, to reported cases; reference scenarios", size(small))
{res}{txt}
{com}. 
. graph export "graph 98 COVID-19 total cases estimated to reported, $country, reference scenarios.pdf", replace
{txt}(file /Users/farshadpourmalek/Downloads/covir2-main/20220701/code/merge/graph 98 COVID-19 total cases estimated to reported, Iran, reference scenarios.pdf written in PDF format)

{com}. 
. 
. 
. 
. 
. 
. *****************
. 
. * IHME graphs
. 
. 
. 
. * R effective, 01jun2021 on
. 
. twoway ///
> (line reff_mean_A02S02 date, sort lcolor(green) lwidth(thick)) ///
> (line reff_mean_A02S01 date, sort lcolor(black) lwidth(thick)) ///
> (line reff_lower_A02S01 date, sort lcolor(black*.5) lpattern(dash)) ///
> (line reff_upper_A02S01 date, sort lcolor(black*.5) lpattern(dash)) ///
> if date >= td(01jun2021) ///
> , xtitle(Date) xlabel(#$monthspast01jan2021merge, format(%tdYY-NN-DD) labsize(small)) xlabel(, grid) xlabel(, grid) ///
> xlabel(, angle(forty_five)) ylabel(, format(%12.1fc) labsize(small))  ylabel(, labsize(small) angle(horizontal)) ///
> ytitle(R effective) title("COVID-19 R effective, $country, IHME, 2 scenarios", size(medium)) ///
> xscale(lwidth(vthin) lcolor(gray*.2)) yscale(lwidth(vthin) lcolor(gray*.2)) legend(region(lcolor(none))) legend(bexpand) ///
> legend(order(1 "Better" 2 "Reference") rows(1)) ///
> note(Uncertainty limits: dashed curves)
{res}{txt}
{com}. 
. graph export "graph 101 COVID-19 R effective, $country, 2 scenarios 01jun2021 on.pdf", replace
{txt}(file /Users/farshadpourmalek/Downloads/covir2-main/20220701/code/merge/graph 101 COVID-19 R effective, Iran, 2 scenarios 01jun2021 on.pdf written in PDF format)

{com}. 
. 
. 
. 
. * daily Infection outcomes ratios, 2 scenarios 
.   
. twoway ///
> (line infection_detection_A02S01 date, sort lcolor(green)) ///
> (line infection_hospitalization_A02S01 date, sort lcolor(black)) ///
> (line infection_fatality_A02S01 date, sort lcolor(red)) ///
> (line infection_detection_A02S02 date, sort lcolor(green) lpattern(dash)) ///
> (line infection_hospitalization_A02S02 date, sort lcolor(black) lpattern(dash)) ///
> (line infection_fatality_A02S02 date, sort lcolor(red) lpattern(dash)) ///
> if date >= td(01jan2020) ///
> , xtitle(Date) xlabel(#$monthspast01jan2020merge, format(%tdYY-NN-DD) labsize(small)) xlabel(, grid) xlabel(, grid) ///
> xlabel(, angle(forty_five)) ylabel(, format(%9.2fc) labsize(small))  ylabel(, labsize(small) angle(horizontal)) ///
> ytitle(Daily infection outcome ratios) title("COVID-19 daily infection outcome ratios, $country, IHME, 2 scenarios", size(medium)) ///
> xscale(lwidth(vthin) lcolor(gray*.2)) yscale(lwidth(vthin) lcolor(gray*.2)) legend(region(lcolor(none))) legend(bexpand) ///
> legend(order(1 "Infection detection ratio" 2 "Infection hospitalization ratio" 3 "Infection fatality ratio") rows(2)) ///
> note("Better scenario: dashed curves")
{res}{txt}
{com}. 
. graph export "graph 102 COVID-19 daily Infection outcomes ratios, $country 2 scenarios, IHME.pdf", replace
{txt}(file /Users/farshadpourmalek/Downloads/covir2-main/20220701/code/merge/graph 102 COVID-19 daily Infection outcomes ratios, Iran 2 scenarios, IHME.pdf written in PDF format)

{com}. 
. 
. 
. 
. * daily % change in mobility, CI
. 
. twoway ///
> (line mobility_mean_A02S02 date, sort lcolor(green) lwidth(vthick) lpattern(tight_dot)) ///
> (line mobility_mean_A02S01 date, sort lcolor(black)) ///
> if date >= td(01jan2020) ///
> , xtitle(Date) xlabel(#$monthspast01jan2020merge, format(%tdYY-NN-DD) labsize(small)) xlabel(, grid) xlabel(, grid) ///
> xlabel(, angle(forty_five)) ylabel(, format(%12.1fc) labsize(small))  ylabel(, labsize(small) angle(horizontal)) ///
> ytitle(Daily % change in mobility from baseline) title("COVID-19 daily % change in mobility, $country, IHME, 2 scenarios", size(medium)) ///
> xscale(lwidth(vthin) lcolor(gray*.2)) yscale(lwidth(vthin) lcolor(gray*.2)) legend(region(lcolor(none))) legend(bexpand) ///
> legend(order(1 "Better" 2 "Reference") rows(1)) 
{res}{txt}
{com}. 
. graph export "graph 103 COVID-19 daily mobility, $country, 2 scenarios IHME.pdf", replace
{txt}(file /Users/farshadpourmalek/Downloads/covir2-main/20220701/code/merge/graph 103 COVID-19 daily mobility, Iran, 2 scenarios IHME.pdf written in PDF format)

{com}. 
. 
. 
. 
. * daily mask use Percent of population reporting always wearing a mask when leaving home
. 
. twoway ///
> (line mask_use_mean_A02S02 date, sort lcolor(green) lwidth(vthick) lpattern(tight_dot)) ///
> (line mask_use_mean_A02S01 date, sort lcolor(black)) ///
> if date >= td(01jan2020) ///
> , xtitle(Date) xlabel(#$monthspast01jan2020merge, format(%tdYY-NN-DD) labsize(small)) xlabel(, grid) xlabel(, grid) ///
> xlabel(, angle(forty_five)) ylabel(, format(%12.1fc) labsize(small))  ylabel(, labsize(small) angle(horizontal)) ///
> ytitle(Daily mask use) title("COVID-19 daily mask use, $country, IHME, 2 scenarios", size(medium)) ///
> xscale(lwidth(vthin) lcolor(gray*.2)) yscale(lwidth(vthin) lcolor(gray*.2)) legend(region(lcolor(none))) legend(bexpand) ///
> legend(order(1 "Better" 2 "Reference") rows(1)) ///
> subtitle(Percent of population reporting always wearing a mask when leaving home, size(small))
{res}{txt}
{com}. 
. graph export "graph 104 COVID-19 daily mask_use, $country, 2 scenarios IHME.pdf", replace
{txt}(file /Users/farshadpourmalek/Downloads/covir2-main/20220701/code/merge/graph 104 COVID-19 daily mask_use, Iran, 2 scenarios IHME.pdf written in PDF format)

{com}. 
. 
. 
. * cumulative vaccinated percent
. 
. twoway ///
> (line cumulative_all_vaccin_pct date, sort lcolor(black)) ///
> (line cumul_all_effect_vacci_pct date, sort lcolor(blue)) ///
> (line cumul_all_fully_vacci_pct date, sort lcolor(green) lwidth(thick)) ///
> if date >= td(01dec2020) ///
> , xtitle(Date) xlabel(#$monthspast01jan2021merge, format(%tdYY-NN-DD) labsize(small)) xlabel(, grid) xlabel(, grid) ///
> xlabel(, angle(forty_five)) ylabel(, format(%15.1fc) labsize(small))  ylabel(, labsize(small) angle(horizontal)) ///
> ytitle(% Cumulative vaccinated percent) title("COVID-19 cumulative vaccinated percent, $country, IHME, 2 scenarios", size(medium)) ///
> xscale(lwidth(vthin) lcolor(gray*.2)) yscale(lwidth(vthin) lcolor(gray*.2)) legend(region(lcolor(none))) legend(bexpand) ///
> legend(order(1 "Vaccinated" 2 "Effectively vaccinated" 3 "Fully vaccinated") rows(1)) ///
> note("Vaccinated: Initially vaccinated (one dose of two doses)" ///
> "Effectively vaccinated: one and two dose with efficacy" ///
> "Fully vaccinated: one of one and two of two doses", size(small))
{res}{txt}
{com}. 
. graph export "graph 105 COVID-19 cumulative vaccinated percent, $country IHME.pdf", replace
{txt}(file /Users/farshadpourmalek/Downloads/covir2-main/20220701/code/merge/graph 105 COVID-19 cumulative vaccinated percent, Iran IHME.pdf written in PDF format)

{com}. 
. 
. 
. 
. 
. * daily vaccinated percent
. 
. twoway ///
> (line daily_all_vaccin_pct date, sort lcolor(black)) ///
> (line daily_all_effect_vacci_pct date, sort lcolor(blue)) ///
> (line daily_all_fully_vacci_pct date, sort lcolor(green) lwidth(thick)) ///
> if date >= td(01dec2020) ///
> , xtitle(Date) xlabel(#$monthspast01jan2021merge, format(%tdYY-NN-DD) labsize(small)) xlabel(, grid) xlabel(, grid) ///
> xlabel(, angle(forty_five)) ylabel(, format(%15.1fc) labsize(small))  ylabel(, labsize(small) angle(horizontal)) ///
> ytitle(% Daily vaccinated percent) title("COVID-19 daily vaccinated percent, $country, IHME, 2 scenarios", size(medium)) ///
> xscale(lwidth(vthin) lcolor(gray*.2)) yscale(lwidth(vthin) lcolor(gray*.2)) legend(region(lcolor(none))) legend(bexpand) ///
> legend(order(1 "Vaccinated" 2 "Effectively vaccinated" 3 "Fully vaccinated") rows(1)) ///
> note("Vaccinated: Initially vaccinated (one dose of two doses)" ///
> "Effectively vaccinated: one and two dose with efficacy" ///
> "Fully vaccinated: one of one and two of two doses", size(small))
{res}{txt}
{com}. 
. graph export "graph 106 COVID-19 daily vaccinated percent, $country.pdf", replace
{txt}(file /Users/farshadpourmalek/Downloads/covir2-main/20220701/code/merge/graph 106 COVID-19 daily vaccinated percent, Iran.pdf written in PDF format)

{com}. 
. 
. 
. 
. * daily vaccinated number
. 
. twoway ///
> (line daily_all_vaccinated date, sort lcolor(black)) ///
> (line daily_all_effectively_vacci date, sort lcolor(blue)) ///
> (line daily_all_fully_vaccinated date, sort lcolor(green) lwidth(thick)) ///
> if date >= td(01jan2021) ///
> , xtitle(Date) xlabel(#$monthspast01jan2021merge, format(%tdYY-NN-DD) labsize(small)) xlabel(, grid) xlabel(, grid) ///
> xlabel(, angle(forty_five)) ylabel(, format(%15.0fc) labsize(small))  ylabel(, labsize(small) angle(horizontal)) ///
> ytitle(Daily vaccinated number) title("COVID-19 daily vaccinated number, $country, IHME, 2 scenarios", size(medium)) ///
> xscale(lwidth(vthin) lcolor(gray*.2)) yscale(lwidth(vthin) lcolor(gray*.2)) legend(region(lcolor(none))) legend(bexpand) ///
> legend(order(1 "Vaccinated" 2 "Effectively vaccinated" 3 "Fully vaccinated") rows(1)) ///
> note("Vaccinated: Initially vaccinated (one dose of two doses)" ///
> "Effectively vaccinated: one and two dose with efficacy" ///
> "Fully vaccinated: one of one and two of two doses", size(small))
{res}{txt}
{com}. 
. graph export "graph 107 COVID-19 daily vaccinated number, $country.pdf", replace
{txt}(file /Users/farshadpourmalek/Downloads/covir2-main/20220701/code/merge/graph 107 COVID-19 daily vaccinated number, Iran.pdf written in PDF format)

{com}. 
. 
. 
. *
. 
. 
. 
. ******************************************************
. 
. *** EMRO
. 
. 
. * EMRO JOHN
. 
. cd .. // code
{res}/Users/farshadpourmalek/Downloads/covir2-main/20220701/code
{txt}
{com}. 
. cd JOHN
{res}/Users/farshadpourmalek/Downloads/covir2-main/20220701/code/JOHN
{txt}
{com}. 
. use "JOHN deaths and cases EMRO region and countries.dta", clear
{txt}
{com}. 
. cd ..
{res}/Users/farshadpourmalek/Downloads/covir2-main/20220701/code
{txt}
{com}. 
. cd merge
{res}/Users/farshadpourmalek/Downloads/covir2-main/20220701/code/merge
{txt}
{com}. 
. save "JOHN deaths and cases EMRO region and countries.dta", replace
{txt}(note: file JOHN deaths and cases EMRO region and countries.dta not found)
file JOHN deaths and cases EMRO region and countries.dta saved

{com}. 
. 
. 
. 
. 
. 
. ****************************
. 
. * daily deaths, JOHN, 2022 on, EMRO countries
. 
. twoway ///
> (line DayDeaMeSmA00AFG date, sort lcolor(brown) lwidth(medium) lpattern(solid)) /// 1 Afghanistan
> (line DayDeaMeSmA00BHR date, sort lcolor(brown) lwidth(medium) lpattern(dash)) /// 2 Bahrain
> (line DayDeaMeSmA00DJI date, sort lcolor(brown) lwidth(medium) lpattern(dot)) /// 3 Djibouti 
> (line DayDeaMeSmA00EGY date, sort lcolor(blue) lwidth(medium) lpattern(solid)) /// 4 Egypt
> (line DayDeaMeSmA00IRQ date, sort lcolor(blue) lwidth(medium) lpattern(dash)) /// 5 Iraq
> (line DayDeaMeSmA00JOR date, sort lcolor(blue) lwidth(medium) lpattern(dot)) /// 6 Jordan
> (line DayDeaMeSmA00KWT date, sort lcolor(green) lwidth(medium) lpattern(solid)) /// 7 Kuwait
> (line DayDeaMeSmA00LBN date, sort lcolor(green) lwidth(medium) lpattern(dash)) /// 8 Lebanon
> (line DayDeaMeSmA00LBY date, sort lcolor(green) lwidth(medium) lpattern(dot)) /// 9 Libya
> (line DayDeaMeSmA00MAR date, sort lcolor(gold) lwidth(medium) lpattern(solid)) /// 10 Morocco
> (line DayDeaMeSmA00OMN date, sort lcolor(gold) lwidth(medium) lpattern(dash)) /// 11 Oman
> (line DayDeaMeSmA00PAK date, sort lcolor(gold) lwidth(medium) lpattern(dot)) /// 12 Pakistan
> (line DayDeaMeSmA00PSE date, sort lcolor(magenta) lwidth(medium) lpattern(solid)) /// 13 Palestine
> (line DayDeaMeSmA00QAT date, sort lcolor(magenta) lwidth(medium) lpattern(dash)) /// 14 Qatar
> (line DayDeaMeSmA00SAU date, sort lcolor(magenta) lwidth(medium) lpattern(dot)) /// 15 Saudi Arabia
> (line DayDeaMeSmA00SOM date, sort lcolor(orange) lwidth(medium) lpattern(solid)) /// 16 Somalia
> (line DayDeaMeSmA00SDN date, sort lcolor(orange) lwidth(medium) lpattern(dash)) /// 17 Sudan
> (line DayDeaMeSmA00SYR date, sort lcolor(orange) lwidth(medium) lpattern(dot)) /// 18 Syria
> (line DayDeaMeSmA00TUN date, sort lcolor(purple) lwidth(medium) lpattern(solid)) /// 19 Tunisia
> (line DayDeaMeSmA00ARE date, sort lcolor(purple) lwidth(medium) lpattern(dash)) /// 20 United Arab Emirates
> (line DayDeaMeSmA00YEM date, sort lcolor(purple) lwidth(medium) lpattern(dot)) /// 21 Yemen
> (line DayDeaMeSmA00EMR date, sort lcolor(black) lwidth(medthick) lpattern(solid)) /// 22 EMRO
> (line DayDeaMeSmA00IRN date, sort lcolor(cyan) lwidth(thick) lpattern(solid)) /// 23 Iran
> if date >= td(01jan2022) & date <= `nextmonthdatespast01jan2022JOHN' ///
> , xtitle(Date) xlabel(#$monthspast01jan2022JOHN, format(%tdYY-NN-DD) labsize(small)) xlabel(, grid) xlabel(, grid) ///
> xlabel(, angle(forty_five)) ylabel(, format(%9.0fc) labsize(small)) ylabel(, labsize(small) angle(horizontal)) ///
> ytitle(Daily reported deaths) title("COVID-19 daily reported deaths, EMRO countries, Johns Hopkins, 2022", size(medium)) ///
> xscale(lwidth(vthin) lcolor(gray*.2)) yscale(lwidth(vthin) lcolor(gray*.2)) legend(region(lcolor(none))) legend(bexpand) ///
> legend(order(23 "Iran" 22 "EMR" 1 "AFG" 2 "BHR" 3 "DJI" 4 "EGY" 5 "IRQ" 6 "JOR" 7 "KWT" ///
> 8 "LBN" 9 "LBY" 10 "MAR" 11 "OMN" 12 "PAK" 13 "PSE" 14 "QAT" 15 "SAU" 16 "SOM" 17 "SDN" ///
> 18 "SYR" 19 "TUN" 20 "ARE" 21 "YEM") size(small) row(3)) ///
> subtitle("Smoothed", size(small))
{res}{txt}
{com}. 
. graph export "graph 1001 COVID-19 daily deaths, EMRO countries, Johns Hopkins, 2022 on.pdf", replace
{txt}(file /Users/farshadpourmalek/Downloads/covir2-main/20220701/code/merge/graph 1001 COVID-19 daily deaths, EMRO countries, Johns Hopkins, 2022 on.pdf written in PDF format)

{com}. 
. 
. 
. 
. 
. 
. ****************************
. 
. * daily deaths, JOHN, 2022 on, EMRO countries, Without extremes
. 
. * Without extremes: EMR, Iran, Sudan, and Oman.
. 
. twoway ///
> (line DayDeaMeSmA00AFG date, sort lcolor(brown) lwidth(medium) lpattern(solid)) /// 1 Afghanistan
> (line DayDeaMeSmA00BHR date, sort lcolor(brown) lwidth(medium) lpattern(dash)) /// 2 Bahrain
> (line DayDeaMeSmA00DJI date, sort lcolor(brown) lwidth(medium) lpattern(dot)) /// 3 Djibouti 
> (line DayDeaMeSmA00EGY date, sort lcolor(blue) lwidth(medium) lpattern(solid)) /// 4 Egypt
> (line DayDeaMeSmA00IRQ date, sort lcolor(blue) lwidth(medium) lpattern(dash)) /// 5 Iraq
> (line DayDeaMeSmA00JOR date, sort lcolor(blue) lwidth(medium) lpattern(dot)) /// 6 Jordan
> (line DayDeaMeSmA00KWT date, sort lcolor(green) lwidth(medium) lpattern(solid)) /// 7 Kuwait
> (line DayDeaMeSmA00LBN date, sort lcolor(green) lwidth(medium) lpattern(dash)) /// 8 Lebanon
> (line DayDeaMeSmA00LBY date, sort lcolor(green) lwidth(medium) lpattern(dot)) /// 9 Libya
> (line DayDeaMeSmA00MAR date, sort lcolor(gold) lwidth(medium) lpattern(solid)) /// 10 Morocco
> (line DayDeaMeSmA00PAK date, sort lcolor(gold) lwidth(medium) lpattern(dot)) /// 11 Pakistan
> (line DayDeaMeSmA00PSE date, sort lcolor(magenta) lwidth(medium) lpattern(solid)) /// 12 Palestine
> (line DayDeaMeSmA00QAT date, sort lcolor(magenta) lwidth(medium) lpattern(dash)) /// 13 Qatar
> (line DayDeaMeSmA00SAU date, sort lcolor(magenta) lwidth(medium) lpattern(dot)) /// 14 Saudi Arabia
> (line DayDeaMeSmA00SOM date, sort lcolor(orange) lwidth(medium) lpattern(solid)) /// 15 Somalia
> (line DayDeaMeSmA00SYR date, sort lcolor(orange) lwidth(medium) lpattern(dot)) /// 16 Syria
> (line DayDeaMeSmA00TUN date, sort lcolor(purple) lwidth(medium) lpattern(solid)) /// 17 Tunisia
> (line DayDeaMeSmA00ARE date, sort lcolor(purple) lwidth(medium) lpattern(dash)) /// 18 United Arab Emirates
> (line DayDeaMeSmA00YEM date, sort lcolor(purple) lwidth(medium) lpattern(dot)) /// 19 Yemen
> if date >= td(01jan2022) & date <= `nextmonthdatespast01jan2022JOHN' ///
> , xtitle(Date) xlabel(#$monthspast01jan2022JOHN, format(%tdYY-NN-DD) labsize(small)) xlabel(, grid) xlabel(, grid) ///
> xlabel(, angle(forty_five)) ylabel(, format(%9.0fc) labsize(small)) ylabel(, labsize(small) angle(horizontal)) ///
> ytitle(Daily reported deaths) title("COVID-19 daily reported deaths, EMRO countries, Johns Hopkins, 2022", size(medium)) ///
> xscale(lwidth(vthin) lcolor(gray*.2)) yscale(lwidth(vthin) lcolor(gray*.2)) legend(region(lcolor(none))) legend(bexpand) ///
> legend(order(1 "AFG" 2 "BHR" 3 "DJI" 4 "EGY" 5 "IRQ" 6 "JOR" 7 "KWT" ///
> 8 "LBN" 9 "LBY" 10 "MAR" 11 "PAK" 12 "PSE" 13 "QAT" 14 "SAU" 15 "SOM" ///
> 16 "SYR" 17 "TUN" 18 "ARE" 19 "YEM") size(small) row(3)) ///
> subtitle("Without extremes: EMR, Iran, Sudan, and Oman. Smoothed", size(small))
{res}{txt}
{com}. 
. graph export "graph 1001 b COVID-19 daily deaths, EMRO countries, Johns Hopkins, 2022 on.pdf", replace
{txt}(file /Users/farshadpourmalek/Downloads/covir2-main/20220701/code/merge/graph 1001 b COVID-19 daily deaths, EMRO countries, Johns Hopkins, 2022 on.pdf written in PDF format)

{com}. 
. 
. 
. 
. 
. 
. ****************************
. 
. * daily deaths, JOHN, 2022 on, EMRO countries, June 2022
. 
. twoway ///
> (line DayDeaMeSmA00AFG date, sort lcolor(brown) lwidth(medium) lpattern(solid)) /// 1 Afghanistan
> (line DayDeaMeSmA00BHR date, sort lcolor(brown) lwidth(medium) lpattern(dash)) /// 2 Bahrain
> (line DayDeaMeSmA00DJI date, sort lcolor(brown) lwidth(medium) lpattern(dot)) /// 3 Djibouti 
> (line DayDeaMeSmA00EGY date, sort lcolor(blue) lwidth(medium) lpattern(solid)) /// 4 Egypt
> (line DayDeaMeSmA00IRQ date, sort lcolor(blue) lwidth(medium) lpattern(dash)) /// 5 Iraq
> (line DayDeaMeSmA00JOR date, sort lcolor(blue) lwidth(medium) lpattern(dot)) /// 6 Jordan
> (line DayDeaMeSmA00KWT date, sort lcolor(green) lwidth(medium) lpattern(solid)) /// 7 Kuwait
> (line DayDeaMeSmA00LBN date, sort lcolor(green) lwidth(medium) lpattern(dash)) /// 8 Lebanon
> (line DayDeaMeSmA00LBY date, sort lcolor(green) lwidth(medium) lpattern(dot)) /// 9 Libya
> (line DayDeaMeSmA00MAR date, sort lcolor(gold) lwidth(medium) lpattern(solid)) /// 10 Morocco
> (line DayDeaMeSmA00OMN date, sort lcolor(gold) lwidth(medium) lpattern(dash)) /// 11 Oman
> (line DayDeaMeSmA00PAK date, sort lcolor(gold) lwidth(medium) lpattern(dot)) /// 12 Pakistan
> (line DayDeaMeSmA00PSE date, sort lcolor(magenta) lwidth(medium) lpattern(solid)) /// 13 Palestine
> (line DayDeaMeSmA00QAT date, sort lcolor(magenta) lwidth(medium) lpattern(dash)) /// 14 Qatar
> (line DayDeaMeSmA00SAU date, sort lcolor(magenta) lwidth(medium) lpattern(dot)) /// 15 Saudi Arabia
> (line DayDeaMeSmA00SOM date, sort lcolor(orange) lwidth(medium) lpattern(solid)) /// 16 Somalia
> (line DayDeaMeSmA00SDN date, sort lcolor(orange) lwidth(medium) lpattern(dash)) /// 17 Sudan
> (line DayDeaMeSmA00SYR date, sort lcolor(orange) lwidth(medium) lpattern(dot)) /// 18 Syria
> (line DayDeaMeSmA00TUN date, sort lcolor(purple) lwidth(medium) lpattern(solid)) /// 19 Tunisia
> (line DayDeaMeSmA00ARE date, sort lcolor(purple) lwidth(medium) lpattern(dash)) /// 20 United Arab Emirates
> (line DayDeaMeSmA00YEM date, sort lcolor(purple) lwidth(medium) lpattern(dot)) /// 21 Yemen
> (line DayDeaMeSmA00EMR date, sort lcolor(black) lwidth(medthick) lpattern(solid)) /// 22 EMRO
> (line DayDeaMeSmA00IRN date, sort lcolor(cyan) lwidth(thick) lpattern(solid)) /// 23 Iran
> if date >= td(01jun2022) & date <= td(01jul2022) ///
> , xtitle(Date) xlabel(, format(%tdYY-NN-DD) labsize(small)) xlabel(, grid) xlabel(, grid) ///
> xlabel(, angle(forty_five)) ylabel(, format(%9.0fc) labsize(small)) ylabel(, labsize(small) angle(horizontal)) ///
> ytitle(Daily reported deaths) title("COVID-19 daily reported deaths, EMRO countries, Johns Hopkins, 2022", size(medium)) ///
> xscale(lwidth(vthin) lcolor(gray*.2)) yscale(lwidth(vthin) lcolor(gray*.2)) legend(region(lcolor(none))) legend(bexpand) ///
> legend(order(23 "Iran" 22 "EMR" 1 "AFG" 2 "BHR" 3 "DJI" 4 "EGY" 5 "IRQ" 6 "JOR" 7 "KWT" ///
> 8 "LBN" 9 "LBY" 10 "MAR" 11 "OMN" 12 "PAK" 13 "PSE" 14 "QAT" 15 "SAU" 16 "SOM" 17 "SDN" ///
> 18 "SYR" 19 "TUN" 20 "ARE" 21 "YEM") size(small) row(3)) ///
> subtitle("June 2022. Smoothed", size(small))
{res}{txt}
{com}. 
. graph export "graph 1001 c COVID-19 daily deaths, EMRO countries, Johns Hopkins, 2022 on.pdf", replace
{txt}(file /Users/farshadpourmalek/Downloads/covir2-main/20220701/code/merge/graph 1001 c COVID-19 daily deaths, EMRO countries, Johns Hopkins, 2022 on.pdf written in PDF format)

{com}. 
. 
. 
. 
. 
. 
. 
. 
. ****************************
. 
. * daily deaths, JOHN, 2022 on, EMRO countries, June 2022
. 
. * Without extremes: EMR, Oman.
. 
. twoway ///
> (line DayDeaMeSmA00AFG date, sort lcolor(brown) lwidth(medium) lpattern(solid)) /// 1 Afghanistan
> (line DayDeaMeSmA00BHR date, sort lcolor(brown) lwidth(medium) lpattern(dash)) /// 2 Bahrain
> (line DayDeaMeSmA00DJI date, sort lcolor(brown) lwidth(medium) lpattern(dot)) /// 3 Djibouti 
> (line DayDeaMeSmA00EGY date, sort lcolor(blue) lwidth(medium) lpattern(solid)) /// 4 Egypt
> (line DayDeaMeSmA00IRQ date, sort lcolor(blue) lwidth(medium) lpattern(dash)) /// 5 Iraq
> (line DayDeaMeSmA00JOR date, sort lcolor(blue) lwidth(medium) lpattern(dot)) /// 6 Jordan
> (line DayDeaMeSmA00KWT date, sort lcolor(green) lwidth(medium) lpattern(solid)) /// 7 Kuwait
> (line DayDeaMeSmA00LBN date, sort lcolor(green) lwidth(medium) lpattern(dash)) /// 8 Lebanon
> (line DayDeaMeSmA00LBY date, sort lcolor(green) lwidth(medium) lpattern(dot)) /// 9 Libya
> (line DayDeaMeSmA00MAR date, sort lcolor(gold) lwidth(medium) lpattern(solid)) /// 10 Morocco
> (line DayDeaMeSmA00PAK date, sort lcolor(gold) lwidth(medium) lpattern(dot)) /// 11 Pakistan
> (line DayDeaMeSmA00PSE date, sort lcolor(magenta) lwidth(medium) lpattern(solid)) /// 12 Palestine
> (line DayDeaMeSmA00QAT date, sort lcolor(magenta) lwidth(medium) lpattern(dash)) /// 13 Qatar
> (line DayDeaMeSmA00SAU date, sort lcolor(magenta) lwidth(medium) lpattern(dot)) /// 14 Saudi Arabia
> (line DayDeaMeSmA00SOM date, sort lcolor(orange) lwidth(medium) lpattern(solid)) /// 15 Somalia
> (line DayDeaMeSmA00SDN date, sort lcolor(orange) lwidth(medium) lpattern(dash)) /// 16 Sudan
> (line DayDeaMeSmA00SYR date, sort lcolor(orange) lwidth(medium) lpattern(dot)) /// 17 Syria
> (line DayDeaMeSmA00TUN date, sort lcolor(purple) lwidth(medium) lpattern(solid)) /// 18 Tunisia
> (line DayDeaMeSmA00ARE date, sort lcolor(purple) lwidth(medium) lpattern(dash)) /// 19 United Arab Emirates
> (line DayDeaMeSmA00YEM date, sort lcolor(purple) lwidth(medium) lpattern(dot)) /// 10 Yemen
> (line DayDeaMeSmA00IRN date, sort lcolor(cyan) lwidth(thick) lpattern(solid)) /// 21 Iran
> if date >= td(01jun2022) & date <= td(01jul2022) ///
> , xtitle(Date) xlabel(, format(%tdYY-NN-DD) labsize(small)) xlabel(, grid) xlabel(, grid) ///
> xlabel(, angle(forty_five)) ylabel(, format(%9.0fc) labsize(small)) ylabel(, labsize(small) angle(horizontal)) ///
> ytitle(Daily reported deaths) title("COVID-19 daily reported deaths, EMRO countries, Johns Hopkins, 2022", size(medium)) ///
> xscale(lwidth(vthin) lcolor(gray*.2)) yscale(lwidth(vthin) lcolor(gray*.2)) legend(region(lcolor(none))) legend(bexpand) ///
> legend(order(21 "Iran" 1 "AFG" 2 "BHR" 3 "DJI" 4 "EGY" 5 "IRQ" 6 "JOR" 7 "KWT" ///
> 8 "LBN" 9 "LBY" 10 "MAR" 11 "PAK" 12 "PSE" 13 "QAT" 14 "SAU" 15 "SOM" 16 "SDN" ///
> 17 "SYR" 18 "TUN" 19 "ARE" 10 "YEM") size(small) row(3)) ///
> subtitle("Without extremes: EMR, Oman. June 2022. Smoothed", size(small))
{res}{txt}
{com}. 
. graph export "graph 1001 d COVID-19 daily deaths, EMRO countries, Johns Hopkins, 2022 on.pdf", replace
{txt}(file /Users/farshadpourmalek/Downloads/covir2-main/20220701/code/merge/graph 1001 d COVID-19 daily deaths, EMRO countries, Johns Hopkins, 2022 on.pdf written in PDF format)

{com}. 
. 
. 
. 
. 
. 
. 
. ****************************
. 
. * daily cases, JOHN, 2022 on, EMRO countries
. 
. twoway ///
> (line DayCasMeSmA00AFG date, sort lcolor(brown) lwidth(medium) lpattern(solid)) /// 1 Afghanistan
> (line DayCasMeSmA00BHR date, sort lcolor(brown) lwidth(medium) lpattern(dash)) /// 2 Bahrain
> (line DayCasMeSmA00DJI date, sort lcolor(brown) lwidth(medium) lpattern(dot)) /// 3 Djibouti 
> (line DayCasMeSmA00EGY date, sort lcolor(blue) lwidth(medium) lpattern(solid)) /// 4 Egypt
> (line DayCasMeSmA00IRQ date, sort lcolor(blue) lwidth(medium) lpattern(dash)) /// 5 Iraq
> (line DayCasMeSmA00JOR date, sort lcolor(blue) lwidth(medium) lpattern(dot)) /// 6 Jordan
> (line DayCasMeSmA00KWT date, sort lcolor(green) lwidth(medium) lpattern(solid)) /// 7 Kuwait
> (line DayCasMeSmA00LBN date, sort lcolor(green) lwidth(medium) lpattern(dash)) /// 8 Lebanon
> (line DayCasMeSmA00LBY date, sort lcolor(green) lwidth(medium) lpattern(dot)) /// 9 Libya
> (line DayCasMeSmA00MAR date, sort lcolor(gold) lwidth(medium) lpattern(solid)) /// 10 Morocco
> (line DayCasMeSmA00OMN date, sort lcolor(gold) lwidth(medium) lpattern(dash)) /// 11 Oman
> (line DayCasMeSmA00PAK date, sort lcolor(gold) lwidth(medium) lpattern(dot)) /// 12 Pakistan
> (line DayCasMeSmA00PSE date, sort lcolor(magenta) lwidth(medium) lpattern(solid)) /// 13 Palestine
> (line DayCasMeSmA00QAT date, sort lcolor(magenta) lwidth(medium) lpattern(dash)) /// 14 Qatar
> (line DayCasMeSmA00SAU date, sort lcolor(magenta) lwidth(medium) lpattern(dot)) /// 15 Saudi Arabia
> (line DayCasMeSmA00SOM date, sort lcolor(orange) lwidth(medium) lpattern(solid)) /// 16 Somalia
> (line DayCasMeSmA00SDN date, sort lcolor(orange) lwidth(medium) lpattern(dash)) /// 17 Sudan
> (line DayCasMeSmA00SYR date, sort lcolor(orange) lwidth(medium) lpattern(dot)) /// 18 Syria
> (line DayCasMeSmA00TUN date, sort lcolor(purple) lwidth(medium) lpattern(solid)) /// 19 Tunisia
> (line DayCasMeSmA00ARE date, sort lcolor(purple) lwidth(medium) lpattern(dash)) /// 20 United Arab Emirates
> (line DayCasMeSmA00YEM date, sort lcolor(purple) lwidth(medium) lpattern(dot)) /// 21 Yemen
> (line DayCasMeSmA00EMR date, sort lcolor(black) lwidth(medthick)  lpattern(solid)) /// 22 EMRO
> (line DayCasMeSmA00IRN date, sort lcolor(cyan) lwidth(thick)  lpattern(solid)) /// 23 Iran
> if date >= td(01jan2022) & date <= `nextmonthdatespast01jan2022JOHN' ///
> , xtitle(Date) xlabel(#$monthspast01jan2022JOHN, format(%tdYY-NN-DD) labsize(small)) xlabel(, grid) xlabel(, grid) ///
> xlabel(, angle(forty_five)) ylabel(, format(%9.0fc) labsize(small)) ylabel(, labsize(small) angle(horizontal)) ///
> ytitle(Daily reported cases) title("COVID-19 daily reported cases, EMRO countries, Johns Hopkins, 2022", size(medium)) ///
> xscale(lwidth(vthin) lcolor(gray*.2)) yscale(lwidth(vthin) lcolor(gray*.2)) legend(region(lcolor(none))) legend(bexpand) ///
> legend(order(23 "Iran" 22 "EMR" 1 "AFG" 2 "BHR" 3 "DJI" 4 "EGY" 5 "IRQ" 6 "JOR" 7 "KWT" ///
> 8 "LBN" 9 "LBY" 10 "MAR" 11 "OMN" 12 "PAK" 13 "PSE" 14 "QAT" 15 "SAU" 16 "SOM" 17 "SDN" ///
> 18 "SYR" 19 "TUN" 20 "ARE" 21 "YEM") size(small) row(3)) ///
> subtitle("Smoothed", size(small))
{res}{txt}
{com}. 
. graph export "graph 1010 COVID-19 daily cases, EMRO countries, Johns Hopkins, 2022 on.pdf", replace
{txt}(file /Users/farshadpourmalek/Downloads/covir2-main/20220701/code/merge/graph 1010 COVID-19 daily cases, EMRO countries, Johns Hopkins, 2022 on.pdf written in PDF format)

{com}. 
. 
. 
. 
. 
. 
. ****************************
. 
. * daily cases, JOHN, 2022 on, EMRO countries, Without extremes
. 
. twoway ///
> (line DayCasMeSmA00AFG date, sort lcolor(brown) lwidth(medium) lpattern(solid)) /// 1 Afghanistan
> (line DayCasMeSmA00BHR date, sort lcolor(brown) lwidth(medium) lpattern(dash)) /// 2 Bahrain
> (line DayCasMeSmA00DJI date, sort lcolor(brown) lwidth(medium) lpattern(dot)) /// 3 Djibouti 
> (line DayCasMeSmA00EGY date, sort lcolor(blue) lwidth(medium) lpattern(solid)) /// 4 Egypt
> (line DayCasMeSmA00IRQ date, sort lcolor(blue) lwidth(medium) lpattern(dash)) /// 5 Iraq
> (line DayCasMeSmA00KWT date, sort lcolor(green) lwidth(medium) lpattern(solid)) /// 6 Kuwait
> (line DayCasMeSmA00LBN date, sort lcolor(green) lwidth(medium) lpattern(dash)) /// 7 Lebanon
> (line DayCasMeSmA00LBY date, sort lcolor(green) lwidth(medium) lpattern(dot)) /// 8 Libya
> (line DayCasMeSmA00MAR date, sort lcolor(gold) lwidth(medium) lpattern(solid)) /// 9 Morocco
> (line DayCasMeSmA00OMN date, sort lcolor(gold) lwidth(medium) lpattern(dash)) /// 10 Oman
> (line DayCasMeSmA00PAK date, sort lcolor(gold) lwidth(medium) lpattern(dot)) /// 11 Pakistan
> (line DayCasMeSmA00PSE date, sort lcolor(magenta) lwidth(medium) lpattern(solid)) /// 12 Palestine
> (line DayCasMeSmA00QAT date, sort lcolor(magenta) lwidth(medium) lpattern(dash)) /// 13 Qatar
> (line DayCasMeSmA00SAU date, sort lcolor(magenta) lwidth(medium) lpattern(dot)) /// 14 Saudi Arabia
> (line DayCasMeSmA00SOM date, sort lcolor(orange) lwidth(medium) lpattern(solid)) /// 15 Somalia
> (line DayCasMeSmA00SDN date, sort lcolor(orange) lwidth(medium) lpattern(dash)) /// 16 Sudan
> (line DayCasMeSmA00SYR date, sort lcolor(orange) lwidth(medium) lpattern(dot)) /// 17 Syria
> (line DayCasMeSmA00TUN date, sort lcolor(purple) lwidth(medium) lpattern(solid)) /// 18 Tunisia
> (line DayCasMeSmA00ARE date, sort lcolor(purple) lwidth(medium) lpattern(dash)) /// 19 United Arab Emirates
> (line DayCasMeSmA00YEM date, sort lcolor(purple) lwidth(medium) lpattern(dot)) /// 20 Yemen
> if date >= td(01jan2022) & date <= `nextmonthdatespast01jan2022JOHN' ///
> , xtitle(Date) xlabel(#$monthspast01jan2022JOHN, format(%tdYY-NN-DD) labsize(small)) xlabel(, grid) xlabel(, grid) ///
> xlabel(, angle(forty_five)) ylabel(, format(%9.0fc) labsize(small)) ylabel(, labsize(small) angle(horizontal)) ///
> ytitle(Daily reported cases) title("COVID-19 daily reported cases, EMRO countries, Johns Hopkins, 2022", size(medium)) ///
> xscale(lwidth(vthin) lcolor(gray*.2)) yscale(lwidth(vthin) lcolor(gray*.2)) legend(region(lcolor(none))) legend(bexpand) ///
> legend(order(1 "AFG" 2 "BHR" 3 "DJI" 4 "EGY" 5 "IRQ" 6 "KWT" ///
> 7 "LBN" 8 "LBY" 9 "MAR" 10 "OMN" 11 "PAK" 12 "PSE" 13 "QAT" 14 "SAU" 15 "SOM" 16 "SDN" ///
> 17 "SYR" 18 "TUN" 19 "ARE" 20 "YEM") size(small) row(3)) ///
> subtitle("Without extremes: EMR, Iran, and Jordan. Smoothed", size(small))
{res}{txt}
{com}. 
. graph export "graph 1010 b COVID-19 daily cases, EMRO countries, Johns Hopkins, 2022 on.pdf", replace
{txt}(file /Users/farshadpourmalek/Downloads/covir2-main/20220701/code/merge/graph 1010 b COVID-19 daily cases, EMRO countries, Johns Hopkins, 2022 on.pdf written in PDF format)

{com}. 
. 
. 
. 
. 
. 
. ****************************
. 
. * daily cases, JOHN, 2022 on, EMRO countries, June 2022
. 
. twoway ///
> (line DayCasMeSmA00AFG date, sort lcolor(brown) lwidth(medium) lpattern(solid)) /// 1 Afghanistan
> (line DayCasMeSmA00BHR date, sort lcolor(brown) lwidth(medium) lpattern(dash)) /// 2 Bahrain
> (line DayCasMeSmA00DJI date, sort lcolor(brown) lwidth(medium) lpattern(dot)) /// 3 Djibouti 
> (line DayCasMeSmA00EGY date, sort lcolor(blue) lwidth(medium) lpattern(solid)) /// 4 Egypt
> (line DayCasMeSmA00IRQ date, sort lcolor(blue) lwidth(medium) lpattern(dash)) /// 5 Iraq
> (line DayCasMeSmA00JOR date, sort lcolor(blue) lwidth(medium) lpattern(dot)) /// 6 Jordan
> (line DayCasMeSmA00KWT date, sort lcolor(green) lwidth(medium) lpattern(solid)) /// 7 Kuwait
> (line DayCasMeSmA00LBN date, sort lcolor(green) lwidth(medium) lpattern(dash)) /// 8 Lebanon
> (line DayCasMeSmA00LBY date, sort lcolor(green) lwidth(medium) lpattern(dot)) /// 9 Libya
> (line DayCasMeSmA00MAR date, sort lcolor(gold) lwidth(medium) lpattern(solid)) /// 10 Morocco
> (line DayCasMeSmA00OMN date, sort lcolor(gold) lwidth(medium) lpattern(dash)) /// 11 Oman
> (line DayCasMeSmA00PAK date, sort lcolor(gold) lwidth(medium) lpattern(dot)) /// 12 Pakistan
> (line DayCasMeSmA00PSE date, sort lcolor(magenta) lwidth(medium) lpattern(solid)) /// 13 Palestine
> (line DayCasMeSmA00QAT date, sort lcolor(magenta) lwidth(medium) lpattern(dash)) /// 14 Qatar
> (line DayCasMeSmA00SAU date, sort lcolor(magenta) lwidth(medium) lpattern(dot)) /// 15 Saudi Arabia
> (line DayCasMeSmA00SOM date, sort lcolor(orange) lwidth(medium) lpattern(solid)) /// 16 Somalia
> (line DayCasMeSmA00SDN date, sort lcolor(orange) lwidth(medium) lpattern(dash)) /// 17 Sudan
> (line DayCasMeSmA00SYR date, sort lcolor(orange) lwidth(medium) lpattern(dot)) /// 18 Syria
> (line DayCasMeSmA00TUN date, sort lcolor(purple) lwidth(medium) lpattern(solid)) /// 19 Tunisia
> (line DayCasMeSmA00ARE date, sort lcolor(purple) lwidth(medium) lpattern(dash)) /// 20 United Arab Emirates
> (line DayCasMeSmA00YEM date, sort lcolor(purple) lwidth(medium) lpattern(dot)) /// 21 Yemen
> (line DayCasMeSmA00IRN date, sort lcolor(cyan) lwidth(thick)  lpattern(solid)) /// 22 Iran
> if date >= td(01jun2022) & date <= td(01jul2022) ///
> , xtitle(Date) xlabel(, format(%tdYY-NN-DD) labsize(small)) xlabel(, grid) xlabel(, grid) ///
> xlabel(, angle(forty_five)) ylabel(, format(%9.0fc) labsize(small)) ylabel(, labsize(small) angle(horizontal)) ///
> ytitle(Daily reported cases) title("COVID-19 daily reported cases, EMRO countries, Johns Hopkins, 2022", size(medium)) ///
> xscale(lwidth(vthin) lcolor(gray*.2)) yscale(lwidth(vthin) lcolor(gray*.2)) legend(region(lcolor(none))) legend(bexpand) ///
> legend(order(22 "Iran" 1 "AFG" 2 "BHR" 3 "DJI" 4 "EGY" 5 "IRQ" 6 "JOR" 7 "KWT" ///
> 8 "LBN" 9 "LBY" 10 "MAR" 11 "OMN" 12 "PAK" 13 "PSE" 14 "QAT" 15 "SAU" 16 "SOM" 17 "SDN" ///
> 18 "SYR" 19 "TUN" 20 "ARE" 21 "YEM") size(small) row(3)) ///
> subtitle("Without EMR. June 2022. Smoothed", size(small))
{res}{txt}
{com}. 
. graph export "graph 1010 c COVID-19 daily cases, EMRO countries, Johns Hopkins, 2022 on.pdf", replace
{txt}(file /Users/farshadpourmalek/Downloads/covir2-main/20220701/code/merge/graph 1010 c COVID-19 daily cases, EMRO countries, Johns Hopkins, 2022 on.pdf written in PDF format)

{com}. 
. 
. 
. 
. 
. * EMRO IHME
. 
. cd .. // code
{res}/Users/farshadpourmalek/Downloads/covir2-main/20220701/code
{txt}
{com}. 
. cd IHME
{res}/Users/farshadpourmalek/Downloads/covir2-main/20220701/code/IHME
{txt}
{com}. 
. use "IHME EMRO reference scenario 2022", clear
{txt}
{com}. 
. cd ..
{res}/Users/farshadpourmalek/Downloads/covir2-main/20220701/code
{txt}
{com}. 
. cd merge
{res}/Users/farshadpourmalek/Downloads/covir2-main/20220701/code/merge
{txt}
{com}. 
. save "IHME EMRO reference scenario 2022.dta", replace
{txt}(note: file IHME EMRO reference scenario 2022.dta not found)
file IHME EMRO reference scenario 2022.dta saved

{com}. 
. 
. 
. 
. 
. 
. ****************************
. 
. * daily deaths, IHME, 2022 on, EMRO countries
. 
. twoway ///
> (line DayDeaMeSmA02S01AFG date, sort lcolor(brown) lwidth(medium) lpattern(solid)) /// 1 Afghanistan
> (line DayDeaMeSmA02S01BHR date, sort lcolor(brown) lwidth(medium) lpattern(dash)) /// 2 Bahrain
> (line DayDeaMeSmA02S01DJI date, sort lcolor(brown) lwidth(medium) lpattern(dot)) /// 3 Djibouti 
> (line DayDeaMeSmA02S01EGY date, sort lcolor(blue) lwidth(medium) lpattern(solid)) /// 4 Egypt
> (line DayDeaMeSmA02S01IRQ date, sort lcolor(blue) lwidth(medium) lpattern(dash)) /// 5 Iraq
> (line DayDeaMeSmA02S01JOR date, sort lcolor(blue) lwidth(medium) lpattern(dot)) /// 6 Jordan
> (line DayDeaMeSmA02S01KWT date, sort lcolor(green) lwidth(medium) lpattern(solid)) /// 7 Kuwait
> (line DayDeaMeSmA02S01LBN date, sort lcolor(green) lwidth(medium) lpattern(dash)) /// 8 Lebanon
> (line DayDeaMeSmA02S01LBY date, sort lcolor(green) lwidth(medium) lpattern(dot)) /// 9 Libya
> (line DayDeaMeSmA02S01MAR date, sort lcolor(gold) lwidth(medium) lpattern(solid)) /// 10 Morocco
> (line DayDeaMeSmA02S01OMN date, sort lcolor(gold) lwidth(medium) lpattern(dash)) /// 11 Oman
> (line DayDeaMeSmA02S01PAK date, sort lcolor(gold) lwidth(medium) lpattern(dot)) /// 12 Pakistan
> (line DayDeaMeSmA02S01PSE date, sort lcolor(magenta) lwidth(medium) lpattern(solid)) /// 13 Palestine
> (line DayDeaMeSmA02S01QAT date, sort lcolor(magenta) lwidth(medium) lpattern(dash)) /// 14 Qatar
> (line DayDeaMeSmA02S01SAU date, sort lcolor(magenta) lwidth(medium) lpattern(dot)) /// 15 Saudi Arabia
> (line DayDeaMeSmA02S01SOM date, sort lcolor(orange) lwidth(medium) lpattern(solid)) /// 16 Somalia
> (line DayDeaMeSmA02S01SDN date, sort lcolor(orange) lwidth(medium) lpattern(dash)) /// 17 Sudan
> (line DayDeaMeSmA02S01SYR date, sort lcolor(orange) lwidth(medium) lpattern(dot)) /// 18 Syria
> (line DayDeaMeSmA02S01TUN date, sort lcolor(purple) lwidth(medium) lpattern(solid)) /// 19 Tunisia
> (line DayDeaMeSmA02S01ARE date, sort lcolor(purple) lwidth(medium) lpattern(dash)) /// 20 United Arab Emirates
> (line DayDeaMeSmA02S01YEM date, sort lcolor(purple) lwidth(medium) lpattern(dot)) /// 21 Yemen
> (line DayDeaMeSmA02S01EMR date, sort lcolor(black) lwidth(medthick) lpattern(solid)) /// 22 EMRO
> (line DayDeaMeSmA02S01IRN date, sort lcolor(cyan) lwidth(thick) lpattern(solid)) /// 23 Iran
> if date >= td(01jan2022) & date <= td(01oct2022) ///
> , xtitle(Date) xlabel(#10, format(%tdYY-NN-DD) labsize(small)) xlabel(, grid) xlabel(, grid) ///
> xlabel(, angle(forty_five)) ylabel(, format(%9.0fc) labsize(small)) ylabel(, labsize(small) angle(horizontal)) ///
> ytitle(Daily reported deaths) title("COVID-19 daily reported deaths, EMRO countries, IHME, 2022", size(medium)) ///
> xscale(lwidth(vthin) lcolor(gray*.2)) yscale(lwidth(vthin) lcolor(gray*.2)) legend(region(lcolor(none))) legend(bexpand) ///
> legend(order(23 "Iran" 22 "EMR" 1 "AFG" 2 "BHR" 3 "DJI" 4 "EGY" 5 "IRQ" 6 "JOR" 7 "KWT" ///
> 8 "LBN" 9 "LBY" 10 "MAR" 11 "OMN" 12 "PAK" 13 "PSE" 14 "QAT" 15 "SAU" 16 "SOM" 17 "SDN" ///
> 18 "SYR" 19 "TUN" 20 "ARE" 21 "YEM") size(small) row(3)) ///
> subtitle("Smoothed", size(small))
{res}{txt}
{com}. 
. graph export "graph 1101 COVID-19 daily deaths, EMRO countries, IHME, 2022 on.pdf", replace
{txt}(file /Users/farshadpourmalek/Downloads/covir2-main/20220701/code/merge/graph 1101 COVID-19 daily deaths, EMRO countries, IHME, 2022 on.pdf written in PDF format)

{com}. 
. 
. 
. 
. 
. 
. ****************************
. 
. * daily deaths, IHME, 2022 on, EMRO countries, Forecast only = June on
. 
. twoway ///
> (line DayDeaFOREA02S01AFG date, sort lcolor(brown) lwidth(medium) lpattern(solid)) /// 1 Afghanistan
> (line DayDeaFOREA02S01BHR date, sort lcolor(brown) lwidth(medium) lpattern(dash)) /// 2 Bahrain
> (line DayDeaFOREA02S01DJI date, sort lcolor(brown) lwidth(medium) lpattern(dot)) /// 3 Djibouti 
> (line DayDeaFOREA02S01EGY date, sort lcolor(blue) lwidth(medium) lpattern(solid)) /// 4 Egypt
> (line DayDeaFOREA02S01IRQ date, sort lcolor(blue) lwidth(medium) lpattern(dash)) /// 5 Iraq
> (line DayDeaFOREA02S01JOR date, sort lcolor(blue) lwidth(medium) lpattern(dot)) /// 6 Jordan
> (line DayDeaFOREA02S01KWT date, sort lcolor(green) lwidth(medium) lpattern(solid)) /// 7 Kuwait
> (line DayDeaFOREA02S01LBN date, sort lcolor(green) lwidth(medium) lpattern(dash)) /// 8 Lebanon
> (line DayDeaFOREA02S01LBY date, sort lcolor(green) lwidth(medium) lpattern(dot)) /// 9 Libya
> (line DayDeaFOREA02S01MAR date, sort lcolor(gold) lwidth(medium) lpattern(solid)) /// 10 Morocco
> (line DayDeaFOREA02S01OMN date, sort lcolor(gold) lwidth(medium) lpattern(dash)) /// 11 Oman
> (line DayDeaFOREA02S01PAK date, sort lcolor(gold) lwidth(medium) lpattern(dot)) /// 12 Pakistan
> (line DayDeaFOREA02S01PSE date, sort lcolor(magenta) lwidth(medium) lpattern(solid)) /// 13 Palestine
> (line DayDeaFOREA02S01QAT date, sort lcolor(magenta) lwidth(medium) lpattern(dash)) /// 14 Qatar
> (line DayDeaFOREA02S01SAU date, sort lcolor(magenta) lwidth(medium) lpattern(dot)) /// 15 Saudi Arabia
> (line DayDeaFOREA02S01SOM date, sort lcolor(orange) lwidth(medium) lpattern(solid)) /// 16 Somalia
> (line DayDeaFOREA02S01SDN date, sort lcolor(orange) lwidth(medium) lpattern(dash)) /// 17 Sudan
> (line DayDeaFOREA02S01SYR date, sort lcolor(orange) lwidth(medium) lpattern(dot)) /// 18 Syria
> (line DayDeaFOREA02S01TUN date, sort lcolor(purple) lwidth(medium) lpattern(solid)) /// 19 Tunisia
> (line DayDeaFOREA02S01ARE date, sort lcolor(purple) lwidth(medium) lpattern(dash)) /// 20 United Arab Emirates
> (line DayDeaFOREA02S01YEM date, sort lcolor(purple) lwidth(medium) lpattern(dot)) /// 21 Yemen
> (line DayDeaFOREA02S01EMR date, sort lcolor(black) lwidth(medthick) lpattern(solid)) /// 22 EMRO
> (line DayDeaFOREA02S01IRN date, sort lcolor(cyan) lwidth(thick) lpattern(solid)) /// 23 Iran
> if date >= td(01jun2022) & date <= td(01oct2022) ///
> , xtitle(Date) xlabel(#5, format(%tdYY-NN-DD) labsize(small)) xlabel(, grid) xlabel(, grid) ///
> xlabel(, angle(forty_five)) ylabel(, format(%9.0fc) labsize(small)) ylabel(, labsize(small) angle(horizontal)) ///
> ytitle(Daily reported deaths) title("COVID-19 daily reported deaths, EMRO countries, IHME, 2022", size(medium)) ///
> xscale(lwidth(vthin) lcolor(gray*.2)) yscale(lwidth(vthin) lcolor(gray*.2)) legend(region(lcolor(none))) legend(bexpand) ///
> legend(order(23 "Iran" 22 "EMR" 1 "AFG" 2 "BHR" 3 "DJI" 4 "EGY" 5 "IRQ" 6 "JOR" 7 "KWT" ///
> 8 "LBN" 9 "LBY" 10 "MAR" 11 "OMN" 12 "PAK" 13 "PSE" 14 "QAT" 15 "SAU" 16 "SOM" 17 "SDN" ///
> 18 "SYR" 19 "TUN" 20 "ARE" 21 "YEM") size(small) row(3)) ///
> subtitle("Forecast only. Smoothed", size(small))
{res}{txt}
{com}. 
. graph export "graph 1101 b COVID-19 daily deaths, EMRO countries, IHME, 2022 on.pdf", replace
{txt}(file /Users/farshadpourmalek/Downloads/covir2-main/20220701/code/merge/graph 1101 b COVID-19 daily deaths, EMRO countries, IHME, 2022 on.pdf written in PDF format)

{com}. 
. 
. 
. 
. 
. 
. ****************************
. 
. * daily infections, IHME, 2022 on, EMRO countries
. 
. twoway ///
> (line DayINFMeSmA02S01AFG date, sort lcolor(brown) lwidth(medium) lpattern(solid)) /// 1 Afghanistan
> (line DayINFMeSmA02S01BHR date, sort lcolor(brown) lwidth(medium) lpattern(dash)) /// 2 Bahrain
> (line DayINFMeSmA02S01DJI date, sort lcolor(brown) lwidth(medium) lpattern(dot)) /// 3 Djibouti 
> (line DayINFMeSmA02S01EGY date, sort lcolor(blue) lwidth(medium) lpattern(solid)) /// 4 Egypt
> (line DayINFMeSmA02S01IRQ date, sort lcolor(blue) lwidth(medium) lpattern(dash)) /// 5 Iraq
> (line DayINFMeSmA02S01JOR date, sort lcolor(blue) lwidth(medium) lpattern(dot)) /// 6 Jordan
> (line DayINFMeSmA02S01KWT date, sort lcolor(green) lwidth(medium) lpattern(solid)) /// 7 Kuwait
> (line DayINFMeSmA02S01LBN date, sort lcolor(green) lwidth(medium) lpattern(dash)) /// 8 Lebanon
> (line DayINFMeSmA02S01LBY date, sort lcolor(green) lwidth(medium) lpattern(dot)) /// 9 Libya
> (line DayINFMeSmA02S01MAR date, sort lcolor(gold) lwidth(medium) lpattern(solid)) /// 10 Morocco
> (line DayINFMeSmA02S01OMN date, sort lcolor(gold) lwidth(medium) lpattern(dash)) /// 11 Oman
> (line DayINFMeSmA02S01PAK date, sort lcolor(gold) lwidth(medium) lpattern(dot)) /// 12 Pakistan
> (line DayINFMeSmA02S01PSE date, sort lcolor(magenta) lwidth(medium) lpattern(solid)) /// 13 Palestine
> (line DayINFMeSmA02S01QAT date, sort lcolor(magenta) lwidth(medium) lpattern(dash)) /// 14 Qatar
> (line DayINFMeSmA02S01SAU date, sort lcolor(magenta) lwidth(medium) lpattern(dot)) /// 15 Saudi Arabia
> (line DayINFMeSmA02S01SOM date, sort lcolor(orange) lwidth(medium) lpattern(solid)) /// 16 Somalia
> (line DayINFMeSmA02S01SDN date, sort lcolor(orange) lwidth(medium) lpattern(dash)) /// 17 Sudan
> (line DayINFMeSmA02S01SYR date, sort lcolor(orange) lwidth(medium) lpattern(dot)) /// 18 Syria
> (line DayINFMeSmA02S01TUN date, sort lcolor(purple) lwidth(medium) lpattern(solid)) /// 19 Tunisia
> (line DayINFMeSmA02S01ARE date, sort lcolor(purple) lwidth(medium) lpattern(dash)) /// 20 United Arab Emirates
> (line DayINFMeSmA02S01YEM date, sort lcolor(purple) lwidth(medium) lpattern(dot)) /// 21 Yemen
> (line DayINFMeSmA02S01EMR date, sort lcolor(black) lwidth(medthick) lpattern(solid)) /// 22 EMRO
> (line DayINFMeSmA02S01IRN date, sort lcolor(cyan) lwidth(thick) lpattern(solid)) /// 23 Iran
> if date >= td(01jan2022) & date <= td(01oct2022) ///
> , xtitle(Date) xlabel(#10, format(%tdYY-NN-DD) labsize(small)) xlabel(, grid) xlabel(, grid) ///
> xlabel(, angle(forty_five)) ylabel(, format(%9.0fc) labsize(small)) ylabel(, labsize(small) angle(horizontal)) ///
> ytitle(Daily reported infections) title("COVID-19 daily reported infections, EMRO countries, IHME, 2022", size(medium)) ///
> xscale(lwidth(vthin) lcolor(gray*.2)) yscale(lwidth(vthin) lcolor(gray*.2)) legend(region(lcolor(none))) legend(bexpand) ///
> legend(order(23 "Iran" 22 "EMR" 1 "AFG" 2 "BHR" 3 "DJI" 4 "EGY" 5 "IRQ" 6 "JOR" 7 "KWT" ///
> 8 "LBN" 9 "LBY" 10 "MAR" 11 "OMN" 12 "PAK" 13 "PSE" 14 "QAT" 15 "SAU" 16 "SOM" 17 "SDN" ///
> 18 "SYR" 19 "TUN" 20 "ARE" 21 "YEM") size(small) row(3)) ///
> subtitle("Smoothed", size(small))
{res}{txt}
{com}. 
. graph export "graph 1111 COVID-19 daily infections, EMRO countries, IHME, 2022 on.pdf", replace
{txt}(file /Users/farshadpourmalek/Downloads/covir2-main/20220701/code/merge/graph 1111 COVID-19 daily infections, EMRO countries, IHME, 2022 on.pdf written in PDF format)

{com}. 
. 
. 
. 
. 
. 
. ****************************
. 
. * daily infections, IHME, 2022 on, EMRO countries, Forecast only = June on
. 
. twoway ///
> (line DayINFFOREA02S01AFG date, sort lcolor(brown) lwidth(medium) lpattern(solid)) /// 1 Afghanistan
> (line DayINFFOREA02S01BHR date, sort lcolor(brown) lwidth(medium) lpattern(dash)) /// 2 Bahrain
> (line DayINFFOREA02S01DJI date, sort lcolor(brown) lwidth(medium) lpattern(dot)) /// 3 Djibouti 
> (line DayINFFOREA02S01EGY date, sort lcolor(blue) lwidth(medium) lpattern(solid)) /// 4 Egypt
> (line DayINFFOREA02S01IRQ date, sort lcolor(blue) lwidth(medium) lpattern(dash)) /// 5 Iraq
> (line DayINFFOREA02S01JOR date, sort lcolor(blue) lwidth(medium) lpattern(dot)) /// 6 Jordan
> (line DayINFFOREA02S01KWT date, sort lcolor(green) lwidth(medium) lpattern(solid)) /// 7 Kuwait
> (line DayINFFOREA02S01LBN date, sort lcolor(green) lwidth(medium) lpattern(dash)) /// 8 Lebanon
> (line DayINFFOREA02S01LBY date, sort lcolor(green) lwidth(medium) lpattern(dot)) /// 9 Libya
> (line DayINFFOREA02S01MAR date, sort lcolor(gold) lwidth(medium) lpattern(solid)) /// 10 Morocco
> (line DayINFFOREA02S01OMN date, sort lcolor(gold) lwidth(medium) lpattern(dash)) /// 11 Oman
> (line DayINFFOREA02S01PAK date, sort lcolor(gold) lwidth(medium) lpattern(dot)) /// 12 Pakistan
> (line DayINFFOREA02S01PSE date, sort lcolor(magenta) lwidth(medium) lpattern(solid)) /// 13 Palestine
> (line DayINFFOREA02S01QAT date, sort lcolor(magenta) lwidth(medium) lpattern(dash)) /// 14 Qatar
> (line DayINFFOREA02S01SAU date, sort lcolor(magenta) lwidth(medium) lpattern(dot)) /// 15 Saudi Arabia
> (line DayINFFOREA02S01SOM date, sort lcolor(orange) lwidth(medium) lpattern(solid)) /// 16 Somalia
> (line DayINFFOREA02S01SDN date, sort lcolor(orange) lwidth(medium) lpattern(dash)) /// 17 Sudan
> (line DayINFFOREA02S01SYR date, sort lcolor(orange) lwidth(medium) lpattern(dot)) /// 18 Syria
> (line DayINFFOREA02S01TUN date, sort lcolor(purple) lwidth(medium) lpattern(solid)) /// 19 Tunisia
> (line DayINFFOREA02S01ARE date, sort lcolor(purple) lwidth(medium) lpattern(dash)) /// 20 United Arab Emirates
> (line DayINFFOREA02S01YEM date, sort lcolor(purple) lwidth(medium) lpattern(dot)) /// 21 Yemen
> (line DayINFFOREA02S01EMR date, sort lcolor(black) lwidth(medthick) lpattern(solid)) /// 22 EMRO
> (line DayINFFOREA02S01IRN date, sort lcolor(cyan) lwidth(thick) lpattern(solid)) /// 23 Iran
> if date >= td(01jun2022) & date <= td(01oct2022) ///
> , xtitle(Date) xlabel(#5, format(%tdYY-NN-DD) labsize(small)) xlabel(, grid) xlabel(, grid) ///
> xlabel(, angle(forty_five)) ylabel(, format(%9.0fc) labsize(small)) ylabel(, labsize(small) angle(horizontal)) ///
> ytitle(Daily reported infections) title("COVID-19 daily reported infections, EMRO countries, IHME, 2022", size(medium)) ///
> xscale(lwidth(vthin) lcolor(gray*.2)) yscale(lwidth(vthin) lcolor(gray*.2)) legend(region(lcolor(none))) legend(bexpand) ///
> legend(order(23 "Iran" 22 "EMR" 1 "AFG" 2 "BHR" 3 "DJI" 4 "EGY" 5 "IRQ" 6 "JOR" 7 "KWT" ///
> 8 "LBN" 9 "LBY" 10 "MAR" 11 "OMN" 12 "PAK" 13 "PSE" 14 "QAT" 15 "SAU" 16 "SOM" 17 "SDN" ///
> 18 "SYR" 19 "TUN" 20 "ARE" 21 "YEM") size(small) row(3)) ///
> subtitle("Forecast only. Smoothed", size(small))
{res}{txt}
{com}. 
. graph export "graph 1111 b COVID-19 daily infections, EMRO countries, IHME, 2022 on.pdf", replace
{txt}(file /Users/farshadpourmalek/Downloads/covir2-main/20220701/code/merge/graph 1111 b COVID-19 daily infections, EMRO countries, IHME, 2022 on.pdf written in PDF format)

{com}. 
. 
. 
. 
. 
. 
. 
. 
. ****************************
. 
. * daily infections, IHME, 2022 on, EMRO countries, Forecast only = 03jun2022 on
. 
. * Without extremes: EMR total and Morocco.
. 
. twoway ///
> (line DayINFFOREA02S01AFG date, sort lcolor(brown) lwidth(medium) lpattern(solid)) /// 1 Afghanistan
> (line DayINFFOREA02S01BHR date, sort lcolor(brown) lwidth(medium) lpattern(dash)) /// 2 Bahrain
> (line DayINFFOREA02S01DJI date, sort lcolor(brown) lwidth(medium) lpattern(dot)) /// 3 Djibouti 
> (line DayINFFOREA02S01EGY date, sort lcolor(blue) lwidth(medium) lpattern(solid)) /// 4 Egypt
> (line DayINFFOREA02S01IRQ date, sort lcolor(blue) lwidth(medium) lpattern(dash)) /// 5 Iraq
> (line DayINFFOREA02S01JOR date, sort lcolor(blue) lwidth(medium) lpattern(dot)) /// 6 Jordan
> (line DayINFFOREA02S01KWT date, sort lcolor(green) lwidth(medium) lpattern(solid)) /// 7 Kuwait
> (line DayINFFOREA02S01LBN date, sort lcolor(green) lwidth(medium) lpattern(dash)) /// 8 Lebanon
> (line DayINFFOREA02S01LBY date, sort lcolor(green) lwidth(medium) lpattern(dot)) /// 9 Libya
> (line DayINFFOREA02S01OMN date, sort lcolor(gold) lwidth(medium) lpattern(dash)) /// 10 Oman
> (line DayINFFOREA02S01PAK date, sort lcolor(gold) lwidth(medium) lpattern(dot)) /// 11 Pakistan
> (line DayINFFOREA02S01PSE date, sort lcolor(magenta) lwidth(medium) lpattern(solid)) /// 12 Palestine
> (line DayINFFOREA02S01QAT date, sort lcolor(magenta) lwidth(medium) lpattern(dash)) /// 13 Qatar
> (line DayINFFOREA02S01SAU date, sort lcolor(magenta) lwidth(medium) lpattern(dot)) /// 14 Saudi Arabia
> (line DayINFFOREA02S01SOM date, sort lcolor(orange) lwidth(medium) lpattern(solid)) /// 15 Somalia
> (line DayINFFOREA02S01SDN date, sort lcolor(orange) lwidth(medium) lpattern(dash)) /// 16 Sudan
> (line DayINFFOREA02S01SYR date, sort lcolor(orange) lwidth(medium) lpattern(dot)) /// 17 Syria
> (line DayINFFOREA02S01TUN date, sort lcolor(purple) lwidth(medium) lpattern(solid)) /// 18 Tunisia
> (line DayINFFOREA02S01ARE date, sort lcolor(purple) lwidth(medium) lpattern(dash)) /// 19 United Arab Emirates
> (line DayINFFOREA02S01YEM date, sort lcolor(purple) lwidth(medium) lpattern(dot)) /// 20 Yemen
> (line DayINFFOREA02S01IRN date, sort lcolor(cyan) lwidth(thick) lpattern(solid)) /// 21 Iran
> if date >= td(03jun2022) & date <= td(01oct2022) ///
> , xtitle(Date) xlabel(#5, format(%tdYY-NN-DD) labsize(small)) xlabel(, grid) xlabel(, grid) ///
> xlabel(, angle(forty_five)) ylabel(, format(%9.0fc) labsize(small)) ylabel(, labsize(small) angle(horizontal)) ///
> ytitle(Daily reported infections) title("COVID-19 daily reported infections, EMRO countries, IHME, 2022", size(medium)) ///
> xscale(lwidth(vthin) lcolor(gray*.2)) yscale(lwidth(vthin) lcolor(gray*.2)) legend(region(lcolor(none))) legend(bexpand) ///
> legend(order(21 "Iran" 1 "AFG" 2 "BHR" 3 "DJI" 4 "EGY" 5 "IRQ" 6 "JOR" 7 "KWT" ///
> 8 "LBN" 9 "LBY" 10 "OMN" 11 "PAK" 12 "PSE" 13 "QAT" 14 "SAU" 15 "SOM" 16 "SDN" ///
> 17 "SYR" 18 "TUN" 19 "ARE" 20 "YEM") size(small) row(3)) ///
> subtitle("Without extremes: EMR total and Morocco. Forecast only. Smoothed", size(small))
{res}{txt}
{com}. 
. graph export "graph 1111 c COVID-19 daily infections, EMRO countries, IHME, 2022 on.pdf", replace
{txt}(file /Users/farshadpourmalek/Downloads/covir2-main/20220701/code/merge/graph 1111 c COVID-19 daily infections, EMRO countries, IHME, 2022 on.pdf written in PDF format)

{com}. 
. 
. 
. 
. 
. 
. 
. 
. 
. ****************************
. 
. * daily infections, IHME, 2022 on, EMRO countries, Forecast only = 03jun2022 on
. 
. * Without extremes: EMR total, Morocco, Pakistan, Sudan, Afghanistan, United Arab Emirates, 
. * Somalia, Saudi Arabia. 
. 
. twoway ///
> (line DayINFFOREA02S01BHR date, sort lcolor(brown) lwidth(medium) lpattern(dash)) /// 1 Bahrain
> (line DayINFFOREA02S01DJI date, sort lcolor(brown) lwidth(medium) lpattern(dot)) /// 2 Djibouti 
> (line DayINFFOREA02S01EGY date, sort lcolor(blue) lwidth(medium) lpattern(solid)) /// 3 Egypt
> (line DayINFFOREA02S01IRQ date, sort lcolor(blue) lwidth(medium) lpattern(dash)) /// 4 Iraq
> (line DayINFFOREA02S01JOR date, sort lcolor(blue) lwidth(medium) lpattern(dot)) /// 5 Jordan
> (line DayINFFOREA02S01KWT date, sort lcolor(green) lwidth(medium) lpattern(solid)) /// 6 Kuwait
> (line DayINFFOREA02S01LBN date, sort lcolor(green) lwidth(medium) lpattern(dash)) /// 7 Lebanon
> (line DayINFFOREA02S01LBY date, sort lcolor(green) lwidth(medium) lpattern(dot)) /// 8 Libya
> (line DayINFFOREA02S01OMN date, sort lcolor(gold) lwidth(medium) lpattern(dash)) /// 9 Oman
> (line DayINFFOREA02S01PSE date, sort lcolor(magenta) lwidth(medium) lpattern(solid)) /// 10 Palestine
> (line DayINFFOREA02S01QAT date, sort lcolor(magenta) lwidth(medium) lpattern(dash)) /// 11 Qatar
> (line DayINFFOREA02S01SYR date, sort lcolor(orange) lwidth(medium) lpattern(dot)) /// 12 Syria
> (line DayINFFOREA02S01TUN date, sort lcolor(purple) lwidth(medium) lpattern(solid)) /// 13 Tunisia
> (line DayINFFOREA02S01YEM date, sort lcolor(purple) lwidth(medium) lpattern(dot)) /// 14 Yemen
> (line DayINFFOREA02S01IRN date, sort lcolor(cyan) lwidth(thick) lpattern(solid)) /// 15 Iran
> if date >= td(03jun2022) & date <= td(01oct2022) ///
> , xtitle(Date) xlabel(#5, format(%tdYY-NN-DD) labsize(small)) xlabel(, grid) xlabel(, grid) ///
> xlabel(, angle(forty_five)) ylabel(, format(%9.0fc) labsize(small)) ylabel(, labsize(small) angle(horizontal)) ///
> ytitle(Daily reported infections) title("COVID-19 daily reported infections, EMRO countries, IHME, 2022", size(medium)) ///
> xscale(lwidth(vthin) lcolor(gray*.2)) yscale(lwidth(vthin) lcolor(gray*.2)) legend(region(lcolor(none))) legend(bexpand) ///
> legend(order(15 "Iran" 1 "BHR" 2 "DJI" 3 "EGY" 4 "IRQ" 5 "JOR" 6 "KWT" ///
> 7 "LBN" 8 "LBY" 9 "OMN" 10 "PSE" 11 "QAT" ///
> 12 "SYR" 13 "TUN" 14 "YEM") size(small) row(3))  ///
> subtitle("Without extremes: EMR total, MAR, PAK, SDN, AFG, ARE, SOM, SAU." ///
> "Forecast only. Smoothed", size(small))
{res}{txt}
{com}. 
. graph export "graph 1111 d COVID-19 daily infections, EMRO countries, IHME, 2022 on.pdf", replace
{txt}(file /Users/farshadpourmalek/Downloads/covir2-main/20220701/code/merge/graph 1111 d COVID-19 daily infections, EMRO countries, IHME, 2022 on.pdf written in PDF format)

{com}. 
. 
. 
. 
. 
. 
. 
. 
. 
. 
. 
. 
. ************
. 
. * restore native scheme (of the local machine)
. 
. set scheme $nativescheme
{txt}
{com}. 
. di c(scheme)
{res}s2color
{txt}
{com}. 
. 
. view "log country merge.smcl"
{txt}
{com}. 
. log close
      {txt}name:  {res}<unnamed>
       {txt}log:  {res}/Users/farshadpourmalek/Downloads/covir2-main/20220701/code/merge/log country merge.smcl
  {txt}log type:  {res}smcl
 {txt}closed on:  {res} 1 Jul 2022, 06:49:04
{txt}{.-}
{smcl}
{txt}{sf}{ul off}