{smcl}
{com}{sf}{ul off}{txt}{.-}
      name:  {res}<unnamed>
       {txt}log:  {res}/Users/farshadpourmalek/Downloads/covir2-main/20220708/code/SRIV/log country SRIV 3.smcl
  {txt}log type:  {res}smcl
 {txt}opened on:  {res} 8 Jul 2022, 16:54:45
{txt}
{com}. 
. ***************************************************************************
. * This is "do country SRIV 3.do"
. 
. * Project: CovidVisualized country - countries without subnational estimates                                                                       
. * Person: Farshad Pourmalek
. ***************************************************************************
. 
. 
. 
. di "SRIVdate = " "$SRIVdate"
{res}SRIVdate = 2022-07-08
{txt}
{com}. 
. * latest update used in this uptake
. * input data files: csv files on web site
. * output data files: "country SRIV.dta"
. 
. 
. **********************************************************
. **********************************************************
. 
. * Get SRIV estimates for $country
. 
. copy https://raw.githubusercontent.com/scc-usc/ReCOVER-COVID-19/master/results/historical_forecasts/$SRIVdate/global_forecasts_deaths.csv global_forecasts_deaths.csv
{txt}
{com}. copy https://raw.githubusercontent.com/scc-usc/ReCOVER-COVID-19/master/results/historical_forecasts/$SRIVdate/global_forecasts_deaths_lb.csv global_forecasts_deaths_lb.csv
{txt}
{com}. copy https://raw.githubusercontent.com/scc-usc/ReCOVER-COVID-19/master/results/historical_forecasts/$SRIVdate/global_forecasts_deaths_ub.csv global_forecasts_deaths_ub.csv
{txt}
{com}. copy https://raw.githubusercontent.com/scc-usc/ReCOVER-COVID-19/master/results/historical_forecasts/$SRIVdate/global_forecasts_cases.csv global_forecasts_cases.csv
{txt}
{com}. copy https://raw.githubusercontent.com/scc-usc/ReCOVER-COVID-19/master/results/historical_forecasts/$SRIVdate/global_forecasts_cases_lb.csv global_forecasts_cases_lb.csv
{txt}
{com}. copy https://raw.githubusercontent.com/scc-usc/ReCOVER-COVID-19/master/results/historical_forecasts/$SRIVdate/global_forecasts_cases_ub.csv global_forecasts_cases_ub.csv
{txt}
{com}. 
. 
. 
. local list ///
> global_forecasts_deaths global_forecasts_deaths_lb global_forecasts_deaths_ub ///
> global_forecasts_cases global_forecasts_cases_lb global_forecasts_cases_ub
{txt}
{com}. 
. foreach l of local list {c -(}
{txt}  2{com}.         import delimited "`l'.csv", clear varnames(1)
{txt}  3{com}.         keep if regexm(country,"$country") == 1
{txt}  4{com}.         drop id country
{txt}  5{com}.         
.         qui destring *, replace
{txt}  6{com}.         
.         gen i = _n
{txt}  7{com}.         reshape long v, i(i) j(j)
{txt}  8{com}.         rename v `l'
{txt}  9{com}.         rename j date
{txt} 10{com}.         drop i
{txt} 11{com}. 
.         save "`l'.dta", replace 
{txt} 12{com}. {c )-}
{res}{text}(103 vars, 184 obs)
(183 observations deleted)
(note: j = 3 4 5 6 7 8 9 10 11 12 13 14 15 16 17 18 19 20 21 22 23 24 25 26 27 28 29 30 31 32 33 34 35 36 37 38 39 40 41 42 43 44 45 46 47 48 49 50 51 52 53 54 55 56 57 58 59 60 61 62 63 64 65 66 67 68 69 70 71 72 73 74 75 76 77 78 79 80 81 82 83 84 85 86 87 88 89 90 91 92 93 94 95 96 97 98 99 100 101 102 103)

Data{col 36}wide{col 43}->{col 48}long
{hline 77}
Number of obs.                 {res}       1   {txt}->{res}     101
{txt}Number of variables            {res}     102   {txt}->{res}       3
{txt}j variable (101 values)                   ->   {res}j
{txt}xij variables:
                         {res}v3 v4 ... v103   {txt}->   {res}v
{txt}{hline 77}
{res}{txt}(note: file global_forecasts_deaths.dta not found)
file global_forecasts_deaths.dta saved
{res}{text}(103 vars, 184 obs)
(183 observations deleted)
(note: j = 3 4 5 6 7 8 9 10 11 12 13 14 15 16 17 18 19 20 21 22 23 24 25 26 27 28 29 30 31 32 33 34 35 36 37 38 39 40 41 42 43 44 45 46 47 48 49 50 51 52 53 54 55 56 57 58 59 60 61 62 63 64 65 66 67 68 69 70 71 72 73 74 75 76 77 78 79 80 81 82 83 84 85 86 87 88 89 90 91 92 93 94 95 96 97 98 99 100 101 102 103)

Data{col 36}wide{col 43}->{col 48}long
{hline 77}
Number of obs.                 {res}       1   {txt}->{res}     101
{txt}Number of variables            {res}     102   {txt}->{res}       3
{txt}j variable (101 values)                   ->   {res}j
{txt}xij variables:
                         {res}v3 v4 ... v103   {txt}->   {res}v
{txt}{hline 77}
{res}{txt}(note: file global_forecasts_deaths_lb.dta not found)
file global_forecasts_deaths_lb.dta saved
{res}{text}(103 vars, 184 obs)
(183 observations deleted)
(note: j = 3 4 5 6 7 8 9 10 11 12 13 14 15 16 17 18 19 20 21 22 23 24 25 26 27 28 29 30 31 32 33 34 35 36 37 38 39 40 41 42 43 44 45 46 47 48 49 50 51 52 53 54 55 56 57 58 59 60 61 62 63 64 65 66 67 68 69 70 71 72 73 74 75 76 77 78 79 80 81 82 83 84 85 86 87 88 89 90 91 92 93 94 95 96 97 98 99 100 101 102 103)

Data{col 36}wide{col 43}->{col 48}long
{hline 77}
Number of obs.                 {res}       1   {txt}->{res}     101
{txt}Number of variables            {res}     102   {txt}->{res}       3
{txt}j variable (101 values)                   ->   {res}j
{txt}xij variables:
                         {res}v3 v4 ... v103   {txt}->   {res}v
{txt}{hline 77}
{res}{txt}(note: file global_forecasts_deaths_ub.dta not found)
file global_forecasts_deaths_ub.dta saved
{res}{text}(103 vars, 184 obs)
(183 observations deleted)
(note: j = 3 4 5 6 7 8 9 10 11 12 13 14 15 16 17 18 19 20 21 22 23 24 25 26 27 28 29 30 31 32 33 34 35 36 37 38 39 40 41 42 43 44 45 46 47 48 49 50 51 52 53 54 55 56 57 58 59 60 61 62 63 64 65 66 67 68 69 70 71 72 73 74 75 76 77 78 79 80 81 82 83 84 85 86 87 88 89 90 91 92 93 94 95 96 97 98 99 100 101 102 103)

Data{col 36}wide{col 43}->{col 48}long
{hline 77}
Number of obs.                 {res}       1   {txt}->{res}     101
{txt}Number of variables            {res}     102   {txt}->{res}       3
{txt}j variable (101 values)                   ->   {res}j
{txt}xij variables:
                         {res}v3 v4 ... v103   {txt}->   {res}v
{txt}{hline 77}
{res}{txt}(note: file global_forecasts_cases.dta not found)
file global_forecasts_cases.dta saved
{res}{text}(103 vars, 184 obs)
(183 observations deleted)
(note: j = 3 4 5 6 7 8 9 10 11 12 13 14 15 16 17 18 19 20 21 22 23 24 25 26 27 28 29 30 31 32 33 34 35 36 37 38 39 40 41 42 43 44 45 46 47 48 49 50 51 52 53 54 55 56 57 58 59 60 61 62 63 64 65 66 67 68 69 70 71 72 73 74 75 76 77 78 79 80 81 82 83 84 85 86 87 88 89 90 91 92 93 94 95 96 97 98 99 100 101 102 103)

Data{col 36}wide{col 43}->{col 48}long
{hline 77}
Number of obs.                 {res}       1   {txt}->{res}     101
{txt}Number of variables            {res}     102   {txt}->{res}       3
{txt}j variable (101 values)                   ->   {res}j
{txt}xij variables:
                         {res}v3 v4 ... v103   {txt}->   {res}v
{txt}{hline 77}
{res}{txt}(note: file global_forecasts_cases_lb.dta not found)
file global_forecasts_cases_lb.dta saved
{res}{text}(103 vars, 184 obs)
(183 observations deleted)
(note: j = 3 4 5 6 7 8 9 10 11 12 13 14 15 16 17 18 19 20 21 22 23 24 25 26 27 28 29 30 31 32 33 34 35 36 37 38 39 40 41 42 43 44 45 46 47 48 49 50 51 52 53 54 55 56 57 58 59 60 61 62 63 64 65 66 67 68 69 70 71 72 73 74 75 76 77 78 79 80 81 82 83 84 85 86 87 88 89 90 91 92 93 94 95 96 97 98 99 100 101 102 103)

Data{col 36}wide{col 43}->{col 48}long
{hline 77}
Number of obs.                 {res}       1   {txt}->{res}     101
{txt}Number of variables            {res}     102   {txt}->{res}       3
{txt}j variable (101 values)                   ->   {res}j
{txt}xij variables:
                         {res}v3 v4 ... v103   {txt}->   {res}v
{txt}{hline 77}
{res}{txt}(note: file global_forecasts_cases_ub.dta not found)
file global_forecasts_cases_ub.dta saved

{com}. *
. 
. foreach l of local list {c -(}
{txt}  2{com}.         merge 1:1 date using "`l'.dta"
{txt}  3{com}.         drop _merge
{txt}  4{com}. {c )-}
{res}
{txt}{col 5}Result{col 38}# of obs.
{col 5}{hline 41}
{col 5}not matched{col 30}{res}               0
{txt}{col 5}matched{col 30}{res}             101{txt}  (_merge==3)
{col 5}{hline 41}
{res}
{txt}{col 5}Result{col 38}# of obs.
{col 5}{hline 41}
{col 5}not matched{col 30}{res}               0
{txt}{col 5}matched{col 30}{res}             101{txt}  (_merge==3)
{col 5}{hline 41}
{res}
{txt}{col 5}Result{col 38}# of obs.
{col 5}{hline 41}
{col 5}not matched{col 30}{res}               0
{txt}{col 5}matched{col 30}{res}             101{txt}  (_merge==3)
{col 5}{hline 41}
{res}
{txt}{col 5}Result{col 38}# of obs.
{col 5}{hline 41}
{col 5}not matched{col 30}{res}               0
{txt}{col 5}matched{col 30}{res}             101{txt}  (_merge==3)
{col 5}{hline 41}
{res}
{txt}{col 5}Result{col 38}# of obs.
{col 5}{hline 41}
{col 5}not matched{col 30}{res}               0
{txt}{col 5}matched{col 30}{res}             101{txt}  (_merge==3)
{col 5}{hline 41}
{res}
{txt}{col 5}Result{col 38}# of obs.
{col 5}{hline 41}
{col 5}not matched{col 30}{res}               0
{txt}{col 5}matched{col 30}{res}             101{txt}  (_merge==3)
{col 5}{hline 41}

{com}. *
. 
. rename global_forecasts_deaths_lb TotDeaLoRaA05S00      
{res}{txt}
{com}. rename global_forecasts_deaths_ub TotDeaUpRaA05S00      
{res}{txt}
{com}. rename global_forecasts_deaths    TotDeaMeRaA05S00
{res}{txt}
{com}. rename global_forecasts_cases_lb  TotCasLoRaA05S00
{res}{txt}
{com}. rename global_forecasts_cases_ub  TotCasUpRaA05S00      
{res}{txt}
{com}. rename global_forecasts_cases     TotCasMeRaA05S00
{res}{txt}
{com}. 
. label var TotDeaMeRaA05S00 "Total Deaths Mean SRIV"
{txt}
{com}. label var TotDeaLoRaA05S00 "Total Deaths Lower SRIV"
{txt}
{com}. label var TotDeaUpRaA05S00 "Total Deaths Upper SRIV"
{txt}
{com}. label var TotCasMeRaA05S00 "Total Cases Mean SRIV"
{txt}
{com}. label var TotCasLoRaA05S00 "Total Cases Lower SRIV"
{txt}
{com}. label var TotCasUpRaA05S00 "Total Cases Upper SRIV"
{txt}
{com}. 
. 
. * first date in csv files is one day before the update date
. 
. rename date date_original
{res}{txt}
{com}. gen date = .
{txt}(101 missing values generated)

{com}. replace date = td($SRIVepoch) in 1
{txt}(1 real change made)

{com}. replace date = date[_n-1] + 1 in 2/l
{txt}(100 real changes made)

{com}. format date %tdDDMonCCYY
{txt}
{com}. codebook date

{txt}{hline}
{res}date{right:(unlabeled)}
{txt}{hline}

{col 19}type:  numeric daily date ({res}float{txt})

{col 18}range:  [{res}22832{txt},{res}22932{txt}]{col 55}units:  {res}1
{col 8}{txt}or equivalently:  [{res}06jul2022{txt},{res}14oct2022{txt}]{col 55}units:  {res}days
{col 10}{txt}unique values:  {res}101{col 51}{txt}missing .:  {res}0{txt}/{res}101

{txt}{col 19}mean:{res}{col 26}   22882{txt} = {res}25aug2022{txt}
{col 15}std. dev:{res}{col 26} 29.3002

{txt}{col 12}percentiles:{col 32}10%{col 42}25%{col 52}50%{col 62}75%{col 72}90%
{res}{col 27}   22842{col 37}   22857{col 47}   22882{col 57}   22907{col 67}   22922
{col 26}16jul2022{col 36}31jul2022{col 46}25aug2022{col 56}19sep2022{col 66}04oct2022
{txt}
{com}. drop date_original
{txt}
{com}. 
. sort date
{txt}
{com}. 
. local list ///
> DeaMeRaA05S00 DeaLoRaA05S00 DeaUpRaA05S00 ///
> CasMeRaA05S00 CasLoRaA05S00 CasUpRaA05S00 
{txt}
{com}. 
. foreach l of local list {c -(}
{txt}  2{com}.         gen Day`l' =  Tot`l'[_n] - Tot`l'[_n-1]
{txt}  3{com}. {c )-}
{txt}(1 missing value generated)
(1 missing value generated)
(1 missing value generated)
(1 missing value generated)
(1 missing value generated)
(1 missing value generated)

{com}. *
. 
. 
. label var DayDeaMeRaA05S00 "Daily Deaths Mean SRIV"
{txt}
{com}. label var DayDeaLoRaA05S00 "Daily Deaths Lower SRIV"
{txt}
{com}. label var DayDeaUpRaA05S00 "Daily Deaths Upper SRIV"
{txt}
{com}. label var DayCasMeRaA05S00 "Daily Cases Mean SRIV"
{txt}
{com}. label var DayCasLoRaA05S00 "Daily Cases Lower SRIV"
{txt}
{com}. label var DayCasUpRaA05S00 "Daily Cases Upper SRIV"
{txt}
{com}. 
. gen loc_grand_name = "$country"
{txt}
{com}. 
. 
. order date loc_grand_name
{txt}
{com}. 
. * gen cfr 
. 
. gen DayCfrMeRaA05S00 = 100 * DayDeaMeRaA05S00 / DayCasMeRaA05S00
{txt}(1 missing value generated)

{com}. gen DayCfrLoRaA05S00 = 100 * DayDeaLoRaA05S00 / DayCasLoRaA05S00
{txt}(1 missing value generated)

{com}. gen DayCfrUpRaA05S00 = 100 * DayDeaUpRaA05S00 / DayCasUpRaA05S00
{txt}(1 missing value generated)

{com}. 
. label var DayCfrMeRaA05S00 "Daily CFR Mean SRIV"
{txt}
{com}. label var DayCfrLoRaA05S00 "Daily CFR Lower SRIV"
{txt}
{com}. label var DayCfrUpRaA05S00 "Daily CFR Upper SRIV"
{txt}
{com}. 
. 
. 
. 
. 
. * gen "Daily cases mean div by daily deaths mean SRIV  DayCbD" for visulization of temporal relation of deaths and cases peaks 
. 
. 
. summ DayDeaMeRaA05S00 

{txt}    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayDeaMeR~00 {c |}{res}        100      301.46    458.6227          4       1813
{txt}
{com}. gen DayDeMMeRaA05S00   = r(mean)
{txt}
{com}. label var DayDeMMeRaA05S00   "Daily deaths mean SRIV  DayDeM"
{txt}
{com}. 
. summ DayCasMeRaA05S00   

{txt}    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayCasMeR~00 {c |}{res}        100    58590.86    79302.55        837     270020
{txt}
{com}. gen DayCaMMeRaA05S00   = r(mean)
{txt}
{com}. label var DayCaMMeRaA05S00   "Daily cases mean SRIV  DayCaM"
{txt}
{com}.                            
. gen DayCbDMeRaA05S00   = DayCaMMeRaA05S00   / DayDeMMeRaA05S00  
{txt}
{com}. label var DayCbDMeRaA05S00   "Daily cases mean div by daily deaths mean SRIV  DayCbD"
{txt}
{com}. summ DayCbDMeRaA05S00  

{txt}    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayCbDMeR~00 {c |}{res}        101     194.357           0    194.357    194.357
{txt}
{com}.                                               
. gen DayDMuMeRaA05S00   = DayDeaMeRaA05S00   * DayCbDMeRaA05S00  
{txt}(1 missing value generated)

{com}. label var DayDMuMeRaA05S00   "Daily deaths scaled (times means of cases by deaths) SRIV "
{txt}
{com}. summ DayDMuMeRaA05S00  

{txt}    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayDMuMeR~00 {c |}{res}        100    58590.86    89136.54    777.428   352369.2
{txt}
{com}.         
.         
.         
.         
. 
. ******************
.         
. * smooth 
. 
. tsset date, daily   
{res}{txt}{col 9}time variable:  {res}{col 25}date, 06Jul2022 to 14Oct2022
{txt}{col 17}delta:  {res}1 day
{txt}
{com}. 
. 
. tssmooth ma DayDeaMeRaA05S00_window = DayDeaMeRaA05S00 if DayDeaMeRaA05S00 >= 0, window(3 1 3) 
{txt}The smoother applied was
{res}{p 5 5 5}(1/7)*[x(t-3) + x(t-2) + x(t-1) + 1*x(t) + x(t+1) + x(t+2) + x(t+3)]; x(t)= DayDeaMeRaA05S00 {p_end}
{txt}
{com}. 
. tssmooth ma DayDeaMeSmA05S00 = DayDeaMeRaA05S00_window, weights( 1 2 3 <4> 3 2 1) replace
{txt}The smoother applied was
{res}{p 5 5 5}(1/16)*[1*x(t-3) + 2*x(t-2) + 3*x(t-1) + 4*x(t) + 3*x(t+1) + 2*x(t+2) + ...; x(t)= DayDeaMeRaA05S00_window
{txt}
{smcl}
{com}. 
. label var DayDeaMeSmA05S00 "Daily deaths smooth A05 SRIV"
{txt}
{com}. 
. drop DayDeaMeRaA05S00_window
{txt}
{com}. 
. 
. tssmooth ma DayCasMeRaA05S00_window = DayCasMeRaA05S00 if DayCasMeRaA05S00 >= 0, window(3 1 3)
{txt}The smoother applied was
{res}{p 5 5 5}(1/7)*[x(t-3) + x(t-2) + x(t-1) + 1*x(t) + x(t+1) + x(t+2) + x(t+3)]; x(t)= DayCasMeRaA05S00 {p_end}
{txt}
{com}. 
. tssmooth ma DayCasMeSmA05S00 = DayCasMeRaA05S00_window, weights( 1 2 3 <4> 3 2 1) replace
{txt}The smoother applied was
{res}{p 5 5 5}(1/16)*[1*x(t-3) + 2*x(t-2) + 3*x(t-1) + 4*x(t) + 3*x(t+1) + 2*x(t+2) + ...; x(t)= DayCasMeRaA05S00_window
{txt}
{smcl}
{com}. 
. label var DayCasMeSmA05S00 "Daily cases smooth A05 SRIV"
{txt}
{com}. 
. drop DayCasMeRaA05S00_window
{txt}
{com}. 
. 
.         
.         
.         
.         
. 
. * Forecast start date 
. 
. gen epoch_SRIV = td($SRIVepoch) // update release date
{txt}
{com}. label var epoch_SRIV "SRIV Forecast start date"
{txt}
{com}. 
. gen DayDeaFOREA05S00 = DayDeaMeSmA05S00
{txt}
{com}. replace DayDeaFOREA05S00 = . if date < td($SRIVepoch)
{txt}(0 real changes made)

{com}. label var DayDeaFOREA05S00 "Daily Forecasted Deaths Mean smoothed SRIV"
{txt}
{com}. 
. gen DayCasFOREA05S00 = DayCasMeSmA05S00
{txt}
{com}. replace DayCasFOREA05S00 = . if date < td($SRIVepoch)
{txt}(0 real changes made)

{com}. label var DayCasFOREA05S00 "Daily Forecasted Cases Mean smoothed SRIV"
{txt}
{com}. 
. qui compress
{txt}
{com}. 
. sort date loc_grand_name 
{txt}
{com}. 
. save "country SRIV.dta", replace
{txt}file country SRIV.dta saved

{com}.  
. 
. 
. 
. 
. 
. 
. 
. 
. 
. view "log country SRIV 3.smcl"
{txt}
{com}. 
. log close
      {txt}name:  {res}<unnamed>
       {txt}log:  {res}/Users/farshadpourmalek/Downloads/covir2-main/20220708/code/SRIV/log country SRIV 3.smcl
  {txt}log type:  {res}smcl
 {txt}closed on:  {res} 8 Jul 2022, 16:54:53
{txt}{.-}
{smcl}
{txt}{sf}{ul off}