{smcl}
{txt}{sf}{ul off}{.-}
      name:  {res}<unnamed>
       {txt}log:  {res}/Users/farshadpourmalek/Downloads/covir2-main/20210413/code/JOHNEMR/log EMR JOHN.smcl
  {txt}log type:  {res}smcl
 {txt}opened on:  {res}15 Apr 2021, 11:34:37
{txt}
{com}. 
. ***************************************************************************
. * This is "do EMR JOHN.do"
. 
. * Project: Rapid review of estimates of COVID Iran - No 2
. * Person: Farshad Pourmalek pourmalek_farshad@yahoo.com
. * Time (initial): 2021-02-10
. 
. * OBJECTIVE: Get and prepare Johns Hopkins data for EMR, compare timing of deaths and cases peaks
. ***************************************************************************
. 
. 
. 
. * get Johns Hopkins data for deaths
. 
. import delimited ///
> "https://raw.githubusercontent.com/CSSEGISandData/COVID-19/master/csse_covid_19_data/csse_covid_19_time_series/time_series_covid19_deaths_global.csv" ///
> , clear varnames(1) colrange(2:2)
{res}{text}(1 var, 274 obs)

{com}. 
. save "time_series_covid19_deaths_global col 2.dta", replace
{txt}(note: file time_series_covid19_deaths_global col 2.dta not found)
file time_series_covid19_deaths_global col 2.dta saved

{com}. 
. 
. import delimited ///
> "https://raw.githubusercontent.com/CSSEGISandData/COVID-19/master/csse_covid_19_data/csse_covid_19_time_series/time_series_covid19_deaths_global.csv" ///
> , clear varnames(1) colrange(5)
{res}{text}(449 vars, 274 obs)

{com}. 
. 
. save "time_series_covid19_deaths_global col 5 on.dta", replace
{txt}(note: file time_series_covid19_deaths_global col 5 on.dta not found)
file time_series_covid19_deaths_global col 5 on.dta saved

{com}. 
. 
. use "time_series_covid19_deaths_global col 2.dta", clear 
{txt}
{com}. 
. merge 1:1 _n using "time_series_covid19_deaths_global col 5 on.dta"
{res}
{txt}{col 5}Result{col 38}# of obs.
{col 5}{hline 41}
{col 5}not matched{col 30}{res}               0
{txt}{col 5}matched{col 30}{res}             274{txt}  (_merge==3)
{col 5}{hline 41}

{com}. 
. rename countryregion loc_grand_name
{res}{txt}
{com}. 
. qui destring *, replace
{txt}
{com}. 
. 
. 
. * gen global sum
. 
. save "global JOHN deaths wo sum.dta", replace
{txt}(note: file global JOHN deaths wo sum.dta not found)
file global JOHN deaths wo sum.dta saved

{com}. 
. drop loc_grand_name
{txt}
{com}. 
. qui destring *, replace
{txt}
{com}.  
. collapse (sum) *
{txt}
{com}. 
. gen loc_grand_name = "global"
{txt}
{com}.   
. save "global JOHN deaths sum.dta", replace
{txt}(note: file global JOHN deaths sum.dta not found)
file global JOHN deaths sum.dta saved

{com}. 
. *
. 
. 
. use "global JOHN deaths wo sum.dta", clear
{txt}
{com}. 
. 
. 
. keep if ///
> loc_grand_name == "Algeria" | ///
> loc_grand_name == "Bahrain" | ///
> loc_grand_name == "Djibouti" | ///
> loc_grand_name == "Egypt" | ///
> loc_grand_name == "Iran" | ///
> loc_grand_name == "Iraq" | ///
> loc_grand_name == "Israel" | ///
> loc_grand_name == "Jordan" | ///
> loc_grand_name == "Kuwait" | ///
> loc_grand_name == "Lebanon" | ///
> loc_grand_name == "Libya" | ///
> loc_grand_name == "Oman" | ///
> loc_grand_name == "Palestine" | ///
> loc_grand_name == "Qatar" | ///
> loc_grand_name == "Saudi Arabia" | ///
> loc_grand_name == "Syria" | ///
> loc_grand_name == "Tunisia" | ///
> loc_grand_name == "United Arab Emirates" | ///
> loc_grand_name == "Yemen" 
{txt}(256 observations deleted)

{com}. 
. 
. * gen EMR sum
. 
. save "EMR JOHN deaths wo sum.dta", replace
{txt}(note: file EMR JOHN deaths wo sum.dta not found)
file EMR JOHN deaths wo sum.dta saved

{com}. 
. drop loc_grand_name
{txt}
{com}. 
. qui destring *, replace
{txt}
{com}.  
. collapse (sum) *
{txt}
{com}. 
. gen loc_grand_name = "EMR"
{txt}
{com}.   
. save "EMR JOHN deaths sum.dta", replace
{txt}(note: file EMR JOHN deaths sum.dta not found)
file EMR JOHN deaths sum.dta saved

{com}. 
. 
. * 
. 
. use "EMR JOHN deaths wo sum.dta", clear 
{txt}
{com}. 
. qui append using "EMR JOHN deaths sum.dta"
{txt}
{com}. 
. qui append using "global JOHN deaths sum.dta"
{txt}
{com}. 
. 
. *
. 
. 
. order loc_grand_name, last
{txt}
{com}. 
. gen counter = _n
{txt}
{com}. 
. reshape long v, i(loc_grand_name) 
{txt}(note: j = 1 2 3 4 5 6 7 8 9 10 11 12 13 14 15 16 17 18 19 20 21 22 23 24 25 26 27 28 29 30 31 32 33 34 35 36 37 38 39 40 41 42 43 44 45 46 47 48 49 50 51 52 53 54 55 56 57 58 59 60 61 62 63 64 65 66 67 68 69 70 71 72 73 74 75 76 77 78 79 80 81 82 83 84 85 86 87 88 89 90 91 92 93 94 95 96 97 98 99 100 101 102 103 104 105 106 107 108 109 110 111 112 113 114 115 116 117 118 119 120 121 122 123 124 125 126 127 128 129 130 131 132 133 134 135 136 137 138 139 140 141 142 143 144 145 146 147 148 149 150 151 152 153 154 155 156 157 158 159 160 161 162 163 164 165 166 167 168 169 170 171 172 173 174 175 176 177 178 179 180 181 182 183 184 185 186 187 188 189 190 191 192 193 194 195 196 197 198 199 200 201 202 203 204 205 206 207 208 209 210 211 212 213 214 215 216 217 218 219 220 221 222 223 224 225 226 227 228 229 230 231 232 233 234 235 236 237 238 239 240 241 242 243 244 245 246 247 248 249 250 251 252 253 254 255 256 257 258 259 260 261 262 263 264 265 266 267 268 269 270 271 272 273 274 275 276 277 278 279 280 281 282 283 284 285 286 287 288 289 290 291 292 293 294 295 296 297 298 299 300 301 302 303 304 305 306 307 308 309 310 311 312 313 314 315 316 317 318 319 320 321 322 323 324 325 326 327 328 329 330 331 332 333 334 335 336 337 338 339 340 341 342 343 344 345 346 347 348 349 350 351 352 353 354 355 356 357 358 359 360 361 362 363 364 365 366 367 368 369 370 371 372 373 374 375 376 377 378 379 380 381 382 383 384 385 386 387 388 389 390 391 392 393 394 395 396 397 398 399 400 401 402 403 404 405 406 407 408 409 410 411 412 413 414 415 416 417 418 419 420 421 422 423 424 425 426 427 428 429 430 431 432 433 434 435 436 437 438 439 440 441 442 443 444 445 446 447 448 449)

Data{col 36}wide{col 43}->{col 48}long
{hline 77}
Number of obs.                 {res}      20   {txt}->{res}    8980
{txt}Number of variables            {res}     452   {txt}->{res}       5
{txt}j variable (449 values)                   ->   {res}_j
{txt}xij variables:
                         {res}v1 v2 ... v449   {txt}->   {res}v
{txt}{hline 77}

{com}. 
. drop counter 
{txt}
{com}. 
. codebook _j

{txt}{hline}
{res}_j{right:(unlabeled)}
{txt}{hline}

{col 19}type:  numeric ({res}int{txt})

{col 18}range:  [{res}1{txt},{res}449{txt}]{col 55}units:  {res}1
{col 10}{txt}unique values:  {res}449{col 51}{txt}missing .:  {res}0{txt}/{res}8,980

{txt}{col 19}mean:{res}{col 26}     225
{txt}{col 15}std. dev:{res}{col 26} 129.622

{txt}{col 12}percentiles:{col 32}10%{col 42}25%{col 52}50%{col 62}75%{col 72}90%
{res}{col 27}      45{col 37}     113{col 47}     225{col 57}     337{col 67}     405
{txt}
{com}. 
. gen date = date("22 Jan 2020", "DMY")
{txt}
{com}. 
. replace date = date + _j - 1
{txt}(8,960 real changes made)

{com}. 
. format date %td
{txt}
{com}. 
. codebook date

{txt}{hline}
{res}date{right:(unlabeled)}
{txt}{hline}

{col 19}type:  numeric daily date ({res}float{txt})

{col 18}range:  [{res}21936{txt},{res}22384{txt}]{col 55}units:  {res}1
{col 8}{txt}or equivalently:  [{res}22jan2020{txt},{res}14apr2021{txt}]{col 55}units:  {res}days
{col 10}{txt}unique values:  {res}449{col 51}{txt}missing .:  {res}0{txt}/{res}8,980

{txt}{col 19}mean:{res}{col 26}   22160{txt} = {res}02sep2020{txt}
{col 15}std. dev:{res}{col 26} 129.622

{txt}{col 12}percentiles:{col 32}10%{col 42}25%{col 52}50%{col 62}75%{col 72}90%
{res}{col 27}   21980{col 37}   22048{col 47}   22160{col 57}   22272{col 67}   22340
{col 26}06mar2020{col 36}13may2020{col 46}02sep2020{col 56}23dec2020{col 66}01mar2021
{txt}
{com}. 
. order date 
{txt}
{com}. 
. rename v TotDeaMeRaA00S00V00
{res}{txt}
{com}. 
. label var TotDeaMeRaA00S00V00 "Total Deaths JOHN"
{txt}
{com}. 
. destring TotDeaMeRaA00S00V00, replace
{txt}TotDeaMeRaA00S00V00 already numeric; no {res}replace
{txt}
{com}. 
. list loc_grand_name TotDeaMeRaA00S00V00 if date == td(19feb2020) // Iran should be 2
{txt}
      {c TLC}{hline 22}{c -}{hline 10}{c TRC}
      {c |} {res}      loc_grand_name   TotDe~00 {txt}{c |}
      {c LT}{hline 22}{c -}{hline 10}{c RT}
  29. {c |} {res}             Algeria          0 {txt}{c |}
 478. {c |} {res}             Bahrain          0 {txt}{c |}
 927. {c |} {res}            Djibouti          0 {txt}{c |}
1376. {c |} {res}                 EMR          2 {txt}{c |}
1825. {c |} {res}               Egypt          0 {txt}{c |}
      {c LT}{hline 22}{c -}{hline 10}{c RT}
2274. {c |} {res}                Iran          2 {txt}{c |}
2723. {c |} {res}                Iraq          0 {txt}{c |}
3172. {c |} {res}              Israel          0 {txt}{c |}
3621. {c |} {res}              Jordan          0 {txt}{c |}
4070. {c |} {res}              Kuwait          0 {txt}{c |}
      {c LT}{hline 22}{c -}{hline 10}{c RT}
4519. {c |} {res}             Lebanon          0 {txt}{c |}
4968. {c |} {res}               Libya          0 {txt}{c |}
5417. {c |} {res}                Oman          0 {txt}{c |}
5866. {c |} {res}               Qatar          0 {txt}{c |}
6315. {c |} {res}        Saudi Arabia          0 {txt}{c |}
      {c LT}{hline 22}{c -}{hline 10}{c RT}
6764. {c |} {res}               Syria          0 {txt}{c |}
7213. {c |} {res}             Tunisia          0 {txt}{c |}
7662. {c |} {res}United Arab Emirates          0 {txt}{c |}
8111. {c |} {res}               Yemen          0 {txt}{c |}
8560. {c |} {res}              global       2123 {txt}{c |}
      {c BLC}{hline 22}{c -}{hline 10}{c BRC}

{com}. 
. gen DayDeaMeRaA00S00V00 =  TotDeaMeRaA00S00V00[_n] - TotDeaMeRaA00S00V00[_n-1]
{txt}(1 missing value generated)

{com}. 
. label var DayDeaMeRaA00S00V00 "Daily Deaths JOHN"
{txt}
{com}. 
. replace DayDeaMeRaA00S00V00 = TotDeaMeRaA00S00V00 if _j == 1
{txt}(20 real changes made)

{com}. 
. drop _j _merge
{txt}
{com}. 
. 
. order date loc_grand_name DayDeaMeRaA00S00V00 TotDeaMeRaA00S00V00 
{txt}
{com}.                                         
. 
. sort loc_grand_name date
{txt}
{com}. 
. save "EMR JOHN deaths.dta", replace
{txt}(note: file EMR JOHN deaths.dta not found)
file EMR JOHN deaths.dta saved

{com}. 
. 
. 
. 
. * get Johns Hopkins data for cases
. 
. 
. import delimited using ///
> "https://raw.githubusercontent.com/CSSEGISandData/COVID-19/master/csse_covid_19_data/csse_covid_19_time_series/time_series_covid19_confirmed_global.csv" ///
> , clear varnames(1) colrange(2:2)
{res}{text}(1 var, 274 obs)

{com}. 
. save "time_series_covid19_confirmed_global col 2.dta", replace 
{txt}(note: file time_series_covid19_confirmed_global col 2.dta not found)
file time_series_covid19_confirmed_global col 2.dta saved

{com}. 
. 
. import delimited using ///
> "https://raw.githubusercontent.com/CSSEGISandData/COVID-19/master/csse_covid_19_data/csse_covid_19_time_series/time_series_covid19_confirmed_global.csv" ///
> , clear varnames(1) colrange(5)
{res}{text}(449 vars, 274 obs)

{com}. 
. save "time_series_covid19_confirmed_global col 5 on.dta", replace 
{txt}(note: file time_series_covid19_confirmed_global col 5 on.dta not found)
file time_series_covid19_confirmed_global col 5 on.dta saved

{com}. 
. 
. use "time_series_covid19_confirmed_global col 2.dta", clear 
{txt}
{com}. 
. merge 1:1 _n using "time_series_covid19_confirmed_global col 5 on.dta"
{res}
{txt}{col 5}Result{col 38}# of obs.
{col 5}{hline 41}
{col 5}not matched{col 30}{res}               0
{txt}{col 5}matched{col 30}{res}             274{txt}  (_merge==3)
{col 5}{hline 41}

{com}. 
. rename countryregion loc_grand_name
{res}{txt}
{com}. 
. qui destring *, replace
{txt}
{com}. 
. 
. 
. * gen global sum
. 
. save "global JOHN cases wo sum.dta", replace
{txt}(note: file global JOHN cases wo sum.dta not found)
file global JOHN cases wo sum.dta saved

{com}. 
. drop loc_grand_name
{txt}
{com}. 
. qui destring *, replace
{txt}
{com}.  
. collapse (sum) *
{txt}
{com}. 
. gen loc_grand_name = "global"
{txt}
{com}.   
. save "global JOHN cases sum.dta", replace
{txt}(note: file global JOHN cases sum.dta not found)
file global JOHN cases sum.dta saved

{com}. 
. *
. 
. 
. use "global JOHN cases wo sum.dta", clear
{txt}
{com}. 
. 
. 
. 
. keep if ///
> loc_grand_name == "Algeria" | ///
> loc_grand_name == "Bahrain" | ///
> loc_grand_name == "Djibouti" | ///
> loc_grand_name == "Egypt" | ///
> loc_grand_name == "Iran" | ///
> loc_grand_name == "Iraq" | ///
> loc_grand_name == "Israel" | ///
> loc_grand_name == "Jordan" | ///
> loc_grand_name == "Kuwait" | ///
> loc_grand_name == "Lebanon" | ///
> loc_grand_name == "Libya" | ///
> loc_grand_name == "Oman" | ///
> loc_grand_name == "Palestine" | ///
> loc_grand_name == "Qatar" | ///
> loc_grand_name == "Saudi Arabia" | ///
> loc_grand_name == "Syria" | ///
> loc_grand_name == "Tunisia" | ///
> loc_grand_name == "United Arab Emirates" | ///
> loc_grand_name == "Yemen" 
{txt}(256 observations deleted)

{com}. 
. 
. 
. * gen EMR sum
. 
. save "EMR JOHN cases wo sum.dta", replace
{txt}(note: file EMR JOHN cases wo sum.dta not found)
file EMR JOHN cases wo sum.dta saved

{com}. 
. drop loc_grand_name
{txt}
{com}. 
. qui destring *, replace
{txt}
{com}.  
. collapse (sum) *
{txt}
{com}. 
. gen loc_grand_name = "EMR"
{txt}
{com}.   
. save "EMR JOHN cases sum.dta", replace
{txt}(note: file EMR JOHN cases sum.dta not found)
file EMR JOHN cases sum.dta saved

{com}. 
. 
. * 
. 
. use "EMR JOHN cases wo sum.dta", clear 
{txt}
{com}. 
. qui append using "EMR JOHN cases sum.dta"
{txt}
{com}. 
. qui append using "global JOHN cases sum.dta"
{txt}
{com}. 
. 
. *
. 
. 
. 
. order loc_grand_name, last
{txt}
{com}. 
. gen counter = _n
{txt}
{com}. 
. reshape long v, i(loc_grand_name) 
{txt}(note: j = 1 2 3 4 5 6 7 8 9 10 11 12 13 14 15 16 17 18 19 20 21 22 23 24 25 26 27 28 29 30 31 32 33 34 35 36 37 38 39 40 41 42 43 44 45 46 47 48 49 50 51 52 53 54 55 56 57 58 59 60 61 62 63 64 65 66 67 68 69 70 71 72 73 74 75 76 77 78 79 80 81 82 83 84 85 86 87 88 89 90 91 92 93 94 95 96 97 98 99 100 101 102 103 104 105 106 107 108 109 110 111 112 113 114 115 116 117 118 119 120 121 122 123 124 125 126 127 128 129 130 131 132 133 134 135 136 137 138 139 140 141 142 143 144 145 146 147 148 149 150 151 152 153 154 155 156 157 158 159 160 161 162 163 164 165 166 167 168 169 170 171 172 173 174 175 176 177 178 179 180 181 182 183 184 185 186 187 188 189 190 191 192 193 194 195 196 197 198 199 200 201 202 203 204 205 206 207 208 209 210 211 212 213 214 215 216 217 218 219 220 221 222 223 224 225 226 227 228 229 230 231 232 233 234 235 236 237 238 239 240 241 242 243 244 245 246 247 248 249 250 251 252 253 254 255 256 257 258 259 260 261 262 263 264 265 266 267 268 269 270 271 272 273 274 275 276 277 278 279 280 281 282 283 284 285 286 287 288 289 290 291 292 293 294 295 296 297 298 299 300 301 302 303 304 305 306 307 308 309 310 311 312 313 314 315 316 317 318 319 320 321 322 323 324 325 326 327 328 329 330 331 332 333 334 335 336 337 338 339 340 341 342 343 344 345 346 347 348 349 350 351 352 353 354 355 356 357 358 359 360 361 362 363 364 365 366 367 368 369 370 371 372 373 374 375 376 377 378 379 380 381 382 383 384 385 386 387 388 389 390 391 392 393 394 395 396 397 398 399 400 401 402 403 404 405 406 407 408 409 410 411 412 413 414 415 416 417 418 419 420 421 422 423 424 425 426 427 428 429 430 431 432 433 434 435 436 437 438 439 440 441 442 443 444 445 446 447 448 449)

Data{col 36}wide{col 43}->{col 48}long
{hline 77}
Number of obs.                 {res}      20   {txt}->{res}    8980
{txt}Number of variables            {res}     452   {txt}->{res}       5
{txt}j variable (449 values)                   ->   {res}_j
{txt}xij variables:
                         {res}v1 v2 ... v449   {txt}->   {res}v
{txt}{hline 77}

{com}. 
. drop counter 
{txt}
{com}. 
. codebook _j

{txt}{hline}
{res}_j{right:(unlabeled)}
{txt}{hline}

{col 19}type:  numeric ({res}int{txt})

{col 18}range:  [{res}1{txt},{res}449{txt}]{col 55}units:  {res}1
{col 10}{txt}unique values:  {res}449{col 51}{txt}missing .:  {res}0{txt}/{res}8,980

{txt}{col 19}mean:{res}{col 26}     225
{txt}{col 15}std. dev:{res}{col 26} 129.622

{txt}{col 12}percentiles:{col 32}10%{col 42}25%{col 52}50%{col 62}75%{col 72}90%
{res}{col 27}      45{col 37}     113{col 47}     225{col 57}     337{col 67}     405
{txt}
{com}. 
. gen date = date("22 Jan 2020", "DMY")
{txt}
{com}. 
. replace date = date + _j - 1
{txt}(8,960 real changes made)

{com}. 
. format date %td
{txt}
{com}. 
. codebook date

{txt}{hline}
{res}date{right:(unlabeled)}
{txt}{hline}

{col 19}type:  numeric daily date ({res}float{txt})

{col 18}range:  [{res}21936{txt},{res}22384{txt}]{col 55}units:  {res}1
{col 8}{txt}or equivalently:  [{res}22jan2020{txt},{res}14apr2021{txt}]{col 55}units:  {res}days
{col 10}{txt}unique values:  {res}449{col 51}{txt}missing .:  {res}0{txt}/{res}8,980

{txt}{col 19}mean:{res}{col 26}   22160{txt} = {res}02sep2020{txt}
{col 15}std. dev:{res}{col 26} 129.622

{txt}{col 12}percentiles:{col 32}10%{col 42}25%{col 52}50%{col 62}75%{col 72}90%
{res}{col 27}   21980{col 37}   22048{col 47}   22160{col 57}   22272{col 67}   22340
{col 26}06mar2020{col 36}13may2020{col 46}02sep2020{col 56}23dec2020{col 66}01mar2021
{txt}
{com}. 
. order date 
{txt}
{com}. 
. rename v TotCasMeRaA00S00V00
{res}{txt}
{com}. 
. label var TotCasMeRaA00S00V00 "Total Cases JOHN"
{txt}
{com}. 
. gen DayCasMeRaA00S00V00 =  TotCasMeRaA00S00V00[_n] - TotCasMeRaA00S00V00[_n-1]
{txt}(1 missing value generated)

{com}. 
. label var DayCasMeRaA00S00V00 "Daily Cases JOHN"
{txt}
{com}. 
. replace DayCasMeRaA00S00V00 = TotCasMeRaA00S00V00 if _j == 1
{txt}(20 real changes made)

{com}. 
. drop _j _merge
{txt}
{com}. 
. 
. order date loc_grand_name DayCasMeRaA00S00V00 TotCasMeRaA00S00V00 
{txt}
{com}. 
. sort loc_grand_name date
{txt}
{com}. 
. compress
  {txt}variable {bf}date{sf} was {bf}{res}float{sf}{txt} now {bf}{res}int{sf}
  {txt}variable {bf}TotCasMeRaA00S00V00{sf} was {bf}{res}double{sf}{txt} now {bf}{res}long{sf}
  {txt}variable {bf}loc_grand_name{sf} was {bf}{res}str32{sf}{txt} now {bf}{res}str20{sf}
{txt}  (161,640 bytes saved)

{com}. 
. save "EMR JOHN Cases.dta", replace
{txt}(note: file EMR JOHN Cases.dta not found)
file EMR JOHN Cases.dta saved

{com}. 
. 
. * merge deaths and cases 
. 
. use "EMR JOHN deaths.dta", clear 
{txt}
{com}. 
. merge 1:1 loc_grand_name date using "EMR JOHN Cases.dta"
{res}
{txt}{col 5}Result{col 38}# of obs.
{col 5}{hline 41}
{col 5}not matched{col 30}{res}               0
{txt}{col 5}matched{col 30}{res}           8,980{txt}  (_merge==3)
{col 5}{hline 41}

{com}. 
. drop _merge
{txt}
{com}. 
. 
. 
. 
. 
. replace loc_grand_name = "Saudi_Arabia" if loc_grand_name == "Saudi Arabia"
{txt}(449 real changes made)

{com}. replace loc_grand_name = "UAE" if loc_grand_name == "United Arab Emirates"
{txt}(449 real changes made)

{com}. 
. replace loc_grand_name = "1_Global" if loc_grand_name == "global"
{txt}(449 real changes made)

{com}. replace loc_grand_name = "2_EMR" if loc_grand_name == "EMR"
{txt}(449 real changes made)

{com}. 
. 
. 
. 
. * gen "Daily cases mean div by daily deaths mean JOHN DayCbD" for visulization of temporal relation of deaths and cases peaks 
. 
. 
. levelsof loc_grand_name, local(levels)
{txt}`"1_Global"' `"2_EMR"' `"Algeria"' `"Bahrain"' `"Djibouti"' `"Egypt"' `"Iran"' `"Iraq"' `"Israel"' `"Jordan"' `"Kuwait"' `"Lebanon"' `"Libya"' `"Oman"' `"Qatar"' `"Saudi_Arabia"' `"Syria"' `"Tunisia"' `"UAE"' `"Yemen"'

{com}. 
. foreach l of local levels {c -(}
{txt}  2{com}. 
.         di "`l'"
{txt}  3{com}.     
.         di "DayDeaMeRaA00S00V00"
{txt}  4{com}.         summ DayDeaMeRaA00S00V00 if loc_grand_name == "`l'"
{txt}  5{com}.         gen DayDeMMeRaA00S00V00_`l' = r(mean)
{txt}  6{com}.         label var DayDeMMeRaA00S00V00_`l' "Daily deaths mean JOHN DayDeM"
{txt}  7{com}.         di "                            "
{txt}  8{com}. 
.         di "DayCasMeRaA00S00V00"
{txt}  9{com}.         summ DayCasMeRaA00S00V00 if loc_grand_name == "`l'"
{txt} 10{com}.         gen DayCaMMeRaA00S00V00_`l' = r(mean)
{txt} 11{com}.         label var DayCaMMeRaA00S00V00_`l' "Daily cases mean JOHN DayCaM"
{txt} 12{com}.         di "                            "
{txt} 13{com}. 
.         di "DayCbDMeRaA00S00V00_(location)"
{txt} 14{com}.         gen DayCbDMeRaA00S00V00_`l' = DayCaMMeRaA00S00V00_`l' / DayDeMMeRaA00S00V00_`l'
{txt} 15{com}.         label var DayCbDMeRaA00S00V00_`l' "Daily cases mean div by daily deaths mean JOHN DayCbD"
{txt} 16{com}.         summ DayCbDMeRaA00S00V00_`l' if loc_grand_name == "`l'"
{txt} 17{com}.         di "                            "
{txt} 18{com}. 
.         di "DayDea_multip_(location)"
{txt} 19{com}.         gen DayDea_multip_`l' = DayDeaMeRaA00S00V00 * DayCbDMeRaA00S00V00_`l' if loc_grand_name == "`l'"
{txt} 20{com}.     label var DayDea_multip_`l' "Daily deaths scaled (times means of cases by deaths) only for visualization JOHN"
{txt} 21{com}.         summ DayDea_multip_`l' if loc_grand_name == "`l'"
{txt} 22{com}.         di "                            "
{txt} 23{com}.         
.         di "divider---------------------"
{txt} 24{com}.         di "                            "
{txt} 25{com}. 
. {c )-}
1_Global
DayDeaMeRaA00S00V00

{txt}    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayDeaMeR~00 {c |}{res}        449    6620.528    4115.924          1      17904
                            
DayCasMeRaA00S00V00

{txt}    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayCasMeR~00 {c |}{res}        449    307928.4    234790.5         98    1498213
                            
DayCbDMeRaA00S00V00_(location)

{txt}    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayCbDMeRa~l {c |}{res}        449    46.51115           0   46.51115   46.51115
                            
DayDea_multip_(location)
{txt}(8,531 missing values generated)

    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayDea_mul~l {c |}{res}        449    307928.4    191436.4   46.51115   832735.6
                            
divider---------------------
                            
2_EMR
DayDeaMeRaA00S00V00

{txt}    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayDeaMeR~00 {c |}{res}        449    321.5078    190.9703          0        814
                            
DayCasMeRaA00S00V00

{txt}    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayCasMeR~00 {c |}{res}        449    16912.79    11510.59          0      51903
                            
DayCbDMeRaA00S00V00_(location)

{txt}    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayCbDMeRa~R {c |}{res}        449     52.6046           0    52.6046    52.6046
                            
DayDea_multip_(location)
{txt}(8,531 missing values generated)

    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayDea_mul~R {c |}{res}        449    16912.79    10045.91          0   42820.15
                            
divider---------------------
                            
Algeria
DayDeaMeRaA00S00V00

{txt}    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayDeaMeR~00 {c |}{res}        449    6.995546    5.211592          0         30
                            
DayCasMeRaA00S00V00

{txt}    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayCasMeR~00 {c |}{res}        449    264.9777    240.9691          0       1133
                            
DayCbDMeRaA00S00V00_(location)

{txt}    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayCbDMeRa~a {c |}{res}        449    37.87806           0   37.87806   37.87806
                            
DayDea_multip_(location)
{txt}(8,531 missing values generated)

    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayDea_mul~a {c |}{res}        449    264.9777     197.405          0   1136.342
                            
divider---------------------
                            
Bahrain
DayDeaMeRaA00S00V00

{txt}    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayDeaMeR~00 {c |}{res}        449    1.267261    1.539603          0          7
                            
DayCasMeRaA00S00V00

{txt}    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayCasMeR~00 {c |}{res}        449    356.2673    275.9114          0       1316
                            
DayCbDMeRaA00S00V00_(location)

{txt}    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayCbDMeRa~n {c |}{res}        449    281.1318           0   281.1318   281.1318
                            
DayDea_multip_(location)
{txt}(8,531 missing values generated)

    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayDea_mul~n {c |}{res}        449    356.2673    432.8313          0   1967.923
                            
divider---------------------
                            
Djibouti
DayDeaMeRaA00S00V00

{txt}    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayDeaMeR~00 {c |}{res}        449    .2360802    .8196465          0          9
                            
DayCasMeRaA00S00V00

{txt}    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayCasMeR~00 {c |}{res}        449     22.7216    51.71324          0        415
                            
DayCbDMeRaA00S00V00_(location)

{txt}    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayCbDMeRa~i {c |}{res}        449    96.24528           0   96.24528   96.24528
                            
DayDea_multip_(location)
{txt}(8,531 missing values generated)

    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayDea_mul~i {c |}{res}        449     22.7216     78.8871          0   866.2075
                            
divider---------------------
                            
Egypt
DayDeaMeRaA00S00V00

{txt}    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayDeaMeR~00 {c |}{res}        449    27.99555    23.20185          0         97
                            
DayCasMeRaA00S00V00

{txt}    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayCasMeR~00 {c |}{res}        449    474.3007    436.2889          0       1774
                            
DayCbDMeRaA00S00V00_(location)

{txt}    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayCbDMeRa~t {c |}{res}        449      16.942           0     16.942     16.942
                            
DayDea_multip_(location)
{txt}(8,531 missing values generated)

    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayDea_mul~t {c |}{res}        449    474.3006    393.0858          0   1643.374
                            
divider---------------------
                            
Iran
DayDeaMeRaA00S00V00

{txt}    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayDeaMeR~00 {c |}{res}        449    145.5657    113.9911          0        486
                            
DayCasMeRaA00S00V00

{txt}    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayCasMeR~00 {c |}{res}        449    4774.597    4330.057          0      25582
                            
DayCbDMeRaA00S00V00_(location)

{txt}    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayCbDMeR~an {c |}{res}        449    32.80029           0   32.80029   32.80029
                            
DayDea_multip_(location)
{txt}(8,531 missing values generated)

    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayDea_mu~an {c |}{res}        449    4774.597    3738.939          0   15940.94
                            
divider---------------------
                            
Iraq
DayDeaMeRaA00S00V00

{txt}    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayDeaMeR~00 {c |}{res}        449    33.04232    31.96874          0        122
                            
DayCasMeRaA00S00V00

{txt}    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayCasMeR~00 {c |}{res}        449    2113.697    1922.929          0       8331
                            
DayCbDMeRaA00S00V00_(location)

{txt}    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayCbDMeRa~q {c |}{res}        449    63.96939           0   63.96939   63.96939
                            
DayDea_multip_(location)
{txt}(8,531 missing values generated)

    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayDea_mul~q {c |}{res}        449    2113.697    2045.021          0   7804.266
                            
divider---------------------
                            
Israel
DayDeaMeRaA00S00V00

{txt}    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayDeaMeR~00 {c |}{res}        449    14.05791    16.00575         -4        101
                            
DayCasMeRaA00S00V00

{txt}    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayCasMeR~00 {c |}{res}        449    1863.229     2348.15        -28      11934
                            
DayCbDMeRaA00S00V00_(location)

{txt}    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayCbDMeR~el {c |}{res}        449    132.5396           0   132.5396   132.5396
                            
DayDea_multip_(location)
{txt}(8,531 missing values generated)

    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayDea_mu~el {c |}{res}        449    1863.229    2121.396  -530.1584    13386.5
                            
divider---------------------
                            
Jordan
DayDeaMeRaA00S00V00

{txt}    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayDeaMeR~00 {c |}{res}        449    17.78842    27.20889          0        111
                            
DayCasMeRaA00S00V00

{txt}    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayCasMeR~00 {c |}{res}        449    1505.958    2259.487       -110       9535
                            
DayCbDMeRaA00S00V00_(location)

{txt}    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayCbDMe~dan {c |}{res}        449    84.65945           0   84.65945   84.65945
                            
DayDea_multip_(location)
{txt}(8,531 missing values generated)

    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayDea_m~dan {c |}{res}        449    1505.958    2303.489          0   9397.198
                            
divider---------------------
                            
Kuwait
DayDeaMeRaA00S00V00

{txt}    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayDeaMeR~00 {c |}{res}        449    3.169265    2.976521          0         14
                            
DayCasMeRaA00S00V00

{txt}    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayCasMeR~00 {c |}{res}        449    560.5234     400.836          0       1716
                            
DayCbDMeRaA00S00V00_(location)

{txt}    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayCbDMeR~it {c |}{res}        449    176.8623           0   176.8623   176.8623
                            
DayDea_multip_(location)
{txt}(8,531 missing values generated)

    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayDea_mu~it {c |}{res}        449    560.5234    526.4343          0   2476.072
                            
divider---------------------
                            
Lebanon
DayDeaMeRaA00S00V00

{txt}    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayDeaMeR~00 {c |}{res}        449    15.09577    26.31161          0        351
                            
DayCasMeRaA00S00V00

{txt}    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayCasMeR~00 {c |}{res}        449    1118.706    1329.023          0       6154
                            
DayCbDMeRaA00S00V00_(location)

{txt}    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayCbDMeR~on {c |}{res}        449    74.10726           0   74.10726   74.10726
                            
DayDea_multip_(location)
{txt}(8,531 missing values generated)

    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayDea_mu~on {c |}{res}        449    1118.706    1949.882          0   26011.65
                            
divider---------------------
                            
Libya
DayDeaMeRaA00S00V00

{txt}    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayDeaMeR~00 {c |}{res}        449    6.311804    8.475588         -3         53
                            
DayCasMeRaA00S00V00

{txt}    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayCasMeR~00 {c |}{res}        449    378.7194    397.2043          0       1639
                            
DayCbDMeRaA00S00V00_(location)

{txt}    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayCbDMeR~ya {c |}{res}        449    60.00177           0   60.00177   60.00177
                            
DayDea_multip_(location)
{txt}(8,531 missing values generated)

    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayDea_mu~ya {c |}{res}        449    378.7194    508.5503  -180.0053   3180.094
                            
divider---------------------
                            
Oman
DayDeaMeRaA00S00V00

{txt}    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayDeaMeR~00 {c |}{res}        449    4.024499    6.751113          0         67
                            
DayCasMeRaA00S00V00

{txt}    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayCasMeR~00 {c |}{res}        449    391.1648    519.8952          0       3544
                            
DayCbDMeRaA00S00V00_(location)

{txt}    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayCbDMe~man {c |}{res}        449    97.19591           0   97.19591   97.19591
                            
DayDea_multip_(location)
{txt}(8,531 missing values generated)

    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayDea_m~man {c |}{res}        449    391.1648    656.1805          0   6512.126
                            
divider---------------------
                            
Qatar
DayDeaMeRaA00S00V00

{txt}    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayDeaMeR~00 {c |}{res}        449    .7750557    1.295839          0          8
                            
DayCasMeRaA00S00V00

{txt}    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayCasMeR~00 {c |}{res}        449    429.7617    447.6331          0       2355
                            
DayCbDMeRaA00S00V00_(location)

{txt}    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayCbDMeRa~r {c |}{res}        449    554.4913           0   554.4913   554.4913
                            
DayDea_multip_(location)
{txt}(8,531 missing values generated)

    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayDea_mul~r {c |}{res}        449    429.7617    718.5313          0   4435.931
                            
divider---------------------
                            
Saudi_Arabia
DayDeaMeRaA00S00V00

{txt}    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayDeaMeR~00 {c |}{res}        449    15.10245    13.98112          0         58
                            
DayCasMeRaA00S00V00

{txt}    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayCasMeR~00 {c |}{res}        449    893.4454    1084.613          0       4919
                            
DayCbDMeRaA00S00V00_(location)

{txt}    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayCbDMe~bia {c |}{res}        449    59.15897           0   59.15897   59.15897
                            
DayDea_multip_(location)
{txt}(8,531 missing values generated)

    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayDea_m~bia {c |}{res}        449    893.4454    827.1085          0    3431.22
                            
divider---------------------
                            
Syria
DayDeaMeRaA00S00V00

{txt}    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayDeaMeR~00 {c |}{res}        449    3.122494    3.563287          0         20
                            
DayCasMeRaA00S00V00

{txt}    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayCasMeR~00 {c |}{res}        449    45.77951    44.13446          0        172
                            
DayCbDMeRaA00S00V00_(location)

{txt}    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayCbDM~yria {c |}{res}        449     14.6612           0    14.6612    14.6612
                            
DayDea_multip_(location)
{txt}(8,531 missing values generated)

    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayDea_~yria {c |}{res}        449    45.77951    52.24206          0    293.224
                            
divider---------------------
                            
Tunisia
DayDeaMeRaA00S00V00

{txt}    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayDeaMeR~00 {c |}{res}        449    21.11359    30.94073          0        217
                            
DayCasMeRaA00S00V00

{txt}    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayCasMeR~00 {c |}{res}        449    616.3185    879.4892          0       5752
                            
DayCbDMeRaA00S00V00_(location)

{txt}    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayCbDMe~sia {c |}{res}        449    29.19061           0   29.19061   29.19061
                            
DayDea_multip_(location)
{txt}(8,531 missing values generated)

    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayDea_m~sia {c |}{res}        449    616.3185    903.1787          0   6334.363
                            
divider---------------------
                            
UAE
DayDeaMeRaA00S00V00

{txt}    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayDeaMeR~00 {c |}{res}        449    3.432071    4.044998          0         20
                            
DayCasMeRaA00S00V00

{txt}    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayCasMeR~00 {c |}{res}        449    1090.189    1029.204          0       3977
                            
DayCbDMeRaA00S00V00_(location)

{txt}    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayCbDMeRa~E {c |}{res}        449    317.6476           0   317.6476   317.6476
                            
DayDea_multip_(location)
{txt}(8,531 missing values generated)

    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayDea_mul~E {c |}{res}        449    1090.189    1284.884          0   6352.953
                            
divider---------------------
                            
Yemen
DayDeaMeRaA00S00V00

{txt}    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayDeaMeR~00 {c |}{res}        449    2.412027    5.216897          0         52
                            
DayCasMeRaA00S00V00

{txt}    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayCasMeR~00 {c |}{res}        449    12.43207    25.34284         -1        174
                            
DayCbDMeRaA00S00V00_(location)

{txt}    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayCbDMeR~en {c |}{res}        449    5.154202           0   5.154202   5.154202
                            
DayDea_multip_(location)
{txt}(8,531 missing values generated)

    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayDea_mu~en {c |}{res}        449    12.43207    26.88894          0   268.0185
                            
divider---------------------
                            
{txt}
{com}. *
. 
. 
. * gen CFR
. 
. gen DayCfrMeRaA00S00V00 = 100 * DayDeaMeRaA00S00V00 / DayCasMeRaA00S00V00
{txt}(1,329 missing values generated)

{com}. 
. label var DayCfrMeRaA00S00V00 "Daily CFR JOHN"
{txt}
{com}. 
. di in red "negative CFR values:"
{res}{err}negative CFR values:
{txt}
{com}. 
. list date loc_grand_name DayDeaMeRaA00S00V00 DayCasMeRaA00S00V00 DayCfrMeRaA00S00V00 if DayCfrMeRaA00S00V00 < 0
{txt}
      {c TLC}{hline 11}{c -}{hline 10}{c -}{hline 10}{c -}{hline 10}{c -}{hline 11}{c TRC}
      {c |} {res}     date   loc_gr~e   DayDe~00   DayCa~00   DayCfr~00 {txt}{c |}
      {c LT}{hline 11}{c -}{hline 10}{c -}{hline 10}{c -}{hline 10}{c -}{hline 11}{c RT}
3577. {c |} {res}30mar2021     Israel         -4        514   -.7782101 {txt}{c |}
5130. {c |} {res}30jul2020      Libya         -3        216   -1.388889 {txt}{c |}
8285. {c |} {res}11aug2020      Yemen          5         -1        -500 {txt}{c |}
      {c BLC}{hline 11}{c -}{hline 10}{c -}{hline 10}{c -}{hline 10}{c -}{hline 11}{c BRC}

{com}. 
. 
. * describe CFR
. 
. levelsof loc_grand_name, local(levels)
{txt}`"1_Global"' `"2_EMR"' `"Algeria"' `"Bahrain"' `"Djibouti"' `"Egypt"' `"Iran"' `"Iraq"' `"Israel"' `"Jordan"' `"Kuwait"' `"Lebanon"' `"Libya"' `"Oman"' `"Qatar"' `"Saudi_Arabia"' `"Syria"' `"Tunisia"' `"UAE"' `"Yemen"'

{com}. 
. foreach l of local levels {c -(}
{txt}  2{com}. 
.         di "`l'"
{txt}  3{com}. 
.         tabstat DayCfrMeRaA00S00V00 if loc_grand_name == "`l'" & DayCfrMeRaA00S00V00 >= 0, stat(p25 p50 p75 iqr mean min max) varwidth(32)
{txt}  4{com}. 
.         di "divider---------------------"
{txt}  5{com}.         di "                            "
{txt}  6{com}. 
. {c )-}
1_Global

{txt}{ralign 32:variable} {...}
{c |}       p25       p50       p75       iqr      mean       min       max
{hline 33}{c +}{hline 70}
{ralign 32:DayCfrMeRaA00S00V00} {...}
{c |}{...}
 {res}  1.78076  2.225127  3.361832  1.581072  3.118965  .3395586  28.36879
{txt}{hline 33}{c BT}{hline 70}
divider---------------------
                            
2_EMR

{ralign 32:variable} {...}
{c |}       p25       p50       p75       iqr      mean       min       max
{hline 33}{c +}{hline 70}
{ralign 32:DayCfrMeRaA00S00V00} {...}
{c |}{...}
 {res} 1.331602  2.172978  2.854616  1.523013  2.731234         0       100
{txt}{hline 33}{c BT}{hline 70}
divider---------------------
                            
Algeria

{ralign 32:variable} {...}
{c |}       p25       p50       p75       iqr      mean       min       max
{hline 33}{c +}{hline 70}
{ralign 32:DayCfrMeRaA00S00V00} {...}
{c |}{...}
 {res} 1.863354  2.380952  3.797468  1.934114  4.177619         0  66.66666
{txt}{hline 33}{c BT}{hline 70}
divider---------------------
                            
Bahrain

{ralign 32:variable} {...}
{c |}       p25       p50       p75       iqr      mean       min       max
{hline 33}{c +}{hline 70}
{ralign 32:DayCfrMeRaA00S00V00} {...}
{c |}{...}
 {res}        0  .2244694  .5089058  .5089058  .3428267         0  6.666667
{txt}{hline 33}{c BT}{hline 70}
divider---------------------
                            
Djibouti

{ralign 32:variable} {...}
{c |}       p25       p50       p75       iqr      mean       min       max
{hline 33}{c +}{hline 70}
{ralign 32:DayCfrMeRaA00S00V00} {...}
{c |}{...}
 {res}        0         0         0         0   1.77676         0       100
{txt}{hline 33}{c BT}{hline 70}
divider---------------------
                            
Egypt

{ralign 32:variable} {...}
{c |}       p25       p50       p75       iqr      mean       min       max
{hline 33}{c +}{hline 70}
{ralign 32:DayCfrMeRaA00S00V00} {...}
{c |}{...}
 {res} 4.526749  6.362719  8.688524  4.161775  7.037592         0  22.22222
{txt}{hline 33}{c BT}{hline 70}
divider---------------------
                            
Iran

{ralign 32:variable} {...}
{c |}       p25       p50       p75       iqr      mean       min       max
{hline 33}{c +}{hline 70}
{ralign 32:DayCfrMeRaA00S00V00} {...}
{c |}{...}
 {res} 1.680672  4.486929  6.183057  4.502385  4.632341         0       100
{txt}{hline 33}{c BT}{hline 70}
divider---------------------
                            
Iraq

{ralign 32:variable} {...}
{c |}       p25       p50       p75       iqr      mean       min       max
{hline 33}{c +}{hline 70}
{ralign 32:DayCfrMeRaA00S00V00} {...}
{c |}{...}
 {res} .7936508  1.646546   2.68886   1.89521  2.487817         0  66.66666
{txt}{hline 33}{c BT}{hline 70}
divider---------------------
                            
Israel

{ralign 32:variable} {...}
{c |}       p25       p50       p75       iqr      mean       min       max
{hline 33}{c +}{hline 70}
{ralign 32:DayCfrMeRaA00S00V00} {...}
{c |}{...}
 {res} .4250255  .7374983  1.538462  1.113436  1.726312         0        60
{txt}{hline 33}{c BT}{hline 70}
divider---------------------
                            
Jordan

{ralign 32:variable} {...}
{c |}       p25       p50       p75       iqr      mean       min       max
{hline 33}{c +}{hline 70}
{ralign 32:DayCfrMeRaA00S00V00} {...}
{c |}{...}
 {res}        0  .6758823  1.326969  1.326969  1.229024         0       100
{txt}{hline 33}{c BT}{hline 70}
divider---------------------
                            
Kuwait

{ralign 32:variable} {...}
{c |}       p25       p50       p75       iqr      mean       min       max
{hline 33}{c +}{hline 70}
{ralign 32:DayCfrMeRaA00S00V00} {...}
{c |}{...}
 {res} .2369668  .4885994   .729927  .4929602  .5413897         0  2.608696
{txt}{hline 33}{c BT}{hline 70}
divider---------------------
                            
Lebanon

{ralign 32:variable} {...}
{c |}       p25       p50       p75       iqr      mean       min       max
{hline 33}{c +}{hline 70}
{ralign 32:DayCfrMeRaA00S00V00} {...}
{c |}{...}
 {res}        0  .7892711  1.625001  1.625001  1.601555         0        25
{txt}{hline 33}{c BT}{hline 70}
divider---------------------
                            
Libya

{ralign 32:variable} {...}
{c |}       p25       p50       p75       iqr      mean       min       max
{hline 33}{c +}{hline 70}
{ralign 32:DayCfrMeRaA00S00V00} {...}
{c |}{...}
 {res} .6957933  1.340898   2.20389  1.508096  2.382591         0       100
{txt}{hline 33}{c BT}{hline 70}
divider---------------------
                            
Oman

{ralign 32:variable} {...}
{c |}       p25       p50       p75       iqr      mean       min       max
{hline 33}{c +}{hline 70}
{ralign 32:DayCfrMeRaA00S00V00} {...}
{c |}{...}
 {res} .1976285  .7042254  1.626016  1.428388  1.161772         0  11.42857
{txt}{hline 33}{c BT}{hline 70}
divider---------------------
                            
Qatar

{ralign 32:variable} {...}
{c |}       p25       p50       p75       iqr      mean       min       max
{hline 33}{c +}{hline 70}
{ralign 32:DayCfrMeRaA00S00V00} {...}
{c |}{...}
 {res}        0         0  .2911208  .2911208  .2306492         0  16.66667
{txt}{hline 33}{c BT}{hline 70}
divider---------------------
                            
Saudi_Arabia

{ralign 32:variable} {...}
{c |}       p25       p50       p75       iqr      mean       min       max
{hline 33}{c +}{hline 70}
{ralign 32:DayCfrMeRaA00S00V00} {...}
{c |}{...}
 {res} 1.046268  1.592357  4.273504  3.227236  2.666852         0   10.6383
{txt}{hline 33}{c BT}{hline 70}
divider---------------------
                            
Syria

{ralign 32:variable} {...}
{c |}       p25       p50       p75       iqr      mean       min       max
{hline 33}{c +}{hline 70}
{ralign 32:DayCfrMeRaA00S00V00} {...}
{c |}{...}
 {res} 4.651163  6.382979         8  3.348837  7.289828         0       100
{txt}{hline 33}{c BT}{hline 70}
divider---------------------
                            
Tunisia

{ralign 32:variable} {...}
{c |}       p25       p50       p75       iqr      mean       min       max
{hline 33}{c +}{hline 70}
{ralign 32:DayCfrMeRaA00S00V00} {...}
{c |}{...}
 {res}        0   2.48184  4.387568  4.387568  3.948041         0       100
{txt}{hline 33}{c BT}{hline 70}
divider---------------------
                            
UAE

{ralign 32:variable} {...}
{c |}       p25       p50       p75       iqr      mean       min       max
{hline 33}{c +}{hline 70}
{ralign 32:DayCfrMeRaA00S00V00} {...}
{c |}{...}
 {res} .1520912  .2577319  .4255319  .2734407  .3542865         0  4.878049
{txt}{hline 33}{c BT}{hline 70}
divider---------------------
                            
Yemen

{ralign 32:variable} {...}
{c |}       p25       p50       p75       iqr      mean       min       max
{hline 33}{c +}{hline 70}
{ralign 32:DayCfrMeRaA00S00V00} {...}
{c |}{...}
 {res}        0  12.90323  28.57143  28.57143  24.63613         0       400
{txt}{hline 33}{c BT}{hline 70}
divider---------------------
                            

{com}. *
. 
. 
. 
. * gen Cases to deaths ratio (CTD)
. 
. gen DayCTDMeRaA00S00V00 =  DayCasMeRaA00S00V00 / DayDeaMeRaA00S00V00
{txt}(2,833 missing values generated)

{com}. label var DayCTDMeRaA00S00V00  "Daily Cases to Deaths S0 JOHN"
{txt}
{com}.         
. gen TotCTDMeRaA00S00V00 =  TotCasMeRaA00S00V00 / TotDeaMeRaA00S00V00
{txt}(1,120 missing values generated)

{com}. label var TotCTDMeRaA00S00V00  "Total Cases to Deaths S0 JOHN"
{txt}
{com}. 
. 
. 
. 
. * describe Cases to deaths ratio (CTD)
. 
. levelsof loc_grand_name, local(levels)
{txt}`"1_Global"' `"2_EMR"' `"Algeria"' `"Bahrain"' `"Djibouti"' `"Egypt"' `"Iran"' `"Iraq"' `"Israel"' `"Jordan"' `"Kuwait"' `"Lebanon"' `"Libya"' `"Oman"' `"Qatar"' `"Saudi_Arabia"' `"Syria"' `"Tunisia"' `"UAE"' `"Yemen"'

{com}. 
. foreach l of local levels {c -(}
{txt}  2{com}. 
.         di "`l'"
{txt}  3{com}. 
.         tabstat DayCTDMeRaA00S00V00 if loc_grand_name == "`l'", stat(p25 p50 p75 iqr mean min max) varwidth(32)
{txt}  4{com}.         
.         tabstat TotCTDMeRaA00S00V00 if loc_grand_name == "`l'", stat(p25 p50 p75 iqr mean min max) varwidth(32)
{txt}  5{com}.         
. 
.         di "divider---------------------"
{txt}  6{com}.         di "                            "
{txt}  7{com}. 
. {c )-}
1_Global

{txt}{ralign 32:variable} {...}
{c |}       p25       p50       p75       iqr      mean       min       max
{hline 33}{c +}{hline 70}
{ralign 32:DayCTDMeRaA00S00V00} {...}
{c |}{...}
 {res} 29.74569  44.94125   56.1558  26.41011  44.36387     3.525     294.5
{txt}{hline 33}{c BT}{hline 70}

{ralign 32:variable} {...}
{c |}       p25       p50       p75       iqr      mean       min       max
{hline 33}{c +}{hline 70}
{ralign 32:TotCTDMeRaA00S00V00} {...}
{c |}{...}
 {res} 23.02615  33.66626  45.09405   22.0679  33.04155  13.80262  49.01241
{txt}{hline 33}{c BT}{hline 70}
divider---------------------
                            
2_EMR

{ralign 32:variable} {...}
{c |}       p25       p50       p75       iqr      mean       min       max
{hline 33}{c +}{hline 70}
{ralign 32:DayCTDMeRaA00S00V00} {...}
{c |}{...}
 {res} 34.86127  45.60642   73.4755  38.61423  52.07895         1  107.1461
{txt}{hline 33}{c BT}{hline 70}

{ralign 32:variable} {...}
{c |}       p25       p50       p75       iqr      mean       min       max
{hline 33}{c +}{hline 70}
{ralign 32:TotCTDMeRaA00S00V00} {...}
{c |}{...}
 {res} 37.53918  39.96605  42.75557  5.216389  37.65396         6   52.6046
{txt}{hline 33}{c BT}{hline 70}
divider---------------------
                            
Algeria

{ralign 32:variable} {...}
{c |}       p25       p50       p75       iqr      mean       min       max
{hline 33}{c +}{hline 70}
{ralign 32:DayCTDMeRaA00S00V00} {...}
{c |}{...}
 {res} 25.16667  40.58928  52.41667     27.25  40.52472       1.5     137.5
{txt}{hline 33}{c BT}{hline 70}

{ralign 32:variable} {...}
{c |}       p25       p50       p75       iqr      mean       min       max
{hline 33}{c +}{hline 70}
{ralign 32:TotCTDMeRaA00S00V00} {...}
{c |}{...}
 {res} 14.60345  29.56448  36.25917  21.65572   26.5001  6.335463  37.99706
{txt}{hline 33}{c BT}{hline 70}
divider---------------------
                            
Bahrain

{ralign 32:variable} {...}
{c |}       p25       p50       p75       iqr      mean       min       max
{hline 33}{c +}{hline 70}
{ralign 32:DayCTDMeRaA00S00V00} {...}
{c |}{...}
 {res}      160       230     365.5     205.5  279.2894         0      1143
{txt}{hline 33}{c BT}{hline 70}

{ralign 32:variable} {...}
{c |}       p25       p50       p75       iqr      mean       min       max
{hline 33}{c +}{hline 70}
{ralign 32:TotCTDMeRaA00S00V00} {...}
{c |}{...}
 {res} 260.1254  274.4761  289.2713  29.14597  304.9198    104.75  701.1667
{txt}{hline 33}{c BT}{hline 70}
divider---------------------
                            
Djibouti

{ralign 32:variable} {...}
{c |}       p25       p50       p75       iqr      mean       min       max
{hline 33}{c +}{hline 70}
{ralign 32:DayCTDMeRaA00S00V00} {...}
{c |}{...}
 {res}       14        41        89        75  66.16239         1       251
{txt}{hline 33}{c BT}{hline 70}

{ralign 32:variable} {...}
{c |}       p25       p50       p75       iqr      mean       min       max
{hline 33}{c +}{hline 70}
{ralign 32:TotCTDMeRaA00S00V00} {...}
{c |}{...}
 {res} 89.71667  94.40333  102.7872  13.07056  130.6215  85.52728       560
{txt}{hline 33}{c BT}{hline 70}
divider---------------------
                            
Egypt

{ralign 32:variable} {...}
{c |}       p25       p50       p75       iqr      mean       min       max
{hline 33}{c +}{hline 70}
{ralign 32:DayCTDMeRaA00S00V00} {...}
{c |}{...}
 {res} 11.37736  15.47368   21.2973  9.919938  17.43799         0  71.18182
{txt}{hline 33}{c BT}{hline 70}

{ralign 32:variable} {...}
{c |}       p25       p50       p75       iqr      mean       min       max
{hline 33}{c +}{hline 70}
{ralign 32:TotCTDMeRaA00S00V00} {...}
{c |}{...}
 {res}  17.1555  17.66742  19.18925  2.033751  19.57472  12.98742        75
{txt}{hline 33}{c BT}{hline 70}
divider---------------------
                            
Iran

{ralign 32:variable} {...}
{c |}       p25       p50       p75       iqr      mean       min       max
{hline 33}{c +}{hline 70}
{ralign 32:DayCTDMeRaA00S00V00} {...}
{c |}{...}
 {res} 16.16858  22.20823  58.96569   42.7971   39.6978         1  152.6038
{txt}{hline 33}{c BT}{hline 70}

{ralign 32:variable} {...}
{c |}       p25       p50       p75       iqr      mean       min       max
{hline 33}{c +}{hline 70}
{ralign 32:TotCTDMeRaA00S00V00} {...}
{c |}{...}
 {res} 17.40279  19.06971  22.82421  5.421417  20.34599         1  40.15862
{txt}{hline 33}{c BT}{hline 70}
divider---------------------
                            
Iraq

{ralign 32:variable} {...}
{c |}       p25       p50       p75       iqr      mean       min       max
{hline 33}{c +}{hline 70}
{ralign 32:DayCTDMeRaA00S00V00} {...}
{c |}{...}
 {res} 35.58065  57.97333      98.4  62.81936  83.45164         0    592.25
{txt}{hline 33}{c BT}{hline 70}

{ralign 32:variable} {...}
{c |}       p25       p50       p75       iqr      mean       min       max
{hline 33}{c +}{hline 70}
{ralign 32:TotCTDMeRaA00S00V00} {...}
{c |}{...}
 {res} 25.96082  37.99806  46.57737  20.61655  36.67129     8.875   63.9694
{txt}{hline 33}{c BT}{hline 70}
divider---------------------
                            
Israel

{ralign 32:variable} {...}
{c |}       p25       p50       p75       iqr      mean       min       max
{hline 33}{c +}{hline 70}
{ralign 32:DayCTDMeRaA00S00V00} {...}
{c |}{...}
 {res}  56.9375  123.2048   186.549  129.6115  147.1913    -128.5      1146
{txt}{hline 33}{c BT}{hline 70}

{ralign 32:variable} {...}
{c |}       p25       p50       p75       iqr      mean       min       max
{hline 33}{c +}{hline 70}
{ralign 32:TotCTDMeRaA00S00V00} {...}
{c |}{...}
 {res} 114.4778  124.9765  135.1522  20.67438  129.1569  58.64685      1249
{txt}{hline 33}{c BT}{hline 70}
divider---------------------
                            
Jordan

{ralign 32:variable} {...}
{c |}       p25       p50       p75       iqr      mean       min       max
{hline 33}{c +}{hline 70}
{ralign 32:DayCTDMeRaA00S00V00} {...}
{c |}{...}
 {res} 59.98654  81.77783  123.0513   63.0648  100.3354         0       634
{txt}{hline 33}{c BT}{hline 70}

{ralign 32:variable} {...}
{c |}       p25       p50       p75       iqr      mean       min       max
{hline 33}{c +}{hline 70}
{ralign 32:TotCTDMeRaA00S00V00} {...}
{c |}{...}
 {res} 76.81368  86.89061  114.2591  37.44541  96.08163  51.11111       246
{txt}{hline 33}{c BT}{hline 70}
divider---------------------
                            
Kuwait

{ralign 32:variable} {...}
{c |}       p25       p50       p75       iqr      mean       min       max
{hline 33}{c +}{hline 70}
{ralign 32:DayCTDMeRaA00S00V00} {...}
{c |}{...}
 {res}      122     179.8       255       133  222.2445  38.33333       919
{txt}{hline 33}{c BT}{hline 70}

{ralign 32:variable} {...}
{c |}       p25       p50       p75       iqr      mean       min       max
{hline 33}{c +}{hline 70}
{ralign 32:TotCTDMeRaA00S00V00} {...}
{c |}{...}
 {res} 149.5343  162.4171  172.7679  23.23363  180.2026  120.6364      1234
{txt}{hline 33}{c BT}{hline 70}
divider---------------------
                            
Lebanon

{ralign 32:variable} {...}
{c |}       p25       p50       p75       iqr      mean       min       max
{hline 33}{c +}{hline 70}
{ralign 32:DayCTDMeRaA00S00V00} {...}
{c |}{...}
 {res} 50.55556  87.53333  142.5143  91.95872  115.6465         4      1360
{txt}{hline 33}{c BT}{hline 70}

{ralign 32:variable} {...}
{c |}       p25       p50       p75       iqr      mean       min       max
{hline 33}{c +}{hline 70}
{ralign 32:TotCTDMeRaA00S00V00} {...}
{c |}{...}
 {res} 50.36364  80.82254  118.5377  68.17408  83.32332  20.33333  136.5479
{txt}{hline 33}{c BT}{hline 70}
divider---------------------
                            
Libya

{ralign 32:variable} {...}
{c |}       p25       p50       p75       iqr      mean       min       max
{hline 33}{c +}{hline 70}
{ralign 32:DayCTDMeRaA00S00V00} {...}
{c |}{...}
 {res} 40.33333  64.92222  99.98485  59.65151  80.92665       -72       622
{txt}{hline 33}{c BT}{hline 70}

{ralign 32:variable} {...}
{c |}       p25       p50       p75       iqr      mean       min       max
{hline 33}{c +}{hline 70}
{ralign 32:TotCTDMeRaA00S00V00} {...}
{c |}{...}
 {res} 45.02985  61.14729  66.44095   21.4111  54.75414        11      78.6
{txt}{hline 33}{c BT}{hline 70}
divider---------------------
                            
Oman

{ralign 32:variable} {...}
{c |}       p25       p50       p75       iqr      mean       min       max
{hline 33}{c +}{hline 70}
{ralign 32:DayCTDMeRaA00S00V00} {...}
{c |}{...}
 {res}       48     104.5  182.6667  134.6667  147.9564      8.75      1082
{txt}{hline 33}{c BT}{hline 70}

{ralign 32:variable} {...}
{c |}       p25       p50       p75       iqr      mean       min       max
{hline 33}{c +}{hline 70}
{ralign 32:TotCTDMeRaA00S00V00} {...}
{c |}{...}
 {res}  89.4147  103.4147  199.8824  110.4677  136.6747  85.65003    254.75
{txt}{hline 33}{c BT}{hline 70}
divider---------------------
                            
Qatar

{ralign 32:variable} {...}
{c |}       p25       p50       p75       iqr      mean       min       max
{hline 33}{c +}{hline 70}
{ralign 32:DayCTDMeRaA00S00V00} {...}
{c |}{...}
 {res}      175       266       473       298  370.5542         6      1554
{txt}{hline 33}{c BT}{hline 70}

{ralign 32:variable} {...}
{c |}       p25       p50       p75       iqr      mean       min       max
{hline 33}{c +}{hline 70}
{ralign 32:TotCTDMeRaA00S00V00} {...}
{c |}{...}
 {res} 585.4833  604.4639  666.1429  80.65955  742.0099  316.3333  2373.733
{txt}{hline 33}{c BT}{hline 70}
divider---------------------
                            
Saudi_Arabia

{ralign 32:variable} {...}
{c |}       p25       p50       p75       iqr      mean       min       max
{hline 33}{c +}{hline 70}
{ralign 32:DayCTDMeRaA00S00V00} {...}
{c |}{...}
 {res} 22.93015  58.08333     87.37  64.43985  69.92881       9.4  407.6667
{txt}{hline 33}{c BT}{hline 70}

{ralign 32:variable} {...}
{c |}       p25       p50       p75       iqr      mean       min       max
{hline 33}{c +}{hline 70}
{ralign 32:TotCTDMeRaA00S00V00} {...}
{c |}{...}
 {res} 58.56427  68.75582    102.14  43.57574  89.91731  57.66693       767
{txt}{hline 33}{c BT}{hline 70}
divider---------------------
                            
Syria

{ralign 32:variable} {...}
{c |}       p25       p50       p75       iqr      mean       min       max
{hline 33}{c +}{hline 70}
{ralign 32:DayCTDMeRaA00S00V00} {...}
{c |}{...}
 {res}       12        15     17.75      5.75  15.89484         0        72
{txt}{hline 33}{c BT}{hline 70}

{ralign 32:variable} {...}
{c |}       p25       p50       p75       iqr      mean       min       max
{hline 33}{c +}{hline 70}
{ralign 32:TotCTDMeRaA00S00V00} {...}
{c |}{...}
 {res} 15.20382  18.69477  21.62703  6.423212   19.0203         5  34.66667
{txt}{hline 33}{c BT}{hline 70}
divider---------------------
                            
Tunisia

{ralign 32:variable} {...}
{c |}       p25       p50       p75       iqr      mean       min       max
{hline 33}{c +}{hline 70}
{ralign 32:DayCTDMeRaA00S00V00} {...}
{c |}{...}
 {res} 18.61905  27.44036  41.30645   22.6874  37.12666         0     244.6
{txt}{hline 33}{c BT}{hline 70}

{ralign 32:variable} {...}
{c |}       p25       p50       p75       iqr      mean       min       max
{hline 33}{c +}{hline 70}
{ralign 32:TotCTDMeRaA00S00V00} {...}
{c |}{...}
 {res} 26.14333   29.4184  35.31584  9.172508   34.5533  21.35294  75.88406
{txt}{hline 33}{c BT}{hline 70}
divider---------------------
                            
UAE

{ralign 32:variable} {...}
{c |}       p25       p50       p75       iqr      mean       min       max
{hline 33}{c +}{hline 70}
{ralign 32:DayCTDMeRaA00S00V00} {...}
{c |}{...}
 {res}   217.75  331.4167       539    321.25  404.0397         0      1563
{txt}{hline 33}{c BT}{hline 70}

{ralign 32:variable} {...}
{c |}       p25       p50       p75       iqr      mean       min       max
{hline 33}{c +}{hline 70}
{ralign 32:TotCTDMeRaA00S00V00} {...}
{c |}{...}
 {res} 166.4286  227.6627  306.4194  139.9909  231.5137        70  359.5811
{txt}{hline 33}{c BT}{hline 70}
divider---------------------
                            
Yemen

{ralign 32:variable} {...}
{c |}       p25       p50       p75       iqr      mean       min       max
{hline 33}{c +}{hline 70}
{ralign 32:DayCTDMeRaA00S00V00} {...}
{c |}{...}
 {res} 1.866667  4.428571  7.214286  5.347619  5.641161       -.2        41
{txt}{hline 33}{c BT}{hline 70}

{ralign 32:variable} {...}
{c |}       p25       p50       p75       iqr      mean       min       max
{hline 33}{c +}{hline 70}
{ralign 32:TotCTDMeRaA00S00V00} {...}
{c |}{...}
 {res} 3.445561  3.472399  3.791209  .3456476   3.84781         3  7.083333
{txt}{hline 33}{c BT}{hline 70}
divider---------------------
                            

{com}. *
. 
. 
. 
. 
. 
. 
. 
. 
. * smooth 
. 
. encode loc_grand_name, gen(loc_grand_name_numeric)
{txt}
{com}. 
. tsset loc_grand_name_numeric date, daily   
{res}{txt}{col 8}panel variable:  {res}loc_grand_name_numeric (strongly balanced)
{txt}{col 9}time variable:  {res}{col 25}date, 22jan2020 to 14apr2021
{txt}{col 17}delta:  {res}1 day
{txt}
{com}. 
. 
. tssmooth ma DayDeaMeRaA00S00V00_window = DayDeaMeRaA00S00V00 if DayDeaMeRaA00S00V00 >= 0, window(3 1 3)
{txt}The smoother applied was
{res}{p 5 5 5} by loc_grand_name_numeric : (1/7)*[x(t-3) + x(t-2) + x(t-1) + 1*x(t) + x(t+1) + x(t+2) + x(t+3)]; x(t)= DayDeaMeRaA00S00V00 {p_end}
{txt}
{com}. 
. tssmooth ma DayDeaMeSmA00S00V00 = DayDeaMeRaA00S00V00_window, weights( 1 2 3 <4> 3 2 1) replace
{txt}The smoother applied was
{res}{p 5 5 5} by loc_grand_name_numeric : (1/16)*[1*x(t-3) + 2*x(t-2) + 3*x(t-1) + 4*x(t) + 3*x(t+1) + 2*x(t+2) + ...; x(t)= DayDeaMeRaA00S00V00_window
{txt}
{smcl}
{com}. 
. label var DayDeaMeSmA00S00V00 "Daily deaths mean smooth JOHN"
{txt}
{com}. 
. drop DayDeaMeRaA00S00V00_window
{txt}
{com}. 
. 
. tssmooth ma DayCasMeRaA00S00V00_window = DayCasMeRaA00S00V00 if DayCasMeRaA00S00V00 >= 0, window(3 1 3)
{txt}The smoother applied was
{res}{p 5 5 5} by loc_grand_name_numeric : (1/7)*[x(t-3) + x(t-2) + x(t-1) + 1*x(t) + x(t+1) + x(t+2) + x(t+3)]; x(t)= DayCasMeRaA00S00V00 {p_end}
{txt}
{com}. 
. tssmooth ma DayCasMeSmA00S00V00 = DayCasMeRaA00S00V00_window, weights( 1 2 3 <4> 3 2 1) replace
{txt}The smoother applied was
{res}{p 5 5 5} by loc_grand_name_numeric : (1/16)*[1*x(t-3) + 2*x(t-2) + 3*x(t-1) + 4*x(t) + 3*x(t+1) + 2*x(t+2) + ...; x(t)= DayCasMeRaA00S00V00_window
{txt}
{smcl}
{com}. 
. label var DayCasMeSmA00S00V00 "Daily cases mean smooth JOHN"
{txt}
{com}. 
. drop DayCasMeRaA00S00V00_window
{txt}
{com}. 
. 
. tssmooth ma DayCfrMeRaA00S00V00_window = DayCfrMeRaA00S00V00 if DayCfrMeRaA00S00V00 >= 0, window(3 1 3)
{txt}The smoother applied was
{res}{p 5 5 5} by loc_grand_name_numeric : (1/7)*[x(t-3) + x(t-2) + x(t-1) + 1*x(t) + x(t+1) + x(t+2) + x(t+3)]; x(t)= DayCfrMeRaA00S00V00 {p_end}
{txt}
{com}. 
. tssmooth ma DayCfrMeSmA00S00V00 = DayCfrMeRaA00S00V00_window, weights( 1 2 3 <4> 3 2 1) replace
{txt}The smoother applied was
{res}{p 5 5 5} by loc_grand_name_numeric : (1/16)*[1*x(t-3) + 2*x(t-2) + 3*x(t-1) + 4*x(t) + 3*x(t+1) + 2*x(t+2) + ...; x(t)= DayCfrMeRaA00S00V00_window
{txt}
{smcl}
{com}. 
. label var DayCfrMeSmA00S00V00 "Daily CFR mean smooth JOHN"
{txt}
{com}. 
. drop DayCfrMeRaA00S00V00_window
{txt}
{com}. 
. 
. tssmooth ma DayCTDMeRaA00S00V00_window = DayCTDMeRaA00S00V00 if DayCTDMeRaA00S00V00 >= 0, window(3 1 3)
{txt}The smoother applied was
{res}{p 5 5 5} by loc_grand_name_numeric : (1/7)*[x(t-3) + x(t-2) + x(t-1) + 1*x(t) + x(t+1) + x(t+2) + x(t+3)]; x(t)= DayCTDMeRaA00S00V00 {p_end}
{txt}
{com}. 
. tssmooth ma DayCTDMeSmA00S00V00 = DayCTDMeRaA00S00V00_window, weights( 1 2 3 <4> 3 2 1) replace
{txt}The smoother applied was
{res}{p 5 5 5} by loc_grand_name_numeric : (1/16)*[1*x(t-3) + 2*x(t-2) + 3*x(t-1) + 4*x(t) + 3*x(t+1) + 2*x(t+2) + ...; x(t)= DayCTDMeRaA00S00V00_window
{txt}
{smcl}
{com}. 
. label var DayCTDMeSmA00S00V00 "Daily CTD mean smooth JOHN"
{txt}
{com}. 
. drop DayCTDMeRaA00S00V00_window
{txt}
{com}. 
. 
. 
. tssmooth ma TotCTDMeRaA00S00V00_window = TotCTDMeRaA00S00V00 if TotCTDMeRaA00S00V00 >= 0, window(3 1 3)
{txt}The smoother applied was
{res}{p 5 5 5} by loc_grand_name_numeric : (1/7)*[x(t-3) + x(t-2) + x(t-1) + 1*x(t) + x(t+1) + x(t+2) + x(t+3)]; x(t)= TotCTDMeRaA00S00V00 {p_end}
{txt}
{com}. 
. tssmooth ma TotCTDMeSmA00S00V00 = TotCTDMeRaA00S00V00_window, weights( 1 2 3 <4> 3 2 1) replace
{txt}The smoother applied was
{res}{p 5 5 5} by loc_grand_name_numeric : (1/16)*[1*x(t-3) + 2*x(t-2) + 3*x(t-1) + 4*x(t) + 3*x(t+1) + 2*x(t+2) + ...; x(t)= TotCTDMeRaA00S00V00_window
{txt}
{smcl}
{com}. 
. label var TotCTDMeSmA00S00V00 "Total CTD mean smooth JOHN"
{txt}
{com}. 
. drop TotCTDMeRaA00S00V00_window
{txt}
{com}. 
. 
. 
. 
. levelsof loc_grand_name, local(levels)
{txt}`"1_Global"' `"2_EMR"' `"Algeria"' `"Bahrain"' `"Djibouti"' `"Egypt"' `"Iran"' `"Iraq"' `"Israel"' `"Jordan"' `"Kuwait"' `"Lebanon"' `"Libya"' `"Oman"' `"Qatar"' `"Saudi_Arabia"' `"Syria"' `"Tunisia"' `"UAE"' `"Yemen"'

{com}. 
. foreach l of local levels {c -(}
{txt}  2{com}. 
.         tssmooth ma DayDea_multip_`l'_w = DayDea_multip_`l' if (DayDea_multip_`l' >= 0) & (loc_grand_name == "`l'"), window(3 1 3)
{txt}  3{com}. 
.         tssmooth ma DayDea_multip_`l'_sm = DayDea_multip_`l'_w if (loc_grand_name == "`l'"), weights( 1 2 3 <4> 3 2 1) replace
{txt}  4{com}. 
.         label var DayDea_multip_`l'_w "Daily deaths scaled smooth only for visualization JOHN"
{txt}  5{com}. 
.         drop DayDea_multip_`l'_w 
{txt}  6{com}. {c )-}
{txt}The smoother applied was
{res}{p 5 5 5}(1/7)*[x(t-3) + x(t-2) + x(t-1) + 1*x(t) + x(t+1) + x(t+2) + x(t+3)]; x(t)= DayDea_multip_1_Global {p_end}
{txt}The smoother applied was
{res}{p 5 5 5}(1/16)*[1*x(t-3) + 2*x(t-2) + 3*x(t-1) + 4*x(t) + 3*x(t+1) + 2*x(t+2) + ...; x(t)= DayDea_multip_1_Global_w 
{txt}The smoother applied was
{res}{p 5 5 5}(1/7)*[x(t-3) + x(t-2) + x(t-1) + 1*x(t) + x(t+1) + x(t+2) + x(t+3)]; x(t)= DayDea_multip_2_EMR {p_end}
{txt}The smoother applied was
{res}{p 5 5 5}(1/16)*[1*x(t-3) + 2*x(t-2) + 3*x(t-1) + 4*x(t) + 3*x(t+1) + 2*x(t+2) + ...; x(t)= DayDea_multip_2_EMR_w 
{txt}The smoother applied was
{res}{p 5 5 5}(1/7)*[x(t-3) + x(t-2) + x(t-1) + 1*x(t) + x(t+1) + x(t+2) + x(t+3)]; x(t)= DayDea_multip_Algeria {p_end}
{txt}The smoother applied was
{res}{p 5 5 5}(1/16)*[1*x(t-3) + 2*x(t-2) + 3*x(t-1) + 4*x(t) + 3*x(t+1) + 2*x(t+2) + ...; x(t)= DayDea_multip_Algeria_w 
{txt}The smoother applied was
{res}{p 5 5 5}(1/7)*[x(t-3) + x(t-2) + x(t-1) + 1*x(t) + x(t+1) + x(t+2) + x(t+3)]; x(t)= DayDea_multip_Bahrain {p_end}
{txt}The smoother applied was
{res}{p 5 5 5}(1/16)*[1*x(t-3) + 2*x(t-2) + 3*x(t-1) + 4*x(t) + 3*x(t+1) + 2*x(t+2) + ...; x(t)= DayDea_multip_Bahrain_w 
{txt}The smoother applied was
{res}{p 5 5 5}(1/7)*[x(t-3) + x(t-2) + x(t-1) + 1*x(t) + x(t+1) + x(t+2) + x(t+3)]; x(t)= DayDea_multip_Djibouti {p_end}
{txt}The smoother applied was
{res}{p 5 5 5}(1/16)*[1*x(t-3) + 2*x(t-2) + 3*x(t-1) + 4*x(t) + 3*x(t+1) + 2*x(t+2) + ...; x(t)= DayDea_multip_Djibouti_w 
{txt}The smoother applied was
{res}{p 5 5 5}(1/7)*[x(t-3) + x(t-2) + x(t-1) + 1*x(t) + x(t+1) + x(t+2) + x(t+3)]; x(t)= DayDea_multip_Egypt {p_end}
{txt}The smoother applied was
{res}{p 5 5 5}(1/16)*[1*x(t-3) + 2*x(t-2) + 3*x(t-1) + 4*x(t) + 3*x(t+1) + 2*x(t+2) + ...; x(t)= DayDea_multip_Egypt_w 
{txt}The smoother applied was
{res}{p 5 5 5}(1/7)*[x(t-3) + x(t-2) + x(t-1) + 1*x(t) + x(t+1) + x(t+2) + x(t+3)]; x(t)= DayDea_multip_Iran {p_end}
{txt}The smoother applied was
{res}{p 5 5 5}(1/16)*[1*x(t-3) + 2*x(t-2) + 3*x(t-1) + 4*x(t) + 3*x(t+1) + 2*x(t+2) + ...; x(t)= DayDea_multip_Iran_w 
{txt}The smoother applied was
{res}{p 5 5 5}(1/7)*[x(t-3) + x(t-2) + x(t-1) + 1*x(t) + x(t+1) + x(t+2) + x(t+3)]; x(t)= DayDea_multip_Iraq {p_end}
{txt}The smoother applied was
{res}{p 5 5 5}(1/16)*[1*x(t-3) + 2*x(t-2) + 3*x(t-1) + 4*x(t) + 3*x(t+1) + 2*x(t+2) + ...; x(t)= DayDea_multip_Iraq_w 
{txt}The smoother applied was
{res}{p 5 5 5}(1/7)*[x(t-3) + x(t-2) + x(t-1) + 1*x(t) + x(t+1) + x(t+2) + x(t+3)]; x(t)= DayDea_multip_Israel {p_end}
{txt}The smoother applied was
{res}{p 5 5 5}(1/16)*[1*x(t-3) + 2*x(t-2) + 3*x(t-1) + 4*x(t) + 3*x(t+1) + 2*x(t+2) + ...; x(t)= DayDea_multip_Israel_w 
{txt}The smoother applied was
{res}{p 5 5 5}(1/7)*[x(t-3) + x(t-2) + x(t-1) + 1*x(t) + x(t+1) + x(t+2) + x(t+3)]; x(t)= DayDea_multip_Jordan {p_end}
{txt}The smoother applied was
{res}{p 5 5 5}(1/16)*[1*x(t-3) + 2*x(t-2) + 3*x(t-1) + 4*x(t) + 3*x(t+1) + 2*x(t+2) + ...; x(t)= DayDea_multip_Jordan_w 
{txt}The smoother applied was
{res}{p 5 5 5}(1/7)*[x(t-3) + x(t-2) + x(t-1) + 1*x(t) + x(t+1) + x(t+2) + x(t+3)]; x(t)= DayDea_multip_Kuwait {p_end}
{txt}The smoother applied was
{res}{p 5 5 5}(1/16)*[1*x(t-3) + 2*x(t-2) + 3*x(t-1) + 4*x(t) + 3*x(t+1) + 2*x(t+2) + ...; x(t)= DayDea_multip_Kuwait_w 
{txt}The smoother applied was
{res}{p 5 5 5}(1/7)*[x(t-3) + x(t-2) + x(t-1) + 1*x(t) + x(t+1) + x(t+2) + x(t+3)]; x(t)= DayDea_multip_Lebanon {p_end}
{txt}The smoother applied was
{res}{p 5 5 5}(1/16)*[1*x(t-3) + 2*x(t-2) + 3*x(t-1) + 4*x(t) + 3*x(t+1) + 2*x(t+2) + ...; x(t)= DayDea_multip_Lebanon_w 
{txt}The smoother applied was
{res}{p 5 5 5}(1/7)*[x(t-3) + x(t-2) + x(t-1) + 1*x(t) + x(t+1) + x(t+2) + x(t+3)]; x(t)= DayDea_multip_Libya {p_end}
{txt}The smoother applied was
{res}{p 5 5 5}(1/16)*[1*x(t-3) + 2*x(t-2) + 3*x(t-1) + 4*x(t) + 3*x(t+1) + 2*x(t+2) + ...; x(t)= DayDea_multip_Libya_w 
{txt}The smoother applied was
{res}{p 5 5 5}(1/7)*[x(t-3) + x(t-2) + x(t-1) + 1*x(t) + x(t+1) + x(t+2) + x(t+3)]; x(t)= DayDea_multip_Oman {p_end}
{txt}The smoother applied was
{res}{p 5 5 5}(1/16)*[1*x(t-3) + 2*x(t-2) + 3*x(t-1) + 4*x(t) + 3*x(t+1) + 2*x(t+2) + ...; x(t)= DayDea_multip_Oman_w 
{txt}The smoother applied was
{res}{p 5 5 5}(1/7)*[x(t-3) + x(t-2) + x(t-1) + 1*x(t) + x(t+1) + x(t+2) + x(t+3)]; x(t)= DayDea_multip_Qatar {p_end}
{txt}The smoother applied was
{res}{p 5 5 5}(1/16)*[1*x(t-3) + 2*x(t-2) + 3*x(t-1) + 4*x(t) + 3*x(t+1) + 2*x(t+2) + ...; x(t)= DayDea_multip_Qatar_w 
{txt}The smoother applied was
{res}{p 5 5 5}(1/7)*[x(t-3) + x(t-2) + x(t-1) + 1*x(t) + x(t+1) + x(t+2) + x(t+3)]; x(t)= DayDea_multip_Saudi_Arabia {p_end}
{txt}The smoother applied was
{res}{p 5 5 5}(1/16)*[1*x(t-3) + 2*x(t-2) + 3*x(t-1) + 4*x(t) + 3*x(t+1) + 2*x(t+2) + ...; x(t)= DayDea_multip_Saudi_Arabia_w 
{txt}The smoother applied was
{res}{p 5 5 5}(1/7)*[x(t-3) + x(t-2) + x(t-1) + 1*x(t) + x(t+1) + x(t+2) + x(t+3)]; x(t)= DayDea_multip_Syria {p_end}
{txt}The smoother applied was
{res}{p 5 5 5}(1/16)*[1*x(t-3) + 2*x(t-2) + 3*x(t-1) + 4*x(t) + 3*x(t+1) + 2*x(t+2) + ...; x(t)= DayDea_multip_Syria_w 
{txt}The smoother applied was
{res}{p 5 5 5}(1/7)*[x(t-3) + x(t-2) + x(t-1) + 1*x(t) + x(t+1) + x(t+2) + x(t+3)]; x(t)= DayDea_multip_Tunisia {p_end}
{txt}The smoother applied was
{res}{p 5 5 5}(1/16)*[1*x(t-3) + 2*x(t-2) + 3*x(t-1) + 4*x(t) + 3*x(t+1) + 2*x(t+2) + ...; x(t)= DayDea_multip_Tunisia_w 
{txt}The smoother applied was
{res}{p 5 5 5}(1/7)*[x(t-3) + x(t-2) + x(t-1) + 1*x(t) + x(t+1) + x(t+2) + x(t+3)]; x(t)= DayDea_multip_UAE {p_end}
{txt}The smoother applied was
{res}{p 5 5 5}(1/16)*[1*x(t-3) + 2*x(t-2) + 3*x(t-1) + 4*x(t) + 3*x(t+1) + 2*x(t+2) + ...; x(t)= DayDea_multip_UAE_w 
{txt}The smoother applied was
{res}{p 5 5 5}(1/7)*[x(t-3) + x(t-2) + x(t-1) + 1*x(t) + x(t+1) + x(t+2) + x(t+3)]; x(t)= DayDea_multip_Yemen {p_end}
{txt}The smoother applied was
{res}{p 5 5 5}(1/16)*[1*x(t-3) + 2*x(t-2) + 3*x(t-1) + 4*x(t) + 3*x(t+1) + 2*x(t+2) + ...; x(t)= DayDea_multip_Yemen_w 
{txt}
{smcl}
{com}. * 
. 
. 
. * 
. 
. tsset, clear
{txt}
{com}. 
. 
. 
. 
. 
. save "EMR JOHN.dta", replace
{txt}(note: file EMR JOHN.dta not found)
file EMR JOHN.dta saved

{com}. 
. 
. 
. 
. 
. 
. 
. **************
. 
. * graphs
. 
. ssc install grstyle, replace
{txt}checking {hilite:grstyle} consistency and verifying not already installed...
all files already exist and are up to date.

{com}. 
. grstyle init
{res}{txt}
{com}. 
. grstyle color background white
{txt}
{com}. 
. 
. 
. 
. 
. 
. 
. * adjust x axis ticks from Jan 2020 to this month and avoid globals
. forval i = 1(1)12 {c -(}
{txt}  2{com}.         local date2020 = mdy(`i', 1, 2020)
{txt}  3{com}.         local dates2020 `dates2020' `date2020'
{txt}  4{com}. {c )-}
{txt}
{com}. local wanted : di %tdNN daily("$S_DATE", "DMY")
{res}{txt}
{com}. forval i = 1(1)`wanted' {c -(}
{txt}  2{com}.         local date2021 = mdy(`i', 1, 2021)
{txt}  3{com}.         local dates2021 `dates2021' `date2021'
{txt}  4{com}. {c )-}
{txt}
{com}. *
. 
. 
. 
. 
. levelsof loc_grand_name, local(levels)
{txt}`"1_Global"' `"2_EMR"' `"Algeria"' `"Bahrain"' `"Djibouti"' `"Egypt"' `"Iran"' `"Iraq"' `"Israel"' `"Jordan"' `"Kuwait"' `"Lebanon"' `"Libya"' `"Oman"' `"Qatar"' `"Saudi_Arabia"' `"Syria"' `"Tunisia"' `"UAE"' `"Yemen"'

{com}. 
. foreach l of local levels {c -(}
{txt}  2{com}. 
. 
. 
. ** DayCas DayDea DayDea_multip
. 
. 
. * DayCas DayDea DayDea_multip, all raw
. 
. twoway ///
> (line DayCasMeRaA00S00V00 date, sort lcolor(blue)) ///
> (line DayDeaMeRaA00S00V00 date, sort lcolor(red)) ///
> (line DayDea_multip_`l' date, sort lpattern(dot) lcolor(red)) ///
> if date > td(01jan2020) & loc_grand_name == "`l'" ///
> , xtitle(Date) xlabel(`dates2020' `dates2021', format(%tdYY-NN-DD) labsize(small)) xlabel(, grid) xlabel(, grid) ///
> xlabel(, angle(forty_five)) ylabel(, format(%12.0fc) labsize(small)) ylabel(, labsize(small) angle(horizontal)) ///
> ytitle(Daily cases and deaths) title("COVID-19 daily cases and deaths, `l', Johns Hopkins", size(medium)) ///
> xscale(lwidth(vthin) lcolor(gray*.2)) yscale(lwidth(vthin) lcolor(gray*.2)) yscale(titlegap(4)) legend(region(lcolor(none)))  ///
> legend(order(1 "Daily cases" 2 "Daily deaths" 3 "Daily deaths scaled for visualization") size(small)) ///
> subtitle("Daily deaths, scaled = times (means of cases divided by deaths) for visualization only", size(small))
{txt}  3{com}. 
. qui graph save "graph 1 COVID-19 daily deaths and cases `l' Johns Hopkins.gph", replace
{txt}  4{com}. qui graph export "graph 1 COVID-19 daily deaths and cases `l' Johns Hopkins.pdf", replace
{txt}  5{com}. 
. 
. 
. 
. 
. * DayCas DayDea DayDea_multip, all smooth
. 
. twoway ///
> (line DayCasMeSmA00S00V00 date, sort lcolor(blue)) ///
> (line DayDeaMeSmA00S00V00 date, sort lcolor(red)) ///
> (line DayDea_multip_`l'_sm date, sort lpattern(dot) lcolor(red)) ///
> if date > td(01jan2020) & loc_grand_name == "`l'" ///
> , xtitle(Date) xlabel(`dates2020' `dates2021', format(%tdYY-NN-DD) labsize(small)) xlabel(, grid) xlabel(, grid) ///
> xlabel(, angle(forty_five)) ylabel(, format(%12.0fc) labsize(small)) ylabel(, labsize(small) angle(horizontal)) ///
> ytitle(Daily cases and deaths smoothed) title("COVID-19 daily cases and deaths smoothed, `l', Johns Hopkins", size(medium)) ///
> xscale(lwidth(vthin) lcolor(gray*.2)) yscale(lwidth(vthin) lcolor(gray*.2)) yscale(titlegap(4)) legend(region(lcolor(none)))  ///
> legend(order(1 "Daily cases smoothed" 2 "Daily deaths smoothed" 3 "Daily deaths scaled for visualization, smoothed") size(small)) ///
> subtitle("Daily deaths, scaled = times (means of cases divided by deaths) for visualization only, smoothed", size(small))
{txt}  6{com}. 
. qui graph save "graph 2 COVID-19 daily deaths and cases smoothed `l' Johns Hopkins.gph", replace
{txt}  7{com}. qui graph export "graph 2 COVID-19 daily deaths and cases smoothed `l' Johns Hopkins.pdf", replace
{txt}  8{com}. 
. 
. 
. 
. 
. ** DayDea
. 
. * DayDea, raw and smooth 
. 
. 
. twoway ///
> (line DayDeaMeRaA00S00V00 date, sort lcolor(gray)) ///
> (line DayDeaMeSmA00S00V00 date, sort lwidth(thick) lcolor(red)) ///
> if date > td(01jan2020) & loc_grand_name == "`l'" ///
> , xtitle(Date) xlabel(`dates2020' `dates2021', format(%tdYY-NN-DD) labsize(small)) xlabel(, grid) xlabel(, grid) ///
> xlabel(, angle(forty_five)) ylabel(, format(%12.0fc) labsize(small)) ylabel(, labsize(small) angle(horizontal)) ///
> ytitle(Daily deaths) title("COVID-19 daily deaths, `l', Johns Hopkins", size(medium)) ///
> xscale(lwidth(vthin) lcolor(gray*.2)) yscale(lwidth(vthin) lcolor(gray*.2)) yscale(titlegap(4)) legend(region(lcolor(none)))  ///
> legend(order(1 "Raw" 2 "Smoothed") size(small)) ///
> 
{txt}  9{com}. qui graph save "graph 3 COVID-19 daily deaths `l' Johns Hopkins.gph", replace
{txt} 10{com}. qui graph export "graph 3 COVID-19 daily deaths `l' Johns Hopkins.pdf", replace
{txt} 11{com}. 
. 
. 
. ** Day CFR
. 
. * Day CFR raw
. 
. twoway ///
> (line DayCfrMeRaA00S00V00 date, sort lcolor(black)) ///
> if date > td(01jan2020) & loc_grand_name == "`l'" ///
> , xtitle(Date) xlabel(`dates2020' `dates2021', format(%tdYY-NN-DD) labsize(small)) xlabel(, grid) xlabel(, grid) ///
> xlabel(, angle(forty_five)) ylabel(, format(%9.2fc) labsize(small))  ylabel(, labsize(small) angle(horizontal)) ///
> ytitle(Daily CFR) title("COVID-19 daily CFR, `l', Johns Hopkins", size(medium)) ///
> xscale(lwidth(vthin) lcolor(gray*.2)) yscale(lwidth(vthin) lcolor(gray*.2)) legend(region(lcolor(none))) legend(bexpand) 
{txt} 12{com}. 
. 
. qui graph save "graph 4 COVID-19 daily CFR, `l', Johns Hopkins.gph", replace
{txt} 13{com}. qui graph export "graph 4 COVID-19 daily CFR, `l', Johns Hopkins.pdf", replace
{txt} 14{com}. 
. 
. 
. * Day CFR smoothed
. 
. twoway ///
> (line DayCfrMeSmA00S00V00 date, sort lcolor(black)) ///
> if date > td(01jan2020) & loc_grand_name == "`l'" ///
> , xtitle(Date) xlabel(`dates2020' `dates2021', format(%tdYY-NN-DD) labsize(small)) xlabel(, grid) xlabel(, grid) ///
> xlabel(, angle(forty_five)) ylabel(, format(%9.2fc) labsize(small))  ylabel(, labsize(small) angle(horizontal)) ///
> ytitle(Daily CFR smoothed) title("COVID-19 daily CFR, smoothed, `l', Johns Hopkins", size(medium)) ///
> xscale(lwidth(vthin) lcolor(gray*.2)) yscale(lwidth(vthin) lcolor(gray*.2)) legend(region(lcolor(none))) legend(bexpand) 
{txt} 15{com}. 
. 
. qui graph save "graph 5 COVID-19 daily CFR, smoothed `l', Johns Hopkins.gph", replace
{txt} 16{com}. qui graph export "graph 5 COVID-19 daily CFR, smoothed `l', Johns Hopkins.pdf", replace
{txt} 17{com}. 
. 
. 
. 
. * Day CFR raw and smoothed
. 
. twoway ///
> (line DayCfrMeRaA00S00V00 date, sort lcolor(gray)) ///
> (line DayCfrMeSmA00S00V00 date, sort lwidth(thick) lcolor(red)) ///
> if date > td(01jan2020) & loc_grand_name == "`l'" ///
> , xtitle(Date) xlabel(`dates2020' `dates2021', format(%tdYY-NN-DD) labsize(small)) xlabel(, grid) xlabel(, grid) ///
> xlabel(, angle(forty_five)) ylabel(, format(%9.2fc) labsize(small))  ylabel(, labsize(small) angle(horizontal)) ///
> ytitle(Daily CFR) title("COVID-19 daily CFR, `l', Johns Hopkins", size(medium)) ///
> xscale(lwidth(vthin) lcolor(gray*.2)) yscale(lwidth(vthin) lcolor(gray*.2)) legend(region(lcolor(none))) legend(bexpand) ///
> legend(order(1 "Raw" 2 "Smoothed") size(small)) ///
> 
{txt} 18{com}. 
. qui graph save "graph 6 COVID-19 daily CFR, raw and smoothed, `l', Johns Hopkins.gph", replace
{txt} 19{com}. qui graph export "graph 6 COVID-19 daily CFR, raw and smoothed, `l', Johns Hopkins.pdf", replace
{txt} 20{com}. 
. 
. 
. 
. ** Cases to deaths ratio (CTD)
. 
. 
. * Day CTD raw and smoothed
. 
. twoway ///
> (line DayCTDMeRaA00S00V00 date, sort lcolor(gray)) ///
> (line DayCTDMeSmA00S00V00 date, sort lwidth(thick) lcolor(red)) ///
> if date > td(01jan2020) & loc_grand_name == "`l'" ///
> , xtitle(Date) xlabel(`dates2020' `dates2021', format(%tdYY-NN-DD) labsize(small)) xlabel(, grid) xlabel(, grid) ///
> xlabel(, angle(forty_five)) ylabel(, format(%9.2fc) labsize(small))  ylabel(, labsize(small) angle(horizontal)) ///
> ytitle(Daily Cases to deaths ratio) title("COVID-19 daily cases to deaths ratio, `l', Johns Hopkins", size(medium)) ///
> xscale(lwidth(vthin) lcolor(gray*.2)) yscale(lwidth(vthin) lcolor(gray*.2)) legend(region(lcolor(none))) legend(bexpand) ///
> legend(order(1 "Raw" 2 "Smoothed") size(small)) ///
> 
{txt} 21{com}. 
. qui graph save "graph 7 COVID-19 daily CTD, raw and smoothed, `l', Johns Hopkins.gph", replace
{txt} 22{com}. qui graph export "graph 7 COVID-19 daily CTD, raw and smoothed, `l', Johns Hopkins.pdf", replace
{txt} 23{com}. 
. 
. 
. 
. * Tot CTD raw and smoothed
. 
. twoway ///
> (line TotCTDMeRaA00S00V00 date, sort lcolor(gray)) ///
> (line TotCTDMeSmA00S00V00 date, sort lwidth(thick) lcolor(red)) ///
> if date > td(01jan2020) & loc_grand_name == "`l'" ///
> , xtitle(Date) xlabel(`dates2020' `dates2021', format(%tdYY-NN-DD) labsize(small)) xlabel(, grid) xlabel(, grid) ///
> xlabel(, angle(forty_five)) ylabel(, format(%9.2fc) labsize(small))  ylabel(, labsize(small) angle(horizontal)) ///
> ytitle(Total Cases to deaths ratio) title("COVID-19 total cases to deaths ratio, `l', Johns Hopkins", size(medium)) ///
> xscale(lwidth(vthin) lcolor(gray*.2)) yscale(lwidth(vthin) lcolor(gray*.2)) legend(region(lcolor(none))) legend(bexpand) ///
> legend(order(1 "Raw" 2 "Smoothed") size(small)) ///
> 
{txt} 24{com}. 
. qui graph save "graph 8 COVID-19 total CTD, raw and smoothed, `l', Johns Hopkins.gph", replace
{txt} 25{com}. qui graph export "graph 8 COVID-19 total CTD, raw and smoothed, `l', Johns Hopkins.pdf", replace
{txt} 26{com}. 
. 
. 
. {c )-}
{res}{txt}
{com}. *
. 
. 
. 
. 
. 
. 
. 
. 
. view "log EMR JOHN.smcl"
{txt}
{com}. 
. log close
      {txt}name:  {res}<unnamed>
       {txt}log:  {res}/Users/farshadpourmalek/Downloads/covir2-main/20210413/code/JOHNEMR/log EMR JOHN.smcl
  {txt}log type:  {res}smcl
 {txt}closed on:  {res}15 Apr 2021, 11:36:48
{txt}{.-}
{smcl}
{txt}{sf}{ul off}