{smcl}
{com}{sf}{ul off}{txt}{.-}
      name:  {res}<unnamed>
       {txt}log:  {res}/Users/farshadpourmalek/Downloads/covir2-main/20210514/code/JOHNEMR/log EMR JOHN.smcl
  {txt}log type:  {res}smcl
 {txt}opened on:  {res}14 May 2021, 20:00:54
{txt}
{com}. 
. ***************************************************************************
. * This is "do EMR JOHN.do"
. 
. * Project: COVID-19 Iran Review No 2
. * Person: Farshad Pourmalek pourmalek_farshad@yahoo.com
. * Time (initial): 2021-02-10
. 
. * OBJECTIVE: Get and prepare Johns Hopkins data for EMR, compare timing of deaths and cases peaks
. ***************************************************************************
. 
. 
. 
. * get Johns Hopkins data for deaths
. 
. import delimited ///
> "https://raw.githubusercontent.com/CSSEGISandData/COVID-19/master/csse_covid_19_data/csse_covid_19_time_series/time_series_covid19_deaths_global.csv" ///
> , clear varnames(1) colrange(2:2)
{res}{text}(1 var, 275 obs)

{com}. 
. save "time_series_covid19_deaths_global col 2.dta", replace
{txt}file time_series_covid19_deaths_global col 2.dta saved

{com}. 
. 
. import delimited ///
> "https://raw.githubusercontent.com/CSSEGISandData/COVID-19/master/csse_covid_19_data/csse_covid_19_time_series/time_series_covid19_deaths_global.csv" ///
> , clear varnames(1) colrange(5)
{res}{text}(478 vars, 275 obs)

{com}. 
. 
. save "time_series_covid19_deaths_global col 5 on.dta", replace
{txt}file time_series_covid19_deaths_global col 5 on.dta saved

{com}. 
. 
. use "time_series_covid19_deaths_global col 2.dta", clear 
{txt}
{com}. 
. merge 1:1 _n using "time_series_covid19_deaths_global col 5 on.dta"
{res}
{txt}{col 5}Result{col 38}# of obs.
{col 5}{hline 41}
{col 5}not matched{col 30}{res}               0
{txt}{col 5}matched{col 30}{res}             275{txt}  (_merge==3)
{col 5}{hline 41}

{com}. 
. rename countryregion loc_grand_name
{res}{txt}
{com}. 
. qui destring *, replace
{txt}
{com}. 
. 
. 
. * gen global sum
. 
. save "global JOHN deaths wo sum.dta", replace
{txt}file global JOHN deaths wo sum.dta saved

{com}. 
. drop loc_grand_name
{txt}
{com}. 
. qui destring *, replace
{txt}
{com}.  
. collapse (sum) *
{txt}
{com}. 
. gen loc_grand_name = "global"
{txt}
{com}.   
. save "global JOHN deaths sum.dta", replace
{txt}file global JOHN deaths sum.dta saved

{com}. 
. *
. 
. 
. use "global JOHN deaths wo sum.dta", clear
{txt}
{com}. 
. 
. 
. keep if ///
> loc_grand_name == "Algeria" | ///
> loc_grand_name == "Bahrain" | ///
> loc_grand_name == "Djibouti" | ///
> loc_grand_name == "Egypt" | ///
> loc_grand_name == "Iran" | ///
> loc_grand_name == "Iraq" | ///
> loc_grand_name == "Israel" | ///
> loc_grand_name == "Jordan" | ///
> loc_grand_name == "Kuwait" | ///
> loc_grand_name == "Lebanon" | ///
> loc_grand_name == "Libya" | ///
> loc_grand_name == "Oman" | ///
> loc_grand_name == "Palestine" | ///
> loc_grand_name == "Qatar" | ///
> loc_grand_name == "Saudi Arabia" | ///
> loc_grand_name == "Syria" | ///
> loc_grand_name == "Tunisia" | ///
> loc_grand_name == "United Arab Emirates" | ///
> loc_grand_name == "Yemen" 
{txt}(257 observations deleted)

{com}. 
. 
. * gen EMR sum
. 
. save "EMR JOHN deaths wo sum.dta", replace
{txt}file EMR JOHN deaths wo sum.dta saved

{com}. 
. drop loc_grand_name
{txt}
{com}. 
. qui destring *, replace
{txt}
{com}.  
. collapse (sum) *
{txt}
{com}. 
. gen loc_grand_name = "EMR"
{txt}
{com}.   
. save "EMR JOHN deaths sum.dta", replace
{txt}file EMR JOHN deaths sum.dta saved

{com}. 
. 
. * 
. 
. use "EMR JOHN deaths wo sum.dta", clear 
{txt}
{com}. 
. qui append using "EMR JOHN deaths sum.dta"
{txt}
{com}. 
. qui append using "global JOHN deaths sum.dta"
{txt}
{com}. 
. 
. *
. 
. 
. order loc_grand_name, last
{txt}
{com}. 
. gen counter = _n
{txt}
{com}. 
. reshape long v, i(loc_grand_name) 
{txt}(note: j = 1 2 3 4 5 6 7 8 9 10 11 12 13 14 15 16 17 18 19 20 21 22 23 24 25 26 27 28 29 30 31 32 33 34 35 36 37 38 39 40 41 42 43 44 45 46 47 48 49 50 51 52 53 54 55 56 57 58 59 60 61 62 63 64 65 66 67 68 69 70 71 72 73 74 75 76 77 78 79 80 81 82 83 84 85 86 87 88 89 90 91 92 93 94 95 96 97 98 99 100 101 102 103 104 105 106 107 108 109 110 111 112 113 114 115 116 117 118 119 120 121 122 123 124 125 126 127 128 129 130 131 132 133 134 135 136 137 138 139 140 141 142 143 144 145 146 147 148 149 150 151 152 153 154 155 156 157 158 159 160 161 162 163 164 165 166 167 168 169 170 171 172 173 174 175 176 177 178 179 180 181 182 183 184 185 186 187 188 189 190 191 192 193 194 195 196 197 198 199 200 201 202 203 204 205 206 207 208 209 210 211 212 213 214 215 216 217 218 219 220 221 222 223 224 225 226 227 228 229 230 231 232 233 234 235 236 237 238 239 240 241 242 243 244 245 246 247 248 249 250 251 252 253 254 255 256 257 258 259 260 261 262 263 264 265 266 267 268 269 270 271 272 273 274 275 276 277 278 279 280 281 282 283 284 285 286 287 288 289 290 291 292 293 294 295 296 297 298 299 300 301 302 303 304 305 306 307 308 309 310 311 312 313 314 315 316 317 318 319 320 321 322 323 324 325 326 327 328 329 330 331 332 333 334 335 336 337 338 339 340 341 342 343 344 345 346 347 348 349 350 351 352 353 354 355 356 357 358 359 360 361 362 363 364 365 366 367 368 369 370 371 372 373 374 375 376 377 378 379 380 381 382 383 384 385 386 387 388 389 390 391 392 393 394 395 396 397 398 399 400 401 402 403 404 405 406 407 408 409 410 411 412 413 414 415 416 417 418 419 420 421 422 423 424 425 426 427 428 429 430 431 432 433 434 435 436 437 438 439 440 441 442 443 444 445 446 447 448 449 450 451 452 453 454 455 456 457 458 459 460 461 462 463 464 465 466 467 468 469 470 471 472 473 474 475 476 477 478)

Data{col 36}wide{col 43}->{col 48}long
{hline 77}
Number of obs.                 {res}      20   {txt}->{res}    9560
{txt}Number of variables            {res}     481   {txt}->{res}       5
{txt}j variable (478 values)                   ->   {res}_j
{txt}xij variables:
                         {res}v1 v2 ... v478   {txt}->   {res}v
{txt}{hline 77}

{com}. 
. drop counter 
{txt}
{com}. 
. codebook _j

{txt}{hline}
{res}_j{right:(unlabeled)}
{txt}{hline}

{col 19}type:  numeric ({res}int{txt})

{col 18}range:  [{res}1{txt},{res}478{txt}]{col 55}units:  {res}1
{col 10}{txt}unique values:  {res}478{col 51}{txt}missing .:  {res}0{txt}/{res}9,560

{txt}{col 19}mean:{res}{col 26}   239.5
{txt}{col 15}std. dev:{res}{col 26} 137.994

{txt}{col 12}percentiles:{col 32}10%{col 42}25%{col 52}50%{col 62}75%{col 72}90%
{res}{col 27}      48{col 37}     120{col 47}   239.5{col 57}     359{col 67}     431
{txt}
{com}. 
. gen date = date("22 Jan 2020", "DMY")
{txt}
{com}. 
. replace date = date + _j - 1
{txt}(9,540 real changes made)

{com}. 
. format date %td
{txt}
{com}. 
. codebook date

{txt}{hline}
{res}date{right:(unlabeled)}
{txt}{hline}

{col 19}type:  numeric daily date ({res}float{txt})

{col 18}range:  [{res}21936{txt},{res}22413{txt}]{col 55}units:  {res}1
{col 8}{txt}or equivalently:  [{res}22jan2020{txt},{res}13may2021{txt}]{col 55}units:  {res}days
{col 10}{txt}unique values:  {res}478{col 51}{txt}missing .:  {res}0{txt}/{res}9,560

{txt}{col 19}mean:{res}{col 26} 22174.5{txt} = {res}16sep2020{txt} (+ 12 hours)
{col 15}std. dev:{res}{col 26} 137.994

{txt}{col 12}percentiles:{col 32}10%{col 42}25%{col 52}50%{col 62}75%{col 72}90%
{res}{col 27}   21983{col 37}   22055{col 47} 22174.5{col 57}   22294{col 67}   22366
{col 26}09mar2020{col 36}20may2020{col 46}16sep2020{col 56}14jan2021{col 66}27mar2021
{txt}
{com}. 
. order date 
{txt}
{com}. 
. rename v TotDeaMeRaA00S00V00
{res}{txt}
{com}. 
. label var TotDeaMeRaA00S00V00 "Total Deaths JOHN"
{txt}
{com}. 
. destring TotDeaMeRaA00S00V00, replace
{txt}TotDeaMeRaA00S00V00 already numeric; no {res}replace
{txt}
{com}. 
. list loc_grand_name TotDeaMeRaA00S00V00 if date == td(19feb2020) // Iran should be 2
{txt}
      {c TLC}{hline 22}{c -}{hline 10}{c TRC}
      {c |} {res}      loc_grand_name   TotDe~00 {txt}{c |}
      {c LT}{hline 22}{c -}{hline 10}{c RT}
  29. {c |} {res}             Algeria          0 {txt}{c |}
 507. {c |} {res}             Bahrain          0 {txt}{c |}
 985. {c |} {res}            Djibouti          0 {txt}{c |}
1463. {c |} {res}                 EMR          2 {txt}{c |}
1941. {c |} {res}               Egypt          0 {txt}{c |}
      {c LT}{hline 22}{c -}{hline 10}{c RT}
2419. {c |} {res}                Iran          2 {txt}{c |}
2897. {c |} {res}                Iraq          0 {txt}{c |}
3375. {c |} {res}              Israel          0 {txt}{c |}
3853. {c |} {res}              Jordan          0 {txt}{c |}
4331. {c |} {res}              Kuwait          0 {txt}{c |}
      {c LT}{hline 22}{c -}{hline 10}{c RT}
4809. {c |} {res}             Lebanon          0 {txt}{c |}
5287. {c |} {res}               Libya          0 {txt}{c |}
5765. {c |} {res}                Oman          0 {txt}{c |}
6243. {c |} {res}               Qatar          0 {txt}{c |}
6721. {c |} {res}        Saudi Arabia          0 {txt}{c |}
      {c LT}{hline 22}{c -}{hline 10}{c RT}
7199. {c |} {res}               Syria          0 {txt}{c |}
7677. {c |} {res}             Tunisia          0 {txt}{c |}
8155. {c |} {res}United Arab Emirates          0 {txt}{c |}
8633. {c |} {res}               Yemen          0 {txt}{c |}
9111. {c |} {res}              global       2123 {txt}{c |}
      {c BLC}{hline 22}{c -}{hline 10}{c BRC}

{com}. 
. gen DayDeaMeRaA00S00V00 =  TotDeaMeRaA00S00V00[_n] - TotDeaMeRaA00S00V00[_n-1]
{txt}(1 missing value generated)

{com}. 
. label var DayDeaMeRaA00S00V00 "Daily Deaths JOHN"
{txt}
{com}. 
. replace DayDeaMeRaA00S00V00 = TotDeaMeRaA00S00V00 if _j == 1
{txt}(20 real changes made)

{com}. 
. drop _j _merge
{txt}
{com}. 
. 
. order date loc_grand_name DayDeaMeRaA00S00V00 TotDeaMeRaA00S00V00 
{txt}
{com}.                                         
. 
. sort loc_grand_name date
{txt}
{com}. 
. save "EMR JOHN deaths.dta", replace
{txt}file EMR JOHN deaths.dta saved

{com}. 
. 
. 
. 
. * get Johns Hopkins data for cases
. 
. 
. import delimited using ///
> "https://raw.githubusercontent.com/CSSEGISandData/COVID-19/master/csse_covid_19_data/csse_covid_19_time_series/time_series_covid19_confirmed_global.csv" ///
> , clear varnames(1) colrange(2:2)
{res}{text}(1 var, 275 obs)

{com}. 
. save "time_series_covid19_confirmed_global col 2.dta", replace 
{txt}file time_series_covid19_confirmed_global col 2.dta saved

{com}. 
. 
. import delimited using ///
> "https://raw.githubusercontent.com/CSSEGISandData/COVID-19/master/csse_covid_19_data/csse_covid_19_time_series/time_series_covid19_confirmed_global.csv" ///
> , clear varnames(1) colrange(5)
{res}{text}(478 vars, 275 obs)

{com}. 
. save "time_series_covid19_confirmed_global col 5 on.dta", replace 
{txt}file time_series_covid19_confirmed_global col 5 on.dta saved

{com}. 
. 
. use "time_series_covid19_confirmed_global col 2.dta", clear 
{txt}
{com}. 
. merge 1:1 _n using "time_series_covid19_confirmed_global col 5 on.dta"
{res}
{txt}{col 5}Result{col 38}# of obs.
{col 5}{hline 41}
{col 5}not matched{col 30}{res}               0
{txt}{col 5}matched{col 30}{res}             275{txt}  (_merge==3)
{col 5}{hline 41}

{com}. 
. rename countryregion loc_grand_name
{res}{txt}
{com}. 
. qui destring *, replace
{txt}
{com}. 
. 
. 
. * gen global sum
. 
. save "global JOHN cases wo sum.dta", replace
{txt}file global JOHN cases wo sum.dta saved

{com}. 
. drop loc_grand_name
{txt}
{com}. 
. qui destring *, replace
{txt}
{com}.  
. collapse (sum) *
{txt}
{com}. 
. gen loc_grand_name = "global"
{txt}
{com}.   
. save "global JOHN cases sum.dta", replace
{txt}file global JOHN cases sum.dta saved

{com}. 
. *
. 
. 
. use "global JOHN cases wo sum.dta", clear
{txt}
{com}. 
. 
. 
. 
. keep if ///
> loc_grand_name == "Algeria" | ///
> loc_grand_name == "Bahrain" | ///
> loc_grand_name == "Djibouti" | ///
> loc_grand_name == "Egypt" | ///
> loc_grand_name == "Iran" | ///
> loc_grand_name == "Iraq" | ///
> loc_grand_name == "Israel" | ///
> loc_grand_name == "Jordan" | ///
> loc_grand_name == "Kuwait" | ///
> loc_grand_name == "Lebanon" | ///
> loc_grand_name == "Libya" | ///
> loc_grand_name == "Oman" | ///
> loc_grand_name == "Palestine" | ///
> loc_grand_name == "Qatar" | ///
> loc_grand_name == "Saudi Arabia" | ///
> loc_grand_name == "Syria" | ///
> loc_grand_name == "Tunisia" | ///
> loc_grand_name == "United Arab Emirates" | ///
> loc_grand_name == "Yemen" 
{txt}(257 observations deleted)

{com}. 
. 
. 
. * gen EMR sum
. 
. save "EMR JOHN cases wo sum.dta", replace
{txt}file EMR JOHN cases wo sum.dta saved

{com}. 
. drop loc_grand_name
{txt}
{com}. 
. qui destring *, replace
{txt}
{com}.  
. collapse (sum) *
{txt}
{com}. 
. gen loc_grand_name = "EMR"
{txt}
{com}.   
. save "EMR JOHN cases sum.dta", replace
{txt}file EMR JOHN cases sum.dta saved

{com}. 
. 
. * 
. 
. use "EMR JOHN cases wo sum.dta", clear 
{txt}
{com}. 
. qui append using "EMR JOHN cases sum.dta"
{txt}
{com}. 
. qui append using "global JOHN cases sum.dta"
{txt}
{com}. 
. 
. *
. 
. 
. 
. order loc_grand_name, last
{txt}
{com}. 
. gen counter = _n
{txt}
{com}. 
. reshape long v, i(loc_grand_name) 
{txt}(note: j = 1 2 3 4 5 6 7 8 9 10 11 12 13 14 15 16 17 18 19 20 21 22 23 24 25 26 27 28 29 30 31 32 33 34 35 36 37 38 39 40 41 42 43 44 45 46 47 48 49 50 51 52 53 54 55 56 57 58 59 60 61 62 63 64 65 66 67 68 69 70 71 72 73 74 75 76 77 78 79 80 81 82 83 84 85 86 87 88 89 90 91 92 93 94 95 96 97 98 99 100 101 102 103 104 105 106 107 108 109 110 111 112 113 114 115 116 117 118 119 120 121 122 123 124 125 126 127 128 129 130 131 132 133 134 135 136 137 138 139 140 141 142 143 144 145 146 147 148 149 150 151 152 153 154 155 156 157 158 159 160 161 162 163 164 165 166 167 168 169 170 171 172 173 174 175 176 177 178 179 180 181 182 183 184 185 186 187 188 189 190 191 192 193 194 195 196 197 198 199 200 201 202 203 204 205 206 207 208 209 210 211 212 213 214 215 216 217 218 219 220 221 222 223 224 225 226 227 228 229 230 231 232 233 234 235 236 237 238 239 240 241 242 243 244 245 246 247 248 249 250 251 252 253 254 255 256 257 258 259 260 261 262 263 264 265 266 267 268 269 270 271 272 273 274 275 276 277 278 279 280 281 282 283 284 285 286 287 288 289 290 291 292 293 294 295 296 297 298 299 300 301 302 303 304 305 306 307 308 309 310 311 312 313 314 315 316 317 318 319 320 321 322 323 324 325 326 327 328 329 330 331 332 333 334 335 336 337 338 339 340 341 342 343 344 345 346 347 348 349 350 351 352 353 354 355 356 357 358 359 360 361 362 363 364 365 366 367 368 369 370 371 372 373 374 375 376 377 378 379 380 381 382 383 384 385 386 387 388 389 390 391 392 393 394 395 396 397 398 399 400 401 402 403 404 405 406 407 408 409 410 411 412 413 414 415 416 417 418 419 420 421 422 423 424 425 426 427 428 429 430 431 432 433 434 435 436 437 438 439 440 441 442 443 444 445 446 447 448 449 450 451 452 453 454 455 456 457 458 459 460 461 462 463 464 465 466 467 468 469 470 471 472 473 474 475 476 477 478)

Data{col 36}wide{col 43}->{col 48}long
{hline 77}
Number of obs.                 {res}      20   {txt}->{res}    9560
{txt}Number of variables            {res}     481   {txt}->{res}       5
{txt}j variable (478 values)                   ->   {res}_j
{txt}xij variables:
                         {res}v1 v2 ... v478   {txt}->   {res}v
{txt}{hline 77}

{com}. 
. drop counter 
{txt}
{com}. 
. codebook _j

{txt}{hline}
{res}_j{right:(unlabeled)}
{txt}{hline}

{col 19}type:  numeric ({res}int{txt})

{col 18}range:  [{res}1{txt},{res}478{txt}]{col 55}units:  {res}1
{col 10}{txt}unique values:  {res}478{col 51}{txt}missing .:  {res}0{txt}/{res}9,560

{txt}{col 19}mean:{res}{col 26}   239.5
{txt}{col 15}std. dev:{res}{col 26} 137.994

{txt}{col 12}percentiles:{col 32}10%{col 42}25%{col 52}50%{col 62}75%{col 72}90%
{res}{col 27}      48{col 37}     120{col 47}   239.5{col 57}     359{col 67}     431
{txt}
{com}. 
. gen date = date("22 Jan 2020", "DMY")
{txt}
{com}. 
. replace date = date + _j - 1
{txt}(9,540 real changes made)

{com}. 
. format date %td
{txt}
{com}. 
. codebook date

{txt}{hline}
{res}date{right:(unlabeled)}
{txt}{hline}

{col 19}type:  numeric daily date ({res}float{txt})

{col 18}range:  [{res}21936{txt},{res}22413{txt}]{col 55}units:  {res}1
{col 8}{txt}or equivalently:  [{res}22jan2020{txt},{res}13may2021{txt}]{col 55}units:  {res}days
{col 10}{txt}unique values:  {res}478{col 51}{txt}missing .:  {res}0{txt}/{res}9,560

{txt}{col 19}mean:{res}{col 26} 22174.5{txt} = {res}16sep2020{txt} (+ 12 hours)
{col 15}std. dev:{res}{col 26} 137.994

{txt}{col 12}percentiles:{col 32}10%{col 42}25%{col 52}50%{col 62}75%{col 72}90%
{res}{col 27}   21983{col 37}   22055{col 47} 22174.5{col 57}   22294{col 67}   22366
{col 26}09mar2020{col 36}20may2020{col 46}16sep2020{col 56}14jan2021{col 66}27mar2021
{txt}
{com}. 
. order date 
{txt}
{com}. 
. rename v TotCasMeRaA00S00V00
{res}{txt}
{com}. 
. label var TotCasMeRaA00S00V00 "Total Cases JOHN"
{txt}
{com}. 
. gen DayCasMeRaA00S00V00 =  TotCasMeRaA00S00V00[_n] - TotCasMeRaA00S00V00[_n-1]
{txt}(1 missing value generated)

{com}. 
. label var DayCasMeRaA00S00V00 "Daily Cases JOHN"
{txt}
{com}. 
. replace DayCasMeRaA00S00V00 = TotCasMeRaA00S00V00 if _j == 1
{txt}(20 real changes made)

{com}. 
. drop _j _merge
{txt}
{com}. 
. 
. order date loc_grand_name DayCasMeRaA00S00V00 TotCasMeRaA00S00V00 
{txt}
{com}. 
. sort loc_grand_name date
{txt}
{com}. 
. compress
  {txt}variable {bf}date{sf} was {bf}{res}float{sf}{txt} now {bf}{res}int{sf}
  {txt}variable {bf}TotCasMeRaA00S00V00{sf} was {bf}{res}double{sf}{txt} now {bf}{res}long{sf}
  {txt}variable {bf}loc_grand_name{sf} was {bf}{res}str32{sf}{txt} now {bf}{res}str20{sf}
{txt}  (172,080 bytes saved)

{com}. 
. save "EMR JOHN Cases.dta", replace
{txt}file EMR JOHN Cases.dta saved

{com}. 
. 
. * merge deaths and cases 
. 
. use "EMR JOHN deaths.dta", clear 
{txt}
{com}. 
. merge 1:1 loc_grand_name date using "EMR JOHN Cases.dta"
{res}
{txt}{col 5}Result{col 38}# of obs.
{col 5}{hline 41}
{col 5}not matched{col 30}{res}               0
{txt}{col 5}matched{col 30}{res}           9,560{txt}  (_merge==3)
{col 5}{hline 41}

{com}. 
. drop _merge
{txt}
{com}. 
. 
. 
. 
. 
. replace loc_grand_name = "Saudi_Arabia" if loc_grand_name == "Saudi Arabia"
{txt}(478 real changes made)

{com}. replace loc_grand_name = "UAE" if loc_grand_name == "United Arab Emirates"
{txt}(478 real changes made)

{com}. 
. replace loc_grand_name = "1_Global" if loc_grand_name == "global"
{txt}(478 real changes made)

{com}. replace loc_grand_name = "2_EMR" if loc_grand_name == "EMR"
{txt}(478 real changes made)

{com}. 
. 
. 
. 
. * gen "Daily cases mean div by daily deaths mean JOHN DayCbD" for visulization of temporal relation of deaths and cases peaks 
. 
. 
. levelsof loc_grand_name, local(levels)
{txt}`"1_Global"' `"2_EMR"' `"Algeria"' `"Bahrain"' `"Djibouti"' `"Egypt"' `"Iran"' `"Iraq"' `"Israel"' `"Jordan"' `"Kuwait"' `"Lebanon"' `"Libya"' `"Oman"' `"Qatar"' `"Saudi_Arabia"' `"Syria"' `"Tunisia"' `"UAE"' `"Yemen"'

{com}. 
. foreach l of local levels {c -(}
{txt}  2{com}. 
.         di "`l'"
{txt}  3{com}.     
.         di "DayDeaMeRaA00S00V00"
{txt}  4{com}.         summ DayDeaMeRaA00S00V00 if loc_grand_name == "`l'"
{txt}  5{com}.         gen DayDeMMeRaA00S00V00_`l' = r(mean)
{txt}  6{com}.         label var DayDeMMeRaA00S00V00_`l' "Daily deaths mean JOHN DayDeM"
{txt}  7{com}.         di "                            "
{txt}  8{com}. 
.         di "DayCasMeRaA00S00V00"
{txt}  9{com}.         summ DayCasMeRaA00S00V00 if loc_grand_name == "`l'"
{txt} 10{com}.         gen DayCaMMeRaA00S00V00_`l' = r(mean)
{txt} 11{com}.         label var DayCaMMeRaA00S00V00_`l' "Daily cases mean JOHN DayCaM"
{txt} 12{com}.         di "                            "
{txt} 13{com}. 
.         di "DayCbDMeRaA00S00V00_(location)"
{txt} 14{com}.         gen DayCbDMeRaA00S00V00_`l' = DayCaMMeRaA00S00V00_`l' / DayDeMMeRaA00S00V00_`l'
{txt} 15{com}.         label var DayCbDMeRaA00S00V00_`l' "Daily cases mean div by daily deaths mean JOHN DayCbD"
{txt} 16{com}.         summ DayCbDMeRaA00S00V00_`l' if loc_grand_name == "`l'"
{txt} 17{com}.         di "                            "
{txt} 18{com}. 
.         di "DayDea_multip_(location)"
{txt} 19{com}.         gen DayDea_multip_`l' = DayDeaMeRaA00S00V00 * DayCbDMeRaA00S00V00_`l' if loc_grand_name == "`l'"
{txt} 20{com}.     label var DayDea_multip_`l' "Daily deaths scaled (times means of cases by deaths) only for visualization JOHN"
{txt} 21{com}.         summ DayDea_multip_`l' if loc_grand_name == "`l'"
{txt} 22{com}.         di "                            "
{txt} 23{com}.         
.         di "divider---------------------"
{txt} 24{com}.         di "                            "
{txt} 25{com}. 
. {c )-}
1_Global
DayDeaMeRaA00S00V00

{txt}    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayDeaMeR~00 {c |}{res}        478     6996.64     4277.95          1      17906
                            
DayCasMeRaA00S00V00

{txt}    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayCasMeR~00 {c |}{res}        478    337188.6    255933.6         98    1498213
                            
DayCbDMeRaA00S00V00_(location)

{txt}    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayCbDMeRa~l {c |}{res}        478    48.19293           0   48.19293   48.19293
                            
DayDea_multip_(location)
{txt}(9,082 missing values generated)

    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayDea_mul~l {c |}{res}        478    337188.6      206167   48.19293   862942.6
                            
divider---------------------
                            
2_EMR
DayDeaMeRaA00S00V00

{txt}    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayDeaMeR~00 {c |}{res}        478    344.0649    206.1438          0        850
                            
DayCasMeRaA00S00V00

{txt}    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayCasMeR~00 {c |}{res}        478    18281.44    12499.67          0      51903
                            
DayCbDMeRaA00S00V00_(location)

{txt}    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayCbDMeRa~R {c |}{res}        478    53.13371           0   53.13371   53.13371
                            
DayDea_multip_(location)
{txt}(9,082 missing values generated)

    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayDea_mul~R {c |}{res}        478    18281.44    10953.18          0   45163.65
                            
divider---------------------
                            
Algeria
DayDeaMeRaA00S00V00

{txt}    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayDeaMeR~00 {c |}{res}        478    7.018828    5.078179          0         30
                            
DayCasMeRaA00S00V00

{txt}    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayCasMeR~00 {c |}{res}        478    261.2741    234.1265          0       1133
                            
DayCbDMeRaA00S00V00_(location)

{txt}    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayCbDMeRa~a {c |}{res}        478    37.22474           0   37.22474   37.22474
                            
DayDea_multip_(location)
{txt}(9,082 missing values generated)

    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayDea_mul~a {c |}{res}        478    261.2741    189.0339          0   1116.742
                            
divider---------------------
                            
Bahrain
DayDeaMeRaA00S00V00

{txt}    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayDeaMeR~00 {c |}{res}        478    1.495816    1.824301          0         10
                            
DayCasMeRaA00S00V00

{txt}    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayCasMeR~00 {c |}{res}        478    410.2615    347.4263          0       1816
                            
DayCbDMeRaA00S00V00_(location)

{txt}    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayCbDMeRa~n {c |}{res}        478    274.2727           0   274.2727   274.2727
                            
DayDea_multip_(location)
{txt}(9,082 missing values generated)

    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayDea_mul~n {c |}{res}        478    410.2615    500.3561          0   2742.727
                            
divider---------------------
                            
Djibouti
DayDeaMeRaA00S00V00

{txt}    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayDeaMeR~00 {c |}{res}        478    .3158996    .9486824          0          9
                            
DayCasMeRaA00S00V00

{txt}    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayCasMeR~00 {c |}{res}        478    23.82636    50.71176          0        415
                            
DayCbDMeRaA00S00V00_(location)

{txt}    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayCbDMeRa~i {c |}{res}        478    75.42384           0   75.42384   75.42384
                            
DayDea_multip_(location)
{txt}(9,082 missing values generated)

    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayDea_mul~i {c |}{res}        478    23.82636    71.55327          0   678.8146
                            
divider---------------------
                            
Egypt
DayDeaMeRaA00S00V00

{txt}    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayDeaMeR~00 {c |}{res}        478    29.60251    23.47265          0         97
                            
DayCasMeRaA00S00V00

{txt}    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayCasMeR~00 {c |}{res}        478    506.5272    442.4576          0       1774
                            
DayCbDMeRaA00S00V00_(location)

{txt}    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayCbDMeRa~t {c |}{res}        478    17.11095           0   17.11095   17.11095
                            
DayDea_multip_(location)
{txt}(9,082 missing values generated)

    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayDea_mul~t {c |}{res}        478    506.5272    401.6395          0   1659.763
                            
divider---------------------
                            
Iran
DayDeaMeRaA00S00V00

{txt}    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayDeaMeR~00 {c |}{res}        478    159.4791    123.9665          0        496
                            
DayCasMeRaA00S00V00

{txt}    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayCasMeR~00 {c |}{res}        478    5694.575     5606.81          0      25582
                            
DayCbDMeRaA00S00V00_(location)

{txt}    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayCbDMeR~an {c |}{res}        478    35.70735           0   35.70735   35.70735
                            
DayDea_multip_(location)
{txt}(9,082 missing values generated)

    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayDea_mu~an {c |}{res}        478    5694.575    4426.517          0   17710.84
                            
divider---------------------
                            
Iraq
DayDeaMeRaA00S00V00

{txt}    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayDeaMeR~00 {c |}{res}        478    33.22803    31.03579          0        122
                            
DayCasMeRaA00S00V00

{txt}    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayCasMeR~00 {c |}{res}        478    2368.393    2139.959          0       8696
                            
DayCbDMeRaA00S00V00_(location)

{txt}    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayCbDMeRa~q {c |}{res}        478    71.27696           0   71.27696   71.27696
                            
DayDea_multip_(location)
{txt}(9,082 missing values generated)

    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayDea_mul~q {c |}{res}        478    2368.393    2212.137          0   8695.789
                            
divider---------------------
                            
Israel
DayDeaMeRaA00S00V00

{txt}    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayDeaMeR~00 {c |}{res}        478    13.34519    15.78007         -4        101
                            
DayCasMeRaA00S00V00

{txt}    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayCasMeR~00 {c |}{res}        478    1755.354    2315.062        -53      11934
                            
DayCbDMeRaA00S00V00_(location)

{txt}    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayCbDMeR~el {c |}{res}        478    131.5346           0   131.5346   131.5346
                            
DayDea_multip_(location)
{txt}(9,082 missing values generated)

    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayDea_mu~el {c |}{res}        478    1755.353    2075.624  -526.1382   13284.99
                            
divider---------------------
                            
Jordan
DayDeaMeRaA00S00V00

{txt}    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayDeaMeR~00 {c |}{res}        478    19.25314     27.3289          0        111
                            
DayCasMeRaA00S00V00

{txt}    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayCasMeR~00 {c |}{res}        478    1512.038    2200.629       -110       9535
                            
DayCbDMeRaA00S00V00_(location)

{txt}    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayCbDMe~dan {c |}{res}        478    78.53461           0   78.53461   78.53461
                            
DayDea_multip_(location)
{txt}(9,082 missing values generated)

    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayDea_m~dan {c |}{res}        478    1512.038    2146.264          0   8717.342
                            
divider---------------------
                            
Kuwait
DayDeaMeRaA00S00V00

{txt}    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayDeaMeR~00 {c |}{res}        478    3.502092    3.221227          0         14
                            
DayCasMeRaA00S00V00

{txt}    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayCasMeR~00 {c |}{res}        478    605.1109    428.2205          0       1716
                            
DayCbDMeRaA00S00V00_(location)

{txt}    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayCbDMeR~it {c |}{res}        478    172.7856           0   172.7856   172.7856
                            
DayDea_multip_(location)
{txt}(9,082 missing values generated)

    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayDea_mu~it {c |}{res}        478    605.1109    556.5816          0   2418.998
                            
divider---------------------
                            
Lebanon
DayDeaMeRaA00S00V00

{txt}    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayDeaMeR~00 {c |}{res}        478    15.83473    25.70768          0        351
                            
DayCasMeRaA00S00V00

{txt}    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayCasMeR~00 {c |}{res}        478     1119.18    1295.594          0       6154
                            
DayCbDMeRaA00S00V00_(location)

{txt}    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayCbDMeR~on {c |}{res}        478    70.67882           0   70.67882   70.67882
                            
DayDea_multip_(location)
{txt}(9,082 missing values generated)

    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayDea_mu~on {c |}{res}        478     1119.18    1816.988          0   24808.27
                            
divider---------------------
                            
Libya
DayDeaMeRaA00S00V00

{txt}    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayDeaMeR~00 {c |}{res}        478    6.453975    8.630608         -3         53
                            
DayCasMeRaA00S00V00

{txt}    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayCasMeR~00 {c |}{res}        478    379.0356    388.0397          0       1639
                            
DayCbDMeRaA00S00V00_(location)

{txt}    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayCbDMeR~ya {c |}{res}        478    58.72901           0   58.72901   58.72901
                            
DayDea_multip_(location)
{txt}(9,082 missing values generated)

    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayDea_mu~ya {c |}{res}        478    379.0356    506.8671   -176.187   3112.638
                            
divider---------------------
                            
Oman
DayDeaMeRaA00S00V00

{txt}    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayDeaMeR~00 {c |}{res}        478    4.493724     7.56876          0         67
                            
DayCasMeRaA00S00V00

{txt}    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayCasMeR~00 {c |}{res}        478    424.0858    570.9809          0       3544
                            
DayCbDMeRaA00S00V00_(location)

{txt}    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayCbDMe~man {c |}{res}        478    94.37291           0   94.37291   94.37291
                            
DayDea_multip_(location)
{txt}(9,082 missing values generated)

    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayDea_m~man {c |}{res}        478    424.0858    714.2859          0   6322.985
                            
divider---------------------
                            
Qatar
DayDeaMeRaA00S00V00

{txt}    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayDeaMeR~00 {c |}{res}        478     1.09205    1.853067          0         10
                            
DayCasMeRaA00S00V00

{txt}    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayCasMeR~00 {c |}{res}        478    444.3996    439.8052          0       2355
                            
DayCbDMeRaA00S00V00_(location)

{txt}    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayCbDMeRa~r {c |}{res}        478    406.9406           0   406.9406   406.9406
                            
DayDea_multip_(location)
{txt}(9,082 missing values generated)

    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayDea_mul~r {c |}{res}        478    444.3996    754.0882          0   4069.406
                            
divider---------------------
                            
Saudi_Arabia
DayDeaMeRaA00S00V00

{txt}    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayDeaMeR~00 {c |}{res}        478    14.89958     13.5785          0         58
                            
DayCasMeRaA00S00V00

{txt}    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayCasMeR~00 {c |}{res}        478    900.6381    1051.588          0       4919
                            
DayCbDMeRaA00S00V00_(location)

{txt}    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayCbDMe~bia {c |}{res}        478     60.4472           0    60.4472    60.4472
                            
DayDea_multip_(location)
{txt}(9,082 missing values generated)

    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayDea_m~bia {c |}{res}        478    900.6381    820.7823          0   3505.938
                            
divider---------------------
                            
Syria
DayDeaMeRaA00S00V00

{txt}    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayDeaMeR~00 {c |}{res}        478    3.518828    3.862232          0         20
                            
DayCasMeRaA00S00V00

{txt}    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayCasMeR~00 {c |}{res}        478    49.36192    45.95003          0        172
                            
DayCbDMeRaA00S00V00_(location)

{txt}    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayCbDM~yria {c |}{res}        478    14.02794           0   14.02794   14.02794
                            
DayDea_multip_(location)
{txt}(9,082 missing values generated)

    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayDea_~yria {c |}{res}        478    49.36192    54.17917          0   280.5588
                            
divider---------------------
                            
Tunisia
DayDeaMeRaA00S00V00

{txt}    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayDeaMeR~00 {c |}{res}        478    24.46234    33.09692          0        217
                            
DayCasMeRaA00S00V00

{txt}    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayCasMeR~00 {c |}{res}        478     679.546     897.059          0       5752
                            
DayCbDMeRaA00S00V00_(location)

{txt}    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayCbDMe~sia {c |}{res}        478    27.77927           0   27.77927   27.77927
                            
DayDea_multip_(location)
{txt}(9,082 missing values generated)

    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayDea_m~sia {c |}{res}        478     679.546    919.4084          0   6028.102
                            
divider---------------------
                            
UAE
DayDeaMeRaA00S00V00

{txt}    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayDeaMeR~00 {c |}{res}        478    3.395397     3.92868          0         20
                            
DayCasMeRaA00S00V00

{txt}    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayCasMeR~00 {c |}{res}        478    1134.222     1013.24          0       3977
                            
DayCbDMeRaA00S00V00_(location)

{txt}    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayCbDMeRa~E {c |}{res}        478    334.0468           0   334.0468   334.0468
                            
DayDea_multip_(location)
{txt}(9,082 missing values generated)

    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayDea_mul~E {c |}{res}        478    1134.222    1312.363          0   6680.937
                            
divider---------------------
                            
Yemen
DayDeaMeRaA00S00V00

{txt}    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayDeaMeR~00 {c |}{res}        478     2.67364    5.304381          0         52
                            
DayCasMeRaA00S00V00

{txt}    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayCasMeR~00 {c |}{res}        478    13.61297    25.42863         -1        174
                            
DayCbDMeRaA00S00V00_(location)

{txt}    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayCbDMeR~en {c |}{res}        478    5.091549           0   5.091549   5.091549
                            
DayDea_multip_(location)
{txt}(9,082 missing values generated)

    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayDea_mu~en {c |}{res}        478    13.61297    27.00751          0   264.7606
                            
divider---------------------
                            
{txt}
{com}. *
. 
. 
. * gen CFR
. 
. gen DayCfrMeRaA00S00V00 = 100 * DayDeaMeRaA00S00V00 / DayCasMeRaA00S00V00
{txt}(1,348 missing values generated)

{com}. 
. label var DayCfrMeRaA00S00V00 "Daily CFR JOHN"
{txt}
{com}. 
. di in red "negative CFR values:"
{res}{err}negative CFR values:
{txt}
{com}. 
. list date loc_grand_name DayDeaMeRaA00S00V00 DayCasMeRaA00S00V00 DayCfrMeRaA00S00V00 if DayCfrMeRaA00S00V00 < 0
{txt}
      {c TLC}{hline 11}{c -}{hline 10}{c -}{hline 10}{c -}{hline 10}{c -}{hline 11}{c TRC}
      {c |} {res}     date   loc_gr~e   DayDe~00   DayCa~00   DayCfr~00 {txt}{c |}
      {c LT}{hline 11}{c -}{hline 10}{c -}{hline 10}{c -}{hline 10}{c -}{hline 11}{c RT}
3780. {c |} {res}30mar2021     Israel         -4        514   -.7782101 {txt}{c |}
3798. {c |} {res}17apr2021     Israel         15        -53   -28.30189 {txt}{c |}
5449. {c |} {res}30jul2020      Libya         -3        216   -1.388889 {txt}{c |}
8807. {c |} {res}11aug2020      Yemen          5         -1        -500 {txt}{c |}
      {c BLC}{hline 11}{c -}{hline 10}{c -}{hline 10}{c -}{hline 10}{c -}{hline 11}{c BRC}

{com}. 
. 
. * describe CFR
. 
. levelsof loc_grand_name, local(levels)
{txt}`"1_Global"' `"2_EMR"' `"Algeria"' `"Bahrain"' `"Djibouti"' `"Egypt"' `"Iran"' `"Iraq"' `"Israel"' `"Jordan"' `"Kuwait"' `"Lebanon"' `"Libya"' `"Oman"' `"Qatar"' `"Saudi_Arabia"' `"Syria"' `"Tunisia"' `"UAE"' `"Yemen"'

{com}. 
. foreach l of local levels {c -(}
{txt}  2{com}. 
.         di "`l'"
{txt}  3{com}. 
.         tabstat DayCfrMeRaA00S00V00 if loc_grand_name == "`l'" & DayCfrMeRaA00S00V00 >= 0, stat(p25 p50 p75 iqr mean min max) varwidth(32)
{txt}  4{com}. 
.         di "divider---------------------"
{txt}  5{com}.         di "                            "
{txt}  6{com}. 
. {c )-}
1_Global

{txt}{ralign 32:variable} {...}
{c |}       p25       p50       p75       iqr      mean       min       max
{hline 33}{c +}{hline 70}
{ralign 32:DayCfrMeRaA00S00V00} {...}
{c |}{...}
 {res} 1.721499  2.159807  3.213844  1.492346  3.028122  .3395586  28.36879
{txt}{hline 33}{c BT}{hline 70}
divider---------------------
                            
2_EMR

{ralign 32:variable} {...}
{c |}       p25       p50       p75       iqr      mean       min       max
{hline 33}{c +}{hline 70}
{ralign 32:DayCfrMeRaA00S00V00} {...}
{c |}{...}
 {res} 1.365817  2.110995  2.810833  1.445016  2.671093         0       100
{txt}{hline 33}{c BT}{hline 70}
divider---------------------
                            
Algeria

{ralign 32:variable} {...}
{c |}       p25       p50       p75       iqr      mean       min       max
{hline 33}{c +}{hline 70}
{ralign 32:DayCfrMeRaA00S00V00} {...}
{c |}{...}
 {res} 1.894737  2.492236  3.940887   2.04615  4.139047         0  66.66666
{txt}{hline 33}{c BT}{hline 70}
divider---------------------
                            
Bahrain

{ralign 32:variable} {...}
{c |}       p25       p50       p75       iqr      mean       min       max
{hline 33}{c +}{hline 70}
{ralign 32:DayCfrMeRaA00S00V00} {...}
{c |}{...}
 {res}        0  .2518892  .5150214  .5150214  .3472628         0  6.666667
{txt}{hline 33}{c BT}{hline 70}
divider---------------------
                            
Djibouti

{ralign 32:variable} {...}
{c |}       p25       p50       p75       iqr      mean       min       max
{hline 33}{c +}{hline 70}
{ralign 32:DayCfrMeRaA00S00V00} {...}
{c |}{...}
 {res}        0         0         0         0   1.96344         0       100
{txt}{hline 33}{c BT}{hline 70}
divider---------------------
                            
Egypt

{ralign 32:variable} {...}
{c |}       p25       p50       p75       iqr      mean       min       max
{hline 33}{c +}{hline 70}
{ralign 32:DayCfrMeRaA00S00V00} {...}
{c |}{...}
 {res} 4.644412  6.146926  8.457711  3.813299  6.928177         0  22.22222
{txt}{hline 33}{c BT}{hline 70}
divider---------------------
                            
Iran

{ralign 32:variable} {...}
{c |}       p25       p50       p75       iqr      mean       min       max
{hline 33}{c +}{hline 70}
{ralign 32:DayCfrMeRaA00S00V00} {...}
{c |}{...}
 {res} 1.680672  3.822592  6.081477  4.400805  4.457431         0       100
{txt}{hline 33}{c BT}{hline 70}
divider---------------------
                            
Iraq

{ralign 32:variable} {...}
{c |}       p25       p50       p75       iqr      mean       min       max
{hline 33}{c +}{hline 70}
{ralign 32:DayCfrMeRaA00S00V00} {...}
{c |}{...}
 {res}    .6614  1.565558  2.521008  1.859609  2.362123         0  66.66666
{txt}{hline 33}{c BT}{hline 70}
divider---------------------
                            
Israel

{ralign 32:variable} {...}
{c |}       p25       p50       p75       iqr      mean       min       max
{hline 33}{c +}{hline 70}
{ralign 32:DayCfrMeRaA00S00V00} {...}
{c |}{...}
 {res} .4371585  .7676561   1.71371  1.276551  1.788943         0        60
{txt}{hline 33}{c BT}{hline 70}
divider---------------------
                            
Jordan

{ralign 32:variable} {...}
{c |}       p25       p50       p75       iqr      mean       min       max
{hline 33}{c +}{hline 70}
{ralign 32:DayCfrMeRaA00S00V00} {...}
{c |}{...}
 {res}        0  .7590361  1.459035  1.459035  1.339181         0       100
{txt}{hline 33}{c BT}{hline 70}
divider---------------------
                            
Kuwait

{ralign 32:variable} {...}
{c |}       p25       p50       p75       iqr      mean       min       max
{hline 33}{c +}{hline 70}
{ralign 32:DayCfrMeRaA00S00V00} {...}
{c |}{...}
 {res} .2688172  .5075301  .7513661  .4825489  .5503779         0  2.608696
{txt}{hline 33}{c BT}{hline 70}
divider---------------------
                            
Lebanon

{ralign 32:variable} {...}
{c |}       p25       p50       p75       iqr      mean       min       max
{hline 33}{c +}{hline 70}
{ralign 32:DayCfrMeRaA00S00V00} {...}
{c |}{...}
 {res}        0    .85531  1.809955  1.809955  1.698496         0        25
{txt}{hline 33}{c BT}{hline 70}
divider---------------------
                            
Libya

{ralign 32:variable} {...}
{c |}       p25       p50       p75       iqr      mean       min       max
{hline 33}{c +}{hline 70}
{ralign 32:DayCfrMeRaA00S00V00} {...}
{c |}{...}
 {res} .7173601  1.382488   2.18281   1.46545  2.366701         0       100
{txt}{hline 33}{c BT}{hline 70}
divider---------------------
                            
Oman

{ralign 32:variable} {...}
{c |}       p25       p50       p75       iqr      mean       min       max
{hline 33}{c +}{hline 70}
{ralign 32:DayCfrMeRaA00S00V00} {...}
{c |}{...}
 {res} .2808989  .7671907  1.615799    1.3349  1.167428         0  11.42857
{txt}{hline 33}{c BT}{hline 70}
divider---------------------
                            
Qatar

{ralign 32:variable} {...}
{c |}       p25       p50       p75       iqr      mean       min       max
{hline 33}{c +}{hline 70}
{ralign 32:DayCfrMeRaA00S00V00} {...}
{c |}{...}
 {res}        0         0  .4081633  .4081633  .2763784         0  16.66667
{txt}{hline 33}{c BT}{hline 70}
divider---------------------
                            
Saudi_Arabia

{ralign 32:variable} {...}
{c |}       p25       p50       p75       iqr      mean       min       max
{hline 33}{c +}{hline 70}
{ralign 32:DayCfrMeRaA00S00V00} {...}
{c |}{...}
 {res}  1.04216  1.528891  4.144038  3.101877  2.566151         0   10.6383
{txt}{hline 33}{c BT}{hline 70}
divider---------------------
                            
Syria

{ralign 32:variable} {...}
{c |}       p25       p50       p75       iqr      mean       min       max
{hline 33}{c +}{hline 70}
{ralign 32:DayCfrMeRaA00S00V00} {...}
{c |}{...}
 {res}  4.83871  6.539558  8.333333  3.494623  7.481392         0       100
{txt}{hline 33}{c BT}{hline 70}
divider---------------------
                            
Tunisia

{ralign 32:variable} {...}
{c |}       p25       p50       p75       iqr      mean       min       max
{hline 33}{c +}{hline 70}
{ralign 32:DayCfrMeRaA00S00V00} {...}
{c |}{...}
 {res}        0  2.725968  4.655571  4.655571  4.022252         0       100
{txt}{hline 33}{c BT}{hline 70}
divider---------------------
                            
UAE

{ralign 32:variable} {...}
{c |}       p25       p50       p75       iqr      mean       min       max
{hline 33}{c +}{hline 70}
{ralign 32:DayCfrMeRaA00S00V00} {...}
{c |}{...}
 {res} .1435552   .247628  .4177984  .2742432  .3409617         0  4.878049
{txt}{hline 33}{c BT}{hline 70}
divider---------------------
                            
Yemen

{ralign 32:variable} {...}
{c |}       p25       p50       p75       iqr      mean       min       max
{hline 33}{c +}{hline 70}
{ralign 32:DayCfrMeRaA00S00V00} {...}
{c |}{...}
 {res}        0  14.28571  27.88889  27.88889  24.73633         0       400
{txt}{hline 33}{c BT}{hline 70}
divider---------------------
                            

{com}. *
. 
. 
. 
. * gen Cases to deaths ratio (CTD)
. 
. gen DayCTDMeRaA00S00V00 =  DayCasMeRaA00S00V00 / DayDeaMeRaA00S00V00
{txt}(2,865 missing values generated)

{com}. label var DayCTDMeRaA00S00V00  "Daily Cases to Deaths S0 JOHN"
{txt}
{com}.         
. gen TotCTDMeRaA00S00V00 =  TotCasMeRaA00S00V00 / TotDeaMeRaA00S00V00
{txt}(1,120 missing values generated)

{com}. label var TotCTDMeRaA00S00V00  "Total Cases to Deaths S0 JOHN"
{txt}
{com}. 
. 
. 
. 
. * describe Cases to deaths ratio (CTD)
. 
. levelsof loc_grand_name, local(levels)
{txt}`"1_Global"' `"2_EMR"' `"Algeria"' `"Bahrain"' `"Djibouti"' `"Egypt"' `"Iran"' `"Iraq"' `"Israel"' `"Jordan"' `"Kuwait"' `"Lebanon"' `"Libya"' `"Oman"' `"Qatar"' `"Saudi_Arabia"' `"Syria"' `"Tunisia"' `"UAE"' `"Yemen"'

{com}. 
. foreach l of local levels {c -(}
{txt}  2{com}. 
.         di "`l'"
{txt}  3{com}. 
.         tabstat DayCTDMeRaA00S00V00 if loc_grand_name == "`l'", stat(p25 p50 p75 iqr mean min max) varwidth(32)
{txt}  4{com}.         
.         tabstat TotCTDMeRaA00S00V00 if loc_grand_name == "`l'", stat(p25 p50 p75 iqr mean min max) varwidth(32)
{txt}  5{com}.         
. 
.         di "divider---------------------"
{txt}  6{com}.         di "                            "
{txt}  7{com}. 
. {c )-}
1_Global

{txt}{ralign 32:variable} {...}
{c |}       p25       p50       p75       iqr      mean       min       max
{hline 33}{c +}{hline 70}
{ralign 32:DayCTDMeRaA00S00V00} {...}
{c |}{...}
 {res} 31.11539  46.30043  58.08892  26.97354  45.44145     3.525     294.5
{txt}{hline 33}{c BT}{hline 70}

{ralign 32:variable} {...}
{c |}       p25       p50       p75       iqr      mean       min       max
{hline 33}{c +}{hline 70}
{ralign 32:TotCTDMeRaA00S00V00} {...}
{c |}{...}
 {res} 23.88486  35.19864  45.32838  21.44352  33.91623  13.80256  49.01241
{txt}{hline 33}{c BT}{hline 70}
divider---------------------
                            
2_EMR

{ralign 32:variable} {...}
{c |}       p25       p50       p75       iqr      mean       min       max
{hline 33}{c +}{hline 70}
{ralign 32:DayCTDMeRaA00S00V00} {...}
{c |}{...}
 {res} 35.52901  47.15403  71.33417  35.80516  52.38828         1  107.1461
{txt}{hline 33}{c BT}{hline 70}

{ralign 32:variable} {...}
{c |}       p25       p50       p75       iqr      mean       min       max
{hline 33}{c +}{hline 70}
{ralign 32:TotCTDMeRaA00S00V00} {...}
{c |}{...}
 {res} 37.58972  40.14456   43.8001  6.210377  38.64859         6  53.18924
{txt}{hline 33}{c BT}{hline 70}
divider---------------------
                            
Algeria

{ralign 32:variable} {...}
{c |}       p25       p50       p75       iqr      mean       min       max
{hline 33}{c +}{hline 70}
{ralign 32:DayCTDMeRaA00S00V00} {...}
{c |}{...}
 {res}       25  38.66667  51.88889  26.88889  39.79655       1.5     137.5
{txt}{hline 33}{c BT}{hline 70}

{ralign 32:variable} {...}
{c |}       p25       p50       p75       iqr      mean       min       max
{hline 33}{c +}{hline 70}
{ralign 32:TotCTDMeRaA00S00V00} {...}
{c |}{...}
 {res} 15.69297  29.73989  36.96172  21.26875  27.25068  6.335463  37.99706
{txt}{hline 33}{c BT}{hline 70}
divider---------------------
                            
Bahrain

{ralign 32:variable} {...}
{c |}       p25       p50       p75       iqr      mean       min       max
{hline 33}{c +}{hline 70}
{ralign 32:DayCTDMeRaA00S00V00} {...}
{c |}{...}
 {res}      162  228.9167       372       210  285.0537         0      1206
{txt}{hline 33}{c BT}{hline 70}

{ralign 32:variable} {...}
{c |}       p25       p50       p75       iqr      mean       min       max
{hline 33}{c +}{hline 70}
{ralign 32:TotCTDMeRaA00S00V00} {...}
{c |}{...}
 {res} 263.6193  275.0011  286.1466  22.52728  302.9296    104.75  701.1667
{txt}{hline 33}{c BT}{hline 70}
divider---------------------
                            
Djibouti

{ralign 32:variable} {...}
{c |}       p25       p50       p75       iqr      mean       min       max
{hline 33}{c +}{hline 70}
{ralign 32:DayCTDMeRaA00S00V00} {...}
{c |}{...}
 {res} 12.66667    33.625      76.5  63.83333  55.37897         1       251
{txt}{hline 33}{c BT}{hline 70}

{ralign 32:variable} {...}
{c |}       p25       p50       p75       iqr      mean       min       max
{hline 33}{c +}{hline 70}
{ralign 32:TotCTDMeRaA00S00V00} {...}
{c |}{...}
 {res} 89.28846  93.78689  99.90476   10.6163   126.964  75.29139       560
{txt}{hline 33}{c BT}{hline 70}
divider---------------------
                            
Egypt

{ralign 32:variable} {...}
{c |}       p25       p50       p75       iqr      mean       min       max
{hline 33}{c +}{hline 70}
{ralign 32:DayCTDMeRaA00S00V00} {...}
{c |}{...}
 {res} 11.62955   16.0125  20.62306  8.993515  17.52373         0  71.18182
{txt}{hline 33}{c BT}{hline 70}

{ralign 32:variable} {...}
{c |}       p25       p50       p75       iqr      mean       min       max
{hline 33}{c +}{hline 70}
{ralign 32:TotCTDMeRaA00S00V00} {...}
{c |}{...}
 {res} 17.06242  17.55157  18.95412  1.891698  19.40472  12.98742        75
{txt}{hline 33}{c BT}{hline 70}
divider---------------------
                            
Iran

{ralign 32:variable} {...}
{c |}       p25       p50       p75       iqr      mean       min       max
{hline 33}{c +}{hline 70}
{ralign 32:DayCTDMeRaA00S00V00} {...}
{c |}{...}
 {res} 16.44337  25.49784  59.06515  42.62177   40.6011         1  152.6038
{txt}{hline 33}{c BT}{hline 70}

{ralign 32:variable} {...}
{c |}       p25       p50       p75       iqr      mean       min       max
{hline 33}{c +}{hline 70}
{ralign 32:TotCTDMeRaA00S00V00} {...}
{c |}{...}
 {res} 17.41043  19.61494  24.38686  6.976435  21.26775         1  40.15862
{txt}{hline 33}{c BT}{hline 70}
divider---------------------
                            
Iraq

{ralign 32:variable} {...}
{c |}       p25       p50       p75       iqr      mean       min       max
{hline 33}{c +}{hline 70}
{ralign 32:DayCTDMeRaA00S00V00} {...}
{c |}{...}
 {res}     37.5  61.66538  128.2439   90.7439   90.0108         0    592.25
{txt}{hline 33}{c BT}{hline 70}

{ralign 32:variable} {...}
{c |}       p25       p50       p75       iqr      mean       min       max
{hline 33}{c +}{hline 70}
{ralign 32:TotCTDMeRaA00S00V00} {...}
{c |}{...}
 {res} 26.63032  40.73255  47.25653  20.62621   38.7735     8.875  71.27696
{txt}{hline 33}{c BT}{hline 70}
divider---------------------
                            
Israel

{ralign 32:variable} {...}
{c |}       p25       p50       p75       iqr      mean       min       max
{hline 33}{c +}{hline 70}
{ralign 32:DayCTDMeRaA00S00V00} {...}
{c |}{...}
 {res} 49.54167     115.5  181.7083  132.1667  140.9988    -128.5      1146
{txt}{hline 33}{c BT}{hline 70}

{ralign 32:variable} {...}
{c |}       p25       p50       p75       iqr      mean       min       max
{hline 33}{c +}{hline 70}
{ralign 32:TotCTDMeRaA00S00V00} {...}
{c |}{...}
 {res} 117.1461  126.1067  134.9891    17.843  129.3423  58.64685      1249
{txt}{hline 33}{c BT}{hline 70}
divider---------------------
                            
Jordan

{ralign 32:variable} {...}
{c |}       p25       p50       p75       iqr      mean       min       max
{hline 33}{c +}{hline 70}
{ralign 32:DayCTDMeRaA00S00V00} {...}
{c |}{...}
 {res}     54.9  75.71875  119.5714  64.67142  93.69354         0       634
{txt}{hline 33}{c BT}{hline 70}

{ralign 32:variable} {...}
{c |}       p25       p50       p75       iqr      mean       min       max
{hline 33}{c +}{hline 70}
{ralign 32:TotCTDMeRaA00S00V00} {...}
{c |}{...}
 {res}  77.0597  84.67809  111.4452  34.38546   95.0214  51.11111       246
{txt}{hline 33}{c BT}{hline 70}
divider---------------------
                            
Kuwait

{ralign 32:variable} {...}
{c |}       p25       p50       p75       iqr      mean       min       max
{hline 33}{c +}{hline 70}
{ralign 32:DayCTDMeRaA00S00V00} {...}
{c |}{...}
 {res}      122  173.2321       247       125  217.6176  38.33333       919
{txt}{hline 33}{c BT}{hline 70}

{ralign 32:variable} {...}
{c |}       p25       p50       p75       iqr      mean       min       max
{hline 33}{c +}{hline 70}
{ralign 32:TotCTDMeRaA00S00V00} {...}
{c |}{...}
 {res} 150.2089  163.0187  175.1276  24.91872  179.8469  120.6364      1234
{txt}{hline 33}{c BT}{hline 70}
divider---------------------
                            
Lebanon

{ralign 32:variable} {...}
{c |}       p25       p50       p75       iqr      mean       min       max
{hline 33}{c +}{hline 70}
{ralign 32:DayCTDMeRaA00S00V00} {...}
{c |}{...}
 {res}       46  71.44379  134.5652  88.56522  108.8155         4      1360
{txt}{hline 33}{c BT}{hline 70}

{ralign 32:variable} {...}
{c |}       p25       p50       p75       iqr      mean       min       max
{hline 33}{c +}{hline 70}
{ralign 32:TotCTDMeRaA00S00V00} {...}
{c |}{...}
 {res} 52.02778  78.45539  115.3629  63.33516  82.58695  20.33333  136.5479
{txt}{hline 33}{c BT}{hline 70}
divider---------------------
                            
Libya

{ralign 32:variable} {...}
{c |}       p25       p50       p75       iqr      mean       min       max
{hline 33}{c +}{hline 70}
{ralign 32:DayCTDMeRaA00S00V00} {...}
{c |}{...}
 {res} 40.76191  63.66667  98.63636  57.87445  80.50438       -72       622
{txt}{hline 33}{c BT}{hline 70}

{ralign 32:variable} {...}
{c |}       p25       p50       p75       iqr      mean       min       max
{hline 33}{c +}{hline 70}
{ralign 32:TotCTDMeRaA00S00V00} {...}
{c |}{...}
 {res} 46.30088    60.624  65.48189    19.181  55.04636        11      78.6
{txt}{hline 33}{c BT}{hline 70}
divider---------------------
                            
Oman

{ralign 32:variable} {...}
{c |}       p25       p50       p75       iqr      mean       min       max
{hline 33}{c +}{hline 70}
{ralign 32:DayCTDMeRaA00S00V00} {...}
{c |}{...}
 {res}     51.5  100.6667       178     126.5  143.9773      8.75      1082
{txt}{hline 33}{c BT}{hline 70}

{ralign 32:variable} {...}
{c |}       p25       p50       p75       iqr      mean       min       max
{hline 33}{c +}{hline 70}
{ralign 32:TotCTDMeRaA00S00V00} {...}
{c |}{...}
 {res} 89.98038  98.05101   193.791  103.8107  133.7702  85.65003    254.75
{txt}{hline 33}{c BT}{hline 70}
divider---------------------
                            
Qatar

{ralign 32:variable} {...}
{c |}       p25       p50       p75       iqr      mean       min       max
{hline 33}{c +}{hline 70}
{ralign 32:DayCTDMeRaA00S00V00} {...}
{c |}{...}
 {res}    143.6    238.75       463     319.4  335.5738         6      1554
{txt}{hline 33}{c BT}{hline 70}

{ralign 32:variable} {...}
{c |}       p25       p50       p75       iqr      mean       min       max
{hline 33}{c +}{hline 70}
{ralign 32:TotCTDMeRaA00S00V00} {...}
{c |}{...}
 {res} 583.4362  600.8457  654.8785  71.44229  722.1672  316.3333  2373.733
{txt}{hline 33}{c BT}{hline 70}
divider---------------------
                            
Saudi_Arabia

{ralign 32:variable} {...}
{c |}       p25       p50       p75       iqr      mean       min       max
{hline 33}{c +}{hline 70}
{ralign 32:DayCTDMeRaA00S00V00} {...}
{c |}{...}
 {res} 23.81482  63.66667  88.86487  65.05005  71.18964       9.4  407.6667
{txt}{hline 33}{c BT}{hline 70}

{ralign 32:variable} {...}
{c |}       p25       p50       p75       iqr      mean       min       max
{hline 33}{c +}{hline 70}
{ralign 32:TotCTDMeRaA00S00V00} {...}
{c |}{...}
 {res} 58.75806  66.09255  98.58203  39.82397  87.82373  57.66693       767
{txt}{hline 33}{c BT}{hline 70}
divider---------------------
                            
Syria

{ralign 32:variable} {...}
{c |}       p25       p50       p75       iqr      mean       min       max
{hline 33}{c +}{hline 70}
{ralign 32:DayCTDMeRaA00S00V00} {...}
{c |}{...}
 {res} 11.66667  14.36667      17.5  5.833333   15.4232         0        72
{txt}{hline 33}{c BT}{hline 70}

{ralign 32:variable} {...}
{c |}       p25       p50       p75       iqr      mean       min       max
{hline 33}{c +}{hline 70}
{ralign 32:TotCTDMeRaA00S00V00} {...}
{c |}{...}
 {res} 15.00652      17.5  21.23721  6.230692  18.69036         5  34.66667
{txt}{hline 33}{c BT}{hline 70}
divider---------------------
                            
Tunisia

{ralign 32:variable} {...}
{c |}       p25       p50       p75       iqr      mean       min       max
{hline 33}{c +}{hline 70}
{ralign 32:DayCTDMeRaA00S00V00} {...}
{c |}{...}
 {res} 18.16216  26.25641  40.29268  22.13052  35.60129         0     244.6
{txt}{hline 33}{c BT}{hline 70}

{ralign 32:variable} {...}
{c |}       p25       p50       p75       iqr      mean       min       max
{hline 33}{c +}{hline 70}
{ralign 32:TotCTDMeRaA00S00V00} {...}
{c |}{...}
 {res} 27.09091  29.24775  34.23077   7.13986  34.15255  21.35294  75.88406
{txt}{hline 33}{c BT}{hline 70}
divider---------------------
                            
UAE

{ralign 32:variable} {...}
{c |}       p25       p50       p75       iqr      mean       min       max
{hline 33}{c +}{hline 70}
{ralign 32:DayCTDMeRaA00S00V00} {...}
{c |}{...}
 {res}      225  364.1667       577       352  426.4704         0      1563
{txt}{hline 33}{c BT}{hline 70}

{ralign 32:variable} {...}
{c |}       p25       p50       p75       iqr      mean       min       max
{hline 33}{c +}{hline 70}
{ralign 32:TotCTDMeRaA00S00V00} {...}
{c |}{...}
 {res} 168.0631  247.2809  311.2669  143.2038  238.0931        70  359.5811
{txt}{hline 33}{c BT}{hline 70}
divider---------------------
                            
Yemen

{ralign 32:variable} {...}
{c |}       p25       p50       p75       iqr      mean       min       max
{hline 33}{c +}{hline 70}
{ralign 32:DayCTDMeRaA00S00V00} {...}
{c |}{...}
 {res}        2  4.666667  7.214286  5.214286  5.819948       -.2        41
{txt}{hline 33}{c BT}{hline 70}

{ralign 32:variable} {...}
{c |}       p25       p50       p75       iqr      mean       min       max
{hline 33}{c +}{hline 70}
{ralign 32:TotCTDMeRaA00S00V00} {...}
{c |}{...}
 {res} 3.447155  3.492674  4.323651  .8764968  3.946736         3  7.083333
{txt}{hline 33}{c BT}{hline 70}
divider---------------------
                            

{com}. *
. 
. 
. 
. 
. 
. 
. 
. 
. * smooth 
. 
. encode loc_grand_name, gen(loc_grand_name_numeric)
{txt}
{com}. 
. tsset loc_grand_name_numeric date, daily   
{res}{txt}{col 8}panel variable:  {res}loc_grand_name_numeric (strongly balanced)
{txt}{col 9}time variable:  {res}{col 25}date, 22jan2020 to 13may2021
{txt}{col 17}delta:  {res}1 day
{txt}
{com}. 
. 
. tssmooth ma DayDeaMeRaA00S00V00_window = DayDeaMeRaA00S00V00 if DayDeaMeRaA00S00V00 >= 0, window(3 1 3)
{txt}The smoother applied was
{res}{p 5 5 5} by loc_grand_name_numeric : (1/7)*[x(t-3) + x(t-2) + x(t-1) + 1*x(t) + x(t+1) + x(t+2) + x(t+3)]; x(t)= DayDeaMeRaA00S00V00 {p_end}
{txt}
{com}. 
. tssmooth ma DayDeaMeSmA00S00V00 = DayDeaMeRaA00S00V00_window, weights( 1 2 3 <4> 3 2 1) replace
{txt}The smoother applied was
{res}{p 5 5 5} by loc_grand_name_numeric : (1/16)*[1*x(t-3) + 2*x(t-2) + 3*x(t-1) + 4*x(t) + 3*x(t+1) + 2*x(t+2) + ...; x(t)= DayDeaMeRaA00S00V00_window
{txt}
{smcl}
{com}. 
. label var DayDeaMeSmA00S00V00 "Daily deaths mean smooth JOHN"
{txt}
{com}. 
. drop DayDeaMeRaA00S00V00_window
{txt}
{com}. 
. 
. tssmooth ma DayCasMeRaA00S00V00_window = DayCasMeRaA00S00V00 if DayCasMeRaA00S00V00 >= 0, window(3 1 3)
{txt}The smoother applied was
{res}{p 5 5 5} by loc_grand_name_numeric : (1/7)*[x(t-3) + x(t-2) + x(t-1) + 1*x(t) + x(t+1) + x(t+2) + x(t+3)]; x(t)= DayCasMeRaA00S00V00 {p_end}
{txt}
{com}. 
. tssmooth ma DayCasMeSmA00S00V00 = DayCasMeRaA00S00V00_window, weights( 1 2 3 <4> 3 2 1) replace
{txt}The smoother applied was
{res}{p 5 5 5} by loc_grand_name_numeric : (1/16)*[1*x(t-3) + 2*x(t-2) + 3*x(t-1) + 4*x(t) + 3*x(t+1) + 2*x(t+2) + ...; x(t)= DayCasMeRaA00S00V00_window
{txt}
{smcl}
{com}. 
. label var DayCasMeSmA00S00V00 "Daily cases mean smooth JOHN"
{txt}
{com}. 
. drop DayCasMeRaA00S00V00_window
{txt}
{com}. 
. 
. tssmooth ma DayCfrMeRaA00S00V00_window = DayCfrMeRaA00S00V00 if DayCfrMeRaA00S00V00 >= 0, window(3 1 3)
{txt}The smoother applied was
{res}{p 5 5 5} by loc_grand_name_numeric : (1/7)*[x(t-3) + x(t-2) + x(t-1) + 1*x(t) + x(t+1) + x(t+2) + x(t+3)]; x(t)= DayCfrMeRaA00S00V00 {p_end}
{txt}
{com}. 
. tssmooth ma DayCfrMeSmA00S00V00 = DayCfrMeRaA00S00V00_window, weights( 1 2 3 <4> 3 2 1) replace
{txt}The smoother applied was
{res}{p 5 5 5} by loc_grand_name_numeric : (1/16)*[1*x(t-3) + 2*x(t-2) + 3*x(t-1) + 4*x(t) + 3*x(t+1) + 2*x(t+2) + ...; x(t)= DayCfrMeRaA00S00V00_window
{txt}
{smcl}
{com}. 
. label var DayCfrMeSmA00S00V00 "Daily CFR mean smooth JOHN"
{txt}
{com}. 
. drop DayCfrMeRaA00S00V00_window
{txt}
{com}. 
. 
. tssmooth ma DayCTDMeRaA00S00V00_window = DayCTDMeRaA00S00V00 if DayCTDMeRaA00S00V00 >= 0, window(3 1 3)
{txt}The smoother applied was
{res}{p 5 5 5} by loc_grand_name_numeric : (1/7)*[x(t-3) + x(t-2) + x(t-1) + 1*x(t) + x(t+1) + x(t+2) + x(t+3)]; x(t)= DayCTDMeRaA00S00V00 {p_end}
{txt}
{com}. 
. tssmooth ma DayCTDMeSmA00S00V00 = DayCTDMeRaA00S00V00_window, weights( 1 2 3 <4> 3 2 1) replace
{txt}The smoother applied was
{res}{p 5 5 5} by loc_grand_name_numeric : (1/16)*[1*x(t-3) + 2*x(t-2) + 3*x(t-1) + 4*x(t) + 3*x(t+1) + 2*x(t+2) + ...; x(t)= DayCTDMeRaA00S00V00_window
{txt}
{smcl}
{com}. 
. label var DayCTDMeSmA00S00V00 "Daily CTD mean smooth JOHN"
{txt}
{com}. 
. drop DayCTDMeRaA00S00V00_window
{txt}
{com}. 
. 
. 
. tssmooth ma TotCTDMeRaA00S00V00_window = TotCTDMeRaA00S00V00 if TotCTDMeRaA00S00V00 >= 0, window(3 1 3)
{txt}The smoother applied was
{res}{p 5 5 5} by loc_grand_name_numeric : (1/7)*[x(t-3) + x(t-2) + x(t-1) + 1*x(t) + x(t+1) + x(t+2) + x(t+3)]; x(t)= TotCTDMeRaA00S00V00 {p_end}
{txt}
{com}. 
. tssmooth ma TotCTDMeSmA00S00V00 = TotCTDMeRaA00S00V00_window, weights( 1 2 3 <4> 3 2 1) replace
{txt}The smoother applied was
{res}{p 5 5 5} by loc_grand_name_numeric : (1/16)*[1*x(t-3) + 2*x(t-2) + 3*x(t-1) + 4*x(t) + 3*x(t+1) + 2*x(t+2) + ...; x(t)= TotCTDMeRaA00S00V00_window
{txt}
{smcl}
{com}. 
. label var TotCTDMeSmA00S00V00 "Total CTD mean smooth JOHN"
{txt}
{com}. 
. drop TotCTDMeRaA00S00V00_window
{txt}
{com}. 
. 
. 
. 
. levelsof loc_grand_name, local(levels)
{txt}`"1_Global"' `"2_EMR"' `"Algeria"' `"Bahrain"' `"Djibouti"' `"Egypt"' `"Iran"' `"Iraq"' `"Israel"' `"Jordan"' `"Kuwait"' `"Lebanon"' `"Libya"' `"Oman"' `"Qatar"' `"Saudi_Arabia"' `"Syria"' `"Tunisia"' `"UAE"' `"Yemen"'

{com}. 
. foreach l of local levels {c -(}
{txt}  2{com}. 
.         tssmooth ma DayDea_multip_`l'_w = DayDea_multip_`l' if (DayDea_multip_`l' >= 0) & (loc_grand_name == "`l'"), window(3 1 3)
{txt}  3{com}. 
.         tssmooth ma DayDea_multip_`l'_sm = DayDea_multip_`l'_w if (loc_grand_name == "`l'"), weights( 1 2 3 <4> 3 2 1) replace
{txt}  4{com}. 
.         label var DayDea_multip_`l'_w "Daily deaths scaled smooth only for visualization JOHN"
{txt}  5{com}. 
.         drop DayDea_multip_`l'_w 
{txt}  6{com}. {c )-}
{txt}The smoother applied was
{res}{p 5 5 5}(1/7)*[x(t-3) + x(t-2) + x(t-1) + 1*x(t) + x(t+1) + x(t+2) + x(t+3)]; x(t)= DayDea_multip_1_Global {p_end}
{txt}The smoother applied was
{res}{p 5 5 5}(1/16)*[1*x(t-3) + 2*x(t-2) + 3*x(t-1) + 4*x(t) + 3*x(t+1) + 2*x(t+2) + ...; x(t)= DayDea_multip_1_Global_w 
{txt}The smoother applied was
{res}{p 5 5 5}(1/7)*[x(t-3) + x(t-2) + x(t-1) + 1*x(t) + x(t+1) + x(t+2) + x(t+3)]; x(t)= DayDea_multip_2_EMR {p_end}
{txt}The smoother applied was
{res}{p 5 5 5}(1/16)*[1*x(t-3) + 2*x(t-2) + 3*x(t-1) + 4*x(t) + 3*x(t+1) + 2*x(t+2) + ...; x(t)= DayDea_multip_2_EMR_w 
{txt}The smoother applied was
{res}{p 5 5 5}(1/7)*[x(t-3) + x(t-2) + x(t-1) + 1*x(t) + x(t+1) + x(t+2) + x(t+3)]; x(t)= DayDea_multip_Algeria {p_end}
{txt}The smoother applied was
{res}{p 5 5 5}(1/16)*[1*x(t-3) + 2*x(t-2) + 3*x(t-1) + 4*x(t) + 3*x(t+1) + 2*x(t+2) + ...; x(t)= DayDea_multip_Algeria_w 
{txt}The smoother applied was
{res}{p 5 5 5}(1/7)*[x(t-3) + x(t-2) + x(t-1) + 1*x(t) + x(t+1) + x(t+2) + x(t+3)]; x(t)= DayDea_multip_Bahrain {p_end}
{txt}The smoother applied was
{res}{p 5 5 5}(1/16)*[1*x(t-3) + 2*x(t-2) + 3*x(t-1) + 4*x(t) + 3*x(t+1) + 2*x(t+2) + ...; x(t)= DayDea_multip_Bahrain_w 
{txt}The smoother applied was
{res}{p 5 5 5}(1/7)*[x(t-3) + x(t-2) + x(t-1) + 1*x(t) + x(t+1) + x(t+2) + x(t+3)]; x(t)= DayDea_multip_Djibouti {p_end}
{txt}The smoother applied was
{res}{p 5 5 5}(1/16)*[1*x(t-3) + 2*x(t-2) + 3*x(t-1) + 4*x(t) + 3*x(t+1) + 2*x(t+2) + ...; x(t)= DayDea_multip_Djibouti_w 
{txt}The smoother applied was
{res}{p 5 5 5}(1/7)*[x(t-3) + x(t-2) + x(t-1) + 1*x(t) + x(t+1) + x(t+2) + x(t+3)]; x(t)= DayDea_multip_Egypt {p_end}
{txt}The smoother applied was
{res}{p 5 5 5}(1/16)*[1*x(t-3) + 2*x(t-2) + 3*x(t-1) + 4*x(t) + 3*x(t+1) + 2*x(t+2) + ...; x(t)= DayDea_multip_Egypt_w 
{txt}The smoother applied was
{res}{p 5 5 5}(1/7)*[x(t-3) + x(t-2) + x(t-1) + 1*x(t) + x(t+1) + x(t+2) + x(t+3)]; x(t)= DayDea_multip_Iran {p_end}
{txt}The smoother applied was
{res}{p 5 5 5}(1/16)*[1*x(t-3) + 2*x(t-2) + 3*x(t-1) + 4*x(t) + 3*x(t+1) + 2*x(t+2) + ...; x(t)= DayDea_multip_Iran_w 
{txt}The smoother applied was
{res}{p 5 5 5}(1/7)*[x(t-3) + x(t-2) + x(t-1) + 1*x(t) + x(t+1) + x(t+2) + x(t+3)]; x(t)= DayDea_multip_Iraq {p_end}
{txt}The smoother applied was
{res}{p 5 5 5}(1/16)*[1*x(t-3) + 2*x(t-2) + 3*x(t-1) + 4*x(t) + 3*x(t+1) + 2*x(t+2) + ...; x(t)= DayDea_multip_Iraq_w 
{txt}The smoother applied was
{res}{p 5 5 5}(1/7)*[x(t-3) + x(t-2) + x(t-1) + 1*x(t) + x(t+1) + x(t+2) + x(t+3)]; x(t)= DayDea_multip_Israel {p_end}
{txt}The smoother applied was
{res}{p 5 5 5}(1/16)*[1*x(t-3) + 2*x(t-2) + 3*x(t-1) + 4*x(t) + 3*x(t+1) + 2*x(t+2) + ...; x(t)= DayDea_multip_Israel_w 
{txt}The smoother applied was
{res}{p 5 5 5}(1/7)*[x(t-3) + x(t-2) + x(t-1) + 1*x(t) + x(t+1) + x(t+2) + x(t+3)]; x(t)= DayDea_multip_Jordan {p_end}
{txt}The smoother applied was
{res}{p 5 5 5}(1/16)*[1*x(t-3) + 2*x(t-2) + 3*x(t-1) + 4*x(t) + 3*x(t+1) + 2*x(t+2) + ...; x(t)= DayDea_multip_Jordan_w 
{txt}The smoother applied was
{res}{p 5 5 5}(1/7)*[x(t-3) + x(t-2) + x(t-1) + 1*x(t) + x(t+1) + x(t+2) + x(t+3)]; x(t)= DayDea_multip_Kuwait {p_end}
{txt}The smoother applied was
{res}{p 5 5 5}(1/16)*[1*x(t-3) + 2*x(t-2) + 3*x(t-1) + 4*x(t) + 3*x(t+1) + 2*x(t+2) + ...; x(t)= DayDea_multip_Kuwait_w 
{txt}The smoother applied was
{res}{p 5 5 5}(1/7)*[x(t-3) + x(t-2) + x(t-1) + 1*x(t) + x(t+1) + x(t+2) + x(t+3)]; x(t)= DayDea_multip_Lebanon {p_end}
{txt}The smoother applied was
{res}{p 5 5 5}(1/16)*[1*x(t-3) + 2*x(t-2) + 3*x(t-1) + 4*x(t) + 3*x(t+1) + 2*x(t+2) + ...; x(t)= DayDea_multip_Lebanon_w 
{txt}The smoother applied was
{res}{p 5 5 5}(1/7)*[x(t-3) + x(t-2) + x(t-1) + 1*x(t) + x(t+1) + x(t+2) + x(t+3)]; x(t)= DayDea_multip_Libya {p_end}
{txt}The smoother applied was
{res}{p 5 5 5}(1/16)*[1*x(t-3) + 2*x(t-2) + 3*x(t-1) + 4*x(t) + 3*x(t+1) + 2*x(t+2) + ...; x(t)= DayDea_multip_Libya_w 
{txt}The smoother applied was
{res}{p 5 5 5}(1/7)*[x(t-3) + x(t-2) + x(t-1) + 1*x(t) + x(t+1) + x(t+2) + x(t+3)]; x(t)= DayDea_multip_Oman {p_end}
{txt}The smoother applied was
{res}{p 5 5 5}(1/16)*[1*x(t-3) + 2*x(t-2) + 3*x(t-1) + 4*x(t) + 3*x(t+1) + 2*x(t+2) + ...; x(t)= DayDea_multip_Oman_w 
{txt}The smoother applied was
{res}{p 5 5 5}(1/7)*[x(t-3) + x(t-2) + x(t-1) + 1*x(t) + x(t+1) + x(t+2) + x(t+3)]; x(t)= DayDea_multip_Qatar {p_end}
{txt}The smoother applied was
{res}{p 5 5 5}(1/16)*[1*x(t-3) + 2*x(t-2) + 3*x(t-1) + 4*x(t) + 3*x(t+1) + 2*x(t+2) + ...; x(t)= DayDea_multip_Qatar_w 
{txt}The smoother applied was
{res}{p 5 5 5}(1/7)*[x(t-3) + x(t-2) + x(t-1) + 1*x(t) + x(t+1) + x(t+2) + x(t+3)]; x(t)= DayDea_multip_Saudi_Arabia {p_end}
{txt}The smoother applied was
{res}{p 5 5 5}(1/16)*[1*x(t-3) + 2*x(t-2) + 3*x(t-1) + 4*x(t) + 3*x(t+1) + 2*x(t+2) + ...; x(t)= DayDea_multip_Saudi_Arabia_w 
{txt}The smoother applied was
{res}{p 5 5 5}(1/7)*[x(t-3) + x(t-2) + x(t-1) + 1*x(t) + x(t+1) + x(t+2) + x(t+3)]; x(t)= DayDea_multip_Syria {p_end}
{txt}The smoother applied was
{res}{p 5 5 5}(1/16)*[1*x(t-3) + 2*x(t-2) + 3*x(t-1) + 4*x(t) + 3*x(t+1) + 2*x(t+2) + ...; x(t)= DayDea_multip_Syria_w 
{txt}The smoother applied was
{res}{p 5 5 5}(1/7)*[x(t-3) + x(t-2) + x(t-1) + 1*x(t) + x(t+1) + x(t+2) + x(t+3)]; x(t)= DayDea_multip_Tunisia {p_end}
{txt}The smoother applied was
{res}{p 5 5 5}(1/16)*[1*x(t-3) + 2*x(t-2) + 3*x(t-1) + 4*x(t) + 3*x(t+1) + 2*x(t+2) + ...; x(t)= DayDea_multip_Tunisia_w 
{txt}The smoother applied was
{res}{p 5 5 5}(1/7)*[x(t-3) + x(t-2) + x(t-1) + 1*x(t) + x(t+1) + x(t+2) + x(t+3)]; x(t)= DayDea_multip_UAE {p_end}
{txt}The smoother applied was
{res}{p 5 5 5}(1/16)*[1*x(t-3) + 2*x(t-2) + 3*x(t-1) + 4*x(t) + 3*x(t+1) + 2*x(t+2) + ...; x(t)= DayDea_multip_UAE_w 
{txt}The smoother applied was
{res}{p 5 5 5}(1/7)*[x(t-3) + x(t-2) + x(t-1) + 1*x(t) + x(t+1) + x(t+2) + x(t+3)]; x(t)= DayDea_multip_Yemen {p_end}
{txt}The smoother applied was
{res}{p 5 5 5}(1/16)*[1*x(t-3) + 2*x(t-2) + 3*x(t-1) + 4*x(t) + 3*x(t+1) + 2*x(t+2) + ...; x(t)= DayDea_multip_Yemen_w 
{txt}
{smcl}
{com}. * 
. 
. 
. * 
. 
. tsset, clear
{txt}
{com}. 
. 
. 
. sort date loc_grand_name
{txt}
{com}. 
. qui compress
{txt}
{com}. 
. 
. 
. save "EMR JOHN.dta", replace
{txt}file EMR JOHN.dta saved

{com}. 
. 
. 
. 
. 
. 
. 
. **************
. 
. * graphs
. 
. ssc install grstyle, replace
{txt}checking {hilite:grstyle} consistency and verifying not already installed...
all files already exist and are up to date.

{com}. 
. grstyle init
{res}{txt}
{com}. 
. grstyle color background white
{txt}
{com}. 
. 
. 
. 
. 
. 
. 
. * adjust x axis ticks from Jan 2020 to this month and avoid globals
. forval i = 1(1)12 {c -(}
{txt}  2{com}.         local date2020 = mdy(`i', 1, 2020)
{txt}  3{com}.         local dates2020 `dates2020' `date2020'
{txt}  4{com}. {c )-}
{txt}
{com}. local wanted : di %tdNN daily("$S_DATE", "DMY")
{res}{txt}
{com}. forval i = 1(1)`wanted' {c -(}
{txt}  2{com}.         local date2021 = mdy(`i', 1, 2021)
{txt}  3{com}.         local dates2021 `dates2021' `date2021'
{txt}  4{com}. {c )-}
{txt}
{com}. *
. 
. 
. 
. 
. levelsof loc_grand_name, local(levels)
{txt}`"1_Global"' `"2_EMR"' `"Algeria"' `"Bahrain"' `"Djibouti"' `"Egypt"' `"Iran"' `"Iraq"' `"Israel"' `"Jordan"' `"Kuwait"' `"Lebanon"' `"Libya"' `"Oman"' `"Qatar"' `"Saudi_Arabia"' `"Syria"' `"Tunisia"' `"UAE"' `"Yemen"'

{com}. 
. foreach l of local levels {c -(}
{txt}  2{com}. 
. 
. 
. ** DayCas DayDea DayDea_multip
. 
. 
. * DayCas DayDea DayDea_multip, all raw
. 
. twoway ///
> (line DayCasMeRaA00S00V00 date, sort lcolor(blue)) ///
> (line DayDeaMeRaA00S00V00 date, sort lcolor(red)) ///
> (line DayDea_multip_`l' date, sort lpattern(dot) lcolor(red)) ///
> if date > td(01jan2020) & loc_grand_name == "`l'" ///
> , xtitle(Date) xlabel(`dates2020' `dates2021', format(%tdYY-NN-DD) labsize(small)) xlabel(, grid) xlabel(, grid) ///
> xlabel(, angle(forty_five)) ylabel(, format(%12.0fc) labsize(small)) ylabel(, labsize(small) angle(horizontal)) ///
> ytitle(Daily cases and deaths) title("COVID-19 daily cases and deaths, `l', Johns Hopkins", size(medium)) ///
> xscale(lwidth(vthin) lcolor(gray*.2)) yscale(lwidth(vthin) lcolor(gray*.2)) yscale(titlegap(4)) legend(region(lcolor(none)))  ///
> legend(order(1 "Daily cases" 2 "Daily deaths" 3 "Daily deaths scaled for visualization") size(small)) ///
> subtitle("Daily deaths, scaled = times (means of cases divided by deaths) for visualization only", size(small))
{txt}  3{com}. 
. qui graph save "graph 1 COVID-19 daily deaths and cases `l' Johns Hopkins.gph", replace
{txt}  4{com}. qui graph export "graph 1 COVID-19 daily deaths and cases `l' Johns Hopkins.pdf", replace
{txt}  5{com}. 
. 
. 
. 
. 
. * DayCas DayDea DayDea_multip, all smooth
. 
. twoway ///
> (line DayCasMeSmA00S00V00 date, sort lcolor(blue)) ///
> (line DayDeaMeSmA00S00V00 date, sort lcolor(red)) ///
> (line DayDea_multip_`l'_sm date, sort lpattern(dot) lcolor(red)) ///
> if date > td(01jan2020) & loc_grand_name == "`l'" ///
> , xtitle(Date) xlabel(`dates2020' `dates2021', format(%tdYY-NN-DD) labsize(small)) xlabel(, grid) xlabel(, grid) ///
> xlabel(, angle(forty_five)) ylabel(, format(%12.0fc) labsize(small)) ylabel(, labsize(small) angle(horizontal)) ///
> ytitle(Daily cases and deaths smoothed) title("COVID-19 daily cases and deaths smoothed, `l', Johns Hopkins", size(medium)) ///
> xscale(lwidth(vthin) lcolor(gray*.2)) yscale(lwidth(vthin) lcolor(gray*.2)) yscale(titlegap(4)) legend(region(lcolor(none)))  ///
> legend(order(1 "Daily cases smoothed" 2 "Daily deaths smoothed" 3 "Daily deaths scaled for visualization, smoothed") size(small)) ///
> subtitle("Daily deaths, scaled = times (means of cases divided by deaths) for visualization only, smoothed", size(small))
{txt}  6{com}. 
. qui graph save "graph 2 COVID-19 daily deaths and cases smoothed `l' Johns Hopkins.gph", replace
{txt}  7{com}. qui graph export "graph 2 COVID-19 daily deaths and cases smoothed `l' Johns Hopkins.pdf", replace
{txt}  8{com}. 
. 
. 
. 
. 
. ** DayDea
. 
. * DayDea, raw and smooth 
. 
. 
. twoway ///
> (line DayDeaMeRaA00S00V00 date, sort lcolor(gray)) ///
> (line DayDeaMeSmA00S00V00 date, sort lwidth(thick) lcolor(red)) ///
> if date > td(01jan2020) & loc_grand_name == "`l'" ///
> , xtitle(Date) xlabel(`dates2020' `dates2021', format(%tdYY-NN-DD) labsize(small)) xlabel(, grid) xlabel(, grid) ///
> xlabel(, angle(forty_five)) ylabel(, format(%12.0fc) labsize(small)) ylabel(, labsize(small) angle(horizontal)) ///
> ytitle(Daily deaths) title("COVID-19 daily deaths, `l', Johns Hopkins", size(medium)) ///
> xscale(lwidth(vthin) lcolor(gray*.2)) yscale(lwidth(vthin) lcolor(gray*.2)) yscale(titlegap(4)) legend(region(lcolor(none)))  ///
> legend(order(1 "Raw" 2 "Smoothed") size(small)) 
{txt}  9{com}. 
. qui graph save "graph 3 COVID-19 daily deaths `l' Johns Hopkins.gph", replace
{txt} 10{com}. qui graph export "graph 3 COVID-19 daily deaths `l' Johns Hopkins.pdf", replace
{txt} 11{com}. 
. 
. 
. ** Day CFR
. 
. * Day CFR raw
. 
. twoway ///
> (line DayCfrMeRaA00S00V00 date, sort lcolor(black)) ///
> if date > td(01jan2020) & loc_grand_name == "`l'" ///
> , xtitle(Date) xlabel(`dates2020' `dates2021', format(%tdYY-NN-DD) labsize(small)) xlabel(, grid) xlabel(, grid) ///
> xlabel(, angle(forty_five)) ylabel(, format(%9.2fc) labsize(small))  ylabel(, labsize(small) angle(horizontal)) ///
> ytitle(Daily CFR) title("COVID-19 daily CFR, `l', Johns Hopkins", size(medium)) ///
> xscale(lwidth(vthin) lcolor(gray*.2)) yscale(lwidth(vthin) lcolor(gray*.2)) legend(region(lcolor(none))) legend(bexpand) 
{txt} 12{com}. 
. qui graph save "graph 4 COVID-19 daily CFR, `l', Johns Hopkins.gph", replace
{txt} 13{com}. qui graph export "graph 4 COVID-19 daily CFR, `l', Johns Hopkins.pdf", replace
{txt} 14{com}. 
. 
. 
. * Day CFR smoothed
. 
. twoway ///
> (line DayCfrMeSmA00S00V00 date, sort lcolor(black)) ///
> if date > td(01jan2020) & loc_grand_name == "`l'" ///
> , xtitle(Date) xlabel(`dates2020' `dates2021', format(%tdYY-NN-DD) labsize(small)) xlabel(, grid) xlabel(, grid) ///
> xlabel(, angle(forty_five)) ylabel(, format(%9.2fc) labsize(small))  ylabel(, labsize(small) angle(horizontal)) ///
> ytitle(Daily CFR smoothed) title("COVID-19 daily CFR, smoothed, `l', Johns Hopkins", size(medium)) ///
> xscale(lwidth(vthin) lcolor(gray*.2)) yscale(lwidth(vthin) lcolor(gray*.2)) legend(region(lcolor(none))) legend(bexpand) 
{txt} 15{com}. 
. qui graph save "graph 5 COVID-19 daily CFR, smoothed `l', Johns Hopkins.gph", replace
{txt} 16{com}. qui graph export "graph 5 COVID-19 daily CFR, smoothed `l', Johns Hopkins.pdf", replace
{txt} 17{com}. 
. 
. 
. 
. * Day CFR raw and smoothed
. 
. twoway ///
> (line DayCfrMeRaA00S00V00 date, sort lcolor(gray)) ///
> (line DayCfrMeSmA00S00V00 date, sort lwidth(thick) lcolor(red)) ///
> if date > td(01jan2020) & loc_grand_name == "`l'" ///
> , xtitle(Date) xlabel(`dates2020' `dates2021', format(%tdYY-NN-DD) labsize(small)) xlabel(, grid) xlabel(, grid) ///
> xlabel(, angle(forty_five)) ylabel(, format(%9.2fc) labsize(small))  ylabel(, labsize(small) angle(horizontal)) ///
> ytitle(Daily CFR) title("COVID-19 daily CFR, `l', Johns Hopkins", size(medium)) ///
> xscale(lwidth(vthin) lcolor(gray*.2)) yscale(lwidth(vthin) lcolor(gray*.2)) legend(region(lcolor(none))) legend(bexpand) ///
> legend(order(1 "Raw" 2 "Smoothed") size(small)) ///
> 
{txt} 18{com}. qui graph save "graph 6 COVID-19 daily CFR, raw and smoothed, `l', Johns Hopkins.gph", replace
{txt} 19{com}. qui graph export "graph 6 COVID-19 daily CFR, raw and smoothed, `l', Johns Hopkins.pdf", replace
{txt} 20{com}. 
. 
. 
. 
. ** Cases to deaths ratio (CTD)
. 
. 
. * Day CTD raw and smoothed
. 
. twoway ///
> (line DayCTDMeRaA00S00V00 date, sort lcolor(gray)) ///
> (line DayCTDMeSmA00S00V00 date, sort lwidth(thick) lcolor(red)) ///
> if date > td(01jan2020) & loc_grand_name == "`l'" ///
> , xtitle(Date) xlabel(`dates2020' `dates2021', format(%tdYY-NN-DD) labsize(small)) xlabel(, grid) xlabel(, grid) ///
> xlabel(, angle(forty_five)) ylabel(, format(%9.2fc) labsize(small))  ylabel(, labsize(small) angle(horizontal)) ///
> ytitle(Daily Cases to deaths ratio) title("COVID-19 daily cases to deaths ratio, `l', Johns Hopkins", size(medium)) ///
> xscale(lwidth(vthin) lcolor(gray*.2)) yscale(lwidth(vthin) lcolor(gray*.2)) legend(region(lcolor(none))) legend(bexpand) ///
> legend(order(1 "Raw" 2 "Smoothed") size(small)) ///
> 
{txt} 21{com}. qui graph save "graph 7 COVID-19 daily CTD, raw and smoothed, `l', Johns Hopkins.gph", replace
{txt} 22{com}. qui graph export "graph 7 COVID-19 daily CTD, raw and smoothed, `l', Johns Hopkins.pdf", replace
{txt} 23{com}. 
. 
. 
. 
. * Tot CTD raw and smoothed
. 
. twoway ///
> (line TotCTDMeRaA00S00V00 date, sort lcolor(gray)) ///
> (line TotCTDMeSmA00S00V00 date, sort lwidth(thick) lcolor(red)) ///
> if date > td(01jan2020) & loc_grand_name == "`l'" ///
> , xtitle(Date) xlabel(`dates2020' `dates2021', format(%tdYY-NN-DD) labsize(small)) xlabel(, grid) xlabel(, grid) ///
> xlabel(, angle(forty_five)) ylabel(, format(%9.2fc) labsize(small))  ylabel(, labsize(small) angle(horizontal)) ///
> ytitle(Total Cases to deaths ratio) title("COVID-19 total cases to deaths ratio, `l', Johns Hopkins", size(medium)) ///
> xscale(lwidth(vthin) lcolor(gray*.2)) yscale(lwidth(vthin) lcolor(gray*.2)) legend(region(lcolor(none))) legend(bexpand) ///
> legend(order(1 "Raw" 2 "Smoothed") size(small)) ///
> 
{txt} 24{com}. qui graph save "graph 8 COVID-19 total CTD, raw and smoothed, `l', Johns Hopkins.gph", replace
{txt} 25{com}. qui graph export "graph 8 COVID-19 total CTD, raw and smoothed, `l', Johns Hopkins.pdf", replace
{txt} 26{com}. 
. 
. 
. {c )-}
{res}{txt}
{com}. *
. 
. 
. 
. 
. 
. 
. 
. 
. view "log EMR JOHN.smcl"
{txt}
{com}. 
. log close
      {txt}name:  {res}<unnamed>
       {txt}log:  {res}/Users/farshadpourmalek/Downloads/covir2-main/20210514/code/JOHNEMR/log EMR JOHN.smcl
  {txt}log type:  {res}smcl
 {txt}closed on:  {res}14 May 2021, 20:03:25
{txt}{.-}
{smcl}
{txt}{sf}{ul off}