{smcl}
{com}{sf}{ul off}{txt}{.-}
      name:  {res}<unnamed>
       {txt}log:  {res}/Users/farshadpourmalek/Downloads/covir2-main/20210528/code/JOHNEMR/log EMR JOHN.smcl
  {txt}log type:  {res}smcl
 {txt}opened on:  {res}28 May 2021, 16:45:01
{txt}
{com}. 
. ***************************************************************************
. * This is "do EMR JOHN.do"
. 
. * Project: COVID-19 Iran Review No 2
. * Person: Farshad Pourmalek pourmalek_farshad@yahoo.com
. * Time (initial): 2021-02-10
. 
. * OBJECTIVE: Get and prepare Johns Hopkins data for EMR, compare timing of deaths and cases peaks
. ***************************************************************************
. 
. 
. 
. * get Johns Hopkins data for deaths
. 
. import delimited ///
> "https://raw.githubusercontent.com/CSSEGISandData/COVID-19/master/csse_covid_19_data/csse_covid_19_time_series/time_series_covid19_deaths_global.csv" ///
> , clear varnames(1) colrange(2:2)
{res}{text}(1 var, 276 obs)

{com}. 
. save "time_series_covid19_deaths_global col 2.dta", replace
{txt}file time_series_covid19_deaths_global col 2.dta saved

{com}. 
. 
. import delimited ///
> "https://raw.githubusercontent.com/CSSEGISandData/COVID-19/master/csse_covid_19_data/csse_covid_19_time_series/time_series_covid19_deaths_global.csv" ///
> , clear varnames(1) colrange(5)
{res}{text}(492 vars, 276 obs)

{com}. 
. 
. save "time_series_covid19_deaths_global col 5 on.dta", replace
{txt}file time_series_covid19_deaths_global col 5 on.dta saved

{com}. 
. 
. use "time_series_covid19_deaths_global col 2.dta", clear 
{txt}
{com}. 
. merge 1:1 _n using "time_series_covid19_deaths_global col 5 on.dta"
{res}
{txt}{col 5}Result{col 38}# of obs.
{col 5}{hline 41}
{col 5}not matched{col 30}{res}               0
{txt}{col 5}matched{col 30}{res}             276{txt}  (_merge==3)
{col 5}{hline 41}

{com}. 
. rename countryregion loc_grand_name
{res}{txt}
{com}. 
. qui destring *, replace
{txt}
{com}. 
. 
. 
. * gen global sum
. 
. save "global JOHN deaths wo sum.dta", replace
{txt}file global JOHN deaths wo sum.dta saved

{com}. 
. drop loc_grand_name
{txt}
{com}. 
. qui destring *, replace
{txt}
{com}.  
. collapse (sum) *
{txt}
{com}. 
. gen loc_grand_name = "global"
{txt}
{com}.   
. save "global JOHN deaths sum.dta", replace
{txt}file global JOHN deaths sum.dta saved

{com}. 
. *
. 
. 
. use "global JOHN deaths wo sum.dta", clear
{txt}
{com}. 
. 
. 
. keep if ///
> loc_grand_name == "Algeria" | ///
> loc_grand_name == "Bahrain" | ///
> loc_grand_name == "Djibouti" | ///
> loc_grand_name == "Egypt" | ///
> loc_grand_name == "Iran" | ///
> loc_grand_name == "Iraq" | ///
> loc_grand_name == "Israel" | ///
> loc_grand_name == "Jordan" | ///
> loc_grand_name == "Kuwait" | ///
> loc_grand_name == "Lebanon" | ///
> loc_grand_name == "Libya" | ///
> loc_grand_name == "Oman" | ///
> loc_grand_name == "Palestine" | ///
> loc_grand_name == "Qatar" | ///
> loc_grand_name == "Saudi Arabia" | ///
> loc_grand_name == "Syria" | ///
> loc_grand_name == "Tunisia" | ///
> loc_grand_name == "United Arab Emirates" | ///
> loc_grand_name == "Yemen" 
{txt}(258 observations deleted)

{com}. 
. 
. * gen EMR sum
. 
. save "EMR JOHN deaths wo sum.dta", replace
{txt}file EMR JOHN deaths wo sum.dta saved

{com}. 
. drop loc_grand_name
{txt}
{com}. 
. qui destring *, replace
{txt}
{com}.  
. collapse (sum) *
{txt}
{com}. 
. gen loc_grand_name = "EMR"
{txt}
{com}.   
. save "EMR JOHN deaths sum.dta", replace
{txt}file EMR JOHN deaths sum.dta saved

{com}. 
. 
. * 
. 
. use "EMR JOHN deaths wo sum.dta", clear 
{txt}
{com}. 
. qui append using "EMR JOHN deaths sum.dta"
{txt}
{com}. 
. qui append using "global JOHN deaths sum.dta"
{txt}
{com}. 
. 
. *
. 
. 
. order loc_grand_name, last
{txt}
{com}. 
. gen counter = _n
{txt}
{com}. 
. reshape long v, i(loc_grand_name) 
{txt}(note: j = 1 2 3 4 5 6 7 8 9 10 11 12 13 14 15 16 17 18 19 20 21 22 23 24 25 26 27 28 29 30 31 32 33 34 35 36 37 38 39 40 41 42 43 44 45 46 47 48 49 50 51 52 53 54 55 56 57 58 59 60 61 62 63 64 65 66 67 68 69 70 71 72 73 74 75 76 77 78 79 80 81 82 83 84 85 86 87 88 89 90 91 92 93 94 95 96 97 98 99 100 101 102 103 104 105 106 107 108 109 110 111 112 113 114 115 116 117 118 119 120 121 122 123 124 125 126 127 128 129 130 131 132 133 134 135 136 137 138 139 140 141 142 143 144 145 146 147 148 149 150 151 152 153 154 155 156 157 158 159 160 161 162 163 164 165 166 167 168 169 170 171 172 173 174 175 176 177 178 179 180 181 182 183 184 185 186 187 188 189 190 191 192 193 194 195 196 197 198 199 200 201 202 203 204 205 206 207 208 209 210 211 212 213 214 215 216 217 218 219 220 221 222 223 224 225 226 227 228 229 230 231 232 233 234 235 236 237 238 239 240 241 242 243 244 245 246 247 248 249 250 251 252 253 254 255 256 257 258 259 260 261 262 263 264 265 266 267 268 269 270 271 272 273 274 275 276 277 278 279 280 281 282 283 284 285 286 287 288 289 290 291 292 293 294 295 296 297 298 299 300 301 302 303 304 305 306 307 308 309 310 311 312 313 314 315 316 317 318 319 320 321 322 323 324 325 326 327 328 329 330 331 332 333 334 335 336 337 338 339 340 341 342 343 344 345 346 347 348 349 350 351 352 353 354 355 356 357 358 359 360 361 362 363 364 365 366 367 368 369 370 371 372 373 374 375 376 377 378 379 380 381 382 383 384 385 386 387 388 389 390 391 392 393 394 395 396 397 398 399 400 401 402 403 404 405 406 407 408 409 410 411 412 413 414 415 416 417 418 419 420 421 422 423 424 425 426 427 428 429 430 431 432 433 434 435 436 437 438 439 440 441 442 443 444 445 446 447 448 449 450 451 452 453 454 455 456 457 458 459 460 461 462 463 464 465 466 467 468 469 470 471 472 473 474 475 476 477 478 479 480 481 482 483 484 485 486 487 488 489 490 491 492)

Data{col 36}wide{col 43}->{col 48}long
{hline 77}
Number of obs.                 {res}      20   {txt}->{res}    9840
{txt}Number of variables            {res}     495   {txt}->{res}       5
{txt}j variable (492 values)                   ->   {res}_j
{txt}xij variables:
                         {res}v1 v2 ... v492   {txt}->   {res}v
{txt}{hline 77}

{com}. 
. drop counter 
{txt}
{com}. 
. codebook _j

{txt}{hline}
{res}_j{right:(unlabeled)}
{txt}{hline}

{col 19}type:  numeric ({res}int{txt})

{col 18}range:  [{res}1{txt},{res}492{txt}]{col 55}units:  {res}1
{col 10}{txt}unique values:  {res}492{col 51}{txt}missing .:  {res}0{txt}/{res}9,840

{txt}{col 19}mean:{res}{col 26}   246.5
{txt}{col 15}std. dev:{res}{col 26} 142.035

{txt}{col 12}percentiles:{col 32}10%{col 42}25%{col 52}50%{col 62}75%{col 72}90%
{res}{col 27}      50{col 37}   123.5{col 47}   246.5{col 57}   369.5{col 67}     443
{txt}
{com}. 
. gen date = date("22 Jan 2020", "DMY")
{txt}
{com}. 
. replace date = date + _j - 1
{txt}(9,820 real changes made)

{com}. 
. format date %td
{txt}
{com}. 
. codebook date

{txt}{hline}
{res}date{right:(unlabeled)}
{txt}{hline}

{col 19}type:  numeric daily date ({res}float{txt})

{col 18}range:  [{res}21936{txt},{res}22427{txt}]{col 55}units:  {res}1
{col 8}{txt}or equivalently:  [{res}22jan2020{txt},{res}27may2021{txt}]{col 55}units:  {res}days
{col 10}{txt}unique values:  {res}492{col 51}{txt}missing .:  {res}0{txt}/{res}9,840

{txt}{col 19}mean:{res}{col 26} 22181.5{txt} = {res}23sep2020{txt} (+ 12 hours)
{col 15}std. dev:{res}{col 26} 142.035

{txt}{col 12}percentiles:{col 32}10%{col 42}25%{col 52}50%{col 62}75%{col 72}90%
{res}{col 27}   21985{col 37} 22058.5{col 47} 22181.5{col 57} 22304.5{col 67}   22378
{col 26}11mar2020{col 36}23may2020{col 46}23sep2020{col 56}24jan2021{col 66}08apr2021
{txt}
{com}. 
. order date 
{txt}
{com}. 
. rename v TotDeaMeRaA00S00
{res}{txt}
{com}. 
. label var TotDeaMeRaA00S00 "Total Deaths JOHN"
{txt}
{com}. 
. destring TotDeaMeRaA00S00, replace
{txt}TotDeaMeRaA00S00 already numeric; no {res}replace
{txt}
{com}. 
. list loc_grand_name TotDeaMeRaA00S00 if date == td(19feb2020) // Iran should be 2
{txt}
      {c TLC}{hline 22}{c -}{hline 10}{c TRC}
      {c |} {res}      loc_grand_name   TotDe~00 {txt}{c |}
      {c LT}{hline 22}{c -}{hline 10}{c RT}
  29. {c |} {res}             Algeria          0 {txt}{c |}
 521. {c |} {res}             Bahrain          0 {txt}{c |}
1013. {c |} {res}            Djibouti          0 {txt}{c |}
1505. {c |} {res}                 EMR          2 {txt}{c |}
1997. {c |} {res}               Egypt          0 {txt}{c |}
      {c LT}{hline 22}{c -}{hline 10}{c RT}
2489. {c |} {res}                Iran          2 {txt}{c |}
2981. {c |} {res}                Iraq          0 {txt}{c |}
3473. {c |} {res}              Israel          0 {txt}{c |}
3965. {c |} {res}              Jordan          0 {txt}{c |}
4457. {c |} {res}              Kuwait          0 {txt}{c |}
      {c LT}{hline 22}{c -}{hline 10}{c RT}
4949. {c |} {res}             Lebanon          0 {txt}{c |}
5441. {c |} {res}               Libya          0 {txt}{c |}
5933. {c |} {res}                Oman          0 {txt}{c |}
6425. {c |} {res}               Qatar          0 {txt}{c |}
6917. {c |} {res}        Saudi Arabia          0 {txt}{c |}
      {c LT}{hline 22}{c -}{hline 10}{c RT}
7409. {c |} {res}               Syria          0 {txt}{c |}
7901. {c |} {res}             Tunisia          0 {txt}{c |}
8393. {c |} {res}United Arab Emirates          0 {txt}{c |}
8885. {c |} {res}               Yemen          0 {txt}{c |}
9377. {c |} {res}              global       2123 {txt}{c |}
      {c BLC}{hline 22}{c -}{hline 10}{c BRC}

{com}. 
. gen DayDeaMeRaA00S00 =  TotDeaMeRaA00S00[_n] - TotDeaMeRaA00S00[_n-1]
{txt}(1 missing value generated)

{com}. 
. label var DayDeaMeRaA00S00 "Daily Deaths JOHN"
{txt}
{com}. 
. replace DayDeaMeRaA00S00 = TotDeaMeRaA00S00 if _j == 1
{txt}(20 real changes made)

{com}. 
. drop _j _merge
{txt}
{com}. 
. 
. order date loc_grand_name DayDeaMeRaA00S00 TotDeaMeRaA00S00 
{txt}
{com}.                                         
. 
. sort loc_grand_name date
{txt}
{com}. 
. save "EMR JOHN deaths.dta", replace
{txt}file EMR JOHN deaths.dta saved

{com}. 
. 
. 
. 
. * get Johns Hopkins data for cases
. 
. 
. import delimited using ///
> "https://raw.githubusercontent.com/CSSEGISandData/COVID-19/master/csse_covid_19_data/csse_covid_19_time_series/time_series_covid19_confirmed_global.csv" ///
> , clear varnames(1) colrange(2:2)
{res}{text}(1 var, 276 obs)

{com}. 
. save "time_series_covid19_confirmed_global col 2.dta", replace 
{txt}file time_series_covid19_confirmed_global col 2.dta saved

{com}. 
. 
. import delimited using ///
> "https://raw.githubusercontent.com/CSSEGISandData/COVID-19/master/csse_covid_19_data/csse_covid_19_time_series/time_series_covid19_confirmed_global.csv" ///
> , clear varnames(1) colrange(5)
{res}{text}(492 vars, 276 obs)

{com}. 
. save "time_series_covid19_confirmed_global col 5 on.dta", replace 
{txt}file time_series_covid19_confirmed_global col 5 on.dta saved

{com}. 
. 
. use "time_series_covid19_confirmed_global col 2.dta", clear 
{txt}
{com}. 
. merge 1:1 _n using "time_series_covid19_confirmed_global col 5 on.dta"
{res}
{txt}{col 5}Result{col 38}# of obs.
{col 5}{hline 41}
{col 5}not matched{col 30}{res}               0
{txt}{col 5}matched{col 30}{res}             276{txt}  (_merge==3)
{col 5}{hline 41}

{com}. 
. rename countryregion loc_grand_name
{res}{txt}
{com}. 
. qui destring *, replace
{txt}
{com}. 
. 
. 
. * gen global sum
. 
. save "global JOHN cases wo sum.dta", replace
{txt}file global JOHN cases wo sum.dta saved

{com}. 
. drop loc_grand_name
{txt}
{com}. 
. qui destring *, replace
{txt}
{com}.  
. collapse (sum) *
{txt}
{com}. 
. gen loc_grand_name = "global"
{txt}
{com}.   
. save "global JOHN cases sum.dta", replace
{txt}file global JOHN cases sum.dta saved

{com}. 
. *
. 
. 
. use "global JOHN cases wo sum.dta", clear
{txt}
{com}. 
. 
. 
. 
. keep if ///
> loc_grand_name == "Algeria" | ///
> loc_grand_name == "Bahrain" | ///
> loc_grand_name == "Djibouti" | ///
> loc_grand_name == "Egypt" | ///
> loc_grand_name == "Iran" | ///
> loc_grand_name == "Iraq" | ///
> loc_grand_name == "Israel" | ///
> loc_grand_name == "Jordan" | ///
> loc_grand_name == "Kuwait" | ///
> loc_grand_name == "Lebanon" | ///
> loc_grand_name == "Libya" | ///
> loc_grand_name == "Oman" | ///
> loc_grand_name == "Palestine" | ///
> loc_grand_name == "Qatar" | ///
> loc_grand_name == "Saudi Arabia" | ///
> loc_grand_name == "Syria" | ///
> loc_grand_name == "Tunisia" | ///
> loc_grand_name == "United Arab Emirates" | ///
> loc_grand_name == "Yemen" 
{txt}(258 observations deleted)

{com}. 
. 
. 
. * gen EMR sum
. 
. save "EMR JOHN cases wo sum.dta", replace
{txt}file EMR JOHN cases wo sum.dta saved

{com}. 
. drop loc_grand_name
{txt}
{com}. 
. qui destring *, replace
{txt}
{com}.  
. collapse (sum) *
{txt}
{com}. 
. gen loc_grand_name = "EMR"
{txt}
{com}.   
. save "EMR JOHN cases sum.dta", replace
{txt}file EMR JOHN cases sum.dta saved

{com}. 
. 
. * 
. 
. use "EMR JOHN cases wo sum.dta", clear 
{txt}
{com}. 
. qui append using "EMR JOHN cases sum.dta"
{txt}
{com}. 
. qui append using "global JOHN cases sum.dta"
{txt}
{com}. 
. 
. *
. 
. 
. 
. order loc_grand_name, last
{txt}
{com}. 
. gen counter = _n
{txt}
{com}. 
. reshape long v, i(loc_grand_name) 
{txt}(note: j = 1 2 3 4 5 6 7 8 9 10 11 12 13 14 15 16 17 18 19 20 21 22 23 24 25 26 27 28 29 30 31 32 33 34 35 36 37 38 39 40 41 42 43 44 45 46 47 48 49 50 51 52 53 54 55 56 57 58 59 60 61 62 63 64 65 66 67 68 69 70 71 72 73 74 75 76 77 78 79 80 81 82 83 84 85 86 87 88 89 90 91 92 93 94 95 96 97 98 99 100 101 102 103 104 105 106 107 108 109 110 111 112 113 114 115 116 117 118 119 120 121 122 123 124 125 126 127 128 129 130 131 132 133 134 135 136 137 138 139 140 141 142 143 144 145 146 147 148 149 150 151 152 153 154 155 156 157 158 159 160 161 162 163 164 165 166 167 168 169 170 171 172 173 174 175 176 177 178 179 180 181 182 183 184 185 186 187 188 189 190 191 192 193 194 195 196 197 198 199 200 201 202 203 204 205 206 207 208 209 210 211 212 213 214 215 216 217 218 219 220 221 222 223 224 225 226 227 228 229 230 231 232 233 234 235 236 237 238 239 240 241 242 243 244 245 246 247 248 249 250 251 252 253 254 255 256 257 258 259 260 261 262 263 264 265 266 267 268 269 270 271 272 273 274 275 276 277 278 279 280 281 282 283 284 285 286 287 288 289 290 291 292 293 294 295 296 297 298 299 300 301 302 303 304 305 306 307 308 309 310 311 312 313 314 315 316 317 318 319 320 321 322 323 324 325 326 327 328 329 330 331 332 333 334 335 336 337 338 339 340 341 342 343 344 345 346 347 348 349 350 351 352 353 354 355 356 357 358 359 360 361 362 363 364 365 366 367 368 369 370 371 372 373 374 375 376 377 378 379 380 381 382 383 384 385 386 387 388 389 390 391 392 393 394 395 396 397 398 399 400 401 402 403 404 405 406 407 408 409 410 411 412 413 414 415 416 417 418 419 420 421 422 423 424 425 426 427 428 429 430 431 432 433 434 435 436 437 438 439 440 441 442 443 444 445 446 447 448 449 450 451 452 453 454 455 456 457 458 459 460 461 462 463 464 465 466 467 468 469 470 471 472 473 474 475 476 477 478 479 480 481 482 483 484 485 486 487 488 489 490 491 492)

Data{col 36}wide{col 43}->{col 48}long
{hline 77}
Number of obs.                 {res}      20   {txt}->{res}    9840
{txt}Number of variables            {res}     495   {txt}->{res}       5
{txt}j variable (492 values)                   ->   {res}_j
{txt}xij variables:
                         {res}v1 v2 ... v492   {txt}->   {res}v
{txt}{hline 77}

{com}. 
. drop counter 
{txt}
{com}. 
. codebook _j

{txt}{hline}
{res}_j{right:(unlabeled)}
{txt}{hline}

{col 19}type:  numeric ({res}int{txt})

{col 18}range:  [{res}1{txt},{res}492{txt}]{col 55}units:  {res}1
{col 10}{txt}unique values:  {res}492{col 51}{txt}missing .:  {res}0{txt}/{res}9,840

{txt}{col 19}mean:{res}{col 26}   246.5
{txt}{col 15}std. dev:{res}{col 26} 142.035

{txt}{col 12}percentiles:{col 32}10%{col 42}25%{col 52}50%{col 62}75%{col 72}90%
{res}{col 27}      50{col 37}   123.5{col 47}   246.5{col 57}   369.5{col 67}     443
{txt}
{com}. 
. gen date = date("22 Jan 2020", "DMY")
{txt}
{com}. 
. replace date = date + _j - 1
{txt}(9,820 real changes made)

{com}. 
. format date %td
{txt}
{com}. 
. codebook date

{txt}{hline}
{res}date{right:(unlabeled)}
{txt}{hline}

{col 19}type:  numeric daily date ({res}float{txt})

{col 18}range:  [{res}21936{txt},{res}22427{txt}]{col 55}units:  {res}1
{col 8}{txt}or equivalently:  [{res}22jan2020{txt},{res}27may2021{txt}]{col 55}units:  {res}days
{col 10}{txt}unique values:  {res}492{col 51}{txt}missing .:  {res}0{txt}/{res}9,840

{txt}{col 19}mean:{res}{col 26} 22181.5{txt} = {res}23sep2020{txt} (+ 12 hours)
{col 15}std. dev:{res}{col 26} 142.035

{txt}{col 12}percentiles:{col 32}10%{col 42}25%{col 52}50%{col 62}75%{col 72}90%
{res}{col 27}   21985{col 37} 22058.5{col 47} 22181.5{col 57} 22304.5{col 67}   22378
{col 26}11mar2020{col 36}23may2020{col 46}23sep2020{col 56}24jan2021{col 66}08apr2021
{txt}
{com}. 
. order date 
{txt}
{com}. 
. rename v TotCasMeRaA00S00
{res}{txt}
{com}. 
. label var TotCasMeRaA00S00 "Total Cases JOHN"
{txt}
{com}. 
. gen DayCasMeRaA00S00 =  TotCasMeRaA00S00[_n] - TotCasMeRaA00S00[_n-1]
{txt}(1 missing value generated)

{com}. 
. label var DayCasMeRaA00S00 "Daily Cases JOHN"
{txt}
{com}. 
. replace DayCasMeRaA00S00 = TotCasMeRaA00S00 if _j == 1
{txt}(20 real changes made)

{com}. 
. drop _j _merge
{txt}
{com}. 
. 
. order date loc_grand_name DayCasMeRaA00S00 TotCasMeRaA00S00 
{txt}
{com}. 
. sort loc_grand_name date
{txt}
{com}. 
. compress
  {txt}variable {bf}date{sf} was {bf}{res}float{sf}{txt} now {bf}{res}int{sf}
  {txt}variable {bf}TotCasMeRaA00S00{sf} was {bf}{res}double{sf}{txt} now {bf}{res}long{sf}
  {txt}variable {bf}loc_grand_name{sf} was {bf}{res}str32{sf}{txt} now {bf}{res}str20{sf}
{txt}  (177,120 bytes saved)

{com}. 
. save "EMR JOHN Cases.dta", replace
{txt}file EMR JOHN Cases.dta saved

{com}. 
. 
. * merge deaths and cases 
. 
. use "EMR JOHN deaths.dta", clear 
{txt}
{com}. 
. merge 1:1 loc_grand_name date using "EMR JOHN Cases.dta"
{res}
{txt}{col 5}Result{col 38}# of obs.
{col 5}{hline 41}
{col 5}not matched{col 30}{res}               0
{txt}{col 5}matched{col 30}{res}           9,840{txt}  (_merge==3)
{col 5}{hline 41}

{com}. 
. drop _merge
{txt}
{com}. 
. 
. 
. 
. 
. replace loc_grand_name = "Saudi_Arabia" if loc_grand_name == "Saudi Arabia"
{txt}(492 real changes made)

{com}. replace loc_grand_name = "UAE" if loc_grand_name == "United Arab Emirates"
{txt}(492 real changes made)

{com}. 
. replace loc_grand_name = "1_Global" if loc_grand_name == "global"
{txt}(492 real changes made)

{com}. replace loc_grand_name = "2_EMR" if loc_grand_name == "EMR"
{txt}(492 real changes made)

{com}. 
. 
. 
. 
. * gen "Daily cases mean div by daily deaths mean JOHN DayCbD" for visulization of temporal relation of deaths and cases peaks 
. 
. 
. levelsof loc_grand_name, local(levels)
{txt}`"1_Global"' `"2_EMR"' `"Algeria"' `"Bahrain"' `"Djibouti"' `"Egypt"' `"Iran"' `"Iraq"' `"Israel"' `"Jordan"' `"Kuwait"' `"Lebanon"' `"Libya"' `"Oman"' `"Qatar"' `"Saudi_Arabia"' `"Syria"' `"Tunisia"' `"UAE"' `"Yemen"'

{com}. 
. foreach l of local levels {c -(}
{txt}  2{com}. 
.         di "`l'"
{txt}  3{com}.     
.         di "DayDeaMeRaA00S00"
{txt}  4{com}.         summ DayDeaMeRaA00S00 if loc_grand_name == "`l'"
{txt}  5{com}.         gen DayDeMMeRaA00S00_`l' = r(mean)
{txt}  6{com}.         label var DayDeMMeRaA00S00_`l' "Daily deaths mean JOHN DayDeM"
{txt}  7{com}.         di "                            "
{txt}  8{com}. 
.         di "DayCasMeRaA00S00"
{txt}  9{com}.         summ DayCasMeRaA00S00 if loc_grand_name == "`l'"
{txt} 10{com}.         gen DayCaMMeRaA00S00_`l' = r(mean)
{txt} 11{com}.         label var DayCaMMeRaA00S00_`l' "Daily cases mean JOHN DayCaM"
{txt} 12{com}.         di "                            "
{txt} 13{com}. 
.         di "DayCbDMeRaA00S00_(location)"
{txt} 14{com}.         gen DayCbDMeRaA00S00_`l' = DayCaMMeRaA00S00_`l' / DayDeMMeRaA00S00_`l'
{txt} 15{com}.         label var DayCbDMeRaA00S00_`l' "Daily cases mean div by daily deaths mean JOHN DayCbD"
{txt} 16{com}.         summ DayCbDMeRaA00S00_`l' if loc_grand_name == "`l'"
{txt} 17{com}.         di "                            "
{txt} 18{com}. 
.         di "DayDea_multip_(location)"
{txt} 19{com}.         gen DayDea_multip_`l' = DayDeaMeRaA00S00 * DayCbDMeRaA00S00_`l' if loc_grand_name == "`l'"
{txt} 20{com}.     label var DayDea_multip_`l' "Daily deaths scaled (times means of cases by deaths) only for visualization JOHN"
{txt} 21{com}.         summ DayDea_multip_`l' if loc_grand_name == "`l'"
{txt} 22{com}.         di "                            "
{txt} 23{com}.         
.         di "divider---------------------"
{txt} 24{com}.         di "                            "
{txt} 25{com}. 
. {c )-}
1_Global
DayDeaMeRaA00S00

{txt}    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayDeaMeR~00 {c |}{res}        492    7136.593    4303.036          1      17906
                            
DayCasMeRaA00S00

{txt}    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayCasMeR~00 {c |}{res}        492    343427.6    255477.1         98    1498213
                            
DayCbDMeRaA00S00_(location)

{txt}    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayCbDMeRa~l {c |}{res}        492    48.12206           0   48.12206   48.12206
                            
DayDea_multip_(location)
{txt}(9,348 missing values generated)

    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayDea_mul~l {c |}{res}        492    343427.6      207071   48.12206   861673.6
                            
divider---------------------
                            
2_EMR
DayDeaMeRaA00S00

{txt}    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayDeaMeR~00 {c |}{res}        492    347.2195    204.4684          0        850
                            
DayCasMeRaA00S00

{txt}    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayCasMeR~00 {c |}{res}        492    18500.34    12403.65          0      51903
                            
DayCbDMeRaA00S00_(location)

{txt}    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayCbDMeRa~R {c |}{res}        492    53.28139           0   53.28139   53.28139
                            
DayDea_multip_(location)
{txt}(9,348 missing values generated)

    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayDea_mul~R {c |}{res}        492    18500.34    10894.36          0   45289.19
                            
divider---------------------
                            
Algeria
DayDeaMeRaA00S00

{txt}    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayDeaMeR~00 {c |}{res}        492     7.00813     5.00915          0         30
                            
DayCasMeRaA00S00

{txt}    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayCasMeR~00 {c |}{res}        492    260.0122    231.0481          0       1133
                            
DayCbDMeRaA00S00_(location)

{txt}    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayCbDMeRa~a {c |}{res}        492    37.10151           0   37.10151   37.10151
                            
DayDea_multip_(location)
{txt}(9,348 missing values generated)

    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayDea_mul~a {c |}{res}        492    260.0122     185.847          0   1113.045
                            
divider---------------------
                            
Bahrain
DayDeaMeRaA00S00

{txt}    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayDeaMeR~00 {c |}{res}        492    1.833333    2.862189          0         28
                            
DayCasMeRaA00S00

{txt}    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayCasMeR~00 {c |}{res}        492    466.3984    484.1867          0       3177
                            
DayCbDMeRaA00S00_(location)

{txt}    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayCbDMeRa~n {c |}{res}        492    254.3991           0   254.3991   254.3991
                            
DayDea_multip_(location)
{txt}(9,348 missing values generated)

    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayDea_mul~n {c |}{res}        492    466.3984    728.1383          0   7123.175
                            
divider---------------------
                            
Djibouti
DayDeaMeRaA00S00

{txt}    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayDeaMeR~00 {c |}{res}        492    .3109756    .9373672          0          9
                            
DayCasMeRaA00S00

{txt}    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayCasMeR~00 {c |}{res}        492    23.42073    50.05195          0        415
                            
DayCbDMeRaA00S00_(location)

{txt}    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayCbDMeRa~i {c |}{res}        492    75.31373           0   75.31373   75.31373
                            
DayDea_multip_(location)
{txt}(9,348 missing values generated)

    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayDea_mul~i {c |}{res}        492    23.42073    70.59662          0   677.8235
                            
divider---------------------
                            
Egypt
DayDeaMeRaA00S00

{txt}    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayDeaMeR~00 {c |}{res}        492    30.29268    23.51192          0         97
                            
DayCasMeRaA00S00

{txt}    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayCasMeR~00 {c |}{res}        492    525.2175    449.6146          0       1774
                            
DayCbDMeRaA00S00_(location)

{txt}    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayCbDMeRa~t {c |}{res}        492     17.3381           0    17.3381    17.3381
                            
DayDea_multip_(location)
{txt}(9,348 missing values generated)

    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayDea_mul~t {c |}{res}        492    525.2175    407.6519          0   1681.795
                            
divider---------------------
                            
Iran
DayDeaMeRaA00S00

{txt}    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayDeaMeR~00 {c |}{res}        492    161.3496    122.9143          0        496
                            
DayCasMeRaA00S00

{txt}    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayCasMeR~00 {c |}{res}        492     5845.24    5605.775          0      25582
                            
DayCbDMeRaA00S00_(location)

{txt}    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayCbDMeR~an {c |}{res}        492    36.22717           0   36.22717   36.22717
                            
DayDea_multip_(location)
{txt}(9,348 missing values generated)

    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayDea_mu~an {c |}{res}        492     5845.24    4452.838          0   17968.68
                            
divider---------------------
                            
Iraq
DayDeaMeRaA00S00

{txt}    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayDeaMeR~00 {c |}{res}        492    33.10772    30.61858          0        122
                            
DayCasMeRaA00S00

{txt}    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayCasMeR~00 {c |}{res}        492    2411.197    2129.029          0       8696
                            
DayCbDMeRaA00S00_(location)

{txt}    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayCbDMeRa~q {c |}{res}        492    72.82884           0   72.82884   72.82884
                            
DayDea_multip_(location)
{txt}(9,348 missing values generated)

    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayDea_mul~q {c |}{res}        492    2411.197    2229.916          0   8885.119
                            
divider---------------------
                            
Israel
DayDeaMeRaA00S00

{txt}    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayDeaMeR~00 {c |}{res}        492    13.02033    15.67385         -4        101
                            
DayCasMeRaA00S00

{txt}    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayCasMeR~00 {c |}{res}        492    1706.138    2299.906        -53      11934
                            
DayCbDMeRaA00S00_(location)

{txt}    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayCbDMeR~el {c |}{res}        492    131.0365           0   131.0365   131.0365
                            
DayDea_multip_(location)
{txt}(9,348 missing values generated)

    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayDea_mu~el {c |}{res}        492    1706.138    2053.847  -524.1461   13234.69
                            
divider---------------------
                            
Jordan
DayDeaMeRaA00S00

{txt}    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayDeaMeR~00 {c |}{res}        492    19.15244     27.3097          0        111
                            
DayCasMeRaA00S00

{txt}    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayCasMeR~00 {c |}{res}        492    1491.949    2184.959       -110       9535
                            
DayCbDMeRaA00S00_(location)

{txt}    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayCbDMe~dan {c |}{res}        492    77.89865           0   77.89865   77.89865
                            
DayDea_multip_(location)
{txt}(9,348 missing values generated)

    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayDea_m~dan {c |}{res}        492    1491.949    2127.389          0    8646.75
                            
divider---------------------
                            
Kuwait
DayDeaMeRaA00S00

{txt}    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayDeaMeR~00 {c |}{res}        492    3.567073    3.216172          0         14
                            
DayCasMeRaA00S00

{txt}    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayCasMeR~00 {c |}{res}        492    618.2907    430.3129          0       1716
                            
DayCbDMeRaA00S00_(location)

{txt}    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayCbDMeR~it {c |}{res}        492    173.3328           0   173.3328   173.3328
                            
DayDea_multip_(location)
{txt}(9,348 missing values generated)

    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayDea_mu~it {c |}{res}        492    618.2907    557.4679          0   2426.659
                            
divider---------------------
                            
Lebanon
DayDeaMeRaA00S00

{txt}    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayDeaMeR~00 {c |}{res}        492    15.66057    25.39033          0        351
                            
DayCasMeRaA00S00

{txt}    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayCasMeR~00 {c |}{res}        492    1096.728    1283.963          0       6154
                            
DayCbDMeRaA00S00_(location)

{txt}    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayCbDMeR~on {c |}{res}        492    70.03115           0   70.03115   70.03115
                            
DayDea_multip_(location)
{txt}(9,348 missing values generated)

    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayDea_mu~on {c |}{res}        492    1096.728    1778.114          0   24580.93
                            
divider---------------------
                            
Libya
DayDeaMeRaA00S00

{txt}    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayDeaMeR~00 {c |}{res}        492    6.331301    8.544242         -3         53
                            
DayCasMeRaA00S00

{txt}    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayCasMeR~00 {c |}{res}        492    374.9431    383.8571          0       1639
                            
DayCbDMeRaA00S00_(location)

{txt}    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayCbDMeR~ya {c |}{res}        492    59.22055           0   59.22055   59.22055
                            
DayDea_multip_(location)
{txt}(9,348 missing values generated)

    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayDea_mu~ya {c |}{res}        492    374.9431    505.9947  -177.6616   3138.689
                            
divider---------------------
                            
Oman
DayDeaMeRaA00S00

{txt}    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayDeaMeR~00 {c |}{res}        492    4.680894    7.790655          0         67
                            
DayCasMeRaA00S00

{txt}    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayCasMeR~00 {c |}{res}        492    434.5203    579.4025          0       3544
                            
DayCbDMeRaA00S00_(location)

{txt}    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayCbDMe~man {c |}{res}        492    92.82848           0   92.82848   92.82848
                            
DayDea_multip_(location)
{txt}(9,348 missing values generated)

    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayDea_m~man {c |}{res}        492    434.5203    723.1946          0   6219.508
                            
divider---------------------
                            
Qatar
DayDeaMeRaA00S00

{txt}    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayDeaMeR~00 {c |}{res}        492    1.121951    1.843513          0         10
                            
DayCasMeRaA00S00

{txt}    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayCasMeR~00 {c |}{res}        492    440.4126    434.1631          0       2355
                            
DayCbDMeRaA00S00_(location)

{txt}    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayCbDMeRa~r {c |}{res}        492    392.5417           0   392.5417   392.5417
                            
DayDea_multip_(location)
{txt}(9,348 missing values generated)

    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayDea_mul~r {c |}{res}        492    440.4126    723.6556          0   3925.417
                            
divider---------------------
                            
Saudi_Arabia
DayDeaMeRaA00S00

{txt}    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayDeaMeR~00 {c |}{res}        492    14.85569    13.38881          0         58
                            
DayCasMeRaA00S00

{txt}    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayCasMeR~00 {c |}{res}        492    906.4289    1037.468          0       4919
                            
DayCbDMeRaA00S00_(location)

{txt}    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayCbDMe~bia {c |}{res}        492    61.01559           0   61.01559   61.01559
                            
DayDea_multip_(location)
{txt}(9,348 missing values generated)

    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayDea_m~bia {c |}{res}        492    906.4288    816.9261          0   3538.905
                            
divider---------------------
                            
Syria
DayDeaMeRaA00S00

{txt}    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayDeaMeR~00 {c |}{res}        492    3.565041    3.818947          0         20
                            
DayCasMeRaA00S00

{txt}    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayCasMeR~00 {c |}{res}        492    49.52236    45.31988          0        172
                            
DayCbDMeRaA00S00_(location)

{txt}    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayCbDM~yria {c |}{res}        492    13.89111           0   13.89111   13.89111
                            
DayDea_multip_(location)
{txt}(9,348 missing values generated)

    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayDea_~yria {c |}{res}        492    49.52236     53.0494          0   277.8221
                            
divider---------------------
                            
Tunisia
DayDeaMeRaA00S00

{txt}    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayDeaMeR~00 {c |}{res}        492    25.30691    33.04754          0        217
                            
DayCasMeRaA00S00

{txt}    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayCasMeR~00 {c |}{res}        492     691.565    888.7872          0       5752
                            
DayCbDMeRaA00S00_(location)

{txt}    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayCbDMe~sia {c |}{res}        492    27.32712           0   27.32712   27.32712
                            
DayDea_multip_(location)
{txt}(9,348 missing values generated)

    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayDea_m~sia {c |}{res}        492     691.565    903.0941          0   5929.985
                            
divider---------------------
                            
UAE
DayDeaMeRaA00S00

{txt}    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayDeaMeR~00 {c |}{res}        492    3.382114    3.874866          0         20
                            
DayCasMeRaA00S00

{txt}    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayCasMeR~00 {c |}{res}        492    1144.746    1001.413          0       3977
                            
DayCbDMeRaA00S00_(location)

{txt}    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayCbDMeRa~E {c |}{res}        492    338.4706           0   338.4706   338.4706
                            
DayDea_multip_(location)
{txt}(9,348 missing values generated)

    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayDea_mul~E {c |}{res}        492    1144.746    1311.528          0   6769.411
                            
divider---------------------
                            
Yemen
DayDeaMeRaA00S00

{txt}    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayDeaMeR~00 {c |}{res}        492    2.672764    5.236624          0         52
                            
DayCasMeRaA00S00

{txt}    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayCasMeR~00 {c |}{res}        492    13.60976    25.08588         -1        174
                            
DayCbDMeRaA00S00_(location)

{txt}    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayCbDMeR~en {c |}{res}        492    5.092015           0   5.092015   5.092015
                            
DayDea_multip_(location)
{txt}(9,348 missing values generated)

    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayDea_mu~en {c |}{res}        492    13.60976    26.66497          0   264.7848
                            
divider---------------------
                            
{txt}
{com}. *
. 
. 
. * gen CFR
. 
. gen DayCfrMeRaA00S00 = 100 * DayDeaMeRaA00S00 / DayCasMeRaA00S00
{txt}(1,366 missing values generated)

{com}. 
. label var DayCfrMeRaA00S00 "Daily CFR JOHN"
{txt}
{com}. 
. di in red "negative CFR values:"
{res}{err}negative CFR values:
{txt}
{com}. 
. list date loc_grand_name DayDeaMeRaA00S00 DayCasMeRaA00S00 DayCfrMeRaA00S00 if DayCfrMeRaA00S00 < 0
{txt}
      {c TLC}{hline 11}{c -}{hline 10}{c -}{hline 10}{c -}{hline 10}{c -}{hline 11}{c TRC}
      {c |} {res}     date   loc_gr~e   DayDe~00   DayCa~00   DayCfr~00 {txt}{c |}
      {c LT}{hline 11}{c -}{hline 10}{c -}{hline 10}{c -}{hline 10}{c -}{hline 11}{c RT}
3878. {c |} {res}30mar2021     Israel         -4        514   -.7782101 {txt}{c |}
3896. {c |} {res}17apr2021     Israel         15        -53   -28.30189 {txt}{c |}
5603. {c |} {res}30jul2020      Libya         -3        216   -1.388889 {txt}{c |}
9059. {c |} {res}11aug2020      Yemen          5         -1        -500 {txt}{c |}
      {c BLC}{hline 11}{c -}{hline 10}{c -}{hline 10}{c -}{hline 10}{c -}{hline 11}{c BRC}

{com}. 
. 
. * describe CFR
. 
. levelsof loc_grand_name, local(levels)
{txt}`"1_Global"' `"2_EMR"' `"Algeria"' `"Bahrain"' `"Djibouti"' `"Egypt"' `"Iran"' `"Iraq"' `"Israel"' `"Jordan"' `"Kuwait"' `"Lebanon"' `"Libya"' `"Oman"' `"Qatar"' `"Saudi_Arabia"' `"Syria"' `"Tunisia"' `"UAE"' `"Yemen"'

{com}. 
. foreach l of local levels {c -(}
{txt}  2{com}. 
.         di "`l'"
{txt}  3{com}. 
.         tabstat DayCfrMeRaA00S00 if loc_grand_name == "`l'" & DayCfrMeRaA00S00 >= 0, stat(p25 p50 p75 iqr mean min max) varwidth(32)
{txt}  4{com}. 
.         di "divider---------------------"
{txt}  5{com}.         di "                            "
{txt}  6{com}. 
. {c )-}
1_Global

{txt}{ralign 32:variable} {...}
{c |}       p25       p50       p75       iqr      mean       min       max
{hline 33}{c +}{hline 70}
{ralign 32:DayCfrMeRaA00S00} {...}
{c |}{...}
 {res} 1.736806  2.156543  3.191679  1.454874  3.005554  .3395586  28.36879
{txt}{hline 33}{c BT}{hline 70}
divider---------------------
                            
2_EMR

{ralign 32:variable} {...}
{c |}       p25       p50       p75       iqr      mean       min       max
{hline 33}{c +}{hline 70}
{ralign 32:DayCfrMeRaA00S00} {...}
{c |}{...}
 {res} 1.372213  2.049766  2.779953   1.40774   2.64445         0       100
{txt}{hline 33}{c BT}{hline 70}
divider---------------------
                            
Algeria

{ralign 32:variable} {...}
{c |}       p25       p50       p75       iqr      mean       min       max
{hline 33}{c +}{hline 70}
{ralign 32:DayCfrMeRaA00S00} {...}
{c |}{...}
 {res} 1.901373  2.549332   3.89352  1.992148   4.11289         0  66.66666
{txt}{hline 33}{c BT}{hline 70}
divider---------------------
                            
Bahrain

{ralign 32:variable} {...}
{c |}       p25       p50       p75       iqr      mean       min       max
{hline 33}{c +}{hline 70}
{ralign 32:DayCfrMeRaA00S00} {...}
{c |}{...}
 {res}        0  .2617801  .5194805  .5194805  .3541095         0  6.666667
{txt}{hline 33}{c BT}{hline 70}
divider---------------------
                            
Djibouti

{ralign 32:variable} {...}
{c |}       p25       p50       p75       iqr      mean       min       max
{hline 33}{c +}{hline 70}
{ralign 32:DayCfrMeRaA00S00} {...}
{c |}{...}
 {res}        0         0         0         0  2.054309         0       100
{txt}{hline 33}{c BT}{hline 70}
divider---------------------
                            
Egypt

{ralign 32:variable} {...}
{c |}       p25       p50       p75       iqr      mean       min       max
{hline 33}{c +}{hline 70}
{ralign 32:DayCfrMeRaA00S00} {...}
{c |}{...}
 {res} 4.582652  6.060606  8.391608  3.808957  6.856355         0  22.22222
{txt}{hline 33}{c BT}{hline 70}
divider---------------------
                            
Iran

{ralign 32:variable} {...}
{c |}       p25       p50       p75       iqr      mean       min       max
{hline 33}{c +}{hline 70}
{ralign 32:DayCfrMeRaA00S00} {...}
{c |}{...}
 {res} 1.700121  3.611157  6.046989  4.346868  4.385458         0       100
{txt}{hline 33}{c BT}{hline 70}
divider---------------------
                            
Iraq

{ralign 32:variable} {...}
{c |}       p25       p50       p75       iqr      mean       min       max
{hline 33}{c +}{hline 70}
{ralign 32:DayCfrMeRaA00S00} {...}
{c |}{...}
 {res} .6451613  1.515152  2.465078  1.819917  2.313172         0  66.66666
{txt}{hline 33}{c BT}{hline 70}
divider---------------------
                            
Israel

{ralign 32:variable} {...}
{c |}       p25       p50       p75       iqr      mean       min       max
{hline 33}{c +}{hline 70}
{ralign 32:DayCfrMeRaA00S00} {...}
{c |}{...}
 {res}  .436409  .7751938  1.886792  1.450383  2.270012         0       100
{txt}{hline 33}{c BT}{hline 70}
divider---------------------
                            
Jordan

{ralign 32:variable} {...}
{c |}       p25       p50       p75       iqr      mean       min       max
{hline 33}{c +}{hline 70}
{ralign 32:DayCfrMeRaA00S00} {...}
{c |}{...}
 {res}        0  .7713102  1.471298  1.471298  1.347999         0       100
{txt}{hline 33}{c BT}{hline 70}
divider---------------------
                            
Kuwait

{ralign 32:variable} {...}
{c |}       p25       p50       p75       iqr      mean       min       max
{hline 33}{c +}{hline 70}
{ralign 32:DayCfrMeRaA00S00} {...}
{c |}{...}
 {res}  .281299  .5075301  .7513091  .4700102  .5507075         0  2.608696
{txt}{hline 33}{c BT}{hline 70}
divider---------------------
                            
Lebanon

{ralign 32:variable} {...}
{c |}       p25       p50       p75       iqr      mean       min       max
{hline 33}{c +}{hline 70}
{ralign 32:DayCfrMeRaA00S00} {...}
{c |}{...}
 {res} .0735294  .9101284  1.871258  1.797728  1.740332         0        25
{txt}{hline 33}{c BT}{hline 70}
divider---------------------
                            
Libya

{ralign 32:variable} {...}
{c |}       p25       p50       p75       iqr      mean       min       max
{hline 33}{c +}{hline 70}
{ralign 32:DayCfrMeRaA00S00} {...}
{c |}{...}
 {res} .7088012   1.34571  2.161631   1.45283  2.322223         0       100
{txt}{hline 33}{c BT}{hline 70}
divider---------------------
                            
Oman

{ralign 32:variable} {...}
{c |}       p25       p50       p75       iqr      mean       min       max
{hline 33}{c +}{hline 70}
{ralign 32:DayCfrMeRaA00S00} {...}
{c |}{...}
 {res} .2974733  .7992921  1.604638  1.307165  1.172552         0  11.42857
{txt}{hline 33}{c BT}{hline 70}
divider---------------------
                            
Qatar

{ralign 32:variable} {...}
{c |}       p25       p50       p75       iqr      mean       min       max
{hline 33}{c +}{hline 70}
{ralign 32:DayCfrMeRaA00S00} {...}
{c |}{...}
 {res}        0         0  .4292162  .4292162   .289959         0  16.66667
{txt}{hline 33}{c BT}{hline 70}
divider---------------------
                            
Saudi_Arabia

{ralign 32:variable} {...}
{c |}       p25       p50       p75       iqr      mean       min       max
{hline 33}{c +}{hline 70}
{ralign 32:DayCfrMeRaA00S00} {...}
{c |}{...}
 {res} 1.042654  1.510954  4.016913  2.974259  2.524448         0   10.6383
{txt}{hline 33}{c BT}{hline 70}
divider---------------------
                            
Syria

{ralign 32:variable} {...}
{c |}       p25       p50       p75       iqr      mean       min       max
{hline 33}{c +}{hline 70}
{ralign 32:DayCfrMeRaA00S00} {...}
{c |}{...}
 {res} 4.938272  6.666667  8.333333  3.395061   7.55936         0       100
{txt}{hline 33}{c BT}{hline 70}
divider---------------------
                            
Tunisia

{ralign 32:variable} {...}
{c |}       p25       p50       p75       iqr      mean       min       max
{hline 33}{c +}{hline 70}
{ralign 32:DayCfrMeRaA00S00} {...}
{c |}{...}
 {res}        0  2.888581  4.685212  4.685212  4.071849         0       100
{txt}{hline 33}{c BT}{hline 70}
divider---------------------
                            
UAE

{ralign 32:variable} {...}
{c |}       p25       p50       p75       iqr      mean       min       max
{hline 33}{c +}{hline 70}
{ralign 32:DayCfrMeRaA00S00} {...}
{c |}{...}
 {res} .1448016   .239006  .4149378  .2701361  .3364338         0  4.878049
{txt}{hline 33}{c BT}{hline 70}
divider---------------------
                            
Yemen

{ralign 32:variable} {...}
{c |}       p25       p50       p75       iqr      mean       min       max
{hline 33}{c +}{hline 70}
{ralign 32:DayCfrMeRaA00S00} {...}
{c |}{...}
 {res}        0  14.28571        28        28   24.7946         0       400
{txt}{hline 33}{c BT}{hline 70}
divider---------------------
                            

{com}. *
. 
. 
. 
. * gen Cases to deaths ratio (CTD)
. 
. gen DayCTDMeRaA00S00 =  DayCasMeRaA00S00 / DayDeaMeRaA00S00
{txt}(2,902 missing values generated)

{com}. label var DayCTDMeRaA00S00  "Daily Cases to Deaths S0 JOHN"
{txt}
{com}.         
. gen TotCTDMeRaA00S00 =  TotCasMeRaA00S00 / TotDeaMeRaA00S00
{txt}(1,120 missing values generated)

{com}. label var TotCTDMeRaA00S00  "Total Cases to Deaths S0 JOHN"
{txt}
{com}. 
. 
. 
. 
. * describe Cases to deaths ratio (CTD)
. 
. levelsof loc_grand_name, local(levels)
{txt}`"1_Global"' `"2_EMR"' `"Algeria"' `"Bahrain"' `"Djibouti"' `"Egypt"' `"Iran"' `"Iraq"' `"Israel"' `"Jordan"' `"Kuwait"' `"Lebanon"' `"Libya"' `"Oman"' `"Qatar"' `"Saudi_Arabia"' `"Syria"' `"Tunisia"' `"UAE"' `"Yemen"'

{com}. 
. foreach l of local levels {c -(}
{txt}  2{com}. 
.         di "`l'"
{txt}  3{com}. 
.         tabstat DayCTDMeRaA00S00 if loc_grand_name == "`l'", stat(p25 p50 p75 iqr mean min max) varwidth(32)
{txt}  4{com}.         
.         tabstat TotCTDMeRaA00S00 if loc_grand_name == "`l'", stat(p25 p50 p75 iqr mean min max) varwidth(32)
{txt}  5{com}.         
. 
.         di "divider---------------------"
{txt}  6{com}.         di "                            "
{txt}  7{com}. 
. {c )-}
1_Global

{txt}{ralign 32:variable} {...}
{c |}       p25       p50       p75       iqr      mean       min       max
{hline 33}{c +}{hline 70}
{ralign 32:DayCTDMeRaA00S00} {...}
{c |}{...}
 {res} 31.33175  46.37055  57.57696  26.24522  45.48772     3.525     294.5
{txt}{hline 33}{c BT}{hline 70}

{ralign 32:variable} {...}
{c |}       p25       p50       p75       iqr      mean       min       max
{hline 33}{c +}{hline 70}
{ralign 32:TotCTDMeRaA00S00} {...}
{c |}{...}
 {res} 24.31976  36.04546  45.48584  21.16608  34.32193  13.80244  49.01241
{txt}{hline 33}{c BT}{hline 70}
divider---------------------
                            
2_EMR

{ralign 32:variable} {...}
{c |}       p25       p50       p75       iqr      mean       min       max
{hline 33}{c +}{hline 70}
{ralign 32:DayCTDMeRaA00S00} {...}
{c |}{...}
 {res} 35.69466  48.15454  71.27778  35.58312  52.56085         1  107.1461
{txt}{hline 33}{c BT}{hline 70}

{ralign 32:variable} {...}
{c |}       p25       p50       p75       iqr      mean       min       max
{hline 33}{c +}{hline 70}
{ralign 32:TotCTDMeRaA00S00} {...}
{c |}{...}
 {res} 37.69124  40.24835  44.52975  6.838511   39.0855         6  53.28139
{txt}{hline 33}{c BT}{hline 70}
divider---------------------
                            
Algeria

{ralign 32:variable} {...}
{c |}       p25       p50       p75       iqr      mean       min       max
{hline 33}{c +}{hline 70}
{ralign 32:DayCTDMeRaA00S00} {...}
{c |}{...}
 {res}       25        38  51.33333  26.33333  39.61098       1.5     137.5
{txt}{hline 33}{c BT}{hline 70}

{ralign 32:variable} {...}
{c |}       p25       p50       p75       iqr      mean       min       max
{hline 33}{c +}{hline 70}
{ralign 32:TotCTDMeRaA00S00} {...}
{c |}{...}
 {res} 16.27273   29.7816   37.1064  20.83367   27.5634  6.335463  37.99706
{txt}{hline 33}{c BT}{hline 70}
divider---------------------
                            
Bahrain

{ralign 32:variable} {...}
{c |}       p25       p50       p75       iqr      mean       min       max
{hline 33}{c +}{hline 70}
{ralign 32:DayCTDMeRaA00S00} {...}
{c |}{...}
 {res}    161.5     224.5  360.1667  198.6667  281.3975         0      1206
{txt}{hline 33}{c BT}{hline 70}

{ralign 32:variable} {...}
{c |}       p25       p50       p75       iqr      mean       min       max
{hline 33}{c +}{hline 70}
{ralign 32:TotCTDMeRaA00S00} {...}
{c |}{...}
 {res} 263.2813  274.6577   284.467  21.18573  301.7182    104.75  701.1667
{txt}{hline 33}{c BT}{hline 70}
divider---------------------
                            
Djibouti

{ralign 32:variable} {...}
{c |}       p25       p50       p75       iqr      mean       min       max
{hline 33}{c +}{hline 70}
{ralign 32:DayCTDMeRaA00S00} {...}
{c |}{...}
 {res} 12.20833    28.625     73.25  61.04167    54.049         1       251
{txt}{hline 33}{c BT}{hline 70}

{ralign 32:variable} {...}
{c |}       p25       p50       p75       iqr      mean       min       max
{hline 33}{c +}{hline 70}
{ralign 32:TotCTDMeRaA00S00} {...}
{c |}{...}
 {res} 88.91071  93.40909  98.98412  10.07341  125.2187  75.11765       560
{txt}{hline 33}{c BT}{hline 70}
divider---------------------
                            
Egypt

{ralign 32:variable} {...}
{c |}       p25       p50       p75       iqr      mean       min       max
{hline 33}{c +}{hline 70}
{ralign 32:DayCTDMeRaA00S00} {...}
{c |}{...}
 {res} 11.82353  16.29372  21.16216  9.338634  17.66468         0  71.18182
{txt}{hline 33}{c BT}{hline 70}

{ralign 32:variable} {...}
{c |}       p25       p50       p75       iqr      mean       min       max
{hline 33}{c +}{hline 70}
{ralign 32:TotCTDMeRaA00S00} {...}
{c |}{...}
 {res} 17.06811  17.50635   18.7783  1.710184  19.33609  12.98742        75
{txt}{hline 33}{c BT}{hline 70}
divider---------------------
                            
Iran

{ralign 32:variable} {...}
{c |}       p25       p50       p75       iqr      mean       min       max
{hline 33}{c +}{hline 70}
{ralign 32:DayCTDMeRaA00S00} {...}
{c |}{...}
 {res} 16.52703  27.68267  58.57558  42.04855  40.87449         1  152.6038
{txt}{hline 33}{c BT}{hline 70}

{ralign 32:variable} {...}
{c |}       p25       p50       p75       iqr      mean       min       max
{hline 33}{c +}{hline 70}
{ralign 32:TotCTDMeRaA00S00} {...}
{c |}{...}
 {res} 17.41978  19.93256  25.32051  7.900724  21.71107         1  40.15862
{txt}{hline 33}{c BT}{hline 70}
divider---------------------
                            
Iraq

{ralign 32:variable} {...}
{c |}       p25       p50       p75       iqr      mean       min       max
{hline 33}{c +}{hline 70}
{ralign 32:DayCTDMeRaA00S00} {...}
{c |}{...}
 {res}  38.2197   63.0032  133.4672  95.24754    91.558         0    592.25
{txt}{hline 33}{c BT}{hline 70}

{ralign 32:variable} {...}
{c |}       p25       p50       p75       iqr      mean       min       max
{hline 33}{c +}{hline 70}
{ralign 32:TotCTDMeRaA00S00} {...}
{c |}{...}
 {res} 26.96599  41.27986  47.68329  20.71731  39.80481     8.875  72.82884
{txt}{hline 33}{c BT}{hline 70}
divider---------------------
                            
Israel

{ralign 32:variable} {...}
{c |}       p25       p50       p75       iqr      mean       min       max
{hline 33}{c +}{hline 70}
{ralign 32:DayCTDMeRaA00S00} {...}
{c |}{...}
 {res}       45  112.9857  181.0714  136.0714  137.9415    -128.5      1146
{txt}{hline 33}{c BT}{hline 70}

{ralign 32:variable} {...}
{c |}       p25       p50       p75       iqr      mean       min       max
{hline 33}{c +}{hline 70}
{ralign 32:TotCTDMeRaA00S00} {...}
{c |}{...}
 {res} 117.3476  127.4908  134.9174  17.56985  129.4031  58.64685      1249
{txt}{hline 33}{c BT}{hline 70}
divider---------------------
                            
Jordan

{ralign 32:variable} {...}
{c |}       p25       p50       p75       iqr      mean       min       max
{hline 33}{c +}{hline 70}
{ralign 32:DayCTDMeRaA00S00} {...}
{c |}{...}
 {res} 54.93214  75.18952  116.4688  61.53661  92.94827         0       634
{txt}{hline 33}{c BT}{hline 70}

{ralign 32:variable} {...}
{c |}       p25       p50       p75       iqr      mean       min       max
{hline 33}{c +}{hline 70}
{ralign 32:TotCTDMeRaA00S00} {...}
{c |}{...}
 {res} 77.12016  84.00517  111.1818  34.06166  94.46828  51.11111       246
{txt}{hline 33}{c BT}{hline 70}
divider---------------------
                            
Kuwait

{ralign 32:variable} {...}
{c |}       p25       p50       p75       iqr      mean       min       max
{hline 33}{c +}{hline 70}
{ralign 32:DayCTDMeRaA00S00} {...}
{c |}{...}
 {res}  122.125       174    247.25   125.125  217.6094  38.33333       919
{txt}{hline 33}{c BT}{hline 70}

{ralign 32:variable} {...}
{c |}       p25       p50       p75       iqr      mean       min       max
{hline 33}{c +}{hline 70}
{ralign 32:TotCTDMeRaA00S00} {...}
{c |}{...}
 {res}  152.002  163.3071  174.7648  22.76274  179.6097  120.6364      1234
{txt}{hline 33}{c BT}{hline 70}
divider---------------------
                            
Lebanon

{ralign 32:variable} {...}
{c |}       p25       p50       p75       iqr      mean       min       max
{hline 33}{c +}{hline 70}
{ralign 32:DayCTDMeRaA00S00} {...}
{c |}{...}
 {res} 44.66667     70.04  132.3333  87.66666  106.2142         4      1360
{txt}{hline 33}{c BT}{hline 70}

{ralign 32:variable} {...}
{c |}       p25       p50       p75       iqr      mean       min       max
{hline 33}{c +}{hline 70}
{ralign 32:TotCTDMeRaA00S00} {...}
{c |}{...}
 {res} 52.32761  77.95314  113.3854  61.05776   82.1969  20.33333  136.5479
{txt}{hline 33}{c BT}{hline 70}
divider---------------------
                            
Libya

{ralign 32:variable} {...}
{c |}       p25       p50       p75       iqr      mean       min       max
{hline 33}{c +}{hline 70}
{ralign 32:DayCTDMeRaA00S00} {...}
{c |}{...}
 {res} 41.61111  64.92222     100.2  58.58889  81.71308       -72       622
{txt}{hline 33}{c BT}{hline 70}

{ralign 32:variable} {...}
{c |}       p25       p50       p75       iqr      mean       min       max
{hline 33}{c +}{hline 70}
{ralign 32:TotCTDMeRaA00S00} {...}
{c |}{...}
 {res}   47.432  60.00176  65.36991  17.93791   55.1746        11      78.6
{txt}{hline 33}{c BT}{hline 70}
divider---------------------
                            
Oman

{ralign 32:variable} {...}
{c |}       p25       p50       p75       iqr      mean       min       max
{hline 33}{c +}{hline 70}
{ralign 32:DayCTDMeRaA00S00} {...}
{c |}{...}
 {res}       53  96.22222  172.1429  119.1429  141.5554      8.75      1082
{txt}{hline 33}{c BT}{hline 70}

{ralign 32:variable} {...}
{c |}       p25       p50       p75       iqr      mean       min       max
{hline 33}{c +}{hline 70}
{ralign 32:TotCTDMeRaA00S00} {...}
{c |}{...}
 {res} 90.00512  97.01702  190.6667  100.6616  132.4312  85.65003    254.75
{txt}{hline 33}{c BT}{hline 70}
divider---------------------
                            
Qatar

{ralign 32:variable} {...}
{c |}       p25       p50       p75       iqr      mean       min       max
{hline 33}{c +}{hline 70}
{ralign 32:DayCTDMeRaA00S00} {...}
{c |}{...}
 {res}   139.25       230       456    316.75  324.9127         6      1554
{txt}{hline 33}{c BT}{hline 70}

{ralign 32:variable} {...}
{c |}       p25       p50       p75       iqr      mean       min       max
{hline 33}{c +}{hline 70}
{ralign 32:TotCTDMeRaA00S00} {...}
{c |}{...}
 {res}  582.267  598.3253  640.0451  57.77814  711.5116  316.3333  2373.733
{txt}{hline 33}{c BT}{hline 70}
divider---------------------
                            
Saudi_Arabia

{ralign 32:variable} {...}
{c |}       p25       p50       p75       iqr      mean       min       max
{hline 33}{c +}{hline 70}
{ralign 32:DayCTDMeRaA00S00} {...}
{c |}{...}
 {res}       24  64.38461        89        65  71.59478       9.4  407.6667
{txt}{hline 33}{c BT}{hline 70}

{ralign 32:variable} {...}
{c |}       p25       p50       p75       iqr      mean       min       max
{hline 33}{c +}{hline 70}
{ralign 32:TotCTDMeRaA00S00} {...}
{c |}{...}
 {res} 58.86284   65.1818  97.43986  38.57701   86.9406  57.66693       767
{txt}{hline 33}{c BT}{hline 70}
divider---------------------
                            
Syria

{ralign 32:variable} {...}
{c |}       p25       p50       p75       iqr      mean       min       max
{hline 33}{c +}{hline 70}
{ralign 32:DayCTDMeRaA00S00} {...}
{c |}{...}
 {res}     11.5      14.2      17.4       5.9  15.22769         0        72
{txt}{hline 33}{c BT}{hline 70}

{ralign 32:variable} {...}
{c |}       p25       p50       p75       iqr      mean       min       max
{hline 33}{c +}{hline 70}
{ralign 32:TotCTDMeRaA00S00} {...}
{c |}{...}
 {res} 14.97982  17.10526   21.1448   6.16498  18.53361         5  34.66667
{txt}{hline 33}{c BT}{hline 70}
divider---------------------
                            
Tunisia

{ralign 32:variable} {...}
{c |}       p25       p50       p75       iqr      mean       min       max
{hline 33}{c +}{hline 70}
{ralign 32:DayCTDMeRaA00S00} {...}
{c |}{...}
 {res} 17.98611        26        40  22.01389  34.89257         0     244.6
{txt}{hline 33}{c BT}{hline 70}

{ralign 32:variable} {...}
{c |}       p25       p50       p75       iqr      mean       min       max
{hline 33}{c +}{hline 70}
{ralign 32:TotCTDMeRaA00S00} {...}
{c |}{...}
 {res}   27.348  29.22466  33.42454  6.076542  33.93717  21.35294  75.88406
{txt}{hline 33}{c BT}{hline 70}
divider---------------------
                            
UAE

{ralign 32:variable} {...}
{c |}       p25       p50       p75       iqr      mean       min       max
{hline 33}{c +}{hline 70}
{ralign 32:DayCTDMeRaA00S00} {...}
{c |}{...}
 {res}   230.25     374.9    578.75     348.5  430.4413         0      1563
{txt}{hline 33}{c BT}{hline 70}

{ralign 32:variable} {...}
{c |}       p25       p50       p75       iqr      mean       min       max
{hline 33}{c +}{hline 70}
{ralign 32:TotCTDMeRaA00S00} {...}
{c |}{...}
 {res} 168.8129  256.0396  314.0368  145.2239  241.2557        70  359.5811
{txt}{hline 33}{c BT}{hline 70}
divider---------------------
                            
Yemen

{ralign 32:variable} {...}
{c |}       p25       p50       p75       iqr      mean       min       max
{hline 33}{c +}{hline 70}
{ralign 32:DayCTDMeRaA00S00} {...}
{c |}{...}
 {res}        2  4.675438  7.357143  5.357143  5.842729       -.2        41
{txt}{hline 33}{c BT}{hline 70}

{ralign 32:variable} {...}
{c |}       p25       p50       p75       iqr      mean       min       max
{hline 33}{c +}{hline 70}
{ralign 32:TotCTDMeRaA00S00} {...}
{c |}{...}
 {res} 3.447368  3.502024  4.439024  .9916561  3.987315         3  7.083333
{txt}{hline 33}{c BT}{hline 70}
divider---------------------
                            

{com}. *
. 
. 
. 
. 
. 
. 
. 
. 
. * smooth 
. 
. encode loc_grand_name, gen(loc_grand_name_numeric)
{txt}
{com}. 
. tsset loc_grand_name_numeric date, daily   
{res}{txt}{col 8}panel variable:  {res}loc_grand_name_numeric (strongly balanced)
{txt}{col 9}time variable:  {res}{col 25}date, 22jan2020 to 27may2021
{txt}{col 17}delta:  {res}1 day
{txt}
{com}. 
. 
. tssmooth ma DayDeaMeRaA00S00_window = DayDeaMeRaA00S00 if DayDeaMeRaA00S00 >= 0, window(3 1 3)
{txt}The smoother applied was
{res}{p 5 5 5} by loc_grand_name_numeric : (1/7)*[x(t-3) + x(t-2) + x(t-1) + 1*x(t) + x(t+1) + x(t+2) + x(t+3)]; x(t)= DayDeaMeRaA00S00 {p_end}
{txt}
{com}. 
. tssmooth ma DayDeaMeSmA00S00 = DayDeaMeRaA00S00_window, weights( 1 2 3 <4> 3 2 1) replace
{txt}The smoother applied was
{res}{p 5 5 5} by loc_grand_name_numeric : (1/16)*[1*x(t-3) + 2*x(t-2) + 3*x(t-1) + 4*x(t) + 3*x(t+1) + 2*x(t+2) + ...; x(t)= DayDeaMeRaA00S00_window
{txt}
{smcl}
{com}. 
. label var DayDeaMeSmA00S00 "Daily deaths mean smooth JOHN"
{txt}
{com}. 
. drop DayDeaMeRaA00S00_window
{txt}
{com}. 
. 
. tssmooth ma DayCasMeRaA00S00_window = DayCasMeRaA00S00 if DayCasMeRaA00S00 >= 0, window(3 1 3)
{txt}The smoother applied was
{res}{p 5 5 5} by loc_grand_name_numeric : (1/7)*[x(t-3) + x(t-2) + x(t-1) + 1*x(t) + x(t+1) + x(t+2) + x(t+3)]; x(t)= DayCasMeRaA00S00 {p_end}
{txt}
{com}. 
. tssmooth ma DayCasMeSmA00S00 = DayCasMeRaA00S00_window, weights( 1 2 3 <4> 3 2 1) replace
{txt}The smoother applied was
{res}{p 5 5 5} by loc_grand_name_numeric : (1/16)*[1*x(t-3) + 2*x(t-2) + 3*x(t-1) + 4*x(t) + 3*x(t+1) + 2*x(t+2) + ...; x(t)= DayCasMeRaA00S00_window
{txt}
{smcl}
{com}. 
. label var DayCasMeSmA00S00 "Daily cases mean smooth JOHN"
{txt}
{com}. 
. drop DayCasMeRaA00S00_window
{txt}
{com}. 
. 
. tssmooth ma DayCfrMeRaA00S00_window = DayCfrMeRaA00S00 if DayCfrMeRaA00S00 >= 0, window(3 1 3)
{txt}The smoother applied was
{res}{p 5 5 5} by loc_grand_name_numeric : (1/7)*[x(t-3) + x(t-2) + x(t-1) + 1*x(t) + x(t+1) + x(t+2) + x(t+3)]; x(t)= DayCfrMeRaA00S00 {p_end}
{txt}
{com}. 
. tssmooth ma DayCfrMeSmA00S00 = DayCfrMeRaA00S00_window, weights( 1 2 3 <4> 3 2 1) replace
{txt}The smoother applied was
{res}{p 5 5 5} by loc_grand_name_numeric : (1/16)*[1*x(t-3) + 2*x(t-2) + 3*x(t-1) + 4*x(t) + 3*x(t+1) + 2*x(t+2) + ...; x(t)= DayCfrMeRaA00S00_window
{txt}
{smcl}
{com}. 
. label var DayCfrMeSmA00S00 "Daily CFR mean smooth JOHN"
{txt}
{com}. 
. drop DayCfrMeRaA00S00_window
{txt}
{com}. 
. 
. tssmooth ma DayCTDMeRaA00S00_window = DayCTDMeRaA00S00 if DayCTDMeRaA00S00 >= 0, window(3 1 3)
{txt}The smoother applied was
{res}{p 5 5 5} by loc_grand_name_numeric : (1/7)*[x(t-3) + x(t-2) + x(t-1) + 1*x(t) + x(t+1) + x(t+2) + x(t+3)]; x(t)= DayCTDMeRaA00S00 {p_end}
{txt}
{com}. 
. tssmooth ma DayCTDMeSmA00S00 = DayCTDMeRaA00S00_window, weights( 1 2 3 <4> 3 2 1) replace
{txt}The smoother applied was
{res}{p 5 5 5} by loc_grand_name_numeric : (1/16)*[1*x(t-3) + 2*x(t-2) + 3*x(t-1) + 4*x(t) + 3*x(t+1) + 2*x(t+2) + ...; x(t)= DayCTDMeRaA00S00_window
{txt}
{smcl}
{com}. 
. label var DayCTDMeSmA00S00 "Daily CTD mean smooth JOHN"
{txt}
{com}. 
. drop DayCTDMeRaA00S00_window
{txt}
{com}. 
. 
. 
. tssmooth ma TotCTDMeRaA00S00_window = TotCTDMeRaA00S00 if TotCTDMeRaA00S00 >= 0, window(3 1 3)
{txt}The smoother applied was
{res}{p 5 5 5} by loc_grand_name_numeric : (1/7)*[x(t-3) + x(t-2) + x(t-1) + 1*x(t) + x(t+1) + x(t+2) + x(t+3)]; x(t)= TotCTDMeRaA00S00 {p_end}
{txt}
{com}. 
. tssmooth ma TotCTDMeSmA00S00 = TotCTDMeRaA00S00_window, weights( 1 2 3 <4> 3 2 1) replace
{txt}The smoother applied was
{res}{p 5 5 5} by loc_grand_name_numeric : (1/16)*[1*x(t-3) + 2*x(t-2) + 3*x(t-1) + 4*x(t) + 3*x(t+1) + 2*x(t+2) + ...; x(t)= TotCTDMeRaA00S00_window
{txt}
{smcl}
{com}. 
. label var TotCTDMeSmA00S00 "Total CTD mean smooth JOHN"
{txt}
{com}. 
. drop TotCTDMeRaA00S00_window
{txt}
{com}. 
. 
. 
. 
. levelsof loc_grand_name, local(levels)
{txt}`"1_Global"' `"2_EMR"' `"Algeria"' `"Bahrain"' `"Djibouti"' `"Egypt"' `"Iran"' `"Iraq"' `"Israel"' `"Jordan"' `"Kuwait"' `"Lebanon"' `"Libya"' `"Oman"' `"Qatar"' `"Saudi_Arabia"' `"Syria"' `"Tunisia"' `"UAE"' `"Yemen"'

{com}. 
. foreach l of local levels {c -(}
{txt}  2{com}. 
.         tssmooth ma DayDea_multip_`l'_w = DayDea_multip_`l' if (DayDea_multip_`l' >= 0) & (loc_grand_name == "`l'"), window(3 1 3)
{txt}  3{com}. 
.         tssmooth ma DayDea_multip_`l'_sm = DayDea_multip_`l'_w if (loc_grand_name == "`l'"), weights( 1 2 3 <4> 3 2 1) replace
{txt}  4{com}. 
.         label var DayDea_multip_`l'_w "Daily deaths scaled smooth only for visualization JOHN"
{txt}  5{com}. 
.         drop DayDea_multip_`l'_w 
{txt}  6{com}. {c )-}
{txt}The smoother applied was
{res}{p 5 5 5}(1/7)*[x(t-3) + x(t-2) + x(t-1) + 1*x(t) + x(t+1) + x(t+2) + x(t+3)]; x(t)= DayDea_multip_1_Global {p_end}
{txt}The smoother applied was
{res}{p 5 5 5}(1/16)*[1*x(t-3) + 2*x(t-2) + 3*x(t-1) + 4*x(t) + 3*x(t+1) + 2*x(t+2) + ...; x(t)= DayDea_multip_1_Global_w 
{txt}The smoother applied was
{res}{p 5 5 5}(1/7)*[x(t-3) + x(t-2) + x(t-1) + 1*x(t) + x(t+1) + x(t+2) + x(t+3)]; x(t)= DayDea_multip_2_EMR {p_end}
{txt}The smoother applied was
{res}{p 5 5 5}(1/16)*[1*x(t-3) + 2*x(t-2) + 3*x(t-1) + 4*x(t) + 3*x(t+1) + 2*x(t+2) + ...; x(t)= DayDea_multip_2_EMR_w 
{txt}The smoother applied was
{res}{p 5 5 5}(1/7)*[x(t-3) + x(t-2) + x(t-1) + 1*x(t) + x(t+1) + x(t+2) + x(t+3)]; x(t)= DayDea_multip_Algeria {p_end}
{txt}The smoother applied was
{res}{p 5 5 5}(1/16)*[1*x(t-3) + 2*x(t-2) + 3*x(t-1) + 4*x(t) + 3*x(t+1) + 2*x(t+2) + ...; x(t)= DayDea_multip_Algeria_w 
{txt}The smoother applied was
{res}{p 5 5 5}(1/7)*[x(t-3) + x(t-2) + x(t-1) + 1*x(t) + x(t+1) + x(t+2) + x(t+3)]; x(t)= DayDea_multip_Bahrain {p_end}
{txt}The smoother applied was
{res}{p 5 5 5}(1/16)*[1*x(t-3) + 2*x(t-2) + 3*x(t-1) + 4*x(t) + 3*x(t+1) + 2*x(t+2) + ...; x(t)= DayDea_multip_Bahrain_w 
{txt}The smoother applied was
{res}{p 5 5 5}(1/7)*[x(t-3) + x(t-2) + x(t-1) + 1*x(t) + x(t+1) + x(t+2) + x(t+3)]; x(t)= DayDea_multip_Djibouti {p_end}
{txt}The smoother applied was
{res}{p 5 5 5}(1/16)*[1*x(t-3) + 2*x(t-2) + 3*x(t-1) + 4*x(t) + 3*x(t+1) + 2*x(t+2) + ...; x(t)= DayDea_multip_Djibouti_w 
{txt}The smoother applied was
{res}{p 5 5 5}(1/7)*[x(t-3) + x(t-2) + x(t-1) + 1*x(t) + x(t+1) + x(t+2) + x(t+3)]; x(t)= DayDea_multip_Egypt {p_end}
{txt}The smoother applied was
{res}{p 5 5 5}(1/16)*[1*x(t-3) + 2*x(t-2) + 3*x(t-1) + 4*x(t) + 3*x(t+1) + 2*x(t+2) + ...; x(t)= DayDea_multip_Egypt_w 
{txt}The smoother applied was
{res}{p 5 5 5}(1/7)*[x(t-3) + x(t-2) + x(t-1) + 1*x(t) + x(t+1) + x(t+2) + x(t+3)]; x(t)= DayDea_multip_Iran {p_end}
{txt}The smoother applied was
{res}{p 5 5 5}(1/16)*[1*x(t-3) + 2*x(t-2) + 3*x(t-1) + 4*x(t) + 3*x(t+1) + 2*x(t+2) + ...; x(t)= DayDea_multip_Iran_w 
{txt}The smoother applied was
{res}{p 5 5 5}(1/7)*[x(t-3) + x(t-2) + x(t-1) + 1*x(t) + x(t+1) + x(t+2) + x(t+3)]; x(t)= DayDea_multip_Iraq {p_end}
{txt}The smoother applied was
{res}{p 5 5 5}(1/16)*[1*x(t-3) + 2*x(t-2) + 3*x(t-1) + 4*x(t) + 3*x(t+1) + 2*x(t+2) + ...; x(t)= DayDea_multip_Iraq_w 
{txt}The smoother applied was
{res}{p 5 5 5}(1/7)*[x(t-3) + x(t-2) + x(t-1) + 1*x(t) + x(t+1) + x(t+2) + x(t+3)]; x(t)= DayDea_multip_Israel {p_end}
{txt}The smoother applied was
{res}{p 5 5 5}(1/16)*[1*x(t-3) + 2*x(t-2) + 3*x(t-1) + 4*x(t) + 3*x(t+1) + 2*x(t+2) + ...; x(t)= DayDea_multip_Israel_w 
{txt}The smoother applied was
{res}{p 5 5 5}(1/7)*[x(t-3) + x(t-2) + x(t-1) + 1*x(t) + x(t+1) + x(t+2) + x(t+3)]; x(t)= DayDea_multip_Jordan {p_end}
{txt}The smoother applied was
{res}{p 5 5 5}(1/16)*[1*x(t-3) + 2*x(t-2) + 3*x(t-1) + 4*x(t) + 3*x(t+1) + 2*x(t+2) + ...; x(t)= DayDea_multip_Jordan_w 
{txt}The smoother applied was
{res}{p 5 5 5}(1/7)*[x(t-3) + x(t-2) + x(t-1) + 1*x(t) + x(t+1) + x(t+2) + x(t+3)]; x(t)= DayDea_multip_Kuwait {p_end}
{txt}The smoother applied was
{res}{p 5 5 5}(1/16)*[1*x(t-3) + 2*x(t-2) + 3*x(t-1) + 4*x(t) + 3*x(t+1) + 2*x(t+2) + ...; x(t)= DayDea_multip_Kuwait_w 
{txt}The smoother applied was
{res}{p 5 5 5}(1/7)*[x(t-3) + x(t-2) + x(t-1) + 1*x(t) + x(t+1) + x(t+2) + x(t+3)]; x(t)= DayDea_multip_Lebanon {p_end}
{txt}The smoother applied was
{res}{p 5 5 5}(1/16)*[1*x(t-3) + 2*x(t-2) + 3*x(t-1) + 4*x(t) + 3*x(t+1) + 2*x(t+2) + ...; x(t)= DayDea_multip_Lebanon_w 
{txt}The smoother applied was
{res}{p 5 5 5}(1/7)*[x(t-3) + x(t-2) + x(t-1) + 1*x(t) + x(t+1) + x(t+2) + x(t+3)]; x(t)= DayDea_multip_Libya {p_end}
{txt}The smoother applied was
{res}{p 5 5 5}(1/16)*[1*x(t-3) + 2*x(t-2) + 3*x(t-1) + 4*x(t) + 3*x(t+1) + 2*x(t+2) + ...; x(t)= DayDea_multip_Libya_w 
{txt}The smoother applied was
{res}{p 5 5 5}(1/7)*[x(t-3) + x(t-2) + x(t-1) + 1*x(t) + x(t+1) + x(t+2) + x(t+3)]; x(t)= DayDea_multip_Oman {p_end}
{txt}The smoother applied was
{res}{p 5 5 5}(1/16)*[1*x(t-3) + 2*x(t-2) + 3*x(t-1) + 4*x(t) + 3*x(t+1) + 2*x(t+2) + ...; x(t)= DayDea_multip_Oman_w 
{txt}The smoother applied was
{res}{p 5 5 5}(1/7)*[x(t-3) + x(t-2) + x(t-1) + 1*x(t) + x(t+1) + x(t+2) + x(t+3)]; x(t)= DayDea_multip_Qatar {p_end}
{txt}The smoother applied was
{res}{p 5 5 5}(1/16)*[1*x(t-3) + 2*x(t-2) + 3*x(t-1) + 4*x(t) + 3*x(t+1) + 2*x(t+2) + ...; x(t)= DayDea_multip_Qatar_w 
{txt}The smoother applied was
{res}{p 5 5 5}(1/7)*[x(t-3) + x(t-2) + x(t-1) + 1*x(t) + x(t+1) + x(t+2) + x(t+3)]; x(t)= DayDea_multip_Saudi_Arabia {p_end}
{txt}The smoother applied was
{res}{p 5 5 5}(1/16)*[1*x(t-3) + 2*x(t-2) + 3*x(t-1) + 4*x(t) + 3*x(t+1) + 2*x(t+2) + ...; x(t)= DayDea_multip_Saudi_Arabia_w 
{txt}The smoother applied was
{res}{p 5 5 5}(1/7)*[x(t-3) + x(t-2) + x(t-1) + 1*x(t) + x(t+1) + x(t+2) + x(t+3)]; x(t)= DayDea_multip_Syria {p_end}
{txt}The smoother applied was
{res}{p 5 5 5}(1/16)*[1*x(t-3) + 2*x(t-2) + 3*x(t-1) + 4*x(t) + 3*x(t+1) + 2*x(t+2) + ...; x(t)= DayDea_multip_Syria_w 
{txt}The smoother applied was
{res}{p 5 5 5}(1/7)*[x(t-3) + x(t-2) + x(t-1) + 1*x(t) + x(t+1) + x(t+2) + x(t+3)]; x(t)= DayDea_multip_Tunisia {p_end}
{txt}The smoother applied was
{res}{p 5 5 5}(1/16)*[1*x(t-3) + 2*x(t-2) + 3*x(t-1) + 4*x(t) + 3*x(t+1) + 2*x(t+2) + ...; x(t)= DayDea_multip_Tunisia_w 
{txt}The smoother applied was
{res}{p 5 5 5}(1/7)*[x(t-3) + x(t-2) + x(t-1) + 1*x(t) + x(t+1) + x(t+2) + x(t+3)]; x(t)= DayDea_multip_UAE {p_end}
{txt}The smoother applied was
{res}{p 5 5 5}(1/16)*[1*x(t-3) + 2*x(t-2) + 3*x(t-1) + 4*x(t) + 3*x(t+1) + 2*x(t+2) + ...; x(t)= DayDea_multip_UAE_w 
{txt}The smoother applied was
{res}{p 5 5 5}(1/7)*[x(t-3) + x(t-2) + x(t-1) + 1*x(t) + x(t+1) + x(t+2) + x(t+3)]; x(t)= DayDea_multip_Yemen {p_end}
{txt}The smoother applied was
{res}{p 5 5 5}(1/16)*[1*x(t-3) + 2*x(t-2) + 3*x(t-1) + 4*x(t) + 3*x(t+1) + 2*x(t+2) + ...; x(t)= DayDea_multip_Yemen_w 
{txt}
{smcl}
{com}. * 
. 
. 
. * 
. 
. tsset, clear
{txt}
{com}. 
. 
. 
. sort date loc_grand_name
{txt}
{com}. 
. qui compress
{txt}
{com}. 
. 
. 
. save "EMR JOHN.dta", replace
{txt}file EMR JOHN.dta saved

{com}. 
. 
. 
. 
. 
. 
. 
. **************
. 
. * graphs
. 
. ssc install grstyle, replace
{txt}checking {hilite:grstyle} consistency and verifying not already installed...
all files already exist and are up to date.

{com}. 
. grstyle init
{res}{txt}
{com}. 
. grstyle color background white
{txt}
{com}. 
. 
. 
. 
. 
. 
. 
. * adjust x axis ticks from Jan 2020 to this month and avoid globals
. forval i = 1(1)12 {c -(}
{txt}  2{com}.         local date2020 = mdy(`i', 1, 2020)
{txt}  3{com}.         local dates2020 `dates2020' `date2020'
{txt}  4{com}. {c )-}
{txt}
{com}. local wanted : di %tdNN daily("$S_DATE", "DMY")
{res}{txt}
{com}. forval i = 1(1)`wanted' {c -(}
{txt}  2{com}.         local date2021 = mdy(`i', 1, 2021)
{txt}  3{com}.         local dates2021 `dates2021' `date2021'
{txt}  4{com}. {c )-}
{txt}
{com}. *
. 
. 
. 
. 
. levelsof loc_grand_name, local(levels)
{txt}`"1_Global"' `"2_EMR"' `"Algeria"' `"Bahrain"' `"Djibouti"' `"Egypt"' `"Iran"' `"Iraq"' `"Israel"' `"Jordan"' `"Kuwait"' `"Lebanon"' `"Libya"' `"Oman"' `"Qatar"' `"Saudi_Arabia"' `"Syria"' `"Tunisia"' `"UAE"' `"Yemen"'

{com}. 
. foreach l of local levels {c -(}
{txt}  2{com}. 
. 
. 
. ** DayCas DayDea DayDea_multip
. 
. 
. * DayCas DayDea DayDea_multip, all raw
. 
. twoway ///
> (line DayCasMeRaA00S00 date, sort lcolor(blue)) ///
> (line DayDeaMeRaA00S00 date, sort lcolor(red)) ///
> (line DayDea_multip_`l' date, sort lpattern(dot) lcolor(red)) ///
> if date > td(01jan2020) & loc_grand_name == "`l'" ///
> , xtitle(Date) xlabel(`dates2020' `dates2021', format(%tdYY-NN-DD) labsize(small)) xlabel(, grid) xlabel(, grid) ///
> xlabel(, angle(forty_five)) ylabel(, format(%12.0fc) labsize(small)) ylabel(, labsize(small) angle(horizontal)) ///
> ytitle(Daily cases and deaths) title("COVID-19 daily cases and deaths, `l', Johns Hopkins", size(medium)) ///
> xscale(lwidth(vthin) lcolor(gray*.2)) yscale(lwidth(vthin) lcolor(gray*.2)) yscale(titlegap(4)) legend(region(lcolor(none)))  ///
> legend(order(1 "Daily cases" 2 "Daily deaths" 3 "Daily deaths scaled for visualization") size(small)) ///
> subtitle("Daily deaths, scaled = times (means of cases divided by deaths) for visualization only", size(small))
{txt}  3{com}. 
. qui graph save "graph 1 COVID-19 daily deaths and cases `l' Johns Hopkins.gph", replace
{txt}  4{com}. qui graph export "graph 1 COVID-19 daily deaths and cases `l' Johns Hopkins.pdf", replace
{txt}  5{com}. 
. 
. 
. 
. 
. * DayCas DayDea DayDea_multip, all smooth
. 
. twoway ///
> (line DayCasMeSmA00S00 date, sort lcolor(blue)) ///
> (line DayDeaMeSmA00S00 date, sort lcolor(red)) ///
> (line DayDea_multip_`l'_sm date, sort lpattern(dot) lcolor(red)) ///
> if date > td(01jan2020) & loc_grand_name == "`l'" ///
> , xtitle(Date) xlabel(`dates2020' `dates2021', format(%tdYY-NN-DD) labsize(small)) xlabel(, grid) xlabel(, grid) ///
> xlabel(, angle(forty_five)) ylabel(, format(%12.0fc) labsize(small)) ylabel(, labsize(small) angle(horizontal)) ///
> ytitle(Daily cases and deaths smoothed) title("COVID-19 daily cases and deaths smoothed, `l', Johns Hopkins", size(medium)) ///
> xscale(lwidth(vthin) lcolor(gray*.2)) yscale(lwidth(vthin) lcolor(gray*.2)) yscale(titlegap(4)) legend(region(lcolor(none)))  ///
> legend(order(1 "Daily cases smoothed" 2 "Daily deaths smoothed" 3 "Daily deaths scaled for visualization, smoothed") size(small)) ///
> subtitle("Daily deaths, scaled = times (means of cases divided by deaths) for visualization only, smoothed", size(small))
{txt}  6{com}. 
. qui graph save "graph 2 COVID-19 daily deaths and cases smoothed `l' Johns Hopkins.gph", replace
{txt}  7{com}. qui graph export "graph 2 COVID-19 daily deaths and cases smoothed `l' Johns Hopkins.pdf", replace
{txt}  8{com}. 
. 
. 
. 
. 
. ** DayDea
. 
. * DayDea, raw and smooth 
. 
. 
. twoway ///
> (line DayDeaMeRaA00S00 date, sort lcolor(gray)) ///
> (line DayDeaMeSmA00S00 date, sort lwidth(thick) lcolor(red)) ///
> if date > td(01jan2020) & loc_grand_name == "`l'" ///
> , xtitle(Date) xlabel(`dates2020' `dates2021', format(%tdYY-NN-DD) labsize(small)) xlabel(, grid) xlabel(, grid) ///
> xlabel(, angle(forty_five)) ylabel(, format(%12.0fc) labsize(small)) ylabel(, labsize(small) angle(horizontal)) ///
> ytitle(Daily deaths) title("COVID-19 daily deaths, `l', Johns Hopkins", size(medium)) ///
> xscale(lwidth(vthin) lcolor(gray*.2)) yscale(lwidth(vthin) lcolor(gray*.2)) yscale(titlegap(4)) legend(region(lcolor(none)))  ///
> legend(order(1 "Raw" 2 "Smoothed") size(small)) 
{txt}  9{com}. 
. qui graph save "graph 3 COVID-19 daily deaths `l' Johns Hopkins.gph", replace
{txt} 10{com}. qui graph export "graph 3 COVID-19 daily deaths `l' Johns Hopkins.pdf", replace
{txt} 11{com}. 
. 
. 
. ** Day CFR
. 
. * Day CFR raw
. 
. twoway ///
> (line DayCfrMeRaA00S00 date, sort lcolor(black)) ///
> if date > td(01jan2020) & loc_grand_name == "`l'" ///
> , xtitle(Date) xlabel(`dates2020' `dates2021', format(%tdYY-NN-DD) labsize(small)) xlabel(, grid) xlabel(, grid) ///
> xlabel(, angle(forty_five)) ylabel(, format(%9.2fc) labsize(small))  ylabel(, labsize(small) angle(horizontal)) ///
> ytitle(Daily CFR) title("COVID-19 daily CFR, `l', Johns Hopkins", size(medium)) ///
> xscale(lwidth(vthin) lcolor(gray*.2)) yscale(lwidth(vthin) lcolor(gray*.2)) legend(region(lcolor(none))) legend(bexpand) 
{txt} 12{com}. 
. qui graph save "graph 4 COVID-19 daily CFR, `l', Johns Hopkins.gph", replace
{txt} 13{com}. qui graph export "graph 4 COVID-19 daily CFR, `l', Johns Hopkins.pdf", replace
{txt} 14{com}. 
. 
. 
. * Day CFR smoothed
. 
. twoway ///
> (line DayCfrMeSmA00S00 date, sort lcolor(black)) ///
> if date > td(01jan2020) & loc_grand_name == "`l'" ///
> , xtitle(Date) xlabel(`dates2020' `dates2021', format(%tdYY-NN-DD) labsize(small)) xlabel(, grid) xlabel(, grid) ///
> xlabel(, angle(forty_five)) ylabel(, format(%9.2fc) labsize(small))  ylabel(, labsize(small) angle(horizontal)) ///
> ytitle(Daily CFR smoothed) title("COVID-19 daily CFR, smoothed, `l', Johns Hopkins", size(medium)) ///
> xscale(lwidth(vthin) lcolor(gray*.2)) yscale(lwidth(vthin) lcolor(gray*.2)) legend(region(lcolor(none))) legend(bexpand) 
{txt} 15{com}. 
. qui graph save "graph 5 COVID-19 daily CFR, smoothed `l', Johns Hopkins.gph", replace
{txt} 16{com}. qui graph export "graph 5 COVID-19 daily CFR, smoothed `l', Johns Hopkins.pdf", replace
{txt} 17{com}. 
. 
. 
. 
. * Day CFR raw and smoothed
. 
. twoway ///
> (line DayCfrMeRaA00S00 date, sort lcolor(gray)) ///
> (line DayCfrMeSmA00S00 date, sort lwidth(thick) lcolor(red)) ///
> if date > td(01jan2020) & loc_grand_name == "`l'" ///
> , xtitle(Date) xlabel(`dates2020' `dates2021', format(%tdYY-NN-DD) labsize(small)) xlabel(, grid) xlabel(, grid) ///
> xlabel(, angle(forty_five)) ylabel(, format(%9.2fc) labsize(small))  ylabel(, labsize(small) angle(horizontal)) ///
> ytitle(Daily CFR) title("COVID-19 daily CFR, `l', Johns Hopkins", size(medium)) ///
> xscale(lwidth(vthin) lcolor(gray*.2)) yscale(lwidth(vthin) lcolor(gray*.2)) legend(region(lcolor(none))) legend(bexpand) ///
> legend(order(1 "Raw" 2 "Smoothed") size(small)) ///
> 
{txt} 18{com}. qui graph save "graph 6 COVID-19 daily CFR, raw and smoothed, `l', Johns Hopkins.gph", replace
{txt} 19{com}. qui graph export "graph 6 COVID-19 daily CFR, raw and smoothed, `l', Johns Hopkins.pdf", replace
{txt} 20{com}. 
. 
. 
. 
. ** Cases to deaths ratio (CTD)
. 
. 
. * Day CTD raw and smoothed
. 
. twoway ///
> (line DayCTDMeRaA00S00 date, sort lcolor(gray)) ///
> (line DayCTDMeSmA00S00 date, sort lwidth(thick) lcolor(red)) ///
> if date > td(01jan2020) & loc_grand_name == "`l'" ///
> , xtitle(Date) xlabel(`dates2020' `dates2021', format(%tdYY-NN-DD) labsize(small)) xlabel(, grid) xlabel(, grid) ///
> xlabel(, angle(forty_five)) ylabel(, format(%9.2fc) labsize(small))  ylabel(, labsize(small) angle(horizontal)) ///
> ytitle(Daily Cases to deaths ratio) title("COVID-19 daily cases to deaths ratio, `l', Johns Hopkins", size(medium)) ///
> xscale(lwidth(vthin) lcolor(gray*.2)) yscale(lwidth(vthin) lcolor(gray*.2)) legend(region(lcolor(none))) legend(bexpand) ///
> legend(order(1 "Raw" 2 "Smoothed") size(small)) ///
> 
{txt} 21{com}. qui graph save "graph 7 COVID-19 daily CTD, raw and smoothed, `l', Johns Hopkins.gph", replace
{txt} 22{com}. qui graph export "graph 7 COVID-19 daily CTD, raw and smoothed, `l', Johns Hopkins.pdf", replace
{txt} 23{com}. 
. 
. 
. 
. * Tot CTD raw and smoothed
. 
. twoway ///
> (line TotCTDMeRaA00S00 date, sort lcolor(gray)) ///
> (line TotCTDMeSmA00S00 date, sort lwidth(thick) lcolor(red)) ///
> if date > td(01jan2020) & loc_grand_name == "`l'" ///
> , xtitle(Date) xlabel(`dates2020' `dates2021', format(%tdYY-NN-DD) labsize(small)) xlabel(, grid) xlabel(, grid) ///
> xlabel(, angle(forty_five)) ylabel(, format(%9.2fc) labsize(small))  ylabel(, labsize(small) angle(horizontal)) ///
> ytitle(Total Cases to deaths ratio) title("COVID-19 total cases to deaths ratio, `l', Johns Hopkins", size(medium)) ///
> xscale(lwidth(vthin) lcolor(gray*.2)) yscale(lwidth(vthin) lcolor(gray*.2)) legend(region(lcolor(none))) legend(bexpand) ///
> legend(order(1 "Raw" 2 "Smoothed") size(small)) ///
> 
{txt} 24{com}. qui graph save "graph 8 COVID-19 total CTD, raw and smoothed, `l', Johns Hopkins.gph", replace
{txt} 25{com}. qui graph export "graph 8 COVID-19 total CTD, raw and smoothed, `l', Johns Hopkins.pdf", replace
{txt} 26{com}. 
. 
. 
. {c )-}
{res}{txt}
{com}. *
. 
. 
. 
. 
. 
. 
. 
. 
. view "log EMR JOHN.smcl"
{txt}
{com}. 
. log close
      {txt}name:  {res}<unnamed>
       {txt}log:  {res}/Users/farshadpourmalek/Downloads/covir2-main/20210528/code/JOHNEMR/log EMR JOHN.smcl
  {txt}log type:  {res}smcl
 {txt}closed on:  {res}28 May 2021, 16:47:29
{txt}{.-}
{smcl}
{txt}{sf}{ul off}