{smcl}
{txt}{sf}{ul off}{.-}
      name:  {res}<unnamed>
       {txt}log:  {res}/Users/farshadpourmalek/Downloads/covir2-main/20210604/code/GHAN/log Iran GHAN.smcl
  {txt}log type:  {res}smcl
 {txt}opened on:  {res} 5 Jun 2021, 07:46:05
{txt}
{com}. 
. ***************************************************************************
. * This is "do Iran GHAN.do"
. 
. * Project: COVID-19 Iran Review No 2
. * Person: Farshad Pourmalek pourmalek_farshad@yahoo.com
. * Time (initial): 2021-02-10
. 
. * OBJECTIVE: Get and prepare GHANbari data for Iran
. ***************************************************************************
. 
. 
. 
. 
. /* Note on outcomes and scenarios: 
> 
> Ghanbari has two subtypes of Daily Cases, “Density of the infected population with a strong immunity system”, 
> and “Density of the infected population with a weak immunity system or with a historical medical illness as diabetic, blood pressure, heart issue, and others.” 
> Each subtype is presented with 18 different values (aka model subtypes) based on different values of three parameters in their model. 
> We selected the median scenario for the first subtype for digitalization. It is model the model subtype number 9 out of 18 subtypes (named S09 here), with the following details. 
> 
> Model subtype parameter: γ1 = 0.09, where γ1 is recovery rate in population subtype 1
> Time point: Second peak 
> Estimate type: Mean
> Peak value mentioned: 897,264   
> Peak date Solar: 1399 11 30     
> Peak date Gregorian: 2021 02 18 
> Source: Fig 4a, green curve
> 
> */
. 
. 
. ***************************************
. 
. * Get GHAN estimates 
. 
. import excel using "GHAN dig data.xlsx", clear firstrow 
{res}{txt}
{com}. 
. keep date day1is20200122 outcome daysfrom1960
{txt}
{com}. 
. rename outcome DayActMeRaA07S09
{res}{txt}
{com}. 
. label var DayActMeRaA07S09 "Daily Active cases GHAN S9" 
{txt}
{com}. 
. rename daysfrom1960 date2
{res}{txt}
{com}. 
. format date2 %tdDDMonCCYY
{txt}
{com}. 
. codebook date2

{txt}{hline}
{res}date2{right:daysfrom1960}
{txt}{hline}

{col 19}type:  numeric daily date ({res}int{txt})

{col 18}range:  [{res}21936{txt},{res}22626{txt}]{col 55}units:  {res}1
{col 8}{txt}or equivalently:  [{res}22jan2020{txt},{res}12dec2021{txt}]{col 55}units:  {res}days
{col 10}{txt}unique values:  {res}691{col 51}{txt}missing .:  {res}4{txt}/{res}695

{txt}{col 19}mean:{res}{col 26}   22281{txt} = {res}01jan2021{txt}
{col 15}std. dev:{res}{col 26} 199.619

{txt}{col 12}percentiles:{col 32}10%{col 42}25%{col 52}50%{col 62}75%{col 72}90%
{res}{col 27}   22005{col 37}   22108{col 47}   22281{col 57}   22454{col 67}   22557
{col 26}31mar2020{col 36}12jul2020{col 46}01jan2021{col 56}23jun2021{col 66}04oct2021
{txt}
{com}. 
. drop date day1is20200122 
{txt}
{com}. 
. rename date2 date
{res}{txt}
{com}. 
. drop if DayActMeRaA07S09 == . & date > td(12Dec2021)
{txt}(4 observations deleted)

{com}. 
. order date DayActMeRaA07S09
{txt}
{com}. 
. 
. 
. 
. *******************
. 
. * graph 
. 
. 
. grstyle init
{res}{txt}
{com}. 
. grstyle color background white
{txt}
{com}.  
. 
. twoway /// 
> (line DayActMeRaA07S09 date, sort lcolor(blue)) ///
> , xtitle(Date) xlabel(#24, format(%tdYY-NN-DD) labsize(small)) xlabel(, grid) xlabel(, grid) ///
> xlabel(, angle(forty_five)) ylabel(, format(%9.0fc) labsize(small))  ylabel(, labsize(small) angle(horizontal)) ///
> ytitle(Daily Acive cases) title("COVID-19 daily active cases, Iran, GHAN, median scenario", size(medium)) ///
> xscale(lwidth(vthin) lcolor(gray*.2)) yscale(lwidth(vthin) lcolor(gray*.2)) legend(off) ///
> note("(Daily active cases in population with ‘a strong immunity system’)")
{res}{txt}
{com}. 
. graph save "graph COVID-19 daily cases, Iran, GHAN.gph", replace
{txt}(note: file graph COVID-19 daily cases, Iran, GHAN.gph not found)
{res}{txt}(file graph COVID-19 daily cases, Iran, GHAN.gph saved)

{com}. graph export "graph COVID-19 daily Acive cases, Iran, GHAN.pdf", replace
{txt}(file /Users/farshadpourmalek/Downloads/covir2-main/20210604/code/GHAN/graph COVID-19 daily Acive cases, Iran, GHAN.pdf written in PDF format)

{com}. 
. 
. 
. 
. 
. save "Iran GHAN.dta", replace 
{txt}(note: file Iran GHAN.dta not found)
file Iran GHAN.dta saved

{com}. 
. 
. 
. 
. view "log Iran GHAN.smcl"
{txt}
{com}. 
. log close
      {txt}name:  {res}<unnamed>
       {txt}log:  {res}/Users/farshadpourmalek/Downloads/covir2-main/20210604/code/GHAN/log Iran GHAN.smcl
  {txt}log type:  {res}smcl
 {txt}closed on:  {res} 5 Jun 2021, 07:46:07
{txt}{.-}
{smcl}
{txt}{sf}{ul off}