{smcl}
{com}{sf}{ul off}{txt}{.-}
      name:  {res}<unnamed>
       {txt}log:  {res}/Users/farshadpourmalek/Downloads/covir2-main/20220708/code/IHME/log country IHME 2.smcl
  {txt}log type:  {res}smcl
 {txt}opened on:  {res} 8 Jul 2022, 16:38:16
{txt}
{com}. 
. ***************************************************************************
. * This is "do country IHME 2.do"
. 
. * Project: CovidVisualized country - countries without subnational estimates                                                                       
. * Person: Farshad Pourmalek
. ***************************************************************************
. 
. 
. 
. * continue preparation of estimates files and merge them, graphs
. * Forecast and backcast
. * input data files: "IHME`update'.dta" and "country JOHN.dta"
. * output data files: "country IHME longit.dta"
. 
. 
. 
. 
. local list ///
> 20220110 ///
> 20220114 ///
> 20220121 ///
> 20220204 ///
> 20220218 ///
> 20220321 ///
> 20220408 ///
> 20220506 ///
> 20220610 ///
> 
{txt}
{com}. 
. 
. 
. foreach update of local list {c -(}
{txt}  2{com}.         
.         use "IHME `update'.dta", clear
{txt}  3{com}. 
.         capture drop DayDeaFOREA02`update'
{txt}  4{com}.         
.         gen DayDeaFOREA02`update' = DayDeaMeSmA02`update'
{txt}  5{com}.         
.         replace DayDeaFOREA02`update' = . if date < epoch`update'
{txt}  6{com}.         
.         label var DayDeaFOREA02`update' "DayDeaMeSmA02S01 Forecast only"
{txt}  7{com}.         
.         save "IHME `update'.dta", replace
{txt}  8{com}. 
. {c )-}
{txt}(700 real changes made, 700 to missing)
file IHME 20220110.dta saved
(707 real changes made, 707 to missing)
file IHME 20220114.dta saved
(715 real changes made, 715 to missing)
file IHME 20220121.dta saved
(728 real changes made, 728 to missing)
file IHME 20220204.dta saved
(742 real changes made, 742 to missing)
file IHME 20220218.dta saved
(770 real changes made, 770 to missing)
file IHME 20220321.dta saved
(791 real changes made, 791 to missing)
file IHME 20220408.dta saved
(819 real changes made, 819 to missing)
file IHME 20220506.dta saved
(854 real changes made, 854 to missing)
file IHME 20220610.dta saved

{com}. *
. 
. 
. foreach update of local list {c -(}
{txt}  2{com}.         
.         merge m:m date loc_grand_name using "IHME `update'.dta"
{txt}  3{com}.         
.         drop _merge
{txt}  4{com}.         
. {c )-}
{res}
{txt}{col 5}Result{col 38}# of obs.
{col 5}{hline 41}
{col 5}not matched{col 30}{res}             153
{txt}{col 9}from master{col 30}{res}             153{txt}  (_merge==1)
{col 9}from using{col 30}{res}               0{txt}  (_merge==2)

{col 5}matched{col 30}{res}             818{txt}  (_merge==3)
{col 5}{hline 41}
{res}
{txt}{col 5}Result{col 38}# of obs.
{col 5}{hline 41}
{col 5}not matched{col 30}{res}             153
{txt}{col 9}from master{col 30}{res}             153{txt}  (_merge==1)
{col 9}from using{col 30}{res}               0{txt}  (_merge==2)

{col 5}matched{col 30}{res}             818{txt}  (_merge==3)
{col 5}{hline 41}
{res}
{txt}{col 5}Result{col 38}# of obs.
{col 5}{hline 41}
{col 5}not matched{col 30}{res}             153
{txt}{col 9}from master{col 30}{res}             153{txt}  (_merge==1)
{col 9}from using{col 30}{res}               0{txt}  (_merge==2)

{col 5}matched{col 30}{res}             818{txt}  (_merge==3)
{col 5}{hline 41}
{res}
{txt}{col 5}Result{col 38}# of obs.
{col 5}{hline 41}
{col 5}not matched{col 30}{res}             122
{txt}{col 9}from master{col 30}{res}             122{txt}  (_merge==1)
{col 9}from using{col 30}{res}               0{txt}  (_merge==2)

{col 5}matched{col 30}{res}             849{txt}  (_merge==3)
{col 5}{hline 41}
{res}
{txt}{col 5}Result{col 38}# of obs.
{col 5}{hline 41}
{col 5}not matched{col 30}{res}             122
{txt}{col 9}from master{col 30}{res}             122{txt}  (_merge==1)
{col 9}from using{col 30}{res}               0{txt}  (_merge==2)

{col 5}matched{col 30}{res}             849{txt}  (_merge==3)
{col 5}{hline 41}
{res}
{txt}{col 5}Result{col 38}# of obs.
{col 5}{hline 41}
{col 5}not matched{col 30}{res}              92
{txt}{col 9}from master{col 30}{res}              92{txt}  (_merge==1)
{col 9}from using{col 30}{res}               0{txt}  (_merge==2)

{col 5}matched{col 30}{res}             879{txt}  (_merge==3)
{col 5}{hline 41}
{res}
{txt}{col 5}Result{col 38}# of obs.
{col 5}{hline 41}
{col 5}not matched{col 30}{res}              61
{txt}{col 9}from master{col 30}{res}              61{txt}  (_merge==1)
{col 9}from using{col 30}{res}               0{txt}  (_merge==2)

{col 5}matched{col 30}{res}             910{txt}  (_merge==3)
{col 5}{hline 41}
{res}
{txt}{col 5}Result{col 38}# of obs.
{col 5}{hline 41}
{col 5}not matched{col 30}{res}              30
{txt}{col 9}from master{col 30}{res}              30{txt}  (_merge==1)
{col 9}from using{col 30}{res}               0{txt}  (_merge==2)

{col 5}matched{col 30}{res}             941{txt}  (_merge==3)
{col 5}{hline 41}
{res}
{txt}{col 5}Result{col 38}# of obs.
{col 5}{hline 41}
{col 5}not matched{col 30}{res}               0
{txt}{col 5}matched{col 30}{res}             971{txt}  (_merge==3)
{col 5}{hline 41}

{com}. *       
. 
. 
. 
. 
. 
. duplicates drop date, force

{p 0 4}{txt}Duplicates in terms of {res} date{p_end}

{txt}(0 observations are duplicates)

{com}. 
. isid date
{txt}
{com}. 
. order loc_grand_name date DayDeaFOREA02* epoch*
{txt}
{com}. 
. sort loc_grand_name date
{txt}
{com}. 
. qui compress
{txt}
{com}. 
. save "country IHME longit.dta", replace
{txt}file country IHME longit.dta saved

{com}. 
. 
. 
. 
. 
. 
. 
. * add JOHN
. 
. cd ..
{res}/Users/farshadpourmalek/Downloads/covir2-main/20220708/code
{txt}
{com}. 
. cd JOHN
{res}/Users/farshadpourmalek/Downloads/covir2-main/20220708/code/JOHN
{txt}
{com}. 
. use "country JOHN.dta", clear 
{txt}
{com}. 
. cd ..
{res}/Users/farshadpourmalek/Downloads/covir2-main/20220708/code
{txt}
{com}. 
. cd IHME
{res}/Users/farshadpourmalek/Downloads/covir2-main/20220708/code/IHME
{txt}
{com}. 
. save "country JOHN.dta", replace 
{txt}file country JOHN.dta saved

{com}. 
. 
. merge m:m loc_grand_name date using "country IHME longit.dta"
{res}
{txt}{col 5}Result{col 38}# of obs.
{col 5}{hline 41}
{col 5}not matched{col 30}{res}              99
{txt}{col 9}from master{col 30}{res}              13{txt}  (_merge==1)
{col 9}from using{col 30}{res}              86{txt}  (_merge==2)

{col 5}matched{col 30}{res}             885{txt}  (_merge==3)
{col 5}{hline 41}

{com}. 
. drop _merge
{txt}
{com}. 
. 
. drop DayDeaMeRa*
{txt}
{com}. 
. drop Tot*
{txt}
{com}. 
. drop provincestate
{txt}
{com}. 
. 
. duplicates drop date, force

{p 0 4}{txt}Duplicates in terms of {res} date{p_end}

{txt}(0 observations are duplicates)

{com}. 
. isid date
{txt}
{com}. 
. qui compress
{txt}
{com}. 
. save "country IHME longit.dta", replace
{txt}file country IHME longit.dta saved

{com}. 
. 
. 
. 
. 
. 
. 
. ***********************************************
. 
. * graphs
. 
. 
. 
. grstyle init
{res}{txt}
{com}. 
. grstyle color background white
{txt}
{com}. 
. 
. 
. ***********************************************
. 
. * graph 1 Daily deaths, Updates together, no extremes, backcasts and forecasts
. 
. twoway /// 
> (line DayDeaMeSmA00 date, sort lcolor(cyan) lwidth(thick)) /// "JOHN smooth"
> (line DayDeaMeSmA0220220110 date, sort lcolor(gold) lwidth(medium)) ///
> (line DayDeaMeSmA0220220114 date, sort lcolor(gold) lwidth(medium)) ///
> (line DayDeaMeSmA0220220121 date, sort lcolor(gold) lwidth(medium)) ///
> (line DayDeaMeSmA0220220204 date, sort lcolor(gold) lwidth(medium)) ///
> (line DayDeaMeSmA0220220218 date, sort lcolor(gold) lwidth(medium)) ///
> (line DayDeaMeSmA0220220321 date, sort lcolor(gold) lwidth(medium)) ///
> (line DayDeaMeSmA0220220408 date, sort lcolor(gold) lwidth(medium)) ///
> (line DayDeaMeSmA0220220506 date, sort lcolor(gold) lwidth(medium)) ///
> (line DayDeaMeSmA0220220610 date, sort lcolor(gold) lwidth(medium)) /// 9
> (line DayDeaFOREA0220220110 date, sort lcolor(black) lwidth(medium)) ///
> (line DayDeaFOREA0220220114 date, sort lcolor(black) lwidth(medium)) ///
> (line DayDeaFOREA0220220121 date, sort lcolor(black) lwidth(medium)) ///
> (line DayDeaFOREA0220220204 date, sort lcolor(black) lwidth(medium)) ///
> (line DayDeaFOREA0220220218 date, sort lcolor(black) lwidth(medium)) ///
> (line DayDeaFOREA0220220321 date, sort lcolor(black) lwidth(medium)) ///
> (line DayDeaFOREA0220220408 date, sort lcolor(black) lwidth(medium)) ///
> (line DayDeaFOREA0220220506 date, sort lcolor(black) lwidth(medium)) ///
> (line DayDeaFOREA0220220610 date, sort lcolor(red) lwidth(thick)) ///
> if date >= td(01jan2022) ///
> , xtitle(Date) xlabel(#11, format(%tdYY-NN-DD) labsize(small)) xlabel(, grid) xlabel(, grid) ///
> xlabel(, angle(forty_five)) ylabel(, format(%15.0fc) labsize(small))  ylabel(, labsize(small) angle(horizontal)) ///
> ytitle(Daily deaths) title("C19 daily deaths, $country, IHME, updates in 2022", size(medium) color(black)) /// 
> xscale(lwidth(vthin) lcolor(gray*.2)) yscale(lwidth(vthin) lcolor(gray*.2)) legend(region(lcolor(none))) legend(bexpand) ///
> legend(order(1 "JOHN" 2 "IHME previous updates, backcast" 11 "IHME previous updates, forecast" ///
> 19 "IHME latest update 20220610, forecast") size(small) row(2)) ///
> subtitle("Forecasts and backcasts; smooth; no extremes", size(small)) yscale(titlegap(2))
{res}{txt}
{com}. 
. qui graph export "graph 1 $country C19 daily deaths, IHME, Updates together no extremes.pdf", replace
{txt}
{com}. 
. 
. 
. 
. 
. 
. **********************
. 
. view "log country IHME 2.smcl"
{txt}
{com}. 
. log close
      {txt}name:  {res}<unnamed>
       {txt}log:  {res}/Users/farshadpourmalek/Downloads/covir2-main/20220708/code/IHME/log country IHME 2.smcl
  {txt}log type:  {res}smcl
 {txt}closed on:  {res} 8 Jul 2022, 16:38:19
{txt}{.-}
{smcl}
{txt}{sf}{ul off}