{smcl}
{com}{sf}{ul off}{txt}{.-}
      name:  {res}<unnamed>
       {txt}log:  {res}/Users/farshadpourmalek/Downloads/covir2-main/20220708/code/IMPE/log country IMPE.smcl
  {txt}log type:  {res}smcl
 {txt}opened on:  {res} 8 Jul 2022, 06:54:38
{txt}
{com}. 
. *****************************************************************************
. * This is "do country IMPE.do"
. 
. * Project: CovidVisualized country - countries without subnational estimates
. * Person: Farshad Pourmalek
. *****************************************************************************
. 
. 
.                                                                                                                                  
. 
. clear 
{txt}
{com}. 
. *****************************
. 
. * get IMPE estimates
. 
. di "$IMPEdate"
{res}2022-06-20_v9
{txt}
{com}. 
. copy https://raw.githubusercontent.com/mrc-ide/global-lmic-reports/master/data/$IMPEdate.csv.zip $IMPEdate.csv.zip
{txt}
{com}. unzipfile $IMPEdate.csv.zip, replace
{res}{txt}    inflating: Users/gbarnsle/Documents/LMIC_fitting/global-lmic-reports-orderly/gh-pages/data/2022-06-20_v9.csv
successfully unzipped 2022-06-20_v9.csv.zip to current directory

{com}. erase $IMPEdate.csv.zip
{txt}
{com}. 
. 
.  
. ******************************
. 
. * import csv file
. 
. 
. import delimited "$IMPEdate.csv", clear varnames(1)
{res}{text}(14 vars, 9,803,904 obs)

{com}. 
. keep if regexm(country,"$country") == 1
{txt}(9,748,596 observations deleted)

{com}. 
. 
. 
. 
. * gen date 
. 
. rename date date_original
{res}{txt}
{com}. 
. gen year = substr(date_original,1,4) 
{txt}
{com}. gen month = substr(date_original,6,2) 
{txt}
{com}. gen day = substr(date_original,9,2)
{txt}
{com}. egen dateblock = concat(year month day)
{txt}
{com}. drop year month day
{txt}
{com}. 
. 
. * rename uncertainty limits
. 
. rename y_025    y_025_
{res}{txt}
{com}. rename y_25     y_250_
{res}{txt}
{com}. rename y_median y_med_
{res}{txt}
{com}. rename y_mean   y_mea_
{res}{txt}
{com}. rename y_75     y_750_
{res}{txt}
{com}. rename y_975    y_975_
{res}{txt}
{com}. 
. 
. foreach var of varlist y_025-y_975 {c -(}
{txt}  2{com}.         ds `var'
{txt}  3{com}.         label variable `var' `r(varlist)'
{txt}  4{com}. {c )-}
{txt}{col 1}y_025_
{col 1}y_250_
{col 1}y_med_
{col 1}y_mea_
{col 1}y_750_
{col 1}y_975_

{com}. *
. 
. 
. 
. * rename scenarios 
. 
. tab scenario 

          {txt}scenario {c |}      Freq.     Percent        Cum.
{hline 19}{c +}{hline 35}
           Central {c |}{res}      9,218       16.67       16.67
{txt}        Optimistic {c |}{res}      9,218       16.67       33.33
{txt}       Pessimistic {c |}{res}      9,218       16.67       50.00
{txt}    Surged Central {c |}{res}      9,218       16.67       66.67
{txt} Surged Optimistic {c |}{res}      9,218       16.67       83.33
{txt}Surged Pessimistic {c |}{res}      9,218       16.67      100.00
{txt}{hline 19}{c +}{hline 35}
             Total {c |}{res}     55,308      100.00
{txt}
{com}. 
. 
. /*
> Scenarios:
> 
> S1  "Additional 50% Reduction"                  "S1_Add_Half_Reduction"
> S2  "Maintain Status Quo"                               "S2_Maintain_Staus_Quo"
> S3  "Relax Interventions 50%"                   "S3_Relax_Half_Intervention"
> 
> S4  "Surged Additional 50% Reduction"   "S4_Surged_Add_Half_Reduction"
> S5  "Surged Maintain Status Quo"                "S5_Surged_Maintain_Staus_Quo"
> S6  "Surged Relax Interventions 50%"    "S6_Surged_Relax_Half_Intervention"
> 
> ** With IMPE update 20211103 (2021-12-13_v9.csv.zip) released on 20211110., IMPE has new terms for their scenarios:
> 
> S1      Optimistic
> S2      Maintain Status Quo
> S3      Pessimistic
> 
> S4      Surged Optimistic
> S5      Surged Maintain Status Quo
> S6      Surged Pessimistic
> 
> 
> 
> *** With IMPE 2022-06-20_v9, IMPE has new terms for their scenarios:
> 
> . tab scenario 
> 
>           scenario |      Freq.     Percent        Cum.
> -------------------+-----------------------------------
>            Central |      9,218       16.67       16.67
>         Optimistic |      9,218       16.67       33.33
>        Pessimistic |      9,218       16.67       50.00
>     Surged Central |      9,218       16.67       66.67
>  Surged Optimistic |      9,218       16.67       83.33
> Surged Pessimistic |      9,218       16.67      100.00
> -------------------+-----------------------------------
>              Total |     55,308      100.00
> 
> */
. 
. 
. 
. gen scenario_snail = ""
{txt}(55,308 missing values generated)

{com}. replace scenario_snail = "S1" if scenario == "Optimistic"
{txt}variable {bf}scenario_snail{sf} was {bf}{res}str1{sf}{txt} now {bf}{res}str2{sf}
{txt}(9,218 real changes made)

{com}. replace scenario_snail = "S2" if scenario == "Central"
{txt}(9,218 real changes made)

{com}. replace scenario_snail = "S3" if scenario == "Pessimistic"
{txt}(9,218 real changes made)

{com}. replace scenario_snail = "S4" if scenario == "Surged Optimistic"
{txt}(9,218 real changes made)

{com}. replace scenario_snail = "S5" if scenario == "Surged Central"
{txt}(9,218 real changes made)

{com}. replace scenario_snail = "S6" if scenario == "Surged Pessimistic"
{txt}(9,218 real changes made)

{com}. 
. 
. 
. gen underline = "_"
{txt}
{com}. egen scenario_snail_dateblock = concat(scenario_snail underline dateblock)
{txt}
{com}. 
. drop date_original scenario
{txt}
{com}. 
. drop scenario_snail_dateblock 
{txt}
{com}.   
. drop y_250_ y_med_ y_750_
{txt}
{com}.  
. 
. * Primary outcomes Total Deaths, Total infections, Daily Deaths, and Daily infections
. 
. replace compartment = "cumul_death" if compartment == "cumulative_deaths"
{txt}(5,028 real changes made)

{com}. replace compartment = "cumul_infec" if compartment == "cumulative_infections"
{txt}(5,028 real changes made)

{com}. replace compartment = "daily_death" if compartment == "deaths"
{txt}(5,028 real changes made)

{com}. replace compartment = "daily_infec" if compartment == "infections"
{txt}(5,028 real changes made)

{com}. 
. 
. * other outcomes
. 
. replace compartment = "icu___deman" if compartment == "ICU_demand"                      // Icd
{txt}(5,028 real changes made)

{com}. replace compartment = "icu___incid" if compartment == "ICU_incidence"           // Ici
{txt}(5,028 real changes made)

{com}. replace compartment = "reff_______" if compartment == "Reff"                            // Ref
{txt}(5,028 real changes made)

{com}. replace compartment = "rt_________" if compartment == "Rt"                                      // Rtt
{txt}(5,028 real changes made)

{com}. replace compartment = "hospi_deman" if compartment == "hospital_demand"         // Hod
{txt}(5,028 real changes made)

{com}. replace compartment = "hospi_incid" if compartment == "hospital_incidence"  // Hoi
{txt}(5,028 real changes made)

{com}. replace compartment = "preval_____" if compartment == "prevalence"                      // Pre
{txt}(5,028 real changes made)

{com}. 
. 
. duplicates drop date compartment scenario, force

{p 0 4}{txt}Duplicates in terms of {res} dateblock compartment scenario_snail{p_end}

{txt}(0 observations are duplicates)

{com}. 
. 
. 
. * reshape
. 
. 
. egen compartment_scenario_snail = concat(compartment underline scenario_snail)  
{txt}
{com}. 
. drop compartment underline scenario_snail
{txt}
{com}. 
. tab compartment_scenario_snail

{txt}compartment_sc {c |}
  enario_snail {c |}      Freq.     Percent        Cum.
{hline 15}{c +}{hline 35}
cumul_death_S1 {c |}{res}        838        1.52        1.52
{txt}cumul_death_S2 {c |}{res}        838        1.52        3.03
{txt}cumul_death_S3 {c |}{res}        838        1.52        4.55
{txt}cumul_death_S4 {c |}{res}        838        1.52        6.06
{txt}cumul_death_S5 {c |}{res}        838        1.52        7.58
{txt}cumul_death_S6 {c |}{res}        838        1.52        9.09
{txt}cumul_infec_S1 {c |}{res}        838        1.52       10.61
{txt}cumul_infec_S2 {c |}{res}        838        1.52       12.12
{txt}cumul_infec_S3 {c |}{res}        838        1.52       13.64
{txt}cumul_infec_S4 {c |}{res}        838        1.52       15.15
{txt}cumul_infec_S5 {c |}{res}        838        1.52       16.67
{txt}cumul_infec_S6 {c |}{res}        838        1.52       18.18
{txt}daily_death_S1 {c |}{res}        838        1.52       19.70
{txt}daily_death_S2 {c |}{res}        838        1.52       21.21
{txt}daily_death_S3 {c |}{res}        838        1.52       22.73
{txt}daily_death_S4 {c |}{res}        838        1.52       24.24
{txt}daily_death_S5 {c |}{res}        838        1.52       25.76
{txt}daily_death_S6 {c |}{res}        838        1.52       27.27
{txt}daily_infec_S1 {c |}{res}        838        1.52       28.79
{txt}daily_infec_S2 {c |}{res}        838        1.52       30.30
{txt}daily_infec_S3 {c |}{res}        838        1.52       31.82
{txt}daily_infec_S4 {c |}{res}        838        1.52       33.33
{txt}daily_infec_S5 {c |}{res}        838        1.52       34.85
{txt}daily_infec_S6 {c |}{res}        838        1.52       36.36
{txt}hospi_deman_S1 {c |}{res}        838        1.52       37.88
{txt}hospi_deman_S2 {c |}{res}        838        1.52       39.39
{txt}hospi_deman_S3 {c |}{res}        838        1.52       40.91
{txt}hospi_deman_S4 {c |}{res}        838        1.52       42.42
{txt}hospi_deman_S5 {c |}{res}        838        1.52       43.94
{txt}hospi_deman_S6 {c |}{res}        838        1.52       45.45
{txt}hospi_incid_S1 {c |}{res}        838        1.52       46.97
{txt}hospi_incid_S2 {c |}{res}        838        1.52       48.48
{txt}hospi_incid_S3 {c |}{res}        838        1.52       50.00
{txt}hospi_incid_S4 {c |}{res}        838        1.52       51.52
{txt}hospi_incid_S5 {c |}{res}        838        1.52       53.03
{txt}hospi_incid_S6 {c |}{res}        838        1.52       54.55
{txt}icu___deman_S1 {c |}{res}        838        1.52       56.06
{txt}icu___deman_S2 {c |}{res}        838        1.52       57.58
{txt}icu___deman_S3 {c |}{res}        838        1.52       59.09
{txt}icu___deman_S4 {c |}{res}        838        1.52       60.61
{txt}icu___deman_S5 {c |}{res}        838        1.52       62.12
{txt}icu___deman_S6 {c |}{res}        838        1.52       63.64
{txt}icu___incid_S1 {c |}{res}        838        1.52       65.15
{txt}icu___incid_S2 {c |}{res}        838        1.52       66.67
{txt}icu___incid_S3 {c |}{res}        838        1.52       68.18
{txt}icu___incid_S4 {c |}{res}        838        1.52       69.70
{txt}icu___incid_S5 {c |}{res}        838        1.52       71.21
{txt}icu___incid_S6 {c |}{res}        838        1.52       72.73
{txt}preval______S1 {c |}{res}        838        1.52       74.24
{txt}preval______S2 {c |}{res}        838        1.52       75.76
{txt}preval______S3 {c |}{res}        838        1.52       77.27
{txt}preval______S4 {c |}{res}        838        1.52       78.79
{txt}preval______S5 {c |}{res}        838        1.52       80.30
{txt}preval______S6 {c |}{res}        838        1.52       81.82
{txt}reff________S1 {c |}{res}        838        1.52       83.33
{txt}reff________S2 {c |}{res}        838        1.52       84.85
{txt}reff________S3 {c |}{res}        838        1.52       86.36
{txt}reff________S4 {c |}{res}        838        1.52       87.88
{txt}reff________S5 {c |}{res}        838        1.52       89.39
{txt}reff________S6 {c |}{res}        838        1.52       90.91
{txt}rt__________S1 {c |}{res}        838        1.52       92.42
{txt}rt__________S2 {c |}{res}        838        1.52       93.94
{txt}rt__________S3 {c |}{res}        838        1.52       95.45
{txt}rt__________S4 {c |}{res}        838        1.52       96.97
{txt}rt__________S5 {c |}{res}        838        1.52       98.48
{txt}rt__________S6 {c |}{res}        838        1.52      100.00
{txt}{hline 15}{c +}{hline 35}
         Total {c |}{res}     55,308      100.00
{txt}
{com}. 
. 
. 
. reshape wide y_025_   y_mea_  y_975_, i(country dateblock) j(compartment_scenario_snail) string
{txt}(note: j = cumul_death_S1 cumul_death_S2 cumul_death_S3 cumul_death_S4 cumul_death_S5 cumul_death_S6 cumul_infec_S1 cumul_infec_S2 cumul_infec_S3 cumul_infec_S4 cumul_infec_S5 cumul_infec_S6 daily_death_S1 daily_death_S2 daily_death_S3 daily_death_S4 daily_death_S5 daily_death_S6 daily_infec_S1 daily_infec_S2 daily_infec_S3 daily_infec_S4 daily_infec_S5 daily_infec_S6 hospi_deman_S1 hospi_deman_S2 hospi_deman_S3 hospi_deman_S4 hospi_deman_S5 hospi_deman_S6 hospi_incid_S1 hospi_incid_S2 hospi_incid_S3 hospi_incid_S4 hospi_incid_S5 hospi_incid_S6 icu___deman_S1 icu___deman_S2 icu___deman_S3 icu___deman_S4 icu___deman_S5 icu___deman_S6 icu___incid_S1 icu___incid_S2 icu___incid_S3 icu___incid_S4 icu___incid_S5 icu___incid_S6 preval______S1 preval______S2 preval______S3 preval______S4 preval______S5 preval______S6 reff________S1 reff________S2 reff________S3 reff________S4 reff________S5 reff________S6 rt__________S1 rt__________S2 rt__________S3 rt__________S4 rt__________S5 rt__________S6)

Data{col 36}long{col 43}->{col 48}wide
{hline 77}
Number of obs.                 {res}   55308   {txt}->{res}     838
{txt}Number of variables            {res}      10   {txt}->{res}     204
{txt}j variable (66 values){res}compartment_scenario_snail{txt}->(dropped)
xij variables:
                                 {res}y_025_   {txt}->   {res}y_025_cumul_death_S1 y_025_cumul_death_S2 ... y_025_rt__________S6
                                 y_mea_   {txt}->   {res}y_mea_cumul_death_S1 y_mea_cumul_death_S2 ... y_mea_rt__________S6
                                 y_975_   {txt}->   {res}y_975_cumul_death_S1 y_975_cumul_death_S2 ... y_975_rt__________S6
{txt}{hline 77}

{com}. 
. 
. *
. 
. 
. 
. foreach v of varlist y_025_cumul_death_S1-y_975_rt__________S6 {c -(} 
{txt}  2{com}. 
.         local first = substr("`v'", 7, 11) 
{txt}  3{com}.         local second = substr("`v'", 6, 1)
{txt}  4{com}.         local third  = substr("`v'", 1, 5)
{txt}  5{com}.         local fourth = substr("`v'", 19, 2)
{txt}  6{com}.         label var `v' "`first'`second'`third'`second'`fourth'"
{txt}  7{com}. {c )-} 
{txt}
{com}. *
. 
. 
. 
. foreach v of varlist y_025_cumul_death_S1-y_975_rt__________S6 {c -(} 
{txt}  2{com}.         di `"`: var label `v''"' 
{txt}  3{com}.         local fifth `"`: var label `v''"'
{txt}  4{com}.         rename `v'   `fifth'
{txt}  5{com}. {c )-}
cumul_death_y_025_S1
{res}cumul_death_y_mea_S1
cumul_death_y_975_S1
cumul_death_y_025_S2
cumul_death_y_mea_S2
cumul_death_y_975_S2
cumul_death_y_025_S3
cumul_death_y_mea_S3
cumul_death_y_975_S3
cumul_death_y_025_S4
cumul_death_y_mea_S4
cumul_death_y_975_S4
cumul_death_y_025_S5
cumul_death_y_mea_S5
cumul_death_y_975_S5
cumul_death_y_025_S6
cumul_death_y_mea_S6
cumul_death_y_975_S6
cumul_infec_y_025_S1
cumul_infec_y_mea_S1
cumul_infec_y_975_S1
cumul_infec_y_025_S2
cumul_infec_y_mea_S2
cumul_infec_y_975_S2
cumul_infec_y_025_S3
cumul_infec_y_mea_S3
cumul_infec_y_975_S3
cumul_infec_y_025_S4
cumul_infec_y_mea_S4
cumul_infec_y_975_S4
cumul_infec_y_025_S5
cumul_infec_y_mea_S5
cumul_infec_y_975_S5
cumul_infec_y_025_S6
cumul_infec_y_mea_S6
cumul_infec_y_975_S6
daily_death_y_025_S1
daily_death_y_mea_S1
daily_death_y_975_S1
daily_death_y_025_S2
daily_death_y_mea_S2
daily_death_y_975_S2
daily_death_y_025_S3
daily_death_y_mea_S3
daily_death_y_975_S3
daily_death_y_025_S4
daily_death_y_mea_S4
daily_death_y_975_S4
daily_death_y_025_S5
daily_death_y_mea_S5
daily_death_y_975_S5
daily_death_y_025_S6
daily_death_y_mea_S6
daily_death_y_975_S6
daily_infec_y_025_S1
daily_infec_y_mea_S1
daily_infec_y_975_S1
daily_infec_y_025_S2
daily_infec_y_mea_S2
daily_infec_y_975_S2
daily_infec_y_025_S3
daily_infec_y_mea_S3
daily_infec_y_975_S3
daily_infec_y_025_S4
daily_infec_y_mea_S4
daily_infec_y_975_S4
daily_infec_y_025_S5
daily_infec_y_mea_S5
daily_infec_y_975_S5
daily_infec_y_025_S6
daily_infec_y_mea_S6
daily_infec_y_975_S6
hospi_deman_y_025_S1
hospi_deman_y_mea_S1
hospi_deman_y_975_S1
hospi_deman_y_025_S2
hospi_deman_y_mea_S2
hospi_deman_y_975_S2
hospi_deman_y_025_S3
hospi_deman_y_mea_S3
hospi_deman_y_975_S3
hospi_deman_y_025_S4
hospi_deman_y_mea_S4
hospi_deman_y_975_S4
hospi_deman_y_025_S5
hospi_deman_y_mea_S5
hospi_deman_y_975_S5
hospi_deman_y_025_S6
hospi_deman_y_mea_S6
hospi_deman_y_975_S6
hospi_incid_y_025_S1
hospi_incid_y_mea_S1
hospi_incid_y_975_S1
hospi_incid_y_025_S2
hospi_incid_y_mea_S2
hospi_incid_y_975_S2
hospi_incid_y_025_S3
hospi_incid_y_mea_S3
hospi_incid_y_975_S3
hospi_incid_y_025_S4
hospi_incid_y_mea_S4
hospi_incid_y_975_S4
hospi_incid_y_025_S5
hospi_incid_y_mea_S5
hospi_incid_y_975_S5
hospi_incid_y_025_S6
hospi_incid_y_mea_S6
hospi_incid_y_975_S6
icu___deman_y_025_S1
icu___deman_y_mea_S1
icu___deman_y_975_S1
icu___deman_y_025_S2
icu___deman_y_mea_S2
icu___deman_y_975_S2
icu___deman_y_025_S3
icu___deman_y_mea_S3
icu___deman_y_975_S3
icu___deman_y_025_S4
icu___deman_y_mea_S4
icu___deman_y_975_S4
icu___deman_y_025_S5
icu___deman_y_mea_S5
icu___deman_y_975_S5
icu___deman_y_025_S6
icu___deman_y_mea_S6
icu___deman_y_975_S6
icu___incid_y_025_S1
icu___incid_y_mea_S1
icu___incid_y_975_S1
icu___incid_y_025_S2
icu___incid_y_mea_S2
icu___incid_y_975_S2
icu___incid_y_025_S3
icu___incid_y_mea_S3
icu___incid_y_975_S3
icu___incid_y_025_S4
icu___incid_y_mea_S4
icu___incid_y_975_S4
icu___incid_y_025_S5
icu___incid_y_mea_S5
icu___incid_y_975_S5
icu___incid_y_025_S6
icu___incid_y_mea_S6
icu___incid_y_975_S6
preval______y_025_S1
preval______y_mea_S1
preval______y_975_S1
preval______y_025_S2
preval______y_mea_S2
preval______y_975_S2
preval______y_025_S3
preval______y_mea_S3
preval______y_975_S3
preval______y_025_S4
preval______y_mea_S4
preval______y_975_S4
preval______y_025_S5
preval______y_mea_S5
preval______y_975_S5
preval______y_025_S6
preval______y_mea_S6
preval______y_975_S6
reff________y_025_S1
reff________y_mea_S1
reff________y_975_S1
reff________y_025_S2
reff________y_mea_S2
reff________y_975_S2
reff________y_025_S3
reff________y_mea_S3
reff________y_975_S3
reff________y_025_S4
reff________y_mea_S4
reff________y_975_S4
reff________y_025_S5
reff________y_mea_S5
reff________y_975_S5
reff________y_025_S6
reff________y_mea_S6
reff________y_975_S6
rt__________y_025_S1
rt__________y_mea_S1
rt__________y_975_S1
rt__________y_025_S2
rt__________y_mea_S2
rt__________y_975_S2
rt__________y_025_S3
rt__________y_mea_S3
rt__________y_975_S3
rt__________y_025_S4
rt__________y_mea_S4
rt__________y_975_S4
rt__________y_025_S5
rt__________y_mea_S5
rt__________y_975_S5
rt__________y_025_S6
rt__________y_mea_S6
rt__________y_975_S6
{txt}
{com}. *
. 
. 
. * gen date
. 
. gen year = substr(dateblock,1,4) 
{txt}
{com}. gen month = substr(dateblock,5,2) 
{txt}
{com}. gen day = substr(dateblock,7,2) 
{txt}
{com}. egen date2 = concat(day month year)
{txt}
{com}. gen date = date(date2, "DMY", 2050)
{txt}
{com}. format date %tdDDMonCCYY
{txt}
{com}. codebook date

{txt}{hline}
{res}date{right:(unlabeled)}
{txt}{hline}

{col 19}type:  numeric daily date ({res}float{txt})

{col 18}range:  [{res}22068{txt},{res}22905{txt}]{col 55}units:  {res}1
{col 8}{txt}or equivalently:  [{res}02jun2020{txt},{res}17sep2022{txt}]{col 55}units:  {res}days
{col 10}{txt}unique values:  {res}838{col 51}{txt}missing .:  {res}0{txt}/{res}838

{txt}{col 19}mean:{res}{col 26} 22486.5{txt} = {res}25jul2021{txt} (+ 12 hours)
{col 15}std. dev:{res}{col 26} 242.054

{txt}{col 12}percentiles:{col 32}10%{col 42}25%{col 52}50%{col 62}75%{col 72}90%
{res}{col 27}   22151{col 37}   22277{col 47} 22486.5{col 57}   22696{col 67}   22822
{col 26}24aug2020{col 36}28dec2020{col 46}25jul2021{col 56}20feb2022{col 66}26jun2022
{txt}
{com}. 
. 
. 
. * 
. 
. 
. * get renvars
. 
. 
. 
. /*
> 
> * After 
> net from  http://www.stata-journal.com/software/sj5-4
> Stata might return the following:
> 
> host not found
> http://www.stata-journal.com/software/sj5-4/ either
>   1)  is not a valid URL, or
>   2)  could not be contacted, or
>   3)  is not a Stata download site (has no stata.toc file).
> 
> current site is still http://fmwww.bc.edu/repec/bocode/g/
> 
> * Bad internet connetion is the issue. Try again / later. 
> 
> 
> */
. 
. net from  http://www.stata-journal.com/software/sj5-4
{s6hlp}
.-
http://www.stata-journal.com/software/sj5-4/
^Stata Journal volume 5, issue 4^
.-
{smcl}

DIRECTORIES you could -{hilite:net cd}- to:
{p2colset 5 23 23 2}{...}
{p2col :{net cd ..:..}}Other Stata Journals{p_end}
{p2colreset}{...}

PACKAGES you could -{hilite:net describe}-:
{s6hlp}
    @net:describe dm67_3!dm67_3@            Update:  Numbers of present and missing values
    @net:describe dm88_1!dm88_1@            Update:  Renaming variables, multiply and
                      systematically
    @net:describe gr0021!gr0021@            Double, diagonal, and polar smoothing
    @net:describe sg134_1!sg134_1@           Update: Model selection using akaike information
                      criterion
    @net:describe st0030_2!st0030_2@          Update:  Instrumental variables and GMM:  Estimation
                      and testing
    @net:describe st0037_2!st0037_2@          Update:  Adaptive kernel density estimation
    @net:describe st0067_2!st0067_2@          Update:  Multiple imputation of missing values
    @net:describe st0091!st0091@            Estimation and inference in dynamic unbalanced
                      panel data models with a small number of individuals
    @net:describe st0092!st0092@            Extended generalized linear models: Simulataneous
                      estimation of flexible link and variance functions
    @net:describe st0093!st0093@            Buckley-James method for analyzing censored data,
                      with an application to a heart disease study
    @net:describe st0094!st0094@            Confidence intervals for predicted outcomes in
                      regression models for categorical outcomes
{smcl}
{.-}

{com}. 
. net describe dm88_1

{txt}{.-}
{s6hlp}
package ^dm88_1^ from http://www.stata-journal.com/software/sj5-4
{smcl}
{.-}
{s6hlp}

^TITLE^
      SJ5-4 dm88_1.  Update:  Renaming variables, multiply and...

^DESCRIPTION/AUTHOR(S)^
      Update:  Renaming variables, multiply and systematically
      by Nicholas J. Cox, Durham University, UK
         Jeroen Weesie, Utrecht University, Netherlands
      Support:  n.j.cox@@durham.ac.uk, j.weesie@@fss.uu.nl
      After installation, type help ^renvars^

^INSTALLATION FILES^                               (type ^net install^ ^dm88_1^)
      dm88_1/renvars.ado
      dm88_1/renvars.hlp

^ANCILLARY FILES^                                  (type ^net get^ ^dm88_1^)
      dm88_1/renvars.do
{smcl}
{.-}

{com}. 
. net install dm88_1
checking {hilite:dm88_1} consistency and verifying not already installed...
all files already exist and are up to date.
{txt}
{com}. 
. 
. 
. 
. * 
. 
. * -renvars- somanyvars rather time consuming
. 
. foreach v of varlist cumul_death_y_025_S1-rt__________y_975_S6 {c -(} 
{txt}  2{com}. 
.     qui renvars, presub(cumul_death_y_025_ TotDeaLoRa)
{txt}  3{com}.     qui renvars, presub(cumul_death_y_975_ TotDeaUpRa)
{txt}  4{com}.     qui renvars, presub(cumul_death_y_mea_ TotDeaMeRa)
{txt}  5{com}. 
.         qui renvars, presub(daily_death_y_025_ DayDeaLoRa)
{txt}  6{com}.         qui renvars, presub(daily_death_y_975_ DayDeaUpRa)
{txt}  7{com}.         qui renvars, presub(daily_death_y_mea_ DayDeaMeRa)
{txt}  8{com}.         
.     qui renvars, presub(cumul_infec_y_025_ TotINFLoRa)
{txt}  9{com}.     qui renvars, presub(cumul_infec_y_975_ TotINFUpRa)
{txt} 10{com}.     qui renvars, presub(cumul_infec_y_mea_ TotINFMeRa)
{txt} 11{com}.         
.         qui renvars, presub(daily_infec_y_025_ DayINFLoRa)
{txt} 12{com}.         qui renvars, presub(daily_infec_y_975_ DayINFUpRa)
{txt} 13{com}.         qui renvars, presub(daily_infec_y_mea_ DayINFMeRa)
{txt} 14{com}.         
.         * other outcomes
.         
.         qui renvars, presub(icu___deman_y_025_ DayIcdLoRa) // "ICU_demand" 
{txt} 15{com}.         qui renvars, presub(icu___deman_y_975_ DayIcdUpRa)
{txt} 16{com}.         qui renvars, presub(icu___deman_y_mea_ DayIcdMeRa)
{txt} 17{com}.         
.         qui renvars, presub(icu___incid_y_025_ DayIciLoRa) // "ICU_incidence"
{txt} 18{com}.         qui renvars, presub(icu___incid_y_975_ DayIciUpRa)
{txt} 19{com}.         qui renvars, presub(icu___incid_y_mea_ DayIciMeRa)
{txt} 20{com}.         
.         qui renvars, presub(reff________y_025_ DayRefLoRa) // "Reff"
{txt} 21{com}.         qui renvars, presub(reff________y_975_ DayRefUpRa)
{txt} 22{com}.         qui renvars, presub(reff________y_mea_ DayRefMeRa)
{txt} 23{com}.         
.         qui renvars, presub(rt__________y_025_ DayRttLoRa) // "Rt"
{txt} 24{com}.         qui renvars, presub(rt__________y_975_ DayRttUpRa)
{txt} 25{com}.         qui renvars, presub(rt__________y_mea_ DayRttMeRa)
{txt} 26{com}.         
.         qui renvars, presub(hospi_deman_y_025_ DayHodLoRa) // "hospital_demand"
{txt} 27{com}.         qui renvars, presub(hospi_deman_y_975_ DayHodUpRa)
{txt} 28{com}.         qui renvars, presub(hospi_deman_y_mea_ DayHodMeRa)
{txt} 29{com}.         
.         qui renvars, presub(hospi_incid_y_025_ DayHoiLoRa) // "hospital_incidence"
{txt} 30{com}.         qui renvars, presub(hospi_incid_y_975_ DayHoiUpRa)
{txt} 31{com}.         qui renvars, presub(hospi_incid_y_mea_ DayHoiMeRa)
{txt} 32{com}.         
.         qui renvars, presub(preval______y_025_ DayPreLoRa) // "prevalence"
{txt} 33{com}.         qui renvars, presub(preval______y_975_ DayPreUpRa)
{txt} 34{com}.         qui renvars, presub(preval______y_mea_ DayPreMeRa)
{txt} 35{com}.         
.         qui renvars, postsub(S1 A03S01) 
{txt} 36{com}.         qui renvars, postsub(S2 A03S02) 
{txt} 37{com}.         qui renvars, postsub(S3 A03S03) 
{txt} 38{com}.         qui renvars, postsub(S4 A03S04) 
{txt} 39{com}.         qui renvars, postsub(S5 A03S05) 
{txt} 40{com}.         qui renvars, postsub(S6 A03S06) 
{txt} 41{com}.         
.         * "Wait Note: renvars are working ..."
.         
. {c )-} 
{txt}
{com}. *   
. 
. 
. 
. *
. 
. drop iso3c report_date version death_calibrated year month day date2 dateblock
{txt}
{com}. 
. order date  
{txt}
{com}. 
. label var DayINFLoRaA03S01 "Daily infections Lower A03 S01 "
{txt}
{com}. label var DayINFLoRaA03S02 "Daily infections Lower A03 S02 "
{txt}
{com}. label var DayINFLoRaA03S03 "Daily infections Lower A03 S03 "
{txt}
{com}. label var DayINFLoRaA03S04 "Daily infections Lower A03 S04 "
{txt}
{com}. label var DayINFLoRaA03S05 "Daily infections Lower A03 S05 "
{txt}
{com}. label var DayINFLoRaA03S06 "Daily infections Lower A03 S06 "
{txt}
{com}. label var DayINFMeRaA03S01 "Daily infections Mean A03 S01 "
{txt}
{com}. label var DayINFMeRaA03S02 "Daily infections Mean A03 S02 "
{txt}
{com}. label var DayINFMeRaA03S03 "Daily infections Mean A03 S03 "
{txt}
{com}. label var DayINFMeRaA03S04 "Daily infections Mean A03 S04 "
{txt}
{com}. label var DayINFMeRaA03S05 "Daily infections Mean A03 S05 "
{txt}
{com}. label var DayINFMeRaA03S06 "Daily infections Mean A03 S06 "
{txt}
{com}. label var DayINFUpRaA03S01 "Daily infections Upper A03 S01 "
{txt}
{com}. label var DayINFUpRaA03S02 "Daily infections Upper A03 S02 "
{txt}
{com}. label var DayINFUpRaA03S03 "Daily infections Upper A03 S03 "
{txt}
{com}. label var DayINFUpRaA03S04 "Daily infections Upper A03 S04 "
{txt}
{com}. label var DayINFUpRaA03S05 "Daily infections Upper A03 S05 "
{txt}
{com}. label var DayINFUpRaA03S06 "Daily infections Upper A03 S06 "
{txt}
{com}. label var DayDeaLoRaA03S01 "Daily Deaths Lower A03 S01 "
{txt}
{com}. label var DayDeaLoRaA03S02 "Daily Deaths Lower A03 S02 "
{txt}
{com}. label var DayDeaLoRaA03S03 "Daily Deaths Lower A03 S03 "
{txt}
{com}. label var DayDeaLoRaA03S04 "Daily Deaths Lower A03 S04 "
{txt}
{com}. label var DayDeaLoRaA03S05 "Daily Deaths Lower A03 S05 "
{txt}
{com}. label var DayDeaLoRaA03S06 "Daily Deaths Lower A03 S06 "
{txt}
{com}. label var DayDeaMeRaA03S01 "Daily Deaths Mean A03 S01 "
{txt}
{com}. label var DayDeaMeRaA03S02 "Daily Deaths Mean A03 S02 "
{txt}
{com}. label var DayDeaMeRaA03S03 "Daily Deaths Mean A03 S03 "
{txt}
{com}. label var DayDeaMeRaA03S04 "Daily Deaths Mean A03 S04 "
{txt}
{com}. label var DayDeaMeRaA03S05 "Daily Deaths Mean A03 S05 "
{txt}
{com}. label var DayDeaMeRaA03S06 "Daily Deaths Mean A03 S06 "
{txt}
{com}. label var DayDeaUpRaA03S01 "Daily Deaths Upper A03 S01 "
{txt}
{com}. label var DayDeaUpRaA03S02 "Daily Deaths Upper A03 S02 "
{txt}
{com}. label var DayDeaUpRaA03S03 "Daily Deaths Upper A03 S03 "
{txt}
{com}. label var DayDeaUpRaA03S04 "Daily Deaths Upper A03 S04 "
{txt}
{com}. label var DayDeaUpRaA03S05 "Daily Deaths Upper A03 S05 "
{txt}
{com}. label var DayDeaUpRaA03S06 "Daily Deaths Upper A03 S06 "
{txt}
{com}. label var TotINFLoRaA03S01 "Total infections Lower A03 S01 "
{txt}
{com}. label var TotINFLoRaA03S02 "Total infections Lower A03 S02 " 
{txt}
{com}. label var TotINFLoRaA03S03 "Total infections Lower A03 S03 " 
{txt}
{com}. label var TotINFLoRaA03S04 "Total infections Lower A03 S04 "
{txt}
{com}. label var TotINFLoRaA03S05 "Total infections Lower A03 S05 "
{txt}
{com}. label var TotINFLoRaA03S06 "Total infections Lower A03 S06 "
{txt}
{com}. label var TotINFMeRaA03S01 "Total infections Mean A03 S01 " 
{txt}
{com}. label var TotINFMeRaA03S02 "Total infections Mean A03 S02 " 
{txt}
{com}. label var TotINFMeRaA03S03 "Total infections Mean A03 S03 "
{txt}
{com}. label var TotINFMeRaA03S04 "Total infections Mean A03 S04 "
{txt}
{com}. label var TotINFMeRaA03S05 "Total infections Mean A03 S05 "
{txt}
{com}. label var TotINFMeRaA03S06 "Total infections Mean A03 S06 "
{txt}
{com}. label var TotINFUpRaA03S01 "Total infections Upper A03 S01 "
{txt}
{com}. label var TotINFUpRaA03S02 "Total infections Upper A03 S02 "
{txt}
{com}. label var TotINFUpRaA03S03 "Total infections Upper A03 S03 "
{txt}
{com}. label var TotINFUpRaA03S04 "Total infections Upper A03 S04 "
{txt}
{com}. label var TotINFUpRaA03S05 "Total infections Upper A03 S05 "
{txt}
{com}. label var TotINFUpRaA03S06 "Total infections Upper A03 S06 "
{txt}
{com}. label var TotDeaLoRaA03S01 "Total Deaths Lower A03 S01 "
{txt}
{com}. label var TotDeaLoRaA03S02 "Total Deaths Lower A03 S02 " 
{txt}
{com}. label var TotDeaLoRaA03S03 "Total Deaths Lower A03 S03 "
{txt}
{com}. label var TotDeaLoRaA03S04 "Total Deaths Lower A03 S04 "
{txt}
{com}. label var TotDeaLoRaA03S05 "Total Deaths Lower A03 S05 "
{txt}
{com}. label var TotDeaLoRaA03S06 "Total Deaths Lower A03 S06 "
{txt}
{com}. label var TotDeaMeRaA03S01 "Total Deaths Mean A03 S01 "
{txt}
{com}. label var TotDeaMeRaA03S02 "Total Deaths Mean A03 S02 "
{txt}
{com}. label var TotDeaMeRaA03S03 "Total Deaths Mean A03 S03 "
{txt}
{com}. label var TotDeaMeRaA03S04 "Total Deaths Mean A03 S04 "
{txt}
{com}. label var TotDeaMeRaA03S05 "Total Deaths Mean A03 S05 "
{txt}
{com}. label var TotDeaMeRaA03S06 "Total Deaths Mean A03 S06 "
{txt}
{com}. label var TotDeaUpRaA03S01 "Total Deaths Upper A03 S01 "
{txt}
{com}. label var TotDeaUpRaA03S02 "Total Deaths Upper A03 S02 "
{txt}
{com}. label var TotDeaUpRaA03S03 "Total Deaths Upper A03 S03 "
{txt}
{com}. label var TotDeaUpRaA03S04 "Total Deaths Upper A03 S04 "
{txt}
{com}. label var TotDeaUpRaA03S05 "Total Deaths Upper A03 S05 "
{txt}
{com}. label var TotDeaUpRaA03S06 "Total Deaths Upper A03 S06 "
{txt}
{com}. 
. 
. * other outcomes
. 
. label var DayHodMeRaA03S01 "Daily hospital demand Mean A03 S01 "
{txt}
{com}. label var DayHodLoRaA03S01 "Daily hospital demand Lower A03 S01 "
{txt}
{com}. label var DayHodUpRaA03S01 "Daily hospital demand Upper A03 S01 "
{txt}
{com}. label var DayHodMeRaA03S02 "Daily hospital demand Mean A03 S02 "
{txt}
{com}. label var DayHodLoRaA03S02 "Daily hospital demand Lower A03 S02 "
{txt}
{com}. label var DayHodUpRaA03S02 "Daily hospital demand Upper A03 S02 "
{txt}
{com}. label var DayHodMeRaA03S03 "Daily hospital demand Mean A03 S03 "
{txt}
{com}. label var DayHodLoRaA03S03 "Daily hospital demand Lower A03 S03 "
{txt}
{com}. label var DayHodUpRaA03S03 "Daily hospital demand Upper A03 S03 "
{txt}
{com}. label var DayHodMeRaA03S04 "Daily hospital demand Mean A03 S04 "
{txt}
{com}. label var DayHodLoRaA03S04 "Daily hospital demand Lower A03 S04 "
{txt}
{com}. label var DayHodUpRaA03S04 "Daily hospital demand Upper A03 S04 " 
{txt}
{com}. label var DayHodMeRaA03S05 "Daily hospital demand Mean A03 S05 "
{txt}
{com}. label var DayHodLoRaA03S05 "Daily hospital demand Lower A03 S05 "
{txt}
{com}. label var DayHodUpRaA03S05 "Daily hospital demand Upper A03 S05 "
{txt}
{com}. label var DayHodMeRaA03S06 "Daily hospital demand Mean A03 S06 "
{txt}
{com}. label var DayHodLoRaA03S06 "Daily hospital demand Lower A03 S06 "
{txt}
{com}. label var DayHodUpRaA03S06 "Daily hospital demand Upper A03 S06 "
{txt}
{com}. 
. 
. label var DayHoiMeRaA03S01 "Daily hospital incidence Mean A03 S01 "
{txt}
{com}. label var DayHoiLoRaA03S01 "Daily hospital incidence Lower A03 S01 "
{txt}
{com}. label var DayHoiUpRaA03S01 "Daily hospital incidence Upper A03 S01 "
{txt}
{com}. label var DayHoiMeRaA03S02 "Daily hospital incidence Mean A03 S02 "
{txt}
{com}. label var DayHoiLoRaA03S02 "Daily hospital incidence Lower A03 S02 "
{txt}
{com}. label var DayHoiUpRaA03S02 "Daily hospital incidence Upper A03 S02 "
{txt}
{com}. label var DayHoiMeRaA03S03 "Daily hospital incidence Mean A03 S03 "
{txt}
{com}. label var DayHoiLoRaA03S03 "Daily hospital incidence Lower A03 S03 "
{txt}
{com}. label var DayHoiUpRaA03S03 "Daily hospital incidence Upper A03 S03 "
{txt}
{com}. label var DayHoiMeRaA03S04 "Daily hospital incidence Mean A03 S04 "
{txt}
{com}. label var DayHoiLoRaA03S04 "Daily hospital incidence Lower A03 S04 "
{txt}
{com}. label var DayHoiUpRaA03S04 "Daily hospital incidence Upper A03 S04 "
{txt}
{com}. label var DayHoiMeRaA03S05 "Daily hospital incidence Mean A03 S05 "
{txt}
{com}. label var DayHoiLoRaA03S05 "Daily hospital incidence Lower A03 S05 "
{txt}
{com}. label var DayHoiUpRaA03S05 "Daily hospital incidence Upper A03 S05 "
{txt}
{com}. label var DayHoiMeRaA03S06 "Daily hospital incidence Mean A03 S06 "
{txt}
{com}. label var DayHoiLoRaA03S06 "Daily hospital incidence Lower A03 S06 "
{txt}
{com}. label var DayHoiUpRaA03S06 "Daily hospital incidence Upper A03 S06 "
{txt}
{com}. 
. 
. label var DayIcdMeRaA03S01 "Daily ICU demand Mean A03 S01 "
{txt}
{com}. label var DayIcdLoRaA03S01 "Daily ICU demand Lower A03 S01 "
{txt}
{com}. label var DayIcdUpRaA03S01 "Daily ICU demand Upper A03 S01 "
{txt}
{com}. label var DayIcdMeRaA03S02 "Daily ICU demand Mean A03 S02 "
{txt}
{com}. label var DayIcdLoRaA03S02 "Daily ICU demand Lower A03 S02 "
{txt}
{com}. label var DayIcdUpRaA03S02 "Daily ICU demand Upper A03 S02 "
{txt}
{com}. label var DayIcdMeRaA03S03 "Daily ICU demand Mean A03 S03 "
{txt}
{com}. label var DayIcdLoRaA03S03 "Daily ICU demand Lower A03 S03 "
{txt}
{com}. label var DayIcdUpRaA03S03 "Daily ICU demand Upper A03 S03 "
{txt}
{com}. label var DayIcdMeRaA03S04 "Daily ICU demand Mean A03 S04 "
{txt}
{com}. label var DayIcdLoRaA03S04 "Daily ICU demand Lower A03 S04 "
{txt}
{com}. label var DayIcdUpRaA03S04 "Daily ICU demand Upper A03 S04 "
{txt}
{com}. label var DayIcdMeRaA03S05 "Daily ICU demand Mean A03 S05 "
{txt}
{com}. label var DayIcdLoRaA03S05 "Daily ICU demand Lower A03 S05 "
{txt}
{com}. label var DayIcdUpRaA03S05 "Daily ICU demand Upper A03 S05 "
{txt}
{com}. label var DayIcdMeRaA03S06 "Daily ICU demand Mean A03 S06 "
{txt}
{com}. label var DayIcdLoRaA03S06 "Daily ICU demand Lower A03 S06 "
{txt}
{com}. label var DayIcdUpRaA03S06 "Daily ICU demand Upper A03 S06 "
{txt}
{com}. 
. 
. label var DayIciMeRaA03S01 "Daily ICU incidence Mean A03 S01 "
{txt}
{com}. label var DayIciLoRaA03S01 "Daily ICU incidence Lower A03 S01 "
{txt}
{com}. label var DayIciUpRaA03S01 "Daily ICU incidence Upper A03 S01 "
{txt}
{com}. label var DayIciMeRaA03S02 "Daily ICU incidence Mean A03 S02 "
{txt}
{com}. label var DayIciLoRaA03S02 "Daily ICU incidence Lower A03 S02 "
{txt}
{com}. label var DayIciUpRaA03S02 "Daily ICU incidence Upper A03 S02 "
{txt}
{com}. label var DayIciMeRaA03S03 "Daily ICU incidence Mean A03 S03 "
{txt}
{com}. label var DayIciLoRaA03S03 "Daily ICU incidence Lower A03 S03 "
{txt}
{com}. label var DayIciUpRaA03S03 "Daily ICU incidence Upper A03 S03 "
{txt}
{com}. label var DayIciMeRaA03S04 "Daily ICU incidence Mean A03 S04 "
{txt}
{com}. label var DayIciLoRaA03S04 "Daily ICU incidence Lower A03 S04 "
{txt}
{com}. label var DayIciUpRaA03S04 "Daily ICU incidence Upper A03 S04 "
{txt}
{com}. label var DayIciMeRaA03S05 "Daily ICU incidence Mean A03 S05 "
{txt}
{com}. label var DayIciLoRaA03S05 "Daily ICU incidence Lower A03 S05 "
{txt}
{com}. label var DayIciUpRaA03S05 "Daily ICU incidence Upper A03 S05 "
{txt}
{com}. label var DayIciMeRaA03S06 "Daily ICU incidence Mean A03 S06 "
{txt}
{com}. label var DayIciLoRaA03S06 "Daily ICU incidence Lower A03 S06 "
{txt}
{com}. label var DayIciUpRaA03S06 "Daily ICU incidence Upper A03 S06 "
{txt}
{com}. 
. 
. label var DayPreMeRaA03S01 "Daily prevalence Mean A03 S01 "
{txt}
{com}. label var DayPreLoRaA03S01 "Daily prevalence Lower A03 S01 "
{txt}
{com}. label var DayPreUpRaA03S01 "Daily prevalence Upper A03 S01 "
{txt}
{com}. label var DayPreMeRaA03S02 "Daily prevalence Mean A03 S02 "
{txt}
{com}. label var DayPreLoRaA03S02 "Daily prevalence Lower A03 S02 "
{txt}
{com}. label var DayPreUpRaA03S02 "Daily prevalence Upper A03 S02 "
{txt}
{com}. label var DayPreMeRaA03S03 "Daily prevalence Mean A03 S03 "
{txt}
{com}. label var DayPreLoRaA03S03 "Daily prevalence Lower A03 S03 "
{txt}
{com}. label var DayPreUpRaA03S03 "Daily prevalence Upper A03 S03 "
{txt}
{com}. label var DayPreMeRaA03S04 "Daily prevalence Mean A03 S04 "
{txt}
{com}. label var DayPreLoRaA03S04 "Daily prevalence Lower A03 S04 "
{txt}
{com}. label var DayPreUpRaA03S04 "Daily prevalence Upper A03 S04 "
{txt}
{com}. label var DayPreMeRaA03S05 "Daily prevalence Mean A03 S05 "
{txt}
{com}. label var DayPreLoRaA03S05 "Daily prevalence Lower A03 S05 "
{txt}
{com}. label var DayPreUpRaA03S05 "Daily prevalence Upper A03 S05 "
{txt}
{com}. label var DayPreMeRaA03S06 "Daily prevalence Mean A03 S06 "
{txt}
{com}. label var DayPreLoRaA03S06 "Daily prevalence Lower A03 S06 "
{txt}
{com}. label var DayPreUpRaA03S06 "Daily prevalence Upper A03 S06 "
{txt}
{com}. 
. label var DayRefMeRaA03S01 "Daily R effective Mean A03 S01 "
{txt}
{com}. label var DayRefLoRaA03S01 "Daily R effective Lower A03 S01 "
{txt}
{com}. label var DayRefUpRaA03S01 "Daily R effective Upper A03 S01 "
{txt}
{com}. label var DayRefMeRaA03S02 "Daily R effective Mean A03 S02 "
{txt}
{com}. label var DayRefLoRaA03S02 "Daily R effective Lower A03 S02 "
{txt}
{com}. label var DayRefUpRaA03S02 "Daily R effective Upper A03 S02 "
{txt}
{com}. label var DayRefMeRaA03S03 "Daily R effective Mean A03 S03 "
{txt}
{com}. label var DayRefLoRaA03S03 "Daily R effective Lower A03 S03 "
{txt}
{com}. label var DayRefUpRaA03S03 "Daily R effective Upper A03 S03 "
{txt}
{com}. label var DayRefMeRaA03S04 "Daily R effective Mean A03 S04 "
{txt}
{com}. label var DayRefLoRaA03S04 "Daily R effective Lower A03 S04 "
{txt}
{com}. label var DayRefUpRaA03S04 "Daily R effective Upper A03 S04 "
{txt}
{com}. label var DayRefMeRaA03S05 "Daily R effective Mean A03 S05 "
{txt}
{com}. label var DayRefLoRaA03S05 "Daily R effective Lower A03 S05 "
{txt}
{com}. label var DayRefUpRaA03S05 "Daily R effective Upper A03 S05 "
{txt}
{com}. label var DayRefMeRaA03S06 "Daily R effective Mean A03 S06 "
{txt}
{com}. label var DayRefLoRaA03S06 "Daily R effective Lower A03 S06 "
{txt}
{com}. label var DayRefUpRaA03S06 "Daily R effective Upper A03 S06 "
{txt}
{com}. 
. label var DayRttMeRaA03S01 "Daily R t Mean A03 S01 "
{txt}
{com}. label var DayRttLoRaA03S01 "Daily R t Lower A03 S01 "
{txt}
{com}. label var DayRttUpRaA03S01 "Daily R t Upper A03 S01 "
{txt}
{com}. label var DayRttMeRaA03S02 "Daily R t Mean A03 S02 "
{txt}
{com}. label var DayRttLoRaA03S02 "Daily R t Lower A03 S02 "
{txt}
{com}. label var DayRttUpRaA03S02 "Daily R t Upper A03 S02 "
{txt}
{com}. label var DayRttMeRaA03S03 "Daily R t Mean A03 S03 "
{txt}
{com}. label var DayRttLoRaA03S03 "Daily R t Lower A03 S03 "
{txt}
{com}. label var DayRttUpRaA03S03 "Daily R t Upper A03 S03 "
{txt}
{com}. label var DayRttMeRaA03S04 "Daily R t Mean A03 S04 "
{txt}
{com}. label var DayRttLoRaA03S04 "Daily R t Lower A03 S04 "
{txt}
{com}. label var DayRttUpRaA03S04 "Daily R t Upper A03 S04 "
{txt}
{com}. label var DayRttMeRaA03S05 "Daily R t Mean A03 S05 "
{txt}
{com}. label var DayRttLoRaA03S05 "Daily R t Lower A03 S05 "
{txt}
{com}. label var DayRttUpRaA03S05 "Daily R t Upper A03 S05 "
{txt}
{com}. label var DayRttMeRaA03S06 "Daily R t Mean A03 S06 "
{txt}
{com}. label var DayRttLoRaA03S06 "Daily R t Lower A03 S06 "
{txt}
{com}. label var DayRttUpRaA03S06 "Daily R t Upper A03 S06 "
{txt}
{com}. 
. 
. rename country loc_grand_name
{res}{txt}
{com}. 
. 
. 
. order ///
> loc_grand_name date     ///
> TotDeaMeRaA03S01        TotDeaLoRaA03S01        TotDeaUpRaA03S01        ///
> TotDeaMeRaA03S02        TotDeaLoRaA03S02        TotDeaUpRaA03S02        ///
> TotDeaMeRaA03S03        TotDeaLoRaA03S03        TotDeaUpRaA03S03        ///
> TotDeaMeRaA03S04        TotDeaLoRaA03S04        TotDeaUpRaA03S04        ///
> TotDeaMeRaA03S05        TotDeaLoRaA03S05        TotDeaUpRaA03S05        ///
> TotDeaMeRaA03S06        TotDeaLoRaA03S06        TotDeaUpRaA03S06        ///
> DayDeaMeRaA03S01        DayDeaLoRaA03S01        DayDeaUpRaA03S01        ///
> DayDeaMeRaA03S02        DayDeaLoRaA03S02        DayDeaUpRaA03S02        ///
> DayDeaMeRaA03S03        DayDeaLoRaA03S03        DayDeaUpRaA03S03        ///
> DayDeaMeRaA03S04        DayDeaLoRaA03S04        DayDeaUpRaA03S04        ///
> DayDeaMeRaA03S05        DayDeaLoRaA03S05        DayDeaUpRaA03S05        ///
> DayDeaMeRaA03S06        DayDeaLoRaA03S06        DayDeaUpRaA03S06        ///
> TotINFMeRaA03S01        TotINFLoRaA03S01        TotINFUpRaA03S01        ///
> TotINFMeRaA03S02        TotINFLoRaA03S02        TotINFUpRaA03S02        ///
> TotINFMeRaA03S03        TotINFLoRaA03S03        TotINFUpRaA03S03        ///
> TotINFMeRaA03S04        TotINFLoRaA03S04        TotINFUpRaA03S04        ///
> TotINFMeRaA03S05        TotINFLoRaA03S05        TotINFUpRaA03S05        ///
> TotINFMeRaA03S06        TotINFLoRaA03S06        TotINFUpRaA03S06        ///
> DayINFMeRaA03S01        DayINFLoRaA03S01        DayINFUpRaA03S01        ///
> DayINFMeRaA03S02        DayINFLoRaA03S02        DayINFUpRaA03S02        ///
> DayINFMeRaA03S03        DayINFLoRaA03S03        DayINFUpRaA03S03        ///
> DayINFMeRaA03S04        DayINFLoRaA03S04        DayINFUpRaA03S04        ///
> DayINFMeRaA03S05        DayINFLoRaA03S05        DayINFUpRaA03S05        ///
> DayINFMeRaA03S06        DayINFLoRaA03S06        DayINFUpRaA03S06
{txt}
{com}. 
. 
. 
. 
.  *
.  
.  
. * gen IFR
. 
. gen DayIFRMeRaA03S01 = 100 * DayDeaMeRaA03S01 / DayINFMeRaA03S01 
{txt}
{com}. gen DayIFRLoRaA03S01 = 100 * DayDeaLoRaA03S01 / DayINFLoRaA03S01 
{txt}
{com}. gen DayIFRUpRaA03S01 = 100 * DayDeaUpRaA03S01 / DayINFUpRaA03S01 
{txt}
{com}. gen DayIFRMeRaA03S02 = 100 * DayDeaMeRaA03S02 / DayINFMeRaA03S02 
{txt}
{com}. gen DayIFRLoRaA03S02 = 100 * DayDeaLoRaA03S02 / DayINFLoRaA03S02 
{txt}
{com}. gen DayIFRUpRaA03S02 = 100 * DayDeaUpRaA03S02 / DayINFUpRaA03S02 
{txt}
{com}. gen DayIFRMeRaA03S03 = 100 * DayDeaMeRaA03S03 / DayINFMeRaA03S03 
{txt}
{com}. gen DayIFRLoRaA03S03 = 100 * DayDeaLoRaA03S03 / DayINFLoRaA03S03 
{txt}
{com}. gen DayIFRUpRaA03S03 = 100 * DayDeaUpRaA03S03 / DayINFUpRaA03S03 
{txt}
{com}. gen DayIFRMeRaA03S04 = 100 * DayDeaMeRaA03S04 / DayINFMeRaA03S04 
{txt}
{com}. gen DayIFRLoRaA03S04 = 100 * DayDeaLoRaA03S04 / DayINFLoRaA03S04 
{txt}
{com}. gen DayIFRUpRaA03S04 = 100 * DayDeaUpRaA03S04 / DayINFUpRaA03S04 
{txt}
{com}. gen DayIFRMeRaA03S05 = 100 * DayDeaMeRaA03S05 / DayINFMeRaA03S05 
{txt}
{com}. gen DayIFRLoRaA03S05 = 100 * DayDeaLoRaA03S05 / DayINFLoRaA03S05 
{txt}
{com}. gen DayIFRUpRaA03S05 = 100 * DayDeaUpRaA03S05 / DayINFUpRaA03S05 
{txt}
{com}. gen DayIFRMeRaA03S06 = 100 * DayDeaMeRaA03S06 / DayINFMeRaA03S06 
{txt}
{com}. gen DayIFRLoRaA03S06 = 100 * DayDeaLoRaA03S06 / DayINFLoRaA03S06 
{txt}
{com}. gen DayIFRUpRaA03S06 = 100 * DayDeaUpRaA03S06 / DayINFUpRaA03S06 
{txt}
{com}. 
. label var DayIFRMeRaA03S01 "Daily IFR Mean A03 S01 "
{txt}
{com}. label var DayIFRLoRaA03S01 "Daily IFR Lower A03 S01 "
{txt}
{com}. label var DayIFRUpRaA03S01 "Daily IFR Upper A03 S01 "
{txt}
{com}. label var DayIFRMeRaA03S02 "Daily IFR Mean A03 S02 "
{txt}
{com}. label var DayIFRLoRaA03S02 "Daily IFR Lower A03 S02 "
{txt}
{com}. label var DayIFRUpRaA03S02 "Daily IFR Upper A03 S02 "
{txt}
{com}. label var DayIFRMeRaA03S03 "Daily IFR Mean A03 S03 "
{txt}
{com}. label var DayIFRLoRaA03S03 "Daily IFR Lower A03 S03 "
{txt}
{com}. label var DayIFRUpRaA03S03 "Daily IFR Upper A03 S03 "
{txt}
{com}. label var DayIFRMeRaA03S04 "Daily IFR Mean A03 S04 "
{txt}
{com}. label var DayIFRLoRaA03S04 "Daily IFR Lower A03 S04 "
{txt}
{com}. label var DayIFRUpRaA03S04 "Daily IFR Upper A03 S04 "
{txt}
{com}. label var DayIFRMeRaA03S05 "Daily IFR Mean A03 S05 "
{txt}
{com}. label var DayIFRLoRaA03S05 "Daily IFR Lower A03 S05 "
{txt}
{com}. label var DayIFRUpRaA03S05 "Daily IFR Upper A03 S05 "
{txt}
{com}. label var DayIFRMeRaA03S06 "Daily IFR Mean A03 S06 "
{txt}
{com}. label var DayIFRLoRaA03S06 "Daily IFR Lower A03 S06 "
{txt}
{com}. label var DayIFRUpRaA03S06 "Daily IFR Upper A03 S06 "
{txt}
{com}. 
. 
. 
. 
. 
. * gen "Daily infections mean div by daily deaths mean IMPE DayIbD" for visulization of temporal relation of deaths and infections peaks 
. 
. 
. summ DayDeaMeRaA03S02 

{txt}    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayDeaMeR~02 {c |}{res}        838    318.2998    275.1768       3.02     1246.7
{txt}
{com}. gen DayDeMMeRaA03S02 = r(mean)
{txt}
{com}. label var DayDeMMeRaA03S02 "Daily deaths mean IMPE DayDeM"
{txt}
{com}. 
. summ DayINFMeRaA03S02 

{txt}    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayINFMeR~02 {c |}{res}        838    77291.22    54710.88     276.38   306386.1
{txt}
{com}. gen DayCaMMeRaA03S02 = r(mean)
{txt}
{com}. label var DayCaMMeRaA03S02 "Daily infections mean IMPE DayCaM"
{txt}
{com}.                            
. gen DayIbDMeRaA03S02 = DayCaMMeRaA03S02 / DayDeMMeRaA03S02
{txt}
{com}. label var DayIbDMeRaA03S02 "Daily infections mean div by daily deaths mean IMPE DayIbD"
{txt}
{com}. summ DayIbDMeRaA03S02

{txt}    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayIbDMeR~02 {c |}{res}        838    242.8252           0   242.8252   242.8252
{txt}
{com}.                                               
. gen DayDMuMeRaA03S02 = DayDeaMeRaA03S02 * DayIbDMeRaA03S02
{txt}
{com}. label var DayDMuMeRaA03S02 "Daily deaths scaled (times means of infections by deaths) IMPE"
{txt}
{com}. summ DayDMuMeRaA03S02

{txt}    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayDMuMeR~02 {c |}{res}        838    77291.22    66819.86   733.3322   302730.2
{txt}
{com}. 
. 
. 
. * gen forecast only
. 
. di "$IMPEepoch"
{res}20Jun2022
{txt}
{com}. 
. *
. 
. gen DayDeaFOREA03S02 = DayDeaMeRaA03S02
{txt}
{com}. replace DayDeaFOREA03S02 = . if date < td("$IMPEepoch")
{txt}(748 real changes made, 748 to missing)

{com}. label var DayDeaFOREA03S02 "Daily Forecasted Deaths Mean smoothed IMPE S2"
{txt}
{com}. 
. gen DayINFFOREA03S02 = DayINFMeRaA03S02
{txt}
{com}. replace DayINFFOREA03S02 = . if date < td("$IMPEepoch")
{txt}(748 real changes made, 748 to missing)

{com}. label var DayINFFOREA03S02 "Daily Forecasted Infections Mean smoothed IMPE S2"
{txt}
{com}. 
. 
. 
. 
. * smooth
. 
. tsset date, daily   
{res}{txt}{col 9}time variable:  {res}{col 25}date, 02Jun2020 to 17Sep2022
{txt}{col 17}delta:  {res}1 day
{txt}
{com}. 
. 
. 
. tssmooth ma DayDeaMeRaA03S02_window = DayDeaMeRaA03S02 if DayDeaMeRaA03S02 >= 0, window(3 1 3)
{txt}The smoother applied was
{res}{p 5 5 5}(1/7)*[x(t-3) + x(t-2) + x(t-1) + 1*x(t) + x(t+1) + x(t+2) + x(t+3)]; x(t)= DayDeaMeRaA03S02 {p_end}
{txt}
{com}. 
. tssmooth ma DayDeaMeSmA03S02 = DayDeaMeRaA03S02_window, weights( 1 2 3 <4> 3 2 1) replace
{txt}The smoother applied was
{res}{p 5 5 5}(1/16)*[1*x(t-3) + 2*x(t-2) + 3*x(t-1) + 4*x(t) + 3*x(t+1) + 2*x(t+2) + ...; x(t)= DayDeaMeRaA03S02_window
{txt}
{smcl}
{com}. 
. label var DayDeaMeSmA03S02 "Daily deaths mean smooth IMPE S2"
{txt}
{com}. 
. 
. tssmooth ma DayDeaMeRaA03S01_window = DayDeaMeRaA03S01 if DayDeaMeRaA03S01 >= 0, window(3 1 3)
{txt}The smoother applied was
{res}{p 5 5 5}(1/7)*[x(t-3) + x(t-2) + x(t-1) + 1*x(t) + x(t+1) + x(t+2) + x(t+3)]; x(t)= DayDeaMeRaA03S01 {p_end}
{txt}
{com}. 
. tssmooth ma DayDeaMeSmA03S01 = DayDeaMeRaA03S01_window, weights( 1 2 3 <4> 3 2 1) replace
{txt}The smoother applied was
{res}{p 5 5 5}(1/16)*[1*x(t-3) + 2*x(t-2) + 3*x(t-1) + 4*x(t) + 3*x(t+1) + 2*x(t+2) + ...; x(t)= DayDeaMeRaA03S01_window
{txt}
{smcl}
{com}. 
. label var DayDeaMeSmA03S01 "Daily deaths mean smooth IMPE S1"
{txt}
{com}. 
. 
. tssmooth ma DayDeaMeRaA03S03_window = DayDeaMeRaA03S03 if DayDeaMeRaA03S03 >= 0, window(3 1 3)
{txt}The smoother applied was
{res}{p 5 5 5}(1/7)*[x(t-3) + x(t-2) + x(t-1) + 1*x(t) + x(t+1) + x(t+2) + x(t+3)]; x(t)= DayDeaMeRaA03S03 {p_end}
{txt}
{com}. 
. tssmooth ma DayDeaMeSmA03S03 = DayDeaMeRaA03S03_window, weights( 1 2 3 <4> 3 2 1) replace
{txt}The smoother applied was
{res}{p 5 5 5}(1/16)*[1*x(t-3) + 2*x(t-2) + 3*x(t-1) + 4*x(t) + 3*x(t+1) + 2*x(t+2) + ...; x(t)= DayDeaMeRaA03S03_window
{txt}
{smcl}
{com}. 
. label var DayDeaMeSmA03S03 "Daily deaths mean smooth IMPE S3"
{txt}
{com}. 
. 
. tssmooth ma DayDeaLoRaA03S03_window = DayDeaLoRaA03S03 if DayDeaLoRaA03S03 >= 0, window(3 1 3)
{txt}The smoother applied was
{res}{p 5 5 5}(1/7)*[x(t-3) + x(t-2) + x(t-1) + 1*x(t) + x(t+1) + x(t+2) + x(t+3)]; x(t)= DayDeaLoRaA03S03 {p_end}
{txt}
{com}. 
. tssmooth ma DayDeaLoSmA03S03 = DayDeaLoRaA03S03_window, weights( 1 2 3 <4> 3 2 1) replace
{txt}The smoother applied was
{res}{p 5 5 5}(1/16)*[1*x(t-3) + 2*x(t-2) + 3*x(t-1) + 4*x(t) + 3*x(t+1) + 2*x(t+2) + ...; x(t)= DayDeaLoRaA03S03_window
{txt}
{smcl}
{com}. 
. label var DayDeaLoSmA03S03 "Daily deaths lower smooth IMPE S3"
{txt}
{com}. 
. 
. tssmooth ma DayDeaUpRaA03S03_window = DayDeaUpRaA03S03 if DayDeaUpRaA03S03 >= 0, window(3 1 3)
{txt}The smoother applied was
{res}{p 5 5 5}(1/7)*[x(t-3) + x(t-2) + x(t-1) + 1*x(t) + x(t+1) + x(t+2) + x(t+3)]; x(t)= DayDeaUpRaA03S03 {p_end}
{txt}
{com}. 
. tssmooth ma DayDeaUpSmA03S03 = DayDeaUpRaA03S03_window, weights( 1 2 3 <4> 3 2 1) replace
{txt}The smoother applied was
{res}{p 5 5 5}(1/16)*[1*x(t-3) + 2*x(t-2) + 3*x(t-1) + 4*x(t) + 3*x(t+1) + 2*x(t+2) + ...; x(t)= DayDeaUpRaA03S03_window
{txt}
{smcl}
{com}. 
. label var DayDeaUpSmA03S03 "Daily deaths upper smooth IMPE S3"
{txt}
{com}. 
. 
. rename DayDeaFOREA03 DayDeaFOREA03S02_raw
{res}{txt}
{com}. 
. tssmooth ma DayDeaFOREA03S02_window = DayDeaFOREA03S02_raw if DayDeaFOREA03S02_raw >= 0, window(3 1 3)
{txt}The smoother applied was
{res}{p 5 5 5}(1/7)*[x(t-3) + x(t-2) + x(t-1) + 1*x(t) + x(t+1) + x(t+2) + x(t+3)]; x(t)= DayDeaFOREA03S02_raw {p_end}
{txt}
{com}. 
. tssmooth ma DayDeaFOREA03S02 = DayDeaFOREA03S02_window, weights( 1 2 3 <4> 3 2 1) replace
{txt}The smoother applied was
{res}{p 5 5 5}(1/16)*[1*x(t-3) + 2*x(t-2) + 3*x(t-1) + 4*x(t) + 3*x(t+1) + 2*x(t+2) + ...; x(t)= DayDeaFOREA03S02_window
{txt}
{smcl}
{com}. 
. label var DayDeaFOREA03S02 "Daily deaths mean smooth IMPE"
{txt}
{com}. 
. 
. 
. tssmooth ma DayINFMeRaA03S02_window = DayINFMeRaA03S02 if DayINFMeRaA03S02 >= 0, window(3 1 3)
{txt}The smoother applied was
{res}{p 5 5 5}(1/7)*[x(t-3) + x(t-2) + x(t-1) + 1*x(t) + x(t+1) + x(t+2) + x(t+3)]; x(t)= DayINFMeRaA03S02 {p_end}
{txt}
{com}. 
. tssmooth ma DayINFMeSmA03S02 = DayINFMeRaA03S02_window, weights( 1 2 3 <4> 3 2 1) replace
{txt}The smoother applied was
{res}{p 5 5 5}(1/16)*[1*x(t-3) + 2*x(t-2) + 3*x(t-1) + 4*x(t) + 3*x(t+1) + 2*x(t+2) + ...; x(t)= DayINFMeRaA03S02_window
{txt}
{smcl}
{com}. 
. label var DayINFMeSmA03S02 "Daily infections mean smooth IMPE"
{txt}
{com}. 
. 
. 
. rename DayINFFOREA03S02 DayINFFOREA03S02_raw
{res}{txt}
{com}. 
. tssmooth ma DayINFFOREA03S02_window = DayINFFOREA03S02_raw if DayINFFOREA03S02_raw >= 0, window(3 1 3)
{txt}The smoother applied was
{res}{p 5 5 5}(1/7)*[x(t-3) + x(t-2) + x(t-1) + 1*x(t) + x(t+1) + x(t+2) + x(t+3)]; x(t)= DayINFFOREA03S02_raw {p_end}
{txt}
{com}. 
. tssmooth ma DayINFFOREA03S02 = DayINFFOREA03S02_window, weights( 1 2 3 <4> 3 2 1) replace
{txt}The smoother applied was
{res}{p 5 5 5}(1/16)*[1*x(t-3) + 2*x(t-2) + 3*x(t-1) + 4*x(t) + 3*x(t+1) + 2*x(t+2) + ...; x(t)= DayINFFOREA03S02_window
{txt}
{smcl}
{com}. 
. label var DayINFFOREA03S02 "Daily infections mean smooth IMPE"
{txt}
{com}. 
. 
. 
. 
. 
. 
. tssmooth ma DayDeaLoRaA03S02_window = DayDeaLoRaA03S02 if DayDeaLoRaA03S02 >= 0, window(3 1 3)
{txt}The smoother applied was
{res}{p 5 5 5}(1/7)*[x(t-3) + x(t-2) + x(t-1) + 1*x(t) + x(t+1) + x(t+2) + x(t+3)]; x(t)= DayDeaLoRaA03S02 {p_end}
{txt}
{com}. 
. tssmooth ma DayDeaLoSmA03S02 = DayDeaLoRaA03S02_window, weights( 1 2 3 <4> 3 2 1) replace
{txt}The smoother applied was
{res}{p 5 5 5}(1/16)*[1*x(t-3) + 2*x(t-2) + 3*x(t-1) + 4*x(t) + 3*x(t+1) + 2*x(t+2) + ...; x(t)= DayDeaLoRaA03S02_window
{txt}
{smcl}
{com}. 
. label var DayDeaLoSmA03S02 "Daily deaths lower smooth IMPE"
{txt}
{com}. 
. 
. 
. 
. 
. 
. 
. 
. 
. tssmooth ma DayINFLoRaA03S02_window = DayINFLoRaA03S02 if DayINFLoRaA03S02 >= 0, window(3 1 3)
{txt}The smoother applied was
{res}{p 5 5 5}(1/7)*[x(t-3) + x(t-2) + x(t-1) + 1*x(t) + x(t+1) + x(t+2) + x(t+3)]; x(t)= DayINFLoRaA03S02 {p_end}
{txt}
{com}. 
. tssmooth ma DayINFLoSmA03S02 = DayINFLoRaA03S02_window, weights( 1 2 3 <4> 3 2 1) replace
{txt}The smoother applied was
{res}{p 5 5 5}(1/16)*[1*x(t-3) + 2*x(t-2) + 3*x(t-1) + 4*x(t) + 3*x(t+1) + 2*x(t+2) + ...; x(t)= DayINFLoRaA03S02_window
{txt}
{smcl}
{com}. 
. label var DayINFLoSmA03S02 "Daily infections lower smooth IMPE"
{txt}
{com}. 
. 
. 
. 
. 
. tssmooth ma DayDeaUpRaA03S02_window = DayDeaUpRaA03S02 if DayDeaUpRaA03S02 >= 0, window(3 1 3)
{txt}The smoother applied was
{res}{p 5 5 5}(1/7)*[x(t-3) + x(t-2) + x(t-1) + 1*x(t) + x(t+1) + x(t+2) + x(t+3)]; x(t)= DayDeaUpRaA03S02 {p_end}
{txt}
{com}. 
. tssmooth ma DayDeaUpSmA03S02 = DayDeaUpRaA03S02_window, weights( 1 2 3 <4> 3 2 1) replace
{txt}The smoother applied was
{res}{p 5 5 5}(1/16)*[1*x(t-3) + 2*x(t-2) + 3*x(t-1) + 4*x(t) + 3*x(t+1) + 2*x(t+2) + ...; x(t)= DayDeaUpRaA03S02_window
{txt}
{smcl}
{com}. 
. label var DayDeaUpSmA03S02 "Daily deaths upper smooth IMPE"
{txt}
{com}. 
. 
. 
. 
. 
. 
. tssmooth ma DayINFUpRaA03S02_window = DayINFUpRaA03S02 if DayINFUpRaA03S02 >= 0, window(3 1 3)
{txt}The smoother applied was
{res}{p 5 5 5}(1/7)*[x(t-3) + x(t-2) + x(t-1) + 1*x(t) + x(t+1) + x(t+2) + x(t+3)]; x(t)= DayINFUpRaA03S02 {p_end}
{txt}
{com}. 
. tssmooth ma DayINFUpSmA03S02 = DayINFUpRaA03S02_window, weights( 1 2 3 <4> 3 2 1) replace
{txt}The smoother applied was
{res}{p 5 5 5}(1/16)*[1*x(t-3) + 2*x(t-2) + 3*x(t-1) + 4*x(t) + 3*x(t+1) + 2*x(t+2) + ...; x(t)= DayINFUpRaA03S02_window
{txt}
{smcl}
{com}. 
. label var DayINFUpSmA03S02 "Daily infections upper smooth IMPE S2"
{txt}
{com}. 
. 
. 
. tssmooth ma DayINFUpRaA03S03_window = DayINFUpRaA03S03 if DayINFUpRaA03S03 >= 0, window(3 1 3)
{txt}The smoother applied was
{res}{p 5 5 5}(1/7)*[x(t-3) + x(t-2) + x(t-1) + 1*x(t) + x(t+1) + x(t+2) + x(t+3)]; x(t)= DayINFUpRaA03S03 {p_end}
{txt}
{com}. 
. tssmooth ma DayINFUpSmA03S03 = DayINFUpRaA03S03_window, weights( 1 2 3 <4> 3 2 1) replace
{txt}The smoother applied was
{res}{p 5 5 5}(1/16)*[1*x(t-3) + 2*x(t-2) + 3*x(t-1) + 4*x(t) + 3*x(t+1) + 2*x(t+2) + ...; x(t)= DayINFUpRaA03S03_window
{txt}
{smcl}
{com}. 
. label var DayINFUpSmA03S03 "Daily infections upper smooth IMPE S3"
{txt}
{com}. 
. 
. 
. drop *_window
{txt}
{com}. 
. tsset, clear
{txt}
{com}.         
. 
. 
. 
. sort date loc_grand_name
{txt}
{com}. 
. qui compress
{txt}
{com}. 
. save "country IMPE.dta", replace
{txt}(note: file country IMPE.dta not found)
file country IMPE.dta saved

{com}. 
. 
. 
. 
. 
. view "log country IMPE.smcl"
{txt}
{com}. 
. log close
      {txt}name:  {res}<unnamed>
       {txt}log:  {res}/Users/farshadpourmalek/Downloads/covir2-main/20220708/code/IMPE/log country IMPE.smcl
  {txt}log type:  {res}smcl
 {txt}closed on:  {res} 8 Jul 2022, 06:58:28
{txt}{.-}
{smcl}
{txt}{sf}{ul off}