{smcl}
{com}{sf}{ul off}{txt}{.-}
      name:  {res}<unnamed>
       {txt}log:  {res}/Users/farshadpourmalek/Downloads/covir2-main/20220506/code/merge/log country merge.smcl
  {txt}log type:  {res}smcl
 {txt}opened on:  {res} 7 May 2022, 17:09:06
{txt}
{com}. 
. 
. ***************************************************************************
. * This is "do country merge.do"
. 
. * Project: CovidVisualized country - countries without subnational estimates
. * Person: Farshad Pourmalek pourmalek_farshad at yahoo dot com
. * Time (initial): 2021-02-10
. 
. * OBJECTIVE: Merge component studies' estimates for country, graphs
. ***************************************************************************
. 
. 
. * SRIV not included in graphs due to highly implausibly high estimates. 
. 
. 
. /* 
> 
> List of component studies:
> 
> JOHN A00
> 
> DELP A01
> IHME A02
> IMPE A03
> LANL A04 // The LANL COVID-19 Team made its last real-time forecast on September 27th, 2021. [for 20210926]. This is more than two weeks old and will not be used. 
> SRIV A05 
> 
> WHO      A06 * 
> * Global excess deaths associated with COVID-19 (modelled estimates) 
> * Most recent update: 5 May 2022
> * Temporal coverage     1 January 2020 - 31 December 2021
> * Source web page:
> * https://www.who.int/data/sets/global-excess-deaths-associated-with-covid-19-modelled-estimates
> 
> */
. 
. 
. clear 
{txt}
{com}. 
. * JOHN
. 
. if regexm(c(os),"Mac") == 1 {c -(}
. 
.         use "$pathcovir2/JOHN/country JOHN.dta", clear 
. {c )-}
{txt}
{com}. else if regexm(c(os),"Windows") == 1 use "$pathcovir2\JOHN\country JOHN.dta", clear 
{txt}
{com}. 
. 
. 
. * DELP 
. 
. if regexm(c(os),"Mac") == 1 {c -(}
. 
.         merge 1:1 date using "$pathcovir2/DELP/country DELP.dta"
{res}
{txt}{col 5}Result{col 38}# of obs.
{col 5}{hline 41}
{col 5}not matched{col 30}{res}             784
{txt}{col 9}from master{col 30}{res}             714{txt}  (_merge==1)
{col 9}from using{col 30}{res}              70{txt}  (_merge==2)

{col 5}matched{col 30}{res}             143{txt}  (_merge==3)
{col 5}{hline 41}
{com}. {c )-}
{txt}
{com}. else if regexm(c(os),"Windows") == 1 merge 1:1 date using "$pathcovir2\DELP\country DELP.dta"
{txt}
{com}. 
. drop _merge
{txt}
{com}. 
. 
. 
. * IHME
. 
. if regexm(c(os),"Mac") == 1 {c -(}
. 
.         merge 1:1 date using "$pathcovir2/IHME/country IHME.dta"
{res}
{txt}{col 5}Result{col 38}# of obs.
{col 5}{hline 41}
{col 5}not matched{col 30}{res}              82
{txt}{col 9}from master{col 30}{res}              34{txt}  (_merge==1)
{col 9}from using{col 30}{res}              48{txt}  (_merge==2)

{col 5}matched{col 30}{res}             893{txt}  (_merge==3)
{col 5}{hline 41}
{com}. {c )-}
{txt}
{com}. else if regexm(c(os),"Windows") == 1 merge 1:1 date using "$pathcovir2\IHME\country IHME.dta"
{txt}
{com}. 
. drop _merge
{txt}
{com}. 
. 
. 
. * IMPE
. 
. if regexm(c(os),"Mac") == 1 {c -(}
. 
.         merge 1:1 date using "$pathcovir2/IMPE/country IMPE.dta"
{res}
{txt}{col 5}Result{col 38}# of obs.
{col 5}{hline 41}
{col 5}not matched{col 30}{res}              81
{txt}{col 9}from master{col 30}{res}              81{txt}  (_merge==1)
{col 9}from using{col 30}{res}               0{txt}  (_merge==2)

{col 5}matched{col 30}{res}             894{txt}  (_merge==3)
{col 5}{hline 41}
{com}. {c )-}
{txt}
{com}. else if regexm(c(os),"Windows") == 1 merge 1:1 date using "$pathcovir2\IMPE\country IMPE.dta"
{txt}
{com}. 
. drop _merge
{txt}
{com}. 
. 
. 
. /* LANL
> 
> if regexm(c(os),"Mac") == 1 {c -(}
> 
>         merge 1:1 date using "$pathcovir2/LANL/country LANL.dta"
> {c )-}
> else if regexm(c(os),"Windows") == 1 merge 1:1 date using "$pathcovir2\LANL\country LANL.dta"
> 
> drop _merge */
. 
. 
. * SRIV
. 
. if regexm(c(os),"Mac") == 1 {c -(}
. 
.         merge 1:1 date using "$pathcovir2/SRIV/country SRIV.dta"
{res}
{txt}{col 5}Result{col 38}# of obs.
{col 5}{hline 41}
{col 5}not matched{col 30}{res}             874
{txt}{col 9}from master{col 30}{res}             874{txt}  (_merge==1)
{col 9}from using{col 30}{res}               0{txt}  (_merge==2)

{col 5}matched{col 30}{res}             101{txt}  (_merge==3)
{col 5}{hline 41}
{com}. {c )-}
{txt}
{com}. else if regexm(c(os),"Windows") == 1 merge 1:1 date using "$pathcovir2\SRIV\country SRIV.dta"
{txt}
{com}. 
. drop _merge
{txt}
{com}. 
. 
. 
. 
. * WHO
. 
. if regexm(c(os),"Mac") == 1 {c -(}
. 
.         merge 1:1 date using "$pathcovir2/WHO/country WHO.dta"
{res}
{txt}{col 5}Result{col 38}# of obs.
{col 5}{hline 41}
{col 5}not matched{col 30}{res}             244
{txt}{col 9}from master{col 30}{res}             244{txt}  (_merge==1)
{col 9}from using{col 30}{res}               0{txt}  (_merge==2)

{col 5}matched{col 30}{res}             731{txt}  (_merge==3)
{col 5}{hline 41}
{com}. {c )-}
{txt}
{com}. else if regexm(c(os),"Windows") == 1 merge 1:1 date using "$pathcovir2\WHO\country WHO.dta"
{txt}
{com}. 
. drop _merge
{txt}
{com}. 
. 
. * 
. 
. label var loc_grand_name "Location"
{txt}
{com}. 
. 
. 
. 
. 
. 
. 
. *************************************
. 
. 
. * cases or infections to deaths ratio
. 
. 
. gen DayCTDMeRaA00S00 =  DayCasMeRaA00S00 / DayDeaMeRaA00S00
{txt}(168 missing values generated)

{com}. 
. label var DayCTDMeRaA00S00  "Daily Cases to Deaths S0 JOHN"
{txt}
{com}. 
. gen TotCTDMeRaA00S00 =  TotCasMeRaA00S00 / TotDeaMeRaA00S00
{txt}(167 missing values generated)

{com}. 
. label var TotCTDMeRaA00S00  "Total Cases to Deaths S0 JOHN"
{txt}
{com}. 
. 
. 
. 
. gen DayCTDMeRaA01S00 =  DayCasMeRaA01S00 / DayDeaMeRaA01S00
{txt}(781 missing values generated)

{com}. 
. label var DayCTDMeRaA01S00  "Daily Cases to Deaths S0 DELP"
{txt}
{com}. 
. gen TotCTDMeRaA01S00 =  TotCasMeRaA01S00 / TotDeaMeRaA01S00
{txt}(762 missing values generated)

{com}. 
. label var TotCTDMeRaA01S00  "Total Cases to Deaths S0 DELP"  
{txt}
{com}. 
. 
. 
. 
. 
. gen DayITDMeRaA02S01  =  DayINFMeSmA02S01  / DayDeaMeSmA02S01 
{txt}(53 missing values generated)

{com}. 
. label var DayITDMeRaA02S01   "Daily Infections to Deaths S1 IHME"
{txt}
{com}. 
. gen TotITDMeRaA02S01  =  TotINFMeSmA02S01  / TotDeaMeSmA02S01 
{txt}(53 missing values generated)

{com}. 
. label var TotITDMeRaA02S01   "Total Infections to Deaths S1 IHME"
{txt}
{com}. 
. 
. 
. 
. gen DayITDMeRaA02S02 = DayINFMeSmA02S02 / DayDeaMeSmA02S02  
{txt}(53 missing values generated)

{com}. 
. label var DayITDMeRaA02S02 "Daily Infections to Deaths S2 IHME"
{txt}
{com}. 
. gen TotITDMeRaA02S02 = TotINFMeSmA02S02 / TotDeaMeSmA02S02  
{txt}(53 missing values generated)

{com}. 
. label var TotITDMeRaA02S02 "Total Infections to Deaths S2 IHME"
{txt}
{com}. 
. 
. 
. 
. 
. 
. 
. gen DayITDMeRaA03S01  = DayINFMeRaA03S01  / DayDeaMeRaA03S01   
{txt}(103 missing values generated)

{com}. 
. label var DayITDMeRaA03S01  "Daily Infections to Deaths S1 IMPE"
{txt}
{com}. 
. gen TotITDMeRaA03S01  = TotINFMeRaA03S01  / TotDeaMeRaA03S01   
{txt}(96 missing values generated)

{com}. 
. label var TotITDMeRaA03S01  "Total Infections to Deaths S1 IMPE"
{txt}
{com}. 
. 
. 
. gen DayITDMeRaA03S02  = DayINFMeRaA03S02  / DayDeaMeRaA03S02   
{txt}(100 missing values generated)

{com}. 
. label var DayITDMeRaA03S02  "Daily Infections to Deaths S2 IMPE"
{txt}
{com}. 
. gen TotITDMeRaA03S02  = TotINFMeRaA03S02  / TotDeaMeRaA03S02   
{txt}(96 missing values generated)

{com}. 
. label var TotITDMeRaA03S02  "Total Infections to Deaths S2 IMPE"
{txt}
{com}. 
. 
. 
. gen DayITDMeRaA03S03  = DayINFMeRaA03S03  / DayDeaMeRaA03S03   
{txt}(100 missing values generated)

{com}. 
. label var DayITDMeRaA03S03  "Daily Infections to Deaths S3 IMPE"
{txt}
{com}. 
. gen TotITDMeRaA03S03  = TotINFMeRaA03S03  / TotDeaMeRaA03S03   
{txt}(96 missing values generated)

{com}. 
. label var TotITDMeRaA03S03  "Total Infections to Deaths S3 IMPE"
{txt}
{com}. 
. 
. 
. 
. gen DayCTDMeRaA05S00  = DayCasMeRaA05S00  / DayDeaMeRaA05S00   
{txt}(875 missing values generated)

{com}. 
. label var DayCTDMeRaA05S00  "Daily Cases to Deaths S0 SRIV"
{txt}
{com}. 
. gen TotCTDMeRaA05S00  = TotCasMeRaA05S00  / TotDeaMeRaA05S00   
{txt}(874 missing values generated)

{com}. 
. label var TotCTDMeRaA05S00  "Total Cases to Deaths S0 SRIV"
{txt}
{com}. 
. 
. 
. 
. 
. 
. ***********************
. 
. * daily deaths estimated to reported  
. 
.     
. gen DayDERMeRaA00S00 = DayDeaMeRaA00S00 / DayDeaMeRaA00S00
{txt}(168 missing values generated)

{com}. 
. label var DayDERMeRaA00S00 "Daily Deaths estim to reported JOHN = 1" 
{txt}
{com}. 
. 
. gen DayDERMeRaA01S00 = DayDeaMeRaA01S00 / DayDeaMeRaA00S00
{txt}(833 missing values generated)

{com}. 
. label var DayDERMeRaA01S00 "Daily Deaths estim to reported Mean DELP S0"
{txt}
{com}. 
. 
. 
. 
. gen DayDERMeRaA02S01 = DayDeaMeSmA02S01 / DayDeaMeRaA00S00
{txt}(168 missing values generated)

{com}. 
. label var DayDERMeRaA02S01 "Daily Deaths estim to reported Mean not smoothed IHME S1"
{txt}
{com}. 
. 
. gen DayDERMeRaA02S02 = DayDeaMeSmA02S02 / DayDeaMeRaA00S00
{txt}(168 missing values generated)

{com}. 
. label var DayDERMeRaA02S02 "Daily Deaths estim to reported Mean not smoothed IHME S2"
{txt}
{com}. 
. 
. 
. 
. gen DayDERMeRaA03S01 = DayDeaMeRaA03S01 / DayDeaMeRaA00S00
{txt}(168 missing values generated)

{com}. 
. label var DayDERMeRaA03S01 "Daily Deaths estim to reported Mean S1 IMPE"
{txt}
{com}. 
. 
. gen DayDERMeRaA03S02 = DayDeaMeRaA03S02 / DayDeaMeRaA00S00
{txt}(168 missing values generated)

{com}. 
. label var DayDERMeRaA03S02 "Daily Deaths estim to reported Mean S2 IMPE"
{txt}
{com}. 
. 
. gen DayDERMeRaA03S03 = DayDeaMeRaA03S03 / DayDeaMeRaA00S00
{txt}(168 missing values generated)

{com}. 
. label var DayDERMeRaA03S03 "Daily Deaths estim to reported Mean S3 IMPE"
{txt}
{com}. 
. 
. 
. gen DayDERMeRaA05S00  = DayDeaMeRaA05S00 / DayDeaMeRaA00S00
{txt}(971 missing values generated)

{com}. 
. label var DayDERMeRaA05S00 "Daily Deaths estim to reported S0 SRIV"
{txt}
{com}. 
. 
. 
. 
. 
. 
. 
. * daily cases or infections estimated to reported  
. 
. 
. gen DayCERMeRaA00S00 = DayCasMeRaA00S00 / DayCasMeRaA00S00
{txt}(167 missing values generated)

{com}. 
. label var DayCERMeRaA00S00 "Daily Cases estim to reported JOHN = 1" 
{txt}
{com}. 
. 
. 
. gen DayCERMeRaA01S00 = DayCasMeRaA01S00 / DayCasMeRaA00S00
{txt}(833 missing values generated)

{com}. 
. label var DayCERMeRaA01S00 "Daily Cases estim to reported Mean DELP S0"
{txt}
{com}. 
. 
. 
. 
. 
. 
. gen DayIERMeRaA02S01 = DayINFMeSmA02S01 / DayCasMeRaA00S00
{txt}(167 missing values generated)

{com}. 
. label var DayIERMeRaA02S01 "Daily Infections estim to reported Mean not smoothed IHME S1"
{txt}
{com}. 
. 
. gen DayIERMeRaA02S02 = DayINFMeSmA02S02 / DayCasMeRaA00S00
{txt}(167 missing values generated)

{com}. 
. label var DayIERMeRaA02S02 "Daily Infections estim to reported Mean not smoothed IHME S2"
{txt}
{com}. 
. 
. 
. gen DayIERMeRaA03S01 = DayINFMeRaA03S01 / DayCasMeRaA00S00
{txt}(167 missing values generated)

{com}. 
. label var DayIERMeRaA03S01 "Daily Infections estim to reported Mean S1 IMPE"
{txt}
{com}. 
. 
. gen DayIERMeRaA03S02 = DayINFMeRaA03S02 / DayCasMeRaA00S00
{txt}(167 missing values generated)

{com}. 
. label var DayIERMeRaA03S02 "Daily Infections estim to reported Mean S2 IMPE"
{txt}
{com}. 
. 
. gen DayIERMeRaA03S03 = DayINFMeRaA03S03 / DayCasMeRaA00S00
{txt}(167 missing values generated)

{com}. 
. label var DayIERMeRaA03S03 "Daily Infections estim to reported Mean S3 IMPE"
{txt}
{com}. 
. 
. gen DayCERMeRaA05S00  = DayCasMeRaA05S00 / DayCasMeRaA00S00
{txt}(971 missing values generated)

{com}. 
. label var DayCERMeRaA05S00 "Daily Cases estim to reported S0 SRIV"
{txt}
{com}. 
. 
. 
. 
. 
. 
. 
. * Total deaths estimated to reported  
. 
. 
. gen TotDERMeRaA00S00 = TotDeaMeRaA00S00 / TotDeaMeRaA00S00
{txt}(167 missing values generated)

{com}. 
. label var TotDERMeRaA00S00 "Total Deaths estim to reported JOHN = 1" 
{txt}
{com}. 
. 
. 
. gen TotDERMeRaA01S00 = TotDeaMeRaA01S00 / TotDeaMeRaA00S00
{txt}(832 missing values generated)

{com}. 
. label var TotDERMeRaA01S00 "Total Deaths estim to reported Mean DELP S0"
{txt}
{com}. 
. 
. 
. gen TotDERMeRaA02S01 = TotDeaMeSmA02S01 / TotDeaMeRaA00S00
{txt}(167 missing values generated)

{com}. 
. label var TotDERMeRaA02S01 "Total Deaths estim to reported Mean not smoothed IHME S1"
{txt}
{com}. 
. 
. gen TotDERMeRaA02S02 = TotDeaMeSmA02S02 / TotDeaMeRaA00S00
{txt}(167 missing values generated)

{com}. 
. label var TotDERMeRaA02S02 "Total Deaths estim to reported Mean not smoothed IHME S2"
{txt}
{com}. 
. 
. 
. 
. gen TotDERMeRaA03S01 = TotDeaMeRaA03S01 / TotDeaMeRaA00S00
{txt}(167 missing values generated)

{com}. 
. label var TotDERMeRaA03S01 "Total Deaths estim to reported Mean S1 IMPE"
{txt}
{com}. 
. 
. gen TotDERMeRaA03S02 = TotDeaMeRaA03S02 / TotDeaMeRaA00S00
{txt}(167 missing values generated)

{com}. 
. label var TotDERMeRaA03S02 "Total Deaths estim to reported Mean S2 IMPE"
{txt}
{com}. 
. 
. gen TotDERMeRaA03S03 = TotDeaMeRaA03S03 / TotDeaMeRaA00S00
{txt}(167 missing values generated)

{com}. 
. label var TotDERMeRaA03S03 "Total Deaths estim to reported Mean S3 IMPE"
{txt}
{com}. 
. 
. gen TotDERMeRaA05S00  = TotDeaMeRaA05S00 / TotDeaMeRaA00S00
{txt}(970 missing values generated)

{com}. 
. label var TotDERMeRaA05S00 "Total Deaths estim to reported S0 SRIV"
{txt}
{com}. 
. 
. 
. 
. 
. 
. 
. * Total cases or infections estimated to reported  
. 
. 
. gen TotCERMeRaA00S00 = TotCasMeRaA00S00 / TotCasMeRaA00S00
{txt}(167 missing values generated)

{com}. 
. label var TotCERMeRaA00S00 "Total Cases estim to reported JOHN = 1" 
{txt}
{com}. 
. 
. gen TotCERMeRaA01S00 = TotCasMeRaA01S00 / TotCasMeRaA00S00
{txt}(832 missing values generated)

{com}. 
. label var TotCERMeRaA01S00 "Total Cases estim to reported Mean DELP S0"
{txt}
{com}. 
. 
. 
. gen TotIERMeRaA02S01 = TotINFMeSmA02S01 / TotCasMeRaA00S00
{txt}(167 missing values generated)

{com}. 
. label var TotIERMeRaA02S01 "Total Infections estim to reported Mean not smoothed IHME S1"
{txt}
{com}. 
. 
. gen TotIERMeRaA02S02 = TotINFMeSmA02S02 / TotCasMeRaA00S00
{txt}(167 missing values generated)

{com}. 
. label var TotIERMeRaA02S02 "Total Infections estim to reported Mean not smoothed IHME S2"
{txt}
{com}. 
. 
. 
. 
. gen TotIERMeRaA03S01 = TotINFMeRaA03S01 / TotCasMeRaA00S00
{txt}(167 missing values generated)

{com}. 
. label var TotIERMeRaA03S01 "Total Infections estim to reported Mean S1 IMPE"
{txt}
{com}. 
. 
. gen TotIERMeRaA03S02 = TotINFMeRaA03S02 / TotCasMeRaA00S00
{txt}(167 missing values generated)

{com}. 
. label var TotIERMeRaA03S02 "Total Infections estim to reported Mean S2 IMPE"
{txt}
{com}. 
. 
. gen TotIERMeRaA03S03 = TotINFMeRaA03S03 / TotCasMeRaA00S00
{txt}(167 missing values generated)

{com}. 
. label var TotIERMeRaA03S03 "Total Infections estim to reported Mean S3 IMPE"
{txt}
{com}. 
. 
. 
. gen TotCERMeRaA05S00  = TotCasMeRaA05S00 / TotCasMeRaA00S00
{txt}(970 missing values generated)

{com}. 
. label var TotCERMeRaA05S00 "Total Cases estim to reported S0 SRIV"
{txt}
{com}. 
. 
. 
. 
. 
. 
. 
. 
. *
. 
. di in red "********* Description of vars in final combined file country.dta *********" 
{res}{err}********* Description of vars in final combined file country.dta *********
{txt}
{com}. 
. 
. desc, fullnames

{txt}Contains data from {res}/Users/farshadpourmalek/Downloads/covir2-main/20220506/code/JOHN/country JOHN.dta
{txt}  obs:{res}           975                          
{txt} vars:{res}           597                          7 May 2022 13:39
{txt} size:{res}     2,301,975                          
{txt}{hline}
              storage   display    value
variable name   type    format     label      variable label
{hline}
{p 0 48}{res}{bind:date           }{txt}{bind: int     }{bind:{txt}%td..     }{space 1}{bind:         }{bind:  }{res}{res}{p_end}
{p 0 48}{bind:loc_grand_name }{txt}{bind: str4    }{bind:{txt}%9s       }{space 1}{bind:         }{bind:  }{res}{res}Location{p_end}
{p 0 48}DayDeaMeRaA00S00{p_end}
{p 0 48}{space 15}{txt}{bind: int     }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Daily Deaths JOHN{p_end}
{p 0 48}TotDeaMeRaA00S00{p_end}
{p 0 48}{space 15}{txt}{bind: long    }{bind:{txt}%10.0g    }{space 1}{bind:         }{bind:  }{res}{res}Total Deaths JOHN{p_end}
{p 0 48}DayDeaMeRaA00S00_CF2{p_end}
{p 0 48}{space 15}{txt}{bind: int     }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Daily Deaths JOHN correction factor 2{p_end}
{p 0 48}DayDeaMeRaA00S00_CF5{p_end}
{p 0 48}{space 15}{txt}{bind: int     }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Daily Deaths JOHN correction factor 5{p_end}
{p 0 48}TotDeaMeRaA00S00_CF2{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Total Deaths JOHN correction factor 2{p_end}
{p 0 48}TotDeaMeRaA00S00_CF5{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Total Deaths JOHN correction factor 5{p_end}
{p 0 48}DayCasMeRaA00S00{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Daily Cases JOHN{p_end}
{p 0 48}TotCasMeRaA00S00{p_end}
{p 0 48}{space 15}{txt}{bind: long    }{bind:{txt}%10.0g    }{space 1}{bind:         }{bind:  }{res}{res}Total Cases JOHN{p_end}
{p 0 48}DayCasMeRaA00S00_CF2{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Daily Cases JOHN correction factor 2{p_end}
{p 0 48}DayCasMeRaA00S00_CF5{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Daily Cases JOHN correction factor 5{p_end}
{p 0 48}TotCasMeRaA00S00_CF2{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Total Cases JOHN correction factor 2{p_end}
{p 0 48}TotCasMeRaA00S00_CF5{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Total Cases JOHN correction factor 5{p_end}
{p 0 48}TotRecMeRaA00S00{p_end}
{p 0 48}{space 15}{txt}{bind: long    }{bind:{txt}%10.0g    }{space 1}{bind:         }{bind:  }{res}{res}Total RECovered JOHN{p_end}
{p 0 48}DayRecMeRaA00S00{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Daily RECovered JOHN{p_end}
{p 0 48}DayCfrMeRaA00S00{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Daily CFR JOHN{p_end}
{p 0 48}DayActMeRaA00S00{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Daily Active JOHN{p_end}
{p 0 48}DayDeaMeSmA00S00{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Daily deaths smooth A00 JOHN{p_end}
{p 0 48}DayCasMeSmA00S00{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Daily cases smooth A00 JOHN{p_end}
{p 0 48}DayDeaMeSmA00S00P1V{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Daily deaths smooth JOHN Peak 1 Value{p_end}
{p 0 48}DayDeaMeSmA00S00P1D{p_end}
{p 0 48}{space 15}{txt}{bind: int     }{bind:{txt}%td..     }{space 1}{bind:         }{bind:  }{res}{res}Daily deaths smooth JOHN Peak 1 Date{p_end}
{p 0 48}DayDeaMeSmA00S00P2V{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Daily deaths smooth JOHN Peak 2 Value{p_end}
{p 0 48}DayDeaMeSmA00S00P2D{p_end}
{p 0 48}{space 15}{txt}{bind: int     }{bind:{txt}%td..     }{space 1}{bind:         }{bind:  }{res}{res}Daily deaths smooth JOHN Peak 2 Date{p_end}
{p 0 48}DayDeaMeSmA00S00P3V{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Daily deaths smooth JOHN Peak 3 Value{p_end}
{p 0 48}DayDeaMeSmA00S00P3D{p_end}
{p 0 48}{space 15}{txt}{bind: int     }{bind:{txt}%td..     }{space 1}{bind:         }{bind:  }{res}{res}Daily deaths smooth JOHN Peak 3 Date{p_end}
{p 0 48}DayDeaMeSmA00S00P4V{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Daily deaths smooth JOHN Peak 4 Value{p_end}
{p 0 48}DayDeaMeSmA00S00P4D{p_end}
{p 0 48}{space 15}{txt}{bind: int     }{bind:{txt}%td..     }{space 1}{bind:         }{bind:  }{res}{res}Daily deaths smooth JOHN Peak 4 Date{p_end}
{p 0 48}DayDeaMeSmA00S00P5V{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Daily deaths smooth JOHN Peak 5 Value{p_end}
{p 0 48}DayDeaMeSmA00S00P5D{p_end}
{p 0 48}{space 15}{txt}{bind: int     }{bind:{txt}%td..     }{space 1}{bind:         }{bind:  }{res}{res}Daily deaths smooth JOHN Peak 5 Date{p_end}
{p 0 48}DayDeaMeSmA00S00PP1V{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Daily deaths smooth JOHN POST Peak 1 Value{p_end}
{p 0 48}DayDeaMeSmA00S00PP1D{p_end}
{p 0 48}{space 15}{txt}{bind: int     }{bind:{txt}%td..     }{space 1}{bind:         }{bind:  }{res}{res}Daily deaths smooth JOHN POST Peak 1 Date{p_end}
{p 0 48}DayDeaMeSmA00S00PP2V{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Daily deaths smooth JOHN POST Peak 2 Value{p_end}
{p 0 48}DayDeaMeSmA00S00PP2D{p_end}
{p 0 48}{space 15}{txt}{bind: int     }{bind:{txt}%td..     }{space 1}{bind:         }{bind:  }{res}{res}Daily deaths smooth JOHN POST Peak 2 Date{p_end}
{p 0 48}DayDeaMeSmA00S00PP3V{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Daily deaths smooth JOHN POST Peak 3 Value{p_end}
{p 0 48}DayDeaMeSmA00S00PP3D{p_end}
{p 0 48}{space 15}{txt}{bind: int     }{bind:{txt}%td..     }{space 1}{bind:         }{bind:  }{res}{res}Daily deaths smooth JOHN POST Peak 3 Date{p_end}
{p 0 48}DayDeaMeSmA00S00PP4V{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Daily deaths smooth JOHN POST Peak 4 Value{p_end}
{p 0 48}DayDeaMeSmA00S00PP4D{p_end}
{p 0 48}{space 15}{txt}{bind: int     }{bind:{txt}%td..     }{space 1}{bind:         }{bind:  }{res}{res}Daily deaths smooth JOHN POST Peak 4 Date{p_end}
{p 0 48}DayDeaMeSmA00S00PP5V{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Daily deaths smooth JOHN Peak 5 Value{p_end}
{p 0 48}DayDeaMeSmA00S00PP5D{p_end}
{p 0 48}{space 15}{txt}{bind: byte    }{bind:{txt}%td..     }{space 1}{bind:         }{bind:  }{res}{res}Daily deaths smooth JOHN Peak 5 Date{p_end}
{p 0 48}DayDeaMeSmA00S00PD{p_end}
{p 0 48}{space 15}{txt}{bind: int     }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Daily deaths smooth JOHN Peak Dates{p_end}
{p 0 48}DayDeaMeSmA00S00PV{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Daily deaths smooth JOHN Peak Values{p_end}
{p 0 48}DayDeaMeSmA00S00PPD{p_end}
{p 0 48}{space 15}{txt}{bind: int     }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Daily deaths smooth JOHN POST Peak Dates{p_end}
{p 0 48}DayDeaMeSmA00S00PPV{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Daily deaths smooth JOHN POST Peak Values{p_end}
{p 0 48}DayCasMeSmA00S00P1V{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Daily cases smooth JOHN Peak 1 Value{p_end}
{p 0 48}DayCasMeSmA00S00P1D{p_end}
{p 0 48}{space 15}{txt}{bind: int     }{bind:{txt}%td..     }{space 1}{bind:         }{bind:  }{res}{res}Daily cases smooth JOHN Peak 1 Date{p_end}
{p 0 48}DayCasMeSmA00S00P2V{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Daily cases smooth JOHN Peak 2 Value{p_end}
{p 0 48}DayCasMeSmA00S00P2D{p_end}
{p 0 48}{space 15}{txt}{bind: int     }{bind:{txt}%td..     }{space 1}{bind:         }{bind:  }{res}{res}Daily cases smooth JOHN Peak 2 Date{p_end}
{p 0 48}DayCasMeSmA00S00P3V{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Daily cases smooth JOHN Peak 3 Value{p_end}
{p 0 48}DayCasMeSmA00S00P3D{p_end}
{p 0 48}{space 15}{txt}{bind: int     }{bind:{txt}%td..     }{space 1}{bind:         }{bind:  }{res}{res}Daily cases smooth JOHN Peak 3 Date{p_end}
{p 0 48}DayCasMeSmA00S00P4V{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Daily cases smooth JOHN Peak 4 Value{p_end}
{p 0 48}DayCasMeSmA00S00P4D{p_end}
{p 0 48}{space 15}{txt}{bind: int     }{bind:{txt}%td..     }{space 1}{bind:         }{bind:  }{res}{res}Daily cases smooth JOHN Peak 4 Date{p_end}
{p 0 48}DayCasMeSmA00S00P5V{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Daily cases smooth JOHN Peak 5 Value{p_end}
{p 0 48}DayCasMeSmA00S00P5D{p_end}
{p 0 48}{space 15}{txt}{bind: int     }{bind:{txt}%td..     }{space 1}{bind:         }{bind:  }{res}{res}Daily cases smooth JOHN Peak 5 Date{p_end}
{p 0 48}DayCasMeSmA00S00PP1V{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Daily cases smooth JOHN POST Peak 1 Value{p_end}
{p 0 48}DayCasMeSmA00S00PP1D{p_end}
{p 0 48}{space 15}{txt}{bind: int     }{bind:{txt}%td..     }{space 1}{bind:         }{bind:  }{res}{res}Daily cases smooth JOHN POST Peak 1 Date{p_end}
{p 0 48}DayCasMeSmA00S00PP2V{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Daily cases smooth JOHN POST Peak 2 Value{p_end}
{p 0 48}DayCasMeSmA00S00PP2D{p_end}
{p 0 48}{space 15}{txt}{bind: int     }{bind:{txt}%td..     }{space 1}{bind:         }{bind:  }{res}{res}Daily cases smooth JOHN POST Peak 2 Date{p_end}
{p 0 48}DayCasMeSmA00S00PP3V{p_end}
{p 0 48}{space 15}{txt}{bind: int     }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Daily cases smooth JOHN POST Peak 3 Value{p_end}
{p 0 48}DayCasMeSmA00S00PP3D{p_end}
{p 0 48}{space 15}{txt}{bind: int     }{bind:{txt}%td..     }{space 1}{bind:         }{bind:  }{res}{res}Daily cases smooth JOHN POST Peak 3 Date{p_end}
{p 0 48}DayCasMeSmA00S00PP4V{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Daily cases smooth JOHN POST Peak 4 Value{p_end}
{p 0 48}DayCasMeSmA00S00PP4D{p_end}
{p 0 48}{space 15}{txt}{bind: int     }{bind:{txt}%td..     }{space 1}{bind:         }{bind:  }{res}{res}Daily cases smooth JOHN POST Peak 4 Date{p_end}
{p 0 48}DayCasMeSmA00S00PP5V{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Daily cases smooth JOHN Peak 5 Value{p_end}
{p 0 48}DayCasMeSmA00S00PP5D{p_end}
{p 0 48}{space 15}{txt}{bind: byte    }{bind:{txt}%td..     }{space 1}{bind:         }{bind:  }{res}{res}Daily cases smooth JOHN Peak 5 Date{p_end}
{p 0 48}DayCasMeSmA00S00PD{p_end}
{p 0 48}{space 15}{txt}{bind: int     }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Daily cases smooth JOHN Peak Dates{p_end}
{p 0 48}DayCasMeSmA00S00PV{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Daily cases smooth JOHN Peak Values{p_end}
{p 0 48}DayCasMeSmA00S00PPD{p_end}
{p 0 48}{space 15}{txt}{bind: int     }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Daily cases smooth JOHN POST Peak Dates{p_end}
{p 0 48}DayCasMeSmA00S00PPV{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Daily cases smooth JOHN POST Peak Values{p_end}
{p 0 48}today_numericdailydate{p_end}
{p 0 48}{space 15}{txt}{bind: int     }{bind:{txt}%td..     }{space 1}{bind:         }{bind:  }{res}{res}{p_end}
{p 0 48}monthspast01jan2020{p_end}
{p 0 48}{space 15}{txt}{bind: byte    }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}{p_end}
{p 0 48}monthspast01jan2021{p_end}
{p 0 48}{space 15}{txt}{bind: byte    }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}{p_end}
{p 0 48}monthspast01jan2022{p_end}
{p 0 48}{space 15}{txt}{bind: byte    }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}{p_end}
{p 0 48}TotDeaMeRaA01S00{p_end}
{p 0 48}{space 15}{txt}{bind: long    }{bind:{txt}%8.0g     }{space 1}{bind:         }{bind:  }{res}{res}Total Deaths Mean DELP S0{p_end}
{p 0 48}TotDeaLoRaA01S00{p_end}
{p 0 48}{space 15}{txt}{bind: long    }{bind:{txt}%8.0g     }{space 1}{bind:         }{bind:  }{res}{res}Total Deaths Lower DELP S0{p_end}
{p 0 48}TotDeaUpRaA01S00{p_end}
{p 0 48}{space 15}{txt}{bind: long    }{bind:{txt}%8.0g     }{space 1}{bind:         }{bind:  }{res}{res}Total Deaths Upper DELP S0{p_end}
{p 0 48}DayDeaMeRaA01S00{p_end}
{p 0 48}{space 15}{txt}{bind: int     }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Daily Deaths Mean DELP S0{p_end}
{p 0 48}DayDeaLoRaA01S00{p_end}
{p 0 48}{space 15}{txt}{bind: int     }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Daily Deaths Lower DELP S0{p_end}
{p 0 48}DayDeaUpRaA01S00{p_end}
{p 0 48}{space 15}{txt}{bind: int     }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Daily Deaths Upper DELP S0{p_end}
{p 0 48}TotCasMeRaA01S00{p_end}
{p 0 48}{space 15}{txt}{bind: long    }{bind:{txt}%12.0g    }{space 1}{bind:         }{bind:  }{res}{res}Total Cases Mean DELP S0{p_end}
{p 0 48}TotCasLoRaA01S00{p_end}
{p 0 48}{space 15}{txt}{bind: long    }{bind:{txt}%12.0g    }{space 1}{bind:         }{bind:  }{res}{res}Total Cases Lower DELP S0{p_end}
{p 0 48}TotCasUpRaA01S00{p_end}
{p 0 48}{space 15}{txt}{bind: long    }{bind:{txt}%12.0g    }{space 1}{bind:         }{bind:  }{res}{res}Total Cases Upper DELP S0{p_end}
{p 0 48}DayCasMeRaA01S00{p_end}
{p 0 48}{space 15}{txt}{bind: int     }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Daily Cases Mean DELP S0{p_end}
{p 0 48}DayCasLoRaA01S00{p_end}
{p 0 48}{space 15}{txt}{bind: int     }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Daily Cases Lower DELP S0{p_end}
{p 0 48}DayCasUpRaA01S00{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Daily Cases Upper DELP S0{p_end}
{p 0 48}DayActMeRaA01S00{p_end}
{p 0 48}{space 15}{txt}{bind: long    }{bind:{txt}%12.0g    }{space 1}{bind:         }{bind:  }{res}{res}Daily Cases Active Mean DELP S0{p_end}
{p 0 48}DayHosMeRaA01S00{p_end}
{p 0 48}{space 15}{txt}{bind: int     }{bind:{txt}%8.0g     }{space 1}{bind:         }{bind:  }{res}{res}Daily Cases Active Hospitalized Mean DELP S0{p_end}
{p 0 48}DayVenMeRaA01S00{p_end}
{p 0 48}{space 15}{txt}{bind: int     }{bind:{txt}%8.0g     }{space 1}{bind:         }{bind:  }{res}{res}Daily Cases Active Ventilated Mean DELP S0{p_end}
{p 0 48}TotHosMeRaA01S00{p_end}
{p 0 48}{space 15}{txt}{bind: long    }{bind:{txt}%8.0g     }{space 1}{bind:         }{bind:  }{res}{res}Total Cases Active Mean DELP S0{p_end}
{p 0 48}DayCfrMeRaA01S00{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Daily CFR Mean DELP S0 V4{p_end}
{p 0 48}DayCfrLoRaA01S00{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Daily CFR Lower DELP S0 V4{p_end}
{p 0 48}DayCfrUpRaA01S00{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Daily CFR Upper DELP S0 V4{p_end}
{p 0 48}DayDeMMeRaA01S00{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Daily deaths mean DELP DayDeM{p_end}
{p 0 48}DayCaMMeRaA01S00{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Daily cases mean DELP DayCaM{p_end}
{p 0 48}DayCbDMeRaA01S00{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Daily cases mean div by daily deaths mean DELP DayCbD{p_end}
{p 0 48}DayDMuMeRaA01S00{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Daily deaths scaled (times means of cases by deaths) only for visualization DELP{p_end}
{p 0 48}DayDeaMeSmA01S00{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Daily deaths smooth mean DELP{p_end}
{p 0 48}DayCasMeSmA01S00{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Daily cases smooth mean DELP{p_end}
{p 0 48}DayDeaLoSmA01S00{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Daily deaths smooth lower DELP{p_end}
{p 0 48}DayCasLoSmA01S00{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Daily cases smooth lower DELP{p_end}
{p 0 48}DayDeaUpSmA01S00{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Daily deaths smooth upper DELP{p_end}
{p 0 48}DayCasUpSmA01S00{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Daily cases smooth upper DELP{p_end}
{p 0 48}{bind:epoch_DELP     }{txt}{bind: int     }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}DELP Forecast start date{p_end}
{p 0 48}DayDeaFOREA01S00{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Daily Forecasted Deaths Mean smooth DELP{p_end}
{p 0 48}DayCasFOREA01S00{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Daily Forecasted Cases Mean smooth DELP{p_end}
{p 0 48}DayINFMeSmA02S01{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Daily infections Mean smoothed IHME S1{p_end}
{p 0 48}DayINFUpSmA02S01{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Daily infections Upper smoothed IHME S1{p_end}
{p 0 48}DayINFLoSmA02S01{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Daily infections Lower smoothed IHME S1{p_end}
{p 0 48}TotDeXMeSmA02S01{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Total Excess Deaths Mean smoothed IHME S1{p_end}
{p 0 48}TotDeXLoSmA02S01{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Total Excess Deaths Lower smoothed IHME S1{p_end}
{p 0 48}TotDeXUpSmA02S01{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Total Excess Deaths Upper smoothed IHME S1{p_end}
{p 0 48}TotINFMeSmA02S01{p_end}
{p 0 48}{space 15}{txt}{bind: double  }{bind:{txt}%10.0g    }{space 1}{bind:         }{bind:  }{res}{res}Total infections Mean smoothed IHME S1{p_end}
{p 0 48}TotINFLoSmA02S01{p_end}
{p 0 48}{space 15}{txt}{bind: double  }{bind:{txt}%10.0g    }{space 1}{bind:         }{bind:  }{res}{res}Total infections Lower smoothed IHME S1{p_end}
{p 0 48}TotINFUpSmA02S01{p_end}
{p 0 48}{space 15}{txt}{bind: double  }{bind:{txt}%10.0g    }{space 1}{bind:         }{bind:  }{res}{res}Total infections Upper smoothed IHME S1{p_end}
{p 0 48}DayDeXMeSmA02S01{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Daily Excess Deaths Mean smoothed IHME S1{p_end}
{p 0 48}DayDeXLoSmA02S01{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Daily Excess Deaths Lower smoothed IHME S1{p_end}
{p 0 48}DayDeXUpSmA02S01{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Daily Excess Deaths Upper smoothed IHME S1{p_end}
{p 0 48}DayDeaMeSmA02S01{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Daily Reported Deaths Mean smoothed IHME S1{p_end}
{p 0 48}DayDeaLoSmA02S01{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Daily Reported Deaths Lower smoothed IHME S1{p_end}
{p 0 48}DayDeaUpSmA02S01{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Daily Reported Deaths Upper smoothed IHME S1{p_end}
{p 0 48}TotDeaMeSmA02S01{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Total Reported Deaths Mean smoothed IHME S1{p_end}
{p 0 48}TotDeaLoSmA02S01{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Total Reported Deaths Lower smoothed IHME S1{p_end}
{p 0 48}TotDeaUpSmA02S01{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Total Reported Deaths Upper smoothed IHME S1{p_end}
{p 0 48}{bind:cases_mean     }{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}{p_end}
{p 0 48}{bind:cases_lower    }{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}{p_end}
{p 0 48}{bind:cases_upper    }{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}{p_end}
{p 0 48}reff_mean_A02S01{p_end}
{p 0 48}{space 15}{txt}{bind: double  }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}IHME R effective (mean estimate) S1{p_end}
{p 0 48}reff_lower_A02S01{p_end}
{p 0 48}{space 15}{txt}{bind: double  }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}IHME R effective (lower 95% confidence interval) S1{p_end}
{p 0 48}reff_upper_A02S01{p_end}
{p 0 48}{space 15}{txt}{bind: double  }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}IHME R effective (upper 95% confidence interval) S1{p_end}
{p 0 48}inf_cuml_mean_vax{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}{p_end}
{p 0 48}inf_cuml_lower_vax{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}{p_end}
{p 0 48}inf_cuml_upper_vax{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}{p_end}
{p 0 48}inf_cuml_mean_unvax{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}{p_end}
{p 0 48}inf_cuml_lower_unvax{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}{p_end}
{p 0 48}inf_cuml_upper_unvax{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}{p_end}
{p 0 48}{bind:inf_mean_vax   }{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}{p_end}
{p 0 48}{bind:inf_lower_vax  }{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}{p_end}
{p 0 48}{bind:inf_upper_vax  }{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}{p_end}
{p 0 48}{bind:inf_mean_unvax }{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}{p_end}
{p 0 48}{bind:inf_lower_unvax}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}{p_end}
{p 0 48}{bind:inf_upper_unvax}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}{p_end}
{p 0 48}cumulative_deaths_A02S01{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}IHME Cumulative deaths (raw data with excess mortality scalar applied) S1{p_end}
{p 0 48}daily_deaths_A02S01{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}IHME Daily deaths (raw data with excess mortality scalar applied) S1{p_end}
{p 0 48}cumulative_cases_A02S01{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}IHME Cumulative cases (raw data) S1{p_end}
{p 0 48}cumulative_hosp_A02S01{p_end}
{p 0 48}{space 15}{txt}{bind: byte    }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}IHME Cumulative hospitalizations (raw data) S1{p_end}
{p 0 48}cumul_deaths_unscaled_A02S01{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}IHME umulative deaths (raw data without excess mortality scalar applied) S1{p_end}
{p 0 48}dai_dea_unscaled_A02S01{p_end}
{p 0 48}{space 15}{txt}{bind: int     }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}IHME Daily deaths (raw data without excess mortality scalar applied) S1{p_end}
{p 0 48}{bind:daily_cases    }{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}{p_end}
{p 0 48}{bind:population     }{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}IHME Population size{p_end}
{p 0 48}mobility_mean_A02S01{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}IHME Percent change in mobility from baseline (mean)  S1{p_end}
{p 0 48}{bind:mobility_obs   }{txt}{bind: byte    }{bind:{txt}%8.0g     }{space 1}{bind:         }{bind:  }{res}{res}IHME Indicator for whether mobility estimate comes from observed data (1) or mod{p_end}
{p 0 48}{bind:testing_mean   }{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}IHME Tests per 100,000 (mean estimate){p_end}
{p 0 48}{bind:testing_lower  }{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}IHME Tests per 100,000 (lower 95% confidence interval){p_end}
{p 0 48}{bind:testing_upper  }{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}IHME Tests per 100,000 (upper 95% confidence interval){p_end}
{p 0 48}{bind:testing_obs    }{txt}{bind: byte    }{bind:{txt}%8.0g     }{space 1}{bind:         }{bind:  }{res}{res}IHME Indicator for whether testing estimate comes from observed data (1) or mode{p_end}
{p 0 48}{bind:pneumonia_mean }{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}IHME Ratio of pneumonia deaths in a given week to the average weekly pneumonia d{p_end}
{p 0 48}{bind:pneumonia_obs  }{txt}{bind: byte    }{bind:{txt}%8.0g     }{space 1}{bind:         }{bind:  }{res}{res}IHME Indicator for whether pneumonia estimate comes from observed data (1) or mo{p_end}
{p 0 48}mask_use_mean_A02S01{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}IHME Percent of population reporting always wearing a mask when leaving home  S1{p_end}
{p 0 48}{bind:mask_use_obs   }{txt}{bind: byte    }{bind:{txt}%8.0g     }{space 1}{bind:         }{bind:  }{res}{res}IHME Indicator for whether mask estimate comes from observed data (1) or modelle{p_end}
{p 0 48}cumulative_all_vaccinated{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}IHME Initially vaccinated (one dose of two doses){p_end}
{p 0 48}cumulative_all_fully_vaccinated{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}IHME Fully vaccinated (one of one and†two†of two doses){p_end}
{p 0 48}cumulative_all_effectively_vacci{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}IHME Effectively vaccinated (one and two dose with efficacy){p_end}
{p 0 48}DayBedMeSmA02S01{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}IHME Daily COVID-19 hospital beds needed (mean estimate) S1{p_end}
{p 0 48}DayBedLoSmA02S01{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}IHME Daily COVID-19 hospital beds needed (upper 95% confidence interval) S1{p_end}
{p 0 48}DayBedUpSmA02S01{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}IHME Daily COVID-19 hospital beds needed (lower 95% confidence interval) S1{p_end}
{p 0 48}DayIcuMeSmA02S01{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}IHME Daily COVID-19 ICU beds needed (mean estimate) S1{p_end}
{p 0 48}DayIcuUpSmA02S01{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}IHME Daily COVID-19 ICU beds needed (lower 95% confidence interval) S1{p_end}
{p 0 48}DayIcuLoSmA02S01{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}IHME Daily COVID-19 ICU beds needed (upper 95% confidence interval) S1{p_end}
{p 0 48}DayAdmMeSmA02S01{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}IHME Daily COVID-19 hospital admissions (mean estimate) S1{p_end}
{p 0 48}DayAdmUpSmA02S01{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}IHME Daily COVID-19 hospital admissions (mean estimate) S1{p_end}
{p 0 48}DayAdmLoSmA02S01{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}IHME Daily COVID-19 hospital admissions (mean estimate) S1{p_end}
{p 0 48}{bind:admis_mean_vax }{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}{p_end}
{p 0 48}{bind:admis_upper_vax}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}{p_end}
{p 0 48}{bind:admis_lower_vax}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}{p_end}
{p 0 48}admis_mean_unvax{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}{p_end}
{p 0 48}admis_upper_unvax{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}{p_end}
{p 0 48}admis_lower_unvax{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}{p_end}
{p 0 48}{bind:DayBEDMeSmA02  }{txt}{bind: long    }{bind:{txt}%12.0g    }{space 1}{bind:         }{bind:  }{res}{res}IHME Total number of beds that exist at a location{p_end}
{p 0 48}{bind:DayICUMeSmA02  }{txt}{bind: int     }{bind:{txt}%12.0g    }{space 1}{bind:         }{bind:  }{res}{res}IHME Total number of ICU beds that exist at a location{p_end}
{p 0 48}infection_fatality_A02S01{p_end}
{p 0 48}{space 15}{txt}{bind: double  }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}IHME Infection fatality ratio S1{p_end}
{p 0 48}infection_detection_A02S01{p_end}
{p 0 48}{space 15}{txt}{bind: double  }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}IHME Infection detection ratio S1{p_end}
{p 0 48}infection_hospitalization_A02S01{p_end}
{p 0 48}{space 15}{txt}{bind: double  }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}IHME Infection hospitalization ratio S1{p_end}
{p 0 48}DayINFMeSmA02S02{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Daily infections Mean smoothed IHME S2{p_end}
{p 0 48}DayINFUpSmA02S02{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Daily infections Upper smoothed IHME S2{p_end}
{p 0 48}DayINFLoSmA02S02{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Daily infections Lower smoothed IHME S2{p_end}
{p 0 48}TotDeXMeSmA02S02{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Total Excess Deaths Mean smoothed IHME S2{p_end}
{p 0 48}TotDeXLoSmA02S02{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Total Excess Deaths Lower smoothed IHME S2{p_end}
{p 0 48}TotDeXUpSmA02S02{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Total Excess Deaths Upper smoothed IHME S2{p_end}
{p 0 48}TotINFMeSmA02S02{p_end}
{p 0 48}{space 15}{txt}{bind: double  }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Total infections Mean smoothed IHME S2{p_end}
{p 0 48}TotINFLoSmA02S02{p_end}
{p 0 48}{space 15}{txt}{bind: double  }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Total infections Lower smoothed IHME S2{p_end}
{p 0 48}TotINFUpSmA02S02{p_end}
{p 0 48}{space 15}{txt}{bind: double  }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Total infections Upper smoothed IHME S2{p_end}
{p 0 48}DayDeXMeSmA02S02{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Daily Excess Deaths Mean smoothed IHME S2{p_end}
{p 0 48}DayDeXLoSmA02S02{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Daily Excess Deaths Lower smoothed IHME S2{p_end}
{p 0 48}DayDeXUpSmA02S02{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Daily Excess Deaths Upper smoothed IHME S2{p_end}
{p 0 48}DayDeaMeSmA02S02{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Daily Reported Deaths Mean smoothed IHME S2{p_end}
{p 0 48}DayDeaLoSmA02S02{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Daily Reported Deaths Lower smoothed IHME S2{p_end}
{p 0 48}DayDeaUpSmA02S02{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Daily Reported Deaths Upper smoothed IHME S2{p_end}
{p 0 48}TotDeaMeSmA02S02{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Total Reported Deaths Mean smoothed IHME S2{p_end}
{p 0 48}TotDeaLoSmA02S02{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Total Reported Deaths Lower smoothed IHME S2{p_end}
{p 0 48}TotDeaUpSmA02S02{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Total Reported Deaths Upper smoothed IHME S2{p_end}
{p 0 48}reff_mean_A02S02{p_end}
{p 0 48}{space 15}{txt}{bind: double  }{bind:{txt}%10.0g    }{space 1}{bind:         }{bind:  }{res}{res}IHME R effective (mean estimate) S2{p_end}
{p 0 48}reff_lower_A02S02{p_end}
{p 0 48}{space 15}{txt}{bind: double  }{bind:{txt}%10.0g    }{space 1}{bind:         }{bind:  }{res}{res}IHME R effective (lower 95% confidence interval) S2{p_end}
{p 0 48}reff_upper_A02S02{p_end}
{p 0 48}{space 15}{txt}{bind: double  }{bind:{txt}%10.0g    }{space 1}{bind:         }{bind:  }{res}{res}IHME R effective (upper 95% confidence interval) S2{p_end}
{p 0 48}cumulative_deaths_A02S02{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}IHME Cumulative deaths (raw data with excess mortality scalar applied) S2{p_end}
{p 0 48}daily_deaths_A02S02{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}IHME Daily deaths (raw data with excess mortality scalar applied) S2{p_end}
{p 0 48}cumulative_cases_A02S02{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}IHME Cumulative cases (raw data) S2{p_end}
{p 0 48}cumulative_hosp_A02S02{p_end}
{p 0 48}{space 15}{txt}{bind: byte    }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}IHME Cumulative hospitalizations (raw data) S2{p_end}
{p 0 48}cumul_deaths_unscaled_A02S02{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}IHME umulative deaths (raw data without excess mortality scalar applied) S2{p_end}
{p 0 48}dai_dea_unscaled_A02S02{p_end}
{p 0 48}{space 15}{txt}{bind: int     }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}IHME Daily deaths (raw data without excess mortality scalar applied) S2{p_end}
{p 0 48}mobility_mean_A02S02{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}IHME Percent change in mobility from baseline (mean)  S2{p_end}
{p 0 48}mask_use_mean_A02S02{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}IHME Percent of population reporting always wearing a mask when leaving home  S2{p_end}
{p 0 48}DayBedMeSmA02S02{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}IHME Daily COVID-19 hospital beds needed (mean estimate) S2{p_end}
{p 0 48}DayBedLoSmA02S02{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}IHME Daily COVID-19 hospital beds needed (upper 95% confidence interval) S2{p_end}
{p 0 48}DayBedUpSmA02S02{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}IHME Daily COVID-19 hospital beds needed (lower 95% confidence interval) S2{p_end}
{p 0 48}DayIcuMeSmA02S02{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}IHME Daily COVID-19 ICU beds needed (mean estimate) S2{p_end}
{p 0 48}DayIcuUpSmA02S02{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}IHME Daily COVID-19 ICU beds needed (lower 95% confidence interval) S2{p_end}
{p 0 48}DayIcuLoSmA02S02{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}IHME Daily COVID-19 ICU beds needed (upper 95% confidence interval) S2{p_end}
{p 0 48}DayAdmMeSmA02S02{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}IHME Daily COVID-19 hospital admissions (mean estimate) S2{p_end}
{p 0 48}DayAdmUpSmA02S02{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}IHME Daily COVID-19 hospital admissions (mean estimate) S2{p_end}
{p 0 48}DayAdmLoSmA02S02{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}IHME Daily COVID-19 hospital admissions (mean estimate) S2{p_end}
{p 0 48}infection_fatality_A02S02{p_end}
{p 0 48}{space 15}{txt}{bind: double  }{bind:{txt}%10.0g    }{space 1}{bind:         }{bind:  }{res}{res}IHME Infection fatality ratio S2{p_end}
{p 0 48}infection_detection_A02S02{p_end}
{p 0 48}{space 15}{txt}{bind: double  }{bind:{txt}%10.0g    }{space 1}{bind:         }{bind:  }{res}{res}IHME Infection detection ratio S2{p_end}
{p 0 48}infection_hospitalization_A02S02{p_end}
{p 0 48}{space 15}{txt}{bind: double  }{bind:{txt}%10.0g    }{space 1}{bind:         }{bind:  }{res}{res}IHME Infection hospitalization ratio S2{p_end}
{p 0 48}DayINFMeSmA02S03{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Daily infections Mean smoothed IHME S3{p_end}
{p 0 48}DayINFUpSmA02S03{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Daily infections Upper smoothed IHME S3{p_end}
{p 0 48}DayINFLoSmA02S03{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Daily infections Lower smoothed IHME S3{p_end}
{p 0 48}TotDeXMeSmA02S03{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Total Excess Deaths Mean smoothed IHME S3{p_end}
{p 0 48}TotDeXLoSmA02S03{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Total Excess Deaths Lower smoothed IHME S3{p_end}
{p 0 48}TotDeXUpSmA02S03{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Total Excess Deaths Upper smoothed IHME S3{p_end}
{p 0 48}TotINFMeSmA02S03{p_end}
{p 0 48}{space 15}{txt}{bind: double  }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Total infections Mean smoothed IHME S3{p_end}
{p 0 48}TotINFLoSmA02S03{p_end}
{p 0 48}{space 15}{txt}{bind: double  }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Total infections Lower smoothed IHME S3{p_end}
{p 0 48}TotINFUpSmA02S03{p_end}
{p 0 48}{space 15}{txt}{bind: double  }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Total infections Upper smoothed IHME S3{p_end}
{p 0 48}DayDeXMeSmA02S03{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Daily Excess Deaths Mean smoothed IHME S3{p_end}
{p 0 48}DayDeXLoSmA02S03{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Daily Excess Deaths Lower smoothed IHME S3{p_end}
{p 0 48}DayDeXUpSmA02S03{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Daily Excess Deaths Upper smoothed IHME S3{p_end}
{p 0 48}DayDeaMeSmA02S03{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Daily Reported Deaths Mean smoothed IHME S3{p_end}
{p 0 48}DayDeaLoSmA02S03{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Daily Reported Deaths Lower smoothed IHME S3{p_end}
{p 0 48}DayDeaUpSmA02S03{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Daily Reported Deaths Upper smoothed IHME S3{p_end}
{p 0 48}TotDeaMeSmA02S03{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Total Reported Deaths Mean smoothed IHME S3{p_end}
{p 0 48}TotDeaLoSmA02S03{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Total Reported Deaths Lower smoothed IHME S3{p_end}
{p 0 48}TotDeaUpSmA02S03{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Total Reported Deaths Upper smoothed IHME S3{p_end}
{p 0 48}reff_mean_A02S03{p_end}
{p 0 48}{space 15}{txt}{bind: double  }{bind:{txt}%10.0g    }{space 1}{bind:         }{bind:  }{res}{res}IHME R effective (mean estimate) S3{p_end}
{p 0 48}reff_lower_A02S03{p_end}
{p 0 48}{space 15}{txt}{bind: double  }{bind:{txt}%10.0g    }{space 1}{bind:         }{bind:  }{res}{res}IHME R effective (lower 95% confidence interval) S3{p_end}
{p 0 48}reff_upper_A02S03{p_end}
{p 0 48}{space 15}{txt}{bind: double  }{bind:{txt}%10.0g    }{space 1}{bind:         }{bind:  }{res}{res}IHME R effective (upper 95% confidence interval) S3{p_end}
{p 0 48}cumulative_deaths_A02S03{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}IHME Cumulative deaths (raw data with excess mortality scalar applied) S3{p_end}
{p 0 48}daily_deaths_A02S03{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}IHME Daily deaths (raw data with excess mortality scalar applied) S3{p_end}
{p 0 48}cumulative_cases_A02S03{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}IHME Cumulative cases (raw data) S3{p_end}
{p 0 48}cumulative_hosp_A02S03{p_end}
{p 0 48}{space 15}{txt}{bind: byte    }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}IHME Cumulative hospitalizations (raw data) S3{p_end}
{p 0 48}cumul_deaths_unscaled_A02S03{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}IHME umulative deaths (raw data without excess mortality scalar applied) S3{p_end}
{p 0 48}dai_dea_unscaled_A02S03{p_end}
{p 0 48}{space 15}{txt}{bind: int     }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}IHME Daily deaths (raw data without excess mortality scalar applied) S3{p_end}
{p 0 48}mobility_mean_A02S03{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}IHME Percent change in mobility from baseline (mean)  S3{p_end}
{p 0 48}mask_use_mean_A02S03{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}IHME Percent of population reporting always wearing a mask when leaving home  S3{p_end}
{p 0 48}DayBedMeSmA02S03{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}IHME Daily COVID-19 hospital beds needed (mean estimate) S3{p_end}
{p 0 48}DayBedLoSmA02S03{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}IHME Daily COVID-19 hospital beds needed (upper 95% confidence interval) S3{p_end}
{p 0 48}DayBedUpSmA02S03{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}IHME Daily COVID-19 hospital beds needed (lower 95% confidence interval) S3{p_end}
{p 0 48}DayIcuMeSmA02S03{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}IHME Daily COVID-19 ICU beds needed (mean estimate) S3{p_end}
{p 0 48}DayIcuUpSmA02S03{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}IHME Daily COVID-19 ICU beds needed (lower 95% confidence interval) S3{p_end}
{p 0 48}DayIcuLoSmA02S03{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}IHME Daily COVID-19 ICU beds needed (upper 95% confidence interval) S3{p_end}
{p 0 48}DayAdmMeSmA02S03{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}IHME Daily COVID-19 hospital admissions (mean estimate) S3{p_end}
{p 0 48}DayAdmUpSmA02S03{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}IHME Daily COVID-19 hospital admissions (mean estimate) S3{p_end}
{p 0 48}DayAdmLoSmA02S03{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}IHME Daily COVID-19 hospital admissions (mean estimate) S3{p_end}
{p 0 48}infection_fatality_A02S03{p_end}
{p 0 48}{space 15}{txt}{bind: double  }{bind:{txt}%10.0g    }{space 1}{bind:         }{bind:  }{res}{res}IHME Infection fatality ratio S3{p_end}
{p 0 48}infection_detection_A02S03{p_end}
{p 0 48}{space 15}{txt}{bind: double  }{bind:{txt}%10.0g    }{space 1}{bind:         }{bind:  }{res}{res}IHME Infection detection ratio S3{p_end}
{p 0 48}infection_hospitalization_A02S03{p_end}
{p 0 48}{space 15}{txt}{bind: double  }{bind:{txt}%10.0g    }{space 1}{bind:         }{bind:  }{res}{res}IHME Infection hospitalization ratio S3{p_end}
{p 0 48}DayDeMMeSmA02S01{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Daily deaths mean IHME DayDeM{p_end}
{p 0 48}DayCaMMeSmA02S01{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Daily infections mean IHME DayCaM{p_end}
{p 0 48}DayCbDMeSmA02S01{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Daily infections mean div by daily deaths mean IHME DayCbD{p_end}
{p 0 48}DayDMuMeSmA02S01{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Daily deaths scaled (times means of infections by deaths) IHME{p_end}
{p 0 48}cumulative_all_vaccin_pct{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}% population IHME Initially vaccinated (one dose of two doses){p_end}
{p 0 48}cumul_all_effect_vacci_pct{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}% population IHME Effectively vaccinated (one and two dose with efficacy){p_end}
{p 0 48}cumul_all_fully_vacci_pct{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}% population IHME Fully vaccinated (one of one and two of two doses){p_end}
{p 0 48}daily_all_vaccinated{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Daily population IHME Initially vaccinated (one dose of two doses){p_end}
{p 0 48}daily_all_effectively_vacci{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Daily population IHME Effectively vaccinated (one and two dose with efficacy){p_end}
{p 0 48}daily_all_fully_vaccinated{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Daily population IHME Fully vaccinated (one of one and two of two doses){p_end}
{p 0 48}daily_all_vaccin_pct{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}% Daily population IHME Initially vaccinated (one dose of two doses){p_end}
{p 0 48}daily_all_effect_vacci_pct{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}% Daily population IHME Effectively vaccinated (one and two dose with efficacy){p_end}
{p 0 48}daily_all_fully_vacci_pct{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}% Daily population IHME Fully vaccinated (one of one and two of two doses){p_end}
{p 0 48}DayINFDetMeSmA02S01{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Daily Detected Infections Mean smoothed IHME S1{p_end}
{p 0 48}DayINFDetLoSmA02S01{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Daily Detected Infections Lower smoothed IHME S1{p_end}
{p 0 48}DayINFDetUpSmA02S01{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Daily Detected Infections Upper smoothed IHME S1{p_end}
{p 0 48}DayINFHosMeSmA02S01{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Daily Hospitalized Infections Mean smoothed IHME S1{p_end}
{p 0 48}DayINFHosLoSmA02S01{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Daily Hospitalized Infections Lower smoothed IHME S1{p_end}
{p 0 48}DayINFHosUpSmA02S01{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Daily Hospitalized Infections Upper smoothed IHME S1{p_end}
{p 0 48}DayINFFatMeSmA02S01{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Daily Fatal Infections Mean smoothed IHME S1{p_end}
{p 0 48}DayINFFatLoSmA02S01{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Daily Fatal Infections Lower smoothed IHME S1{p_end}
{p 0 48}DayINFFatUpSmA02S01{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Daily Fatal Infections Upper smoothed IHME S1{p_end}
{p 0 48}{bind:epoch_IHME     }{txt}{bind: int     }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}IHME Forecast start date{p_end}
{p 0 48}DayDeaFOREA02S01{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Daily Forecasted Deaths Mean smoothed IHME S1{p_end}
{p 0 48}DayINFFOREA02S01{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Daily Forecasted infections Mean smoothed IHME S1{p_end}
{p 0 48}TotDeaMeRaA03S01{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Total Deaths Mean A03 S01 {p_end}
{p 0 48}TotDeaLoRaA03S01{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Total Deaths Lower A03 S01 {p_end}
{p 0 48}TotDeaUpRaA03S01{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Total Deaths Upper A03 S01 {p_end}
{p 0 48}TotDeaMeRaA03S02{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Total Deaths Mean A03 S02 {p_end}
{p 0 48}TotDeaLoRaA03S02{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Total Deaths Lower A03 S02 {p_end}
{p 0 48}TotDeaUpRaA03S02{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Total Deaths Upper A03 S02 {p_end}
{p 0 48}TotDeaMeRaA03S03{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Total Deaths Mean A03 S03 {p_end}
{p 0 48}TotDeaLoRaA03S03{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Total Deaths Lower A03 S03 {p_end}
{p 0 48}TotDeaUpRaA03S03{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Total Deaths Upper A03 S03 {p_end}
{p 0 48}TotDeaMeRaA03S04{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Total Deaths Mean A03 S04 {p_end}
{p 0 48}TotDeaLoRaA03S04{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Total Deaths Lower A03 S04 {p_end}
{p 0 48}TotDeaUpRaA03S04{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Total Deaths Upper A03 S04 {p_end}
{p 0 48}TotDeaMeRaA03S05{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Total Deaths Mean A03 S05 {p_end}
{p 0 48}TotDeaLoRaA03S05{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Total Deaths Lower A03 S05 {p_end}
{p 0 48}TotDeaUpRaA03S05{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Total Deaths Upper A03 S05 {p_end}
{p 0 48}TotDeaMeRaA03S06{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Total Deaths Mean A03 S06 {p_end}
{p 0 48}TotDeaLoRaA03S06{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Total Deaths Lower A03 S06 {p_end}
{p 0 48}TotDeaUpRaA03S06{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Total Deaths Upper A03 S06 {p_end}
{p 0 48}DayDeaMeRaA03S01{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Daily Deaths Mean A03 S01 {p_end}
{p 0 48}DayDeaLoRaA03S01{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Daily Deaths Lower A03 S01 {p_end}
{p 0 48}DayDeaUpRaA03S01{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Daily Deaths Upper A03 S01 {p_end}
{p 0 48}DayDeaMeRaA03S02{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Daily Deaths Mean A03 S02 {p_end}
{p 0 48}DayDeaLoRaA03S02{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Daily Deaths Lower A03 S02 {p_end}
{p 0 48}DayDeaUpRaA03S02{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Daily Deaths Upper A03 S02 {p_end}
{p 0 48}DayDeaMeRaA03S03{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Daily Deaths Mean A03 S03 {p_end}
{p 0 48}DayDeaLoRaA03S03{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Daily Deaths Lower A03 S03 {p_end}
{p 0 48}DayDeaUpRaA03S03{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Daily Deaths Upper A03 S03 {p_end}
{p 0 48}DayDeaMeRaA03S04{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Daily Deaths Mean A03 S04 {p_end}
{p 0 48}DayDeaLoRaA03S04{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Daily Deaths Lower A03 S04 {p_end}
{p 0 48}DayDeaUpRaA03S04{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Daily Deaths Upper A03 S04 {p_end}
{p 0 48}DayDeaMeRaA03S05{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Daily Deaths Mean A03 S05 {p_end}
{p 0 48}DayDeaLoRaA03S05{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Daily Deaths Lower A03 S05 {p_end}
{p 0 48}DayDeaUpRaA03S05{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Daily Deaths Upper A03 S05 {p_end}
{p 0 48}DayDeaMeRaA03S06{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Daily Deaths Mean A03 S06 {p_end}
{p 0 48}DayDeaLoRaA03S06{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Daily Deaths Lower A03 S06 {p_end}
{p 0 48}DayDeaUpRaA03S06{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Daily Deaths Upper A03 S06 {p_end}
{p 0 48}TotINFMeRaA03S01{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Total infections Mean A03 S01 {p_end}
{p 0 48}TotINFLoRaA03S01{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Total infections Lower A03 S01 {p_end}
{p 0 48}TotINFUpRaA03S01{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Total infections Upper A03 S01 {p_end}
{p 0 48}TotINFMeRaA03S02{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Total infections Mean A03 S02 {p_end}
{p 0 48}TotINFLoRaA03S02{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Total infections Lower A03 S02 {p_end}
{p 0 48}TotINFUpRaA03S02{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Total infections Upper A03 S02 {p_end}
{p 0 48}TotINFMeRaA03S03{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Total infections Mean A03 S03 {p_end}
{p 0 48}TotINFLoRaA03S03{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Total infections Lower A03 S03 {p_end}
{p 0 48}TotINFUpRaA03S03{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Total infections Upper A03 S03 {p_end}
{p 0 48}TotINFMeRaA03S04{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Total infections Mean A03 S04 {p_end}
{p 0 48}TotINFLoRaA03S04{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Total infections Lower A03 S04 {p_end}
{p 0 48}TotINFUpRaA03S04{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Total infections Upper A03 S04 {p_end}
{p 0 48}TotINFMeRaA03S05{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Total infections Mean A03 S05 {p_end}
{p 0 48}TotINFLoRaA03S05{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Total infections Lower A03 S05 {p_end}
{p 0 48}TotINFUpRaA03S05{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Total infections Upper A03 S05 {p_end}
{p 0 48}TotINFMeRaA03S06{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Total infections Mean A03 S06 {p_end}
{p 0 48}TotINFLoRaA03S06{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Total infections Lower A03 S06 {p_end}
{p 0 48}TotINFUpRaA03S06{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Total infections Upper A03 S06 {p_end}
{p 0 48}DayINFMeRaA03S01{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Daily infections Mean A03 S01 {p_end}
{p 0 48}DayINFLoRaA03S01{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Daily infections Lower A03 S01 {p_end}
{p 0 48}DayINFUpRaA03S01{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Daily infections Upper A03 S01 {p_end}
{p 0 48}DayINFMeRaA03S02{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Daily infections Mean A03 S02 {p_end}
{p 0 48}DayINFLoRaA03S02{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Daily infections Lower A03 S02 {p_end}
{p 0 48}DayINFUpRaA03S02{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Daily infections Upper A03 S02 {p_end}
{p 0 48}DayINFMeRaA03S03{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Daily infections Mean A03 S03 {p_end}
{p 0 48}DayINFLoRaA03S03{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Daily infections Lower A03 S03 {p_end}
{p 0 48}DayINFUpRaA03S03{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Daily infections Upper A03 S03 {p_end}
{p 0 48}DayINFMeRaA03S04{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Daily infections Mean A03 S04 {p_end}
{p 0 48}DayINFLoRaA03S04{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Daily infections Lower A03 S04 {p_end}
{p 0 48}DayINFUpRaA03S04{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Daily infections Upper A03 S04 {p_end}
{p 0 48}DayINFMeRaA03S05{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Daily infections Mean A03 S05 {p_end}
{p 0 48}DayINFLoRaA03S05{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Daily infections Lower A03 S05 {p_end}
{p 0 48}DayINFUpRaA03S05{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Daily infections Upper A03 S05 {p_end}
{p 0 48}DayINFMeRaA03S06{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Daily infections Mean A03 S06 {p_end}
{p 0 48}DayINFLoRaA03S06{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Daily infections Lower A03 S06 {p_end}
{p 0 48}DayINFUpRaA03S06{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Daily infections Upper A03 S06 {p_end}
{p 0 48}DayHodLoRaA03S01{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Daily hospital demand Lower A03 S01 {p_end}
{p 0 48}DayHodMeRaA03S01{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Daily hospital demand Mean A03 S01 {p_end}
{p 0 48}DayHodUpRaA03S01{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Daily hospital demand Upper A03 S01 {p_end}
{p 0 48}DayHodLoRaA03S02{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Daily hospital demand Lower A03 S02 {p_end}
{p 0 48}DayHodMeRaA03S02{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Daily hospital demand Mean A03 S02 {p_end}
{p 0 48}DayHodUpRaA03S02{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Daily hospital demand Upper A03 S02 {p_end}
{p 0 48}DayHodLoRaA03S03{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Daily hospital demand Lower A03 S03 {p_end}
{p 0 48}DayHodMeRaA03S03{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Daily hospital demand Mean A03 S03 {p_end}
{p 0 48}DayHodUpRaA03S03{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Daily hospital demand Upper A03 S03 {p_end}
{p 0 48}DayHodLoRaA03S04{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Daily hospital demand Lower A03 S04 {p_end}
{p 0 48}DayHodMeRaA03S04{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Daily hospital demand Mean A03 S04 {p_end}
{p 0 48}DayHodUpRaA03S04{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Daily hospital demand Upper A03 S04 {p_end}
{p 0 48}DayHodLoRaA03S05{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Daily hospital demand Lower A03 S05 {p_end}
{p 0 48}DayHodMeRaA03S05{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Daily hospital demand Mean A03 S05 {p_end}
{p 0 48}DayHodUpRaA03S05{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Daily hospital demand Upper A03 S05 {p_end}
{p 0 48}DayHodLoRaA03S06{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Daily hospital demand Lower A03 S06 {p_end}
{p 0 48}DayHodMeRaA03S06{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Daily hospital demand Mean A03 S06 {p_end}
{p 0 48}DayHodUpRaA03S06{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Daily hospital demand Upper A03 S06 {p_end}
{p 0 48}DayHoiLoRaA03S01{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Daily hospital incidence Lower A03 S01 {p_end}
{p 0 48}DayHoiMeRaA03S01{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Daily hospital incidence Mean A03 S01 {p_end}
{p 0 48}DayHoiUpRaA03S01{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Daily hospital incidence Upper A03 S01 {p_end}
{p 0 48}DayHoiLoRaA03S02{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Daily hospital incidence Lower A03 S02 {p_end}
{p 0 48}DayHoiMeRaA03S02{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Daily hospital incidence Mean A03 S02 {p_end}
{p 0 48}DayHoiUpRaA03S02{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Daily hospital incidence Upper A03 S02 {p_end}
{p 0 48}DayHoiLoRaA03S03{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Daily hospital incidence Lower A03 S03 {p_end}
{p 0 48}DayHoiMeRaA03S03{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Daily hospital incidence Mean A03 S03 {p_end}
{p 0 48}DayHoiUpRaA03S03{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Daily hospital incidence Upper A03 S03 {p_end}
{p 0 48}DayHoiLoRaA03S04{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Daily hospital incidence Lower A03 S04 {p_end}
{p 0 48}DayHoiMeRaA03S04{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Daily hospital incidence Mean A03 S04 {p_end}
{p 0 48}DayHoiUpRaA03S04{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Daily hospital incidence Upper A03 S04 {p_end}
{p 0 48}DayHoiLoRaA03S05{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Daily hospital incidence Lower A03 S05 {p_end}
{p 0 48}DayHoiMeRaA03S05{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Daily hospital incidence Mean A03 S05 {p_end}
{p 0 48}DayHoiUpRaA03S05{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Daily hospital incidence Upper A03 S05 {p_end}
{p 0 48}DayHoiLoRaA03S06{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Daily hospital incidence Lower A03 S06 {p_end}
{p 0 48}DayHoiMeRaA03S06{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Daily hospital incidence Mean A03 S06 {p_end}
{p 0 48}DayHoiUpRaA03S06{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Daily hospital incidence Upper A03 S06 {p_end}
{p 0 48}DayIcdLoRaA03S01{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Daily ICU demand Lower A03 S01 {p_end}
{p 0 48}DayIcdMeRaA03S01{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Daily ICU demand Mean A03 S01 {p_end}
{p 0 48}DayIcdUpRaA03S01{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Daily ICU demand Upper A03 S01 {p_end}
{p 0 48}DayIcdLoRaA03S02{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Daily ICU demand Lower A03 S02 {p_end}
{p 0 48}DayIcdMeRaA03S02{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Daily ICU demand Mean A03 S02 {p_end}
{p 0 48}DayIcdUpRaA03S02{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Daily ICU demand Upper A03 S02 {p_end}
{p 0 48}DayIcdLoRaA03S03{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Daily ICU demand Lower A03 S03 {p_end}
{p 0 48}DayIcdMeRaA03S03{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Daily ICU demand Mean A03 S03 {p_end}
{p 0 48}DayIcdUpRaA03S03{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Daily ICU demand Upper A03 S03 {p_end}
{p 0 48}DayIcdLoRaA03S04{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Daily ICU demand Lower A03 S04 {p_end}
{p 0 48}DayIcdMeRaA03S04{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Daily ICU demand Mean A03 S04 {p_end}
{p 0 48}DayIcdUpRaA03S04{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Daily ICU demand Upper A03 S04 {p_end}
{p 0 48}DayIcdLoRaA03S05{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Daily ICU demand Lower A03 S05 {p_end}
{p 0 48}DayIcdMeRaA03S05{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Daily ICU demand Mean A03 S05 {p_end}
{p 0 48}DayIcdUpRaA03S05{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Daily ICU demand Upper A03 S05 {p_end}
{p 0 48}DayIcdLoRaA03S06{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Daily ICU demand Lower A03 S06 {p_end}
{p 0 48}DayIcdMeRaA03S06{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Daily ICU demand Mean A03 S06 {p_end}
{p 0 48}DayIcdUpRaA03S06{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Daily ICU demand Upper A03 S06 {p_end}
{p 0 48}DayIciLoRaA03S01{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Daily ICU incidence Lower A03 S01 {p_end}
{p 0 48}DayIciMeRaA03S01{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Daily ICU incidence Mean A03 S01 {p_end}
{p 0 48}DayIciUpRaA03S01{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Daily ICU incidence Upper A03 S01 {p_end}
{p 0 48}DayIciLoRaA03S02{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Daily ICU incidence Lower A03 S02 {p_end}
{p 0 48}DayIciMeRaA03S02{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Daily ICU incidence Mean A03 S02 {p_end}
{p 0 48}DayIciUpRaA03S02{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Daily ICU incidence Upper A03 S02 {p_end}
{p 0 48}DayIciLoRaA03S03{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Daily ICU incidence Lower A03 S03 {p_end}
{p 0 48}DayIciMeRaA03S03{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Daily ICU incidence Mean A03 S03 {p_end}
{p 0 48}DayIciUpRaA03S03{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Daily ICU incidence Upper A03 S03 {p_end}
{p 0 48}DayIciLoRaA03S04{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Daily ICU incidence Lower A03 S04 {p_end}
{p 0 48}DayIciMeRaA03S04{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Daily ICU incidence Mean A03 S04 {p_end}
{p 0 48}DayIciUpRaA03S04{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Daily ICU incidence Upper A03 S04 {p_end}
{p 0 48}DayIciLoRaA03S05{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Daily ICU incidence Lower A03 S05 {p_end}
{p 0 48}DayIciMeRaA03S05{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Daily ICU incidence Mean A03 S05 {p_end}
{p 0 48}DayIciUpRaA03S05{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Daily ICU incidence Upper A03 S05 {p_end}
{p 0 48}DayIciLoRaA03S06{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Daily ICU incidence Lower A03 S06 {p_end}
{p 0 48}DayIciMeRaA03S06{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Daily ICU incidence Mean A03 S06 {p_end}
{p 0 48}DayIciUpRaA03S06{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Daily ICU incidence Upper A03 S06 {p_end}
{p 0 48}DayPreLoRaA03S01{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Daily prevalence Lower A03 S01 {p_end}
{p 0 48}DayPreMeRaA03S01{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Daily prevalence Mean A03 S01 {p_end}
{p 0 48}DayPreUpRaA03S01{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Daily prevalence Upper A03 S01 {p_end}
{p 0 48}DayPreLoRaA03S02{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Daily prevalence Lower A03 S02 {p_end}
{p 0 48}DayPreMeRaA03S02{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Daily prevalence Mean A03 S02 {p_end}
{p 0 48}DayPreUpRaA03S02{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Daily prevalence Upper A03 S02 {p_end}
{p 0 48}DayPreLoRaA03S03{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Daily prevalence Lower A03 S03 {p_end}
{p 0 48}DayPreMeRaA03S03{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Daily prevalence Mean A03 S03 {p_end}
{p 0 48}DayPreUpRaA03S03{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Daily prevalence Upper A03 S03 {p_end}
{p 0 48}DayPreLoRaA03S04{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Daily prevalence Lower A03 S04 {p_end}
{p 0 48}DayPreMeRaA03S04{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Daily prevalence Mean A03 S04 {p_end}
{p 0 48}DayPreUpRaA03S04{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Daily prevalence Upper A03 S04 {p_end}
{p 0 48}DayPreLoRaA03S05{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Daily prevalence Lower A03 S05 {p_end}
{p 0 48}DayPreMeRaA03S05{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Daily prevalence Mean A03 S05 {p_end}
{p 0 48}DayPreUpRaA03S05{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Daily prevalence Upper A03 S05 {p_end}
{p 0 48}DayPreLoRaA03S06{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Daily prevalence Lower A03 S06 {p_end}
{p 0 48}DayPreMeRaA03S06{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Daily prevalence Mean A03 S06 {p_end}
{p 0 48}DayPreUpRaA03S06{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Daily prevalence Upper A03 S06 {p_end}
{p 0 48}DayRefLoRaA03S01{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Daily R effective Lower A03 S01 {p_end}
{p 0 48}DayRefMeRaA03S01{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Daily R effective Mean A03 S01 {p_end}
{p 0 48}DayRefUpRaA03S01{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Daily R effective Upper A03 S01 {p_end}
{p 0 48}DayRefLoRaA03S02{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Daily R effective Lower A03 S02 {p_end}
{p 0 48}DayRefMeRaA03S02{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Daily R effective Mean A03 S02 {p_end}
{p 0 48}DayRefUpRaA03S02{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Daily R effective Upper A03 S02 {p_end}
{p 0 48}DayRefLoRaA03S03{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Daily R effective Lower A03 S03 {p_end}
{p 0 48}DayRefMeRaA03S03{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Daily R effective Mean A03 S03 {p_end}
{p 0 48}DayRefUpRaA03S03{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Daily R effective Upper A03 S03 {p_end}
{p 0 48}DayRefLoRaA03S04{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Daily R effective Lower A03 S04 {p_end}
{p 0 48}DayRefMeRaA03S04{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Daily R effective Mean A03 S04 {p_end}
{p 0 48}DayRefUpRaA03S04{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Daily R effective Upper A03 S04 {p_end}
{p 0 48}DayRefLoRaA03S05{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Daily R effective Lower A03 S05 {p_end}
{p 0 48}DayRefMeRaA03S05{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Daily R effective Mean A03 S05 {p_end}
{p 0 48}DayRefUpRaA03S05{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Daily R effective Upper A03 S05 {p_end}
{p 0 48}DayRefLoRaA03S06{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Daily R effective Lower A03 S06 {p_end}
{p 0 48}DayRefMeRaA03S06{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Daily R effective Mean A03 S06 {p_end}
{p 0 48}DayRefUpRaA03S06{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Daily R effective Upper A03 S06 {p_end}
{p 0 48}DayRttLoRaA03S01{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Daily R t Lower A03 S01 {p_end}
{p 0 48}DayRttMeRaA03S01{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Daily R t Mean A03 S01 {p_end}
{p 0 48}DayRttUpRaA03S01{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Daily R t Upper A03 S01 {p_end}
{p 0 48}DayRttLoRaA03S02{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Daily R t Lower A03 S02 {p_end}
{p 0 48}DayRttMeRaA03S02{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Daily R t Mean A03 S02 {p_end}
{p 0 48}DayRttUpRaA03S02{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Daily R t Upper A03 S02 {p_end}
{p 0 48}DayRttLoRaA03S03{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Daily R t Lower A03 S03 {p_end}
{p 0 48}DayRttMeRaA03S03{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Daily R t Mean A03 S03 {p_end}
{p 0 48}DayRttUpRaA03S03{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Daily R t Upper A03 S03 {p_end}
{p 0 48}DayRttLoRaA03S04{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Daily R t Lower A03 S04 {p_end}
{p 0 48}DayRttMeRaA03S04{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Daily R t Mean A03 S04 {p_end}
{p 0 48}DayRttUpRaA03S04{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Daily R t Upper A03 S04 {p_end}
{p 0 48}DayRttLoRaA03S05{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Daily R t Lower A03 S05 {p_end}
{p 0 48}DayRttMeRaA03S05{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Daily R t Mean A03 S05 {p_end}
{p 0 48}DayRttUpRaA03S05{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Daily R t Upper A03 S05 {p_end}
{p 0 48}DayRttLoRaA03S06{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Daily R t Lower A03 S06 {p_end}
{p 0 48}DayRttMeRaA03S06{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Daily R t Mean A03 S06 {p_end}
{p 0 48}DayRttUpRaA03S06{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Daily R t Upper A03 S06 {p_end}
{p 0 48}DayIFRMeRaA03S01{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Daily IFR Mean A03 S01 {p_end}
{p 0 48}DayIFRLoRaA03S01{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Daily IFR Lower A03 S01 {p_end}
{p 0 48}DayIFRUpRaA03S01{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Daily IFR Upper A03 S01 {p_end}
{p 0 48}DayIFRMeRaA03S02{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Daily IFR Mean A03 S02 {p_end}
{p 0 48}DayIFRLoRaA03S02{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Daily IFR Lower A03 S02 {p_end}
{p 0 48}DayIFRUpRaA03S02{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Daily IFR Upper A03 S02 {p_end}
{p 0 48}DayIFRMeRaA03S03{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Daily IFR Mean A03 S03 {p_end}
{p 0 48}DayIFRLoRaA03S03{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Daily IFR Lower A03 S03 {p_end}
{p 0 48}DayIFRUpRaA03S03{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Daily IFR Upper A03 S03 {p_end}
{p 0 48}DayIFRMeRaA03S04{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Daily IFR Mean A03 S04 {p_end}
{p 0 48}DayIFRLoRaA03S04{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Daily IFR Lower A03 S04 {p_end}
{p 0 48}DayIFRUpRaA03S04{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Daily IFR Upper A03 S04 {p_end}
{p 0 48}DayIFRMeRaA03S05{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Daily IFR Mean A03 S05 {p_end}
{p 0 48}DayIFRLoRaA03S05{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Daily IFR Lower A03 S05 {p_end}
{p 0 48}DayIFRUpRaA03S05{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Daily IFR Upper A03 S05 {p_end}
{p 0 48}DayIFRMeRaA03S06{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Daily IFR Mean A03 S06 {p_end}
{p 0 48}DayIFRLoRaA03S06{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Daily IFR Lower A03 S06 {p_end}
{p 0 48}DayIFRUpRaA03S06{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Daily IFR Upper A03 S06 {p_end}
{p 0 48}DayDeMMeRaA03S02{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Daily deaths mean IMPE DayDeM{p_end}
{p 0 48}DayCaMMeRaA03S02{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Daily infections mean IMPE DayCaM{p_end}
{p 0 48}DayIbDMeRaA03S02{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Daily infections mean div by daily deaths mean IMPE DayIbD{p_end}
{p 0 48}DayDMuMeRaA03S02{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Daily deaths scaled (times means of infections by deaths) IMPE{p_end}
{p 0 48}DayDeaFOREA03S02_raw{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Daily Forecasted Deaths Mean smoothed IMPE S2{p_end}
{p 0 48}DayINFFOREA03S02_raw{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Daily Forecasted Infections Mean smoothed IMPE S2{p_end}
{p 0 48}DayDeaMeSmA03S02{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Daily deaths mean smooth IMPE S2{p_end}
{p 0 48}DayDeaMeSmA03S01{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Daily deaths mean smooth IMPE S1{p_end}
{p 0 48}DayDeaMeSmA03S03{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Daily deaths mean smooth IMPE S3{p_end}
{p 0 48}DayDeaLoSmA03S03{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Daily deaths lower smooth IMPE S3{p_end}
{p 0 48}DayDeaUpSmA03S03{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Daily deaths upper smooth IMPE S3{p_end}
{p 0 48}DayDeaFOREA03S02{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Daily deaths mean smooth IMPE{p_end}
{p 0 48}DayINFMeSmA03S02{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Daily infections mean smooth IMPE{p_end}
{p 0 48}DayINFFOREA03S02{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Daily infections mean smooth IMPE{p_end}
{p 0 48}DayDeaLoSmA03S02{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Daily deaths lower smooth IMPE{p_end}
{p 0 48}DayINFLoSmA03S02{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Daily infections lower smooth IMPE{p_end}
{p 0 48}DayDeaUpSmA03S02{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Daily deaths upper smooth IMPE{p_end}
{p 0 48}DayINFUpSmA03S02{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Daily infections upper smooth IMPE S2{p_end}
{p 0 48}DayINFUpSmA03S03{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Daily infections upper smooth IMPE S3{p_end}
{p 0 48}TotCasUpRaA05S00{p_end}
{p 0 48}{space 15}{txt}{bind: long    }{bind:{txt}%10.0g    }{space 1}{bind:         }{bind:  }{res}{res}Total Cases Upper SRIV{p_end}
{p 0 48}TotDeaMeRaA05S00{p_end}
{p 0 48}{space 15}{txt}{bind: long    }{bind:{txt}%12.0g    }{space 1}{bind:         }{bind:  }{res}{res}Total Deaths Mean SRIV{p_end}
{p 0 48}TotDeaLoRaA05S00{p_end}
{p 0 48}{space 15}{txt}{bind: long    }{bind:{txt}%12.0g    }{space 1}{bind:         }{bind:  }{res}{res}Total Deaths Lower SRIV{p_end}
{p 0 48}TotDeaUpRaA05S00{p_end}
{p 0 48}{space 15}{txt}{bind: long    }{bind:{txt}%12.0g    }{space 1}{bind:         }{bind:  }{res}{res}Total Deaths Upper SRIV{p_end}
{p 0 48}TotCasMeRaA05S00{p_end}
{p 0 48}{space 15}{txt}{bind: long    }{bind:{txt}%10.0g    }{space 1}{bind:         }{bind:  }{res}{res}Total Cases Mean SRIV{p_end}
{p 0 48}TotCasLoRaA05S00{p_end}
{p 0 48}{space 15}{txt}{bind: long    }{bind:{txt}%10.0g    }{space 1}{bind:         }{bind:  }{res}{res}Total Cases Lower SRIV{p_end}
{p 0 48}DayDeaMeRaA05S00{p_end}
{p 0 48}{space 15}{txt}{bind: byte    }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Daily Deaths Mean SRIV{p_end}
{p 0 48}DayDeaLoRaA05S00{p_end}
{p 0 48}{space 15}{txt}{bind: byte    }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Daily Deaths Lower SRIV{p_end}
{p 0 48}DayDeaUpRaA05S00{p_end}
{p 0 48}{space 15}{txt}{bind: byte    }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Daily Deaths Upper SRIV{p_end}
{p 0 48}DayCasMeRaA05S00{p_end}
{p 0 48}{space 15}{txt}{bind: int     }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Daily Cases Mean SRIV{p_end}
{p 0 48}DayCasLoRaA05S00{p_end}
{p 0 48}{space 15}{txt}{bind: int     }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Daily Cases Lower SRIV{p_end}
{p 0 48}DayCasUpRaA05S00{p_end}
{p 0 48}{space 15}{txt}{bind: int     }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Daily Cases Upper SRIV{p_end}
{p 0 48}DayCfrMeRaA05S00{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Daily CFR Mean SRIV{p_end}
{p 0 48}DayCfrLoRaA05S00{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Daily CFR Lower SRIV{p_end}
{p 0 48}DayCfrUpRaA05S00{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Daily CFR Upper SRIV{p_end}
{p 0 48}DayDeMMeRaA05S00{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Daily deaths mean SRIV  DayDeM{p_end}
{p 0 48}DayCaMMeRaA05S00{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Daily cases mean SRIV  DayCaM{p_end}
{p 0 48}DayCbDMeRaA05S00{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Daily cases mean div by daily deaths mean SRIV  DayCbD{p_end}
{p 0 48}DayDMuMeRaA05S00{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Daily deaths scaled (times means of cases by deaths) SRIV {p_end}
{p 0 48}DayDeaMeSmA05S00{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Daily deaths smooth A05 SRIV{p_end}
{p 0 48}DayCasMeSmA05S00{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Daily cases smooth A05 SRIV{p_end}
{p 0 48}{bind:epoch_SRIV     }{txt}{bind: int     }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}SRIV Forecast start date{p_end}
{p 0 48}DayDeaFOREA05S00{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Daily Forecasted Deaths Mean smoothed SRIV{p_end}
{p 0 48}DayCasFOREA05S00{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Daily Forecasted Cases Mean smoothed SRIV{p_end}
{p 0 48}DayDeXMeRaA06S00{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Daily Excess Deaths Raw Mean WHO S0{p_end}
{p 0 48}DayDeXMeSmA06S00{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Daily Excess Deaths Smooth Mean WHO S0{p_end}
{p 0 48}DayCTDMeRaA00S00{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Daily Cases to Deaths S0 JOHN{p_end}
{p 0 48}TotCTDMeRaA00S00{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Total Cases to Deaths S0 JOHN{p_end}
{p 0 48}DayCTDMeRaA01S00{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Daily Cases to Deaths S0 DELP{p_end}
{p 0 48}TotCTDMeRaA01S00{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Total Cases to Deaths S0 DELP{p_end}
{p 0 48}DayITDMeRaA02S01{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Daily Infections to Deaths S1 IHME{p_end}
{p 0 48}TotITDMeRaA02S01{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Total Infections to Deaths S1 IHME{p_end}
{p 0 48}DayITDMeRaA02S02{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Daily Infections to Deaths S2 IHME{p_end}
{p 0 48}TotITDMeRaA02S02{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Total Infections to Deaths S2 IHME{p_end}
{p 0 48}DayITDMeRaA03S01{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Daily Infections to Deaths S1 IMPE{p_end}
{p 0 48}TotITDMeRaA03S01{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Total Infections to Deaths S1 IMPE{p_end}
{p 0 48}DayITDMeRaA03S02{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Daily Infections to Deaths S2 IMPE{p_end}
{p 0 48}TotITDMeRaA03S02{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Total Infections to Deaths S2 IMPE{p_end}
{p 0 48}DayITDMeRaA03S03{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Daily Infections to Deaths S3 IMPE{p_end}
{p 0 48}TotITDMeRaA03S03{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Total Infections to Deaths S3 IMPE{p_end}
{p 0 48}DayCTDMeRaA05S00{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Daily Cases to Deaths S0 SRIV{p_end}
{p 0 48}TotCTDMeRaA05S00{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Total Cases to Deaths S0 SRIV{p_end}
{p 0 48}DayDERMeRaA00S00{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Daily Deaths estim to reported JOHN = 1{p_end}
{p 0 48}DayDERMeRaA01S00{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Daily Deaths estim to reported Mean DELP S0{p_end}
{p 0 48}DayDERMeRaA02S01{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Daily Deaths estim to reported Mean not smoothed IHME S1{p_end}
{p 0 48}DayDERMeRaA02S02{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Daily Deaths estim to reported Mean not smoothed IHME S2{p_end}
{p 0 48}DayDERMeRaA03S01{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Daily Deaths estim to reported Mean S1 IMPE{p_end}
{p 0 48}DayDERMeRaA03S02{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Daily Deaths estim to reported Mean S2 IMPE{p_end}
{p 0 48}DayDERMeRaA03S03{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Daily Deaths estim to reported Mean S3 IMPE{p_end}
{p 0 48}DayDERMeRaA05S00{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Daily Deaths estim to reported S0 SRIV{p_end}
{p 0 48}DayCERMeRaA00S00{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Daily Cases estim to reported JOHN = 1{p_end}
{p 0 48}DayCERMeRaA01S00{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Daily Cases estim to reported Mean DELP S0{p_end}
{p 0 48}DayIERMeRaA02S01{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Daily Infections estim to reported Mean not smoothed IHME S1{p_end}
{p 0 48}DayIERMeRaA02S02{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Daily Infections estim to reported Mean not smoothed IHME S2{p_end}
{p 0 48}DayIERMeRaA03S01{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Daily Infections estim to reported Mean S1 IMPE{p_end}
{p 0 48}DayIERMeRaA03S02{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Daily Infections estim to reported Mean S2 IMPE{p_end}
{p 0 48}DayIERMeRaA03S03{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Daily Infections estim to reported Mean S3 IMPE{p_end}
{p 0 48}DayCERMeRaA05S00{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Daily Cases estim to reported S0 SRIV{p_end}
{p 0 48}TotDERMeRaA00S00{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Total Deaths estim to reported JOHN = 1{p_end}
{p 0 48}TotDERMeRaA01S00{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Total Deaths estim to reported Mean DELP S0{p_end}
{p 0 48}TotDERMeRaA02S01{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Total Deaths estim to reported Mean not smoothed IHME S1{p_end}
{p 0 48}TotDERMeRaA02S02{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Total Deaths estim to reported Mean not smoothed IHME S2{p_end}
{p 0 48}TotDERMeRaA03S01{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Total Deaths estim to reported Mean S1 IMPE{p_end}
{p 0 48}TotDERMeRaA03S02{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Total Deaths estim to reported Mean S2 IMPE{p_end}
{p 0 48}TotDERMeRaA03S03{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Total Deaths estim to reported Mean S3 IMPE{p_end}
{p 0 48}TotDERMeRaA05S00{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Total Deaths estim to reported S0 SRIV{p_end}
{p 0 48}TotCERMeRaA00S00{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Total Cases estim to reported JOHN = 1{p_end}
{p 0 48}TotCERMeRaA01S00{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Total Cases estim to reported Mean DELP S0{p_end}
{p 0 48}TotIERMeRaA02S01{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Total Infections estim to reported Mean not smoothed IHME S1{p_end}
{p 0 48}TotIERMeRaA02S02{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Total Infections estim to reported Mean not smoothed IHME S2{p_end}
{p 0 48}TotIERMeRaA03S01{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Total Infections estim to reported Mean S1 IMPE{p_end}
{p 0 48}TotIERMeRaA03S02{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Total Infections estim to reported Mean S2 IMPE{p_end}
{p 0 48}TotIERMeRaA03S03{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Total Infections estim to reported Mean S3 IMPE{p_end}
{p 0 48}TotCERMeRaA05S00{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Total Cases estim to reported S0 SRIV{p_end}
{txt}{hline}
Sorted by: {res}date
     Note: Dataset has changed since last saved.
{txt}
{com}.  
.  
. *
. 
. sort date
{txt}
{com}. 
. qui compress
{txt}
{com}. 
. save "country.dta", replace
{txt}file country.dta saved

{com}. 
. export delimited using "country.csv", replace 
{res}{txt}file country.csv saved

{com}. 
. 
. *
. 
. 
. 
. 
. 
. ***************
. 
. * graphs 
. 
. 
. grstyle init
{res}{txt}
{com}. 
. grstyle color background white
{txt}
{com}. 
. 
. 
. 
. 
. 
. 
. **********
. 
. * gen monthspast vars for #thicknumber of graphs
. 
. 
. summ date

{txt}    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
{space 8}date {c |}{res}        975       22402    281.6026      21915      22889
{txt}
{com}. 
. gen mergemaxdate = r(max)
{txt}
{com}. 
. 
. gen monthspast01jan2020merge = ((mergemaxdate - td(01jan2020)) / 30)
{txt}
{com}. 
. replace monthspast01jan2020merge = round(monthspast01jan2020merge)
{txt}(975 real changes made)

{com}. 
. global monthspast01jan2020merge = monthspast01jan2020merge
{txt}
{com}. 
. di $monthspast01jan2020merge
{res}32
{txt}
{com}. 
. 
. 
. gen monthspast01jan2021merge = ((mergemaxdate - td(01jan2021)) / 30)
{txt}
{com}. 
. replace monthspast01jan2021merge = round(monthspast01jan2021merge)
{txt}(975 real changes made)

{com}. 
. global monthspast01jan2021merge = monthspast01jan2021merge
{txt}
{com}. 
. di $monthspast01jan2021merge
{res}20
{txt}
{com}. 
. 
. 
. gen monthspast01jan2022merge = ((mergemaxdate - td(01jan2022)) / 30)
{txt}
{com}. 
. replace monthspast01jan2022merge = round(monthspast01jan2022merge)
{txt}(975 real changes made)

{com}. 
. global monthspast01jan2022merge = monthspast01jan2022merge
{txt}
{com}. 
. di $monthspast01jan2022merge
{res}8
{txt}
{com}. 
. 
. 
. 
. 
. 
. * gen monthspast vars for #thicknumber of graphs JOHN
. 
. gen monthspast01jan2020JOHN = ((today_numericdailydate - td(01jan2020)) / 30) + 1
{txt}(118 missing values generated)

{com}. 
. replace monthspast01jan2020JOHN = round(monthspast01jan2020)
{txt}(857 real changes made)

{com}. 
. global monthspast01jan2020JOHN = monthspast01jan2020JOHN
{txt}
{com}. 
. di $monthspast01jan2020JOHN
{res}30
{txt}
{com}. 
. 
. 
. gen monthspast01jan2021JOHN = ((today_numericdailydate - td(01jan2021)) / 30) + 1
{txt}(118 missing values generated)

{com}. 
. replace monthspast01jan2021JOHN = round(monthspast01jan2021)
{txt}(857 real changes made)

{com}. 
. global monthspast01jan2021JOHN = monthspast01jan2021JOHN
{txt}
{com}. 
. di $monthspast01jan2021JOHN
{res}17
{txt}
{com}. 
. 
. 
. gen monthspast01jan2022JOHN = ((today_numericdailydate - td(01jan2022)) / 30) + 1
{txt}(118 missing values generated)

{com}. 
. replace monthspast01jan2022JOHN = round(monthspast01jan2022JOHN)
{txt}(857 real changes made)

{com}. 
. global monthspast01jan2022JOHN = monthspast01jan2022JOHN
{txt}
{com}. 
. di $monthspast01jan2022JOHN
{res}5
{txt}
{com}. 
. 
. 
. * end date of graphs JOHN
. 
. gen nextmonthspast01jan2020JOHN = monthspast01jan2020JOHN 
{txt}(118 missing values generated)

{com}. 
. gen nextmonthdayspast01jan2020JOHN = nextmonthspast01jan2020JOHN * 30
{txt}(118 missing values generated)

{com}. 
. gen nextmonthdatespast01jan2020JOHN = td(01jan2020) + nextmonthdayspast01jan2020JOHN
{txt}(118 missing values generated)

{com}. 
. local nextmonthdatespast01jan2020JOHN = nextmonthdatespast01jan2020JOHN
{txt}
{com}. 
. 
. 
. gen nextmonthspast01jan2022JOHN = monthspast01jan2022JOHN 
{txt}(118 missing values generated)

{com}. 
. gen nextmonthdayspast01jan2022JOHN = nextmonthspast01jan2022JOHN * 30
{txt}(118 missing values generated)

{com}. 
. gen nextmonthdatespast01jan2022JOHN = td(01jan2022) + nextmonthdayspast01jan2022JOHN
{txt}(118 missing values generated)

{com}. 
. local nextmonthdatespast01jan2022JOHN = nextmonthdatespast01jan2022JOHN
{txt}
{com}. 
. 
. 
. 
. 
. 
. 
. ****************************
. 
. * daily deaths, JOHN, 2020 on
. 
. twoway ///
> (line DayDeaMeRaA00S00 date, sort lcolor(black) lwidth(medium)) /// 1 "JOHN raw"
> (line DayDeaMeSmA00S00 date, sort lcolor(cyan*1.2) lwidth(thick)) /// 2 "JOHN smooth"
> if date >= td(01jan2020) & date <= `nextmonthdatespast01jan2020JOHN' ///
> , xtitle(Date) xlabel(#$monthspast01jan2020JOHN, format(%tdYY-NN-DD) labsize(small)) xlabel(, grid) xlabel(, grid) ///
> xlabel(, angle(forty_five)) ylabel(, format(%9.0fc) labsize(small))  ylabel(, labsize(small) angle(horizontal)) ///
> ytitle(Daily reported deaths) title("COVID-19 daily reported deaths, $country, Johns Hopkins", size(medium)) ///
> xscale(lwidth(vthin) lcolor(gray*.2)) yscale(lwidth(vthin) lcolor(gray*.2)) legend(region(lcolor(none))) legend(bexpand) ///
> legend(order(1 "Raw deaths" 2 "Smooth deaths") size(small) row(1)) 
{res}{txt}
{com}. 
. graph export "graph 1 COVID-19 daily deaths, $country, Johns Hopkins.pdf", replace
{txt}(file /Users/farshadpourmalek/Downloads/covir2-main/20220506/code/merge/graph 1 COVID-19 daily deaths, Iran, Johns Hopkins.pdf written in PDF format)

{com}. 
. 
. 
. ****************************
. 
. * daily cases, JOHN, 2020 on
. 
. twoway ///
> (line DayCasMeRaA00S00 date, sort lcolor(black) lwidth(medium)) /// 1 "JOHN raw"
> (line DayCasMeSmA00S00 date, sort lcolor(cyan*1.2) lwidth(thick)) /// 2 "JOHN smooth"
> if date >= td(01jan2020) & date <= `nextmonthdatespast01jan2020JOHN' ///
> , xtitle(Date) xlabel(#$monthspast01jan2020JOHN, format(%tdYY-NN-DD) labsize(small)) xlabel(, grid) xlabel(, grid) ///
> xlabel(, angle(forty_five)) ylabel(, format(%9.0fc) labsize(small))  ylabel(, labsize(small) angle(horizontal)) ///
> ytitle(Daily reported cases) title("COVID-19 daily reported cases, $country, Johns Hopkins", size(medium)) ///
> xscale(lwidth(vthin) lcolor(gray*.2)) yscale(lwidth(vthin) lcolor(gray*.2)) legend(region(lcolor(none))) legend(bexpand) ///
> legend(order(1 "Raw cases" 2 "Smooth cases") size(small) row(1)) ///
> 
{res}{txt}
{com}. 
. graph export "graph 2 COVID-19 daily cases, $country, Johns Hopkins.pdf", replace
{txt}(file /Users/farshadpourmalek/Downloads/covir2-main/20220506/code/merge/graph 2 COVID-19 daily cases, Iran, Johns Hopkins.pdf written in PDF format)

{com}. 
. 
. 
. 
. 
. 
. ****************************
. 
. * daily deaths, JOHN, 2022 on
. 
. twoway ///
> (line DayDeaMeRaA00S00 date, sort lcolor(black) lwidth(medium)) /// 1 "JOHN raw"
> (line DayDeaMeSmA00S00 date, sort lcolor(cyan*1.2) lwidth(thick)) /// 2 "JOHN smooth"
> if date >= td(01jan2022) & date <= `nextmonthdatespast01jan2022JOHN' ///
> , xtitle(Date) xlabel(#$monthspast01jan2022JOHN, format(%tdYY-NN-DD) labsize(small)) xlabel(, grid) xlabel(, grid) ///
> xlabel(, angle(forty_five)) ylabel(, format(%9.0fc) labsize(small)) ylabel(, labsize(small) angle(horizontal)) ///
> ytitle(Daily reported deaths) title("COVID-19 daily reported deaths, $country, Johns Hopkins, 2022", size(medium)) ///
> xscale(lwidth(vthin) lcolor(gray*.2)) yscale(lwidth(vthin) lcolor(gray*.2)) legend(region(lcolor(none))) legend(bexpand) ///
> legend(order(1 "Raw deaths" 2 "Smooth deaths") size(small) row(1)) 
{res}{txt}
{com}. 
. graph export "graph 3 COVID-19 daily deaths, $country, Johns Hopkins, 2022 on.pdf", replace
{txt}(file /Users/farshadpourmalek/Downloads/covir2-main/20220506/code/merge/graph 3 COVID-19 daily deaths, Iran, Johns Hopkins, 2022 on.pdf written in PDF format)

{com}. 
. 
. 
. ****************************
. 
. * daily cases, JOHN, 2022 on
. 
. twoway ///
> (line DayCasMeRaA00S00 date, sort lcolor(black) lwidth(medium)) /// 1 "JOHN raw"
> (line DayCasMeSmA00S00 date, sort lcolor(cyan*1.2) lwidth(thick)) /// 2 "JOHN smooth"
> if date >= td(01jan2022) & date <= `nextmonthdatespast01jan2022JOHN' ///
> , xtitle(Date) xlabel(#$monthspast01jan2022JOHN, format(%tdYY-NN-DD) labsize(small)) xlabel(, grid) xlabel(, grid) ///
> xlabel(, angle(forty_five)) ylabel(, format(%9.0fc) labsize(small))  ylabel(, labsize(small) angle(horizontal)) ///
> ytitle(Daily reported cases) title("COVID-19 daily reported cases, $country, Johns Hopkins, 2022", size(medium)) ///
> xscale(lwidth(vthin) lcolor(gray*.2)) yscale(lwidth(vthin) lcolor(gray*.2)) legend(region(lcolor(none))) legend(bexpand) ///
> legend(order(1 "Raw cases" 2 "Smooth cases") size(small) row(1)) 
{res}{txt}
{com}. 
. graph export "graph 4 COVID-19 daily cases, $country, Johns Hopkins, 2022 on.pdf", replace
{txt}(file /Users/farshadpourmalek/Downloads/covir2-main/20220506/code/merge/graph 4 COVID-19 daily cases, Iran, Johns Hopkins, 2022 on.pdf written in PDF format)

{com}. 
. 
. 
. 
. 
. 
. 
. ******************
. 
. 
. 
. * daily deaths (graph numbers start with 11)
. 
. 
. ****
. * daily deaths, reference scenario, all time
. 
. twoway ///
> (line DayDeaMeSmA00S00 date, sort lcolor(cyan) lwidth(thick)) /// 1 "JOHN smooth"
> (line DayDeaFOREA01S00 date, sort lcolor(red) lpattern(tight_dot) lwidth(vthick)) /// 2 "DELP" Forecast only
> (line DayDeaMeSmA01S00 date, sort lcolor(red)) /// 3 "DELP"
> (line DayDeaFOREA02S01 date, sort lcolor(black) lpattern(tight_dot) lwidth(vthick)) /// 4 "IHME" Forecast only
> (line DayDeaMeSmA02S01 date, sort lcolor(black)) /// 5 "IHME"
> (line DayDeXMeSmA02S01 date, sort lcolor(brown) lpattern(dash)) /// 6 "IHME" Excess
> (line DayDeaFOREA03S02 date, sort lcolor(magenta)) /// 7 "IMPE" Forecast only
> (line DayDeaMeSmA03S02 date, sort lcolor(magenta)) /// 8 "IMPE"
> (line DayDeaFOREA05S00 date, sort lcolor(green) lpattern(tight_dot) lwidth(vthick)) /// 9 "SRIV" Forecast only
> (line DayDeaMeSmA05S00 date, sort lcolor(green)) /// 10 "SRIV"
> (line DayDeXMeSmA06S00 date, sort lcolor(gold)) /// 11 "WHO" Excess
> if date >= td(01jan2020) ///
> , xtitle(Date) xlabel(#$monthspast01jan2020merge, format(%tdYY-NN-DD) labsize(small)) xlabel(, grid) ///
> xlabel(, angle(forty_five)) ylabel(, format(%9.0fc) labsize(small)) ylabel(, labsize(small) angle(horizontal)) ///
> ytitle(Daily deaths) title("COVID-19 daily deaths, $country", size(medium)) /// 
> xscale(lwidth(vthin) lcolor(gray*.2)) yscale(lwidth(vthin) lcolor(gray*.2)) legend(region(lcolor(none))) legend(bexpand) ///
> legend(order(1 "JOHN" 3 "DELP" 5 "IHME" 6 "IHME excess" 8 "IMPE" 10 "SRIV" 11 "WHO excess") size(small) row(2)) ///
> subtitle("reference scenarios", size(small)) 
{res}{txt}
{com}. 
. graph export "graph 11 COVID-19 daily deaths, $country, reference scenarios, all time.pdf", replace
{txt}(file /Users/farshadpourmalek/Downloads/covir2-main/20220506/code/merge/graph 11 COVID-19 daily deaths, Iran, reference scenarios, all time.pdf written in PDF format)

{com}. 
. 
. 
. ****
. * daily deaths, reference scenario, 2021
. 
. twoway ///
> (line DayDeaMeSmA00S00 date, sort lcolor(cyan) lwidth(thick)) /// 1 "JOHN smooth"
> (line DayDeaFOREA01S00 date, sort lcolor(red) lpattern(tight_dot) lwidth(vthick)) /// 2 "DELP" Forecast only
> (line DayDeaMeSmA01S00 date, sort lcolor(red)) /// 3 "DELP"
> (line DayDeaFOREA02S01 date, sort lcolor(black) lpattern(tight_dot) lwidth(vthick)) /// 4 "IHME" Forecast only
> (line DayDeaMeSmA02S01 date, sort lcolor(black)) /// 5 "IHME"
> (line DayDeXMeSmA02S01 date, sort lcolor(brown) lpattern(dash)) /// 6 "IHME" Excess
> (line DayDeaFOREA03S02 date, sort lcolor(magenta) lpattern(tight_dot) lwidth(vthick)) /// 7 "IMPE" Forecast only
> (line DayDeaMeSmA03S02 date, sort lcolor(magenta)) /// 8 "IMPE"
> (line DayDeaFOREA05S00 date, sort lcolor(green) lpattern(tight_dot) lwidth(vthick)) /// 9 "SRIV" Forecast only
> (line DayDeaMeSmA05S00 date, sort lcolor(green)) /// 10 "SRIV"
> if date >= td(01jan2021) ///
> , xtitle(Date) xlabel(#$monthspast01jan2021merge, format(%tdYY-NN-DD) labsize(small)) xlabel(, grid) ///
> xlabel(, angle(forty_five)) ylabel(, format(%9.0fc) labsize(small))  ylabel(, labsize(small) angle(horizontal)) ///
> ytitle(Daily deaths) title("COVID-19 daily deaths, $country", size(medium)) /// 
> xscale(lwidth(vthin) lcolor(gray*.2)) yscale(lwidth(vthin) lcolor(gray*.2)) legend(region(lcolor(none))) legend(bexpand) ///
> legend(order(1 "JOHN" 3 "DELP" 5 "IHME" 6 "IHME excess" 8 "IMPE" 10 "SRIV") size(small) rows(1)) ///
> subtitle("2021 on, reference scenarios", size(small)) ///
> note("Reference scenario forecasts are marked with |||||||||||| " , size(small))  
{res}{txt}
{com}. 
. graph export "graph 12 COVID-19 daily deaths, $country, reference scenarios.pdf", replace
{txt}(file /Users/farshadpourmalek/Downloads/covir2-main/20220506/code/merge/graph 12 COVID-19 daily deaths, Iran, reference scenarios.pdf written in PDF format)

{com}. 
. 
. 
. 
. ****
. * daily deaths, reference scenario, 2021, CI
. 
. twoway ///
> (line DayDeaMeSmA00S00 date, sort lcolor(cyan) lwidth(thick)) /// 1 "JOHN smooth"
> (line DayDeaMeRaA01S00 date, sort lcolor(red)) /// 2 "DELP" mean
> (line DayDeaLoRaA01S00 date, sort lcolor(red) lpattern(dash)) /// 3 "DELP" lower
> (line DayDeaUpRaA01S00 date, sort lcolor(red) lpattern(dash)) /// 4 "DELP" upper
> (line DayDeaMeSmA02S01 date, sort lcolor(black)) /// 5 IHME mean
> (line DayDeaLoSmA02S01 date, sort lcolor(black) lpattern(dash)) /// 6 IHME lower
> (line DayDeaUpSmA02S01 date, sort lcolor(black) lpattern(dash)) /// 7 IHME upper
> (line DayDeaMeRaA03S02 date, sort lcolor(magenta)) /// 8 IMPE mean
> (line DayDeaLoSmA03S02 date, sort lcolor(magenta) lpattern(dash)) /// 9 IMPE lower
> (line DayDeaUpSmA03S02 date, sort lcolor(magenta) lpattern(dash)) /// 10 IMPE upper
> (line DayDeaMeRaA05S00 date, sort lcolor(green)) /// 11 SRIV mean
> (line DayDeaLoRaA05S00 date, sort lcolor(green) lpattern(dash)) /// 12 SRIV lower
> (line DayDeaUpRaA05S00 date, sort lcolor(green) lpattern(dash)) /// 13 SRIV upper
> if date >= td(01jan2021) ///
> , xtitle(Date) xlabel(#$monthspast01jan2021merge, format(%tdYY-NN-DD) labsize(small)) xlabel(, grid)  ///
> xlabel(, angle(forty_five)) ylabel(, format(%9.0fc) labsize(small))  ylabel(, labsize(small) angle(horizontal)) ///
> ytitle(Daily deaths) title("COVID-19 daily deaths, $country", size(medium)) ///
> xscale(lwidth(vthin) lcolor(gray*.2)) yscale(lwidth(vthin) lcolor(gray*.2)) legend(region(lcolor(none))) legend(bexpand) ///
> legend(order(1 "JOHN" 2 "DELP" 5 "IHME" 8 "IMPE" 11 "SRIV") size(small) row(1)) ///
> subtitle("2021 on, reference scenarios with uncertainty", size(small)) ///
> note("Uncertainty limits: dashed curves", size(small))
{res}{txt}
{com}. 
. graph export "graph 13 COVID-19 daily deaths, $country, reference scenarios, CI.pdf", replace
{txt}(file /Users/farshadpourmalek/Downloads/covir2-main/20220506/code/merge/graph 13 COVID-19 daily deaths, Iran, reference scenarios, CI.pdf written in PDF format)

{com}. 
. 
. 
. 
. ****
. * daily deaths, reference scenario with uncertainty, IHME, 2021 
. 
. twoway ///
> (line DayDeaMeSmA00S00 date, sort lcolor(cyan) lwidth(thick)) /// 1 "JOHN smooth"
> (line DayDeaMeSmA02S01 date, sort lcolor(black)) /// 2 IHME reference mean
> (line DayDeaLoSmA02S01 date, sort lcolor(green) lpattern(dash)) /// 3 IHME reference lower
> (line DayDeaUpSmA02S01 date, sort lcolor(red) lpattern(dash)) /// 4 IHME reference upper
> (line DayDeXLoSmA02S01 date, sort lcolor(green) lpattern(dash_dot)) /// 5 "IHME excess lower"
> (line DayDeXUpSmA02S01 date, sort lcolor(red) lpattern(dash_dot)) /// 6 "IHME excess upper"
> (line DayDeXMeSmA02S01 date, sort lcolor(black) lpattern(dash_dot) lwidth(medthick)) /// 7 "IHME excess mean"
> if date >= td(01jan2021) ///
> , xtitle(Date) xlabel(#$monthspast01jan2021merge, format(%tdYY-NN-DD) labsize(small)) xlabel(, grid) ///
> xlabel(, angle(forty_five)) ylabel(, format(%9.0fc) labsize(small)) ylabel(, labsize(small) angle(horizontal)) ///
> ytitle(Daily deaths) title("COVID-19 daily deaths, $country, IHME", size(medium)) ///
> xscale(lwidth(vthin) lcolor(gray*.2)) yscale(lwidth(vthin) lcolor(gray*.2)) legend(region(lcolor(none))) legend(bexpand) ///
> legend(order(1 "JOHN" 2 "IHME reference scenario, mean" ///
> 3 "IHME reference scenario, lower" 4 "IHME reference scenario, upper" 5 "IHME excess lower" ///
> 6 "IHME excess upper" 7 "IHME excess mean") size(small) row(4)) ///
> subtitle("2021 on, reference scenario with uncertainty", size(small)) ///
> note("Uncertainty limits: dashed (– – –) curves", size(small)) 
{res}{txt}
{com}. 
. graph export "graph 14 COVID-19 daily deaths, $country, reference scenario with uncertainty, IHME.pdf", replace
{txt}(file /Users/farshadpourmalek/Downloads/covir2-main/20220506/code/merge/graph 14 COVID-19 daily deaths, Iran, reference scenario with uncertainty, IHME.pdf written in PDF format)

{com}. 
. 
. 
. ****
. * daily deaths, all scenarios, IHME, 2021
. 
. twoway ///
> (line DayDeaMeSmA00S00 date, sort lcolor(cyan) lwidth(thick)) /// 1
> (line DayDeaFOREA02S01 date, sort lcolor(black*0.6) lpattern(tight_dot) lwidth(vthick)) /// 2 "IHME" Forecast only
> (line DayDeaMeSmA02S01 date, sort lcolor(black) lwidth(medthick)) /// 3 "IHME" 
> (line DayDeaMeSmA02S02 date, sort lcolor(blue)) /// 4
> (line DayDeaMeSmA02S03 date, sort lcolor(green)) /// 5
> if date >= td(01jan2021) ///
> , xtitle(Date) xlabel(#$monthspast01jan2021merge, format(%tdYY-NN-DD) labsize(small)) xlabel(, grid) xlabel(, grid) ///
> xlabel(, angle(forty_five)) ylabel(, format(%12.0fc) labsize(small))  ylabel(, labsize(small) angle(horizontal)) ///
> ytitle(Daily reported deaths) title("COVID-19 daily reported deaths, $country, IHME, all scenarios", size(medium)) ///
> xscale(lwidth(vthin) lcolor(gray*.2)) yscale(lwidth(vthin) lcolor(gray*.2)) legend(region(lcolor(none))) legend(bexpand) ///
> legend(order(1 "JOHN" 3 "IHME Reference" 4 "IHME Masks" 5 "IHME Third dose") rows(1)) ///
> note("Reference scenario forecasts are marked with |||||||||||| " , size(small))
{res}{txt}
{com}. 
. graph export "graph 15 COVID-19 daily deaths, $country, all scenarios, IHME.pdf", replace
{txt}(file /Users/farshadpourmalek/Downloads/covir2-main/20220506/code/merge/graph 15 COVID-19 daily deaths, Iran, all scenarios, IHME.pdf written in PDF format)

{com}. 
. 
. 
. ****
. * daily deaths, reference scenario with uncertainty, IMPE, 2021
. 
. twoway ///
> (line DayDeaMeSmA00S00 date, sort lcolor(cyan) lwidth(thick)) /// 1 "JOHN smooth"
> (line DayDeaFOREA03S02 date, sort lcolor(black*0.6) lpattern(tight_dot) lwidth(vthick)) /// 2 "IMPE" Forecast only
> (line DayDeaMeSmA03S02 date, sort lcolor(black)) /// 3 IMPE reference mean
> (line DayDeaLoSmA03S02 date, sort lcolor(green) lpattern(dash)) /// 4 IMPE reference lower
> (line DayDeaUpSmA03S02 date, sort lcolor(red) lpattern(dash)) /// 5 IMPE reference upper
> if date >= td(01jan2021) ///
> , xtitle(Date) xlabel(#$monthspast01jan2021merge, format(%tdYY-NN-DD) labsize(small)) xlabel(, grid) ///
> xlabel(, angle(forty_five)) ylabel(, format(%9.0fc) labsize(small)) ylabel(, labsize(small) angle(horizontal)) ///
> ytitle(Daily deaths) title("COVID-19 daily deaths, $country, IMPE", size(medium)) ///
> xscale(lwidth(vthin) lcolor(gray*.2)) yscale(lwidth(vthin) lcolor(gray*.2)) legend(region(lcolor(none))) legend(bexpand) ///
> legend(order(1 "JOHN smooth" 3 "IMPE reference scenario, mean" ///
> 4 "IMPE reference scenario, lower" 5 "IMPE reference scenario, upper") size(small) row(3)) ///
> subtitle("2021 on, reference scenario with uncertainty", size(small)) ///
> note("Reference scenario forecasts are marked with |||||||||||| " , size(small))
{res}{txt}
{com}. 
. graph export "graph 16 COVID-19 daily deaths, $country, reference scenario with uncertainty, IMPE.pdf", replace
{txt}(file /Users/farshadpourmalek/Downloads/covir2-main/20220506/code/merge/graph 16 COVID-19 daily deaths, Iran, reference scenario with uncertainty, IMPE.pdf written in PDF format)

{com}. 
. 
. 
. ****
. * daily deaths, 3 scenarios, IMPE, 2021
. 
. twoway ///
> (line DayDeaMeSmA00S00 date, sort lcolor(cyan) lwidth(thick)) /// 1 "JOHN smooth"
> (line DayDeaMeSmA03S02 date, sort lcolor(black)) /// 2 IMPE reference mean
> (line DayDeaMeSmA03S01 date, sort lcolor(green) lwidth(thick) lpattern(tight_dot)) /// 3 IMPE better mean
> (line DayDeaMeSmA03S03 date, sort lcolor(red) lwidth(thick) lpattern(tight_dot)) /// 4 IMPE worse mean
> (line DayDeaUpSmA03S03 date, sort lcolor(red) lpattern(dash)) /// 5 IMPE worse upper
> if date >= td(01jan2021) ///
> , xtitle(Date) xlabel(#$monthspast01jan2021merge, format(%tdYY-NN-DD) labsize(small)) xlabel(, grid) ///
> xlabel(, angle(forty_five)) ylabel(, format(%9.0fc) labsize(small)) ylabel(, labsize(small) angle(horizontal)) ///
> ytitle(Daily deaths) title("COVID-19 daily deaths, $country, IMPE", size(medium)) ///
> xscale(lwidth(vthin) lcolor(gray*.2)) yscale(lwidth(vthin) lcolor(gray*.2)) legend(region(lcolor(none))) legend(bexpand) ///
> legend(order(1 "JOHN" 2 "IMPE reference scenario, mean" 3 "IMPE better scenario, mean" ///
> 4 "IMPE worse scenario, mean" 5 "IMPE worse scenario, upper uncertainty limit") size(small) row(3)) ///
> subtitle("2021 on, 3 scenarios", size(small)) ///
> note("Better and worse scenarios: tight dot (|||||) curves; Uncertainty limits: dashed (– – –) curves.")
{res}{txt}
{com}. 
. graph export "graph 17 COVID-19 daily deaths, $country, 3 scenarios, IMPE.pdf", replace
{txt}(file /Users/farshadpourmalek/Downloads/covir2-main/20220506/code/merge/graph 17 COVID-19 daily deaths, Iran, 3 scenarios, IMPE.pdf written in PDF format)

{com}. 
. 
. 
. ***********************
. 
. * daily cases or infections (graph numbers start with 21)
. 
. twoway ///
> (line DayCasMeSmA00S00 date, sort lcolor(cyan) lwidth(thick)) /// 1 "JOHN"
> (line DayCasFOREA01S00 date, sort lcolor(red) lpattern(tight_dot) lwidth(vthick)) /// 2 "DELP" Forecast only
> (line DayCasMeSmA01S00 date, sort lcolor(red)) /// 3 "DELP"
> (line DayINFFOREA02S01 date, sort lcolor(black) lpattern(tight_dot) lwidth(vthick)) /// 4 "IHME" Forecast only
> (line DayINFMeSmA02S01 date, sort lcolor(black)) /// 5 "IHME"
> (line DayINFFOREA03S02 date, sort lcolor(magenta) lpattern(tight_dot) lwidth(vthick)) /// 6 "IMPE" Forecast only
> (line DayINFMeSmA03S02 date, sort lcolor(magenta)) /// 7 "IMPE"
> (line DayCasFOREA05S00 date, sort lcolor(green) lpattern(tight_dot) lwidth(vthick)) /// 8 "SRIV" Forecast only
> (line DayCasMeSmA05S00 date, sort lcolor(green)) /// 9 "SRIV"
> if date >= td(01jan2020) ///
> , xtitle(Date) xlabel(#$monthspast01jan2020merge, format(%tdYY-NN-DD) labsize(small)) xlabel(, grid)  ///
> xlabel(, angle(forty_five)) ylabel(, format(%9.0fc) labsize(small)) ylabel(, labsize(small) angle(horizontal)) ///
> ytitle(Daily cases or infections) title("COVID-19 daily cases or infections, $country", size(medium)) /// 
> xscale(lwidth(vthin) lcolor(gray*.2)) yscale(lwidth(vthin) lcolor(gray*.2)) legend(region(lcolor(none))) legend(bexpand) ///
> legend(order(1 "JOHN cases" 3 "DELP cases" 5 "IHME infections" 7 "IMPE infections" 9 "SRIV cases") size(small) row(2)) ///
> subtitle("reference scenarios", size(small)) ///
> note("Reference scenario forecasts are marked with |||||||||||| " , size(small))
{res}{txt}
{com}. 
. graph export "graph 21 COVID-19 daily cases, $country, reference scenarios, all time.pdf", replace
{txt}(file /Users/farshadpourmalek/Downloads/covir2-main/20220506/code/merge/graph 21 COVID-19 daily cases, Iran, reference scenarios, all time.pdf written in PDF format)

{com}. 
. 
. 
. 
. ****
. * daily cases or infections, reference scenario, 2021
. 
. twoway ///
> (line DayCasMeSmA00S00 date, sort lcolor(cyan) lwidth(thick)) /// 1 "JOHN"
> (line DayCasFOREA01S00 date, sort lcolor(red) lpattern(tight_dot) lwidth(vthick)) /// 2 "DELP" Forecast only
> (line DayCasMeSmA01S00 date, sort lcolor(red)) /// 3 "DELP"
> (line DayINFFOREA02S01 date, sort lcolor(black) lpattern(tight_dot) lwidth(vthick)) /// 4 "IHME" Forecast only
> (line DayINFMeSmA02S01 date, sort lcolor(black)) /// 5 "IHME"
> (line DayINFFOREA03S02 date, sort lcolor(magenta) lpattern(tight_dot) lwidth(vthick)) /// 6 "IMPE" Forecast only
> (line DayINFMeSmA03S02 date, sort lcolor(magenta)) /// 7 "IMPE"
> (line DayCasFOREA05S00 date, sort lcolor(green) lpattern(tight_dot) lwidth(vthick)) /// 8 "SRIV" Forecast only
> (line DayCasMeSmA05S00 date, sort lcolor(green)) /// 9 "SRIV"
> if date >= td(01jan2021) ///
> , xtitle(Date) xlabel(#$monthspast01jan2021merge, format(%tdYY-NN-DD) labsize(small)) xlabel(, grid)  ///
> xlabel(, angle(forty_five)) ylabel(, format(%9.0fc) labsize(small)) ylabel(, labsize(small) angle(horizontal)) ///
> ytitle(Daily cases or infections) title("COVID-19 daily cases or infections, $country", size(medium)) /// 
> xscale(lwidth(vthin) lcolor(gray*.2)) yscale(lwidth(vthin) lcolor(gray*.2)) legend(region(lcolor(none))) legend(bexpand) ///
> legend(order(1 "JOHN cases" 3 "DELP cases" 5 "IHME infections" 7 "IMPE infections" 9 "SRIV cases") size(small) row(2)) ///
> subtitle("2021 on, reference scenarios", size(small)) ///
> note("Reference scenario forecasts are marked with |||||||||||| " , size(small))
{res}{txt}
{com}. 
. graph export "graph 22 COVID-19 daily cases, $country, reference scenarios.pdf", replace
{txt}(file /Users/farshadpourmalek/Downloads/covir2-main/20220506/code/merge/graph 22 COVID-19 daily cases, Iran, reference scenarios.pdf written in PDF format)

{com}. 
. 
. 
. ****
. * daily cases, reference scenario, 2021
. 
. twoway ///
> (line DayCasMeSmA00S00 date, sort lcolor(cyan) lwidth(thick)) /// 1 "JOHN"
> (line DayCasFOREA01S00 date, sort lcolor(red) lpattern(tight_dot) lwidth(vthick)) /// 2 "DELP" Forecast only
> (line DayCasMeSmA01S00 date, sort lcolor(red)) /// 3 "DELP"
> (line DayCasFOREA05S00 date, sort lcolor(green) lpattern(tight_dot) lwidth(vthick)) /// 4 "SRIV" Forecast only
> (line DayCasMeSmA05S00 date, sort lcolor(green)) /// 5 "SRIV"
> if date >= td(01jan2021) ///
> , xtitle(Date) xlabel(#$monthspast01jan2021merge, format(%tdYY-NN-DD) labsize(small)) xlabel(, grid) ///
> xlabel(, angle(forty_five)) ylabel(, format(%9.0fc) labsize(small))  ylabel(, labsize(small) angle(horizontal)) ///
> ytitle(Daily cases) title("COVID-19 daily cases, $country", size(medium)) /// 
> xscale(lwidth(vthin) lcolor(gray*.2)) yscale(lwidth(vthin) lcolor(gray*.2)) legend(region(lcolor(none))) legend(bexpand) ///
> legend(order(1 "JOHN cases" 3 "DELP cases" 5 "SRIV cases") size(small) row(1)) ///
> subtitle("2021 on, reference scenarios", size(small)) 
{res}{txt}
{com}. 
. graph export "graph 22b COVID-19 daily cases, $country, reference scenarios.pdf", replace
{txt}(file /Users/farshadpourmalek/Downloads/covir2-main/20220506/code/merge/graph 22b COVID-19 daily cases, Iran, reference scenarios.pdf written in PDF format)

{com}. 
. 
. 
. ****
. * daily cases or infections, reference scenarios, 2021, CI
. 
. twoway ///
> (line DayCasMeRaA00S00 date, sort lcolor(cyan) lwidth(thick)) /// 1 JOHN
> (line DayCasMeRaA01S00 date, sort lcolor(red)) /// 2 "DELP" mean
> (line DayCasLoRaA01S00 date, sort lcolor(red) lpattern(dash)) /// 3 "DELP" lower
> (line DayCasUpRaA01S00 date, sort lcolor(red) lpattern(dash)) /// 4 "DELP" upper
> (line DayINFMeSmA02S01 date, sort lcolor(black)) /// 5 IHME mean
> (line DayINFLoSmA02S01 date, sort lcolor(black) lpattern(dash)) /// 6 IHME lower
> (line DayINFUpSmA02S01 date, sort lcolor(black) lpattern(dash)) /// 7 IHME upper
> (line DayINFMeRaA03S02 date, sort lcolor(magenta)) /// 8 IMPE mean
> (line DayINFLoSmA03S02 date, sort lcolor(magenta) lpattern(dash)) /// 9 IMPE lower
> (line DayINFUpSmA03S02 date, sort lcolor(magenta) lpattern(dash)) /// 10 IMPE upper
> (line DayCasMeRaA05S00 date, sort lcolor(green)) /// 11 SRIV mean
> (line DayCasLoRaA05S00 date, sort lcolor(green) lpattern(dash)) /// 12 SRIV lower
> (line DayCasUpRaA05S00 date, sort lcolor(green) lpattern(dash)) /// 13 SRIV upper
> if date >= td(01jan2021) ///
> , xtitle(Date) xlabel(#$monthspast01jan2021merge, format(%tdYY-NN-DD) labsize(small)) xlabel(, grid) ///
> xlabel(, angle(forty_five)) ylabel(, format(%9.0fc) labsize(small)) ylabel(, labsize(small) angle(horizontal)) ///
> ytitle(Daily cases or infections) title("COVID-19 daily cases or infections, $country", size(medium)) ///
> xscale(lwidth(vthin) lcolor(gray*.2)) yscale(lwidth(vthin) lcolor(gray*.2)) legend(region(lcolor(none))) legend(bexpand) ///
> legend(order(1 "JOHN cases" 2 "DELP cases" 5 "IHME infections" 8 "IMPE infections" ///
> 11 "SRIV cases") size(small) row(2)) /// 
> subtitle("2021 on, reference scenarios with uncertainty", size(small)) ///
> 
{res}{txt}
{com}. graph export "graph 23 COVID-19 daily cases, $country, reference scenarios, CI.pdf", replace
{txt}(file /Users/farshadpourmalek/Downloads/covir2-main/20220506/code/merge/graph 23 COVID-19 daily cases, Iran, reference scenarios, CI.pdf written in PDF format)

{com}. 
. 
. 
. ****
. * daily cases or infections, full scenarios, with uncertainty, 2021
. 
. twoway ///
> (line DayCasMeRaA00S00 date, sort lcolor(cyan) lwidth(thick)) /// 1 JOHN
> (line DayCasMeRaA01S00 date, sort lcolor(red)) /// 2 "DELP" mean
> (line DayCasLoRaA01S00 date, sort lcolor(red) lpattern(dash)) /// 3 "DELP" lower
> (line DayCasUpRaA01S00 date, sort lcolor(red) lpattern(dash)) /// 4 "DELP" upper
> (line DayINFMeSmA02S01 date, sort lcolor(black)) /// 5 IHME reference mean
> (line DayINFLoSmA02S01 date, sort lcolor(black) lpattern(dash)) /// 6 IHME reference lower
> (line DayINFUpSmA02S01 date, sort lcolor(black) lpattern(dash)) /// 7 IHME reference upper
> (line DayINFMeSmA02S02 date, sort lcolor(black) lwidth(thick) lpattern(tight_dot)) /// 8 IHME better mean
> (line DayINFMeRaA03S02 date, sort lcolor(magenta)) /// 9 IMPE reference mean
> (line DayINFLoSmA03S02 date, sort lcolor(magenta) lpattern(dash)) /// 10 IMPE reference lower
> (line DayINFUpSmA03S02 date, sort lcolor(magenta) lpattern(dash)) /// 11 IMPE reference upper
> (line DayINFMeRaA03S01 date, sort lcolor(magenta) lwidth(thick) lpattern(tight_dot)) /// 12 IMPE better mean
> (line DayINFMeRaA03S03 date, sort lcolor(magenta) lwidth(thick) lpattern(tight_dot)) /// 13 IMPE worse mean
> (line DayCasMeRaA05S00 date, sort lcolor(green)) /// 14 SRIV mean
> (line DayCasLoRaA05S00 date, sort lcolor(green) lpattern(dash)) /// 15 SRIV lower
> (line DayCasUpRaA05S00 date, sort lcolor(green) lpattern(dash)) /// 16 SRIV upper
> if date >= td(01jan2021) ///
> , xtitle(Date) xlabel(#$monthspast01jan2021merge, format(%tdYY-NN-DD) labsize(small)) xlabel(, grid) ///
> xlabel(, angle(forty_five)) ylabel(, format(%9.0fc) labsize(small)) ylabel(, labsize(small) angle(horizontal)) ///
> ytitle(Daily cases or infections) title("COVID-19 daily cases or infections, $country", size(medium)) ///
> xscale(lwidth(vthin) lcolor(gray*.2)) yscale(lwidth(vthin) lcolor(gray*.2)) legend(region(lcolor(none))) legend(bexpand) ///
> legend(order(1 "JOHN cases" 2 "DELP cases" 5 "IHME reference, mean" 6 "IHME ref, uncertainty" 8 "IHME better" ///
> 9 "IMPE reference, mean " 10 "IMPE ref, uncertainty" 12 "IMPE better and worse" ///
> 14 "SRIV ref, mean") size(small) row(4)) ///
> subtitle("2021 on, full scenarios, with uncertainty; IHME & IMPE: infections", size(small))
{res}{txt}
{com}. 
. graph export "graph 23 COVID-19 daily cases, $country, full scenarios, CI.pdf", replace
{txt}(file /Users/farshadpourmalek/Downloads/covir2-main/20220506/code/merge/graph 23 COVID-19 daily cases, Iran, full scenarios, CI.pdf written in PDF format)

{com}. 
. 
. 
. ****
. * daily infections, reference scenario with uncertainty, IHME, 2021
. 
. twoway ///
> (line DayCasMeRaA00S00 date, sort lcolor(cyan) lwidth(thick)) /// 1 JOHN
> (line DayINFMeSmA02S01 date, sort lcolor(black)) /// 2 IHME reference mean
> (line DayINFLoSmA02S01 date, sort lcolor(green) lpattern(dash)) /// 3 IHME reference lower
> (line DayINFUpSmA02S01 date, sort lcolor(red) lpattern(dash)) /// 4 IHME reference upper
> if date >= td(01jan2021) ///
> , xtitle(Date) xlabel(#$monthspast01jan2021merge, format(%tdYY-NN-DD) labsize(small)) xlabel(, grid) ///
> xlabel(, angle(forty_five)) ylabel(, format(%9.0fc) labsize(small)) ylabel(, labsize(small) angle(horizontal)) ///
> ytitle(Daily cases or infections) title("COVID-19 daily cases JOHN, and infections IHME, $country", size(medium)) ///
> xscale(lwidth(vthin) lcolor(gray*.2)) yscale(lwidth(vthin) lcolor(gray*.2)) legend(region(lcolor(none))) legend(bexpand) ///
> legend(order(1 "JOHN cases" 2 "IHME reference, mean" 3 "IHME reference, lower" 4 "IHME reference, upper") size(small) row(2)) ///
> subtitle("2021 on, IHME infections reference scenario with uncertainty", size(small)) ///
> note("Uncertainty limits: dashed (– – –) curves", size(small))
{res}{txt}
{com}. 
. graph export "graph 24 COVID-19 daily cases, $country, reference scenario with uncertainty, IHME.pdf", replace
{txt}(file /Users/farshadpourmalek/Downloads/covir2-main/20220506/code/merge/graph 24 COVID-19 daily cases, Iran, reference scenario with uncertainty, IHME.pdf written in PDF format)

{com}. 
. 
. 
. 
. ****
. * daily infections, all scenarios, IHME, 2021
. 
. twoway ///
> (line DayINFMeSmA02S01 date, sort lcolor(black) lwidth(medthick)) ///
> (line DayINFMeSmA02S02 date, sort lcolor(blue)) ///
> (line DayINFMeSmA02S03 date, sort lcolor(green)) /// 
> if date >= td(01jan2021) ///
> , xtitle(Date) xlabel(#$monthspast01jan2021merge, format(%tdYY-NN-DD) labsize(small)) xlabel(, grid) xlabel(, grid) ///
> xlabel(, angle(forty_five)) ylabel(, format(%12.0fc) labsize(small))  ylabel(, labsize(small) angle(horizontal)) ///
> ytitle(Daily infections) title("COVID-19 daily infections, $country, IHME, all scenarios", size(medium)) ///
> xscale(lwidth(vthin) lcolor(gray*.2)) yscale(lwidth(vthin) lcolor(gray*.2)) legend(region(lcolor(none))) legend(bexpand) ///
> legend(order(1 "Reference" 2 "Masks" 3 "Third dose") rows(1))
{res}{txt}
{com}. 
. graph export "graph 25 1 COVID-19 daily cases, $country, all scenarios, IHME.pdf", replace
{txt}(file /Users/farshadpourmalek/Downloads/covir2-main/20220506/code/merge/graph 25 1 COVID-19 daily cases, Iran, all scenarios, IHME.pdf written in PDF format)

{com}. 
. 
. 
. ****
. * daily infections, reference scenario with uncertainty, IMPE, 2021
. 
. twoway ///
> (line DayCasMeRaA00S00 date, sort lcolor(cyan) lwidth(thick)) /// 1 JOHN
> (line DayINFMeRaA03S02 date, sort lcolor(black)) /// 2 IMPE reference mean
> (line DayINFLoSmA03S02 date, sort lcolor(green) lpattern(dash)) /// 3 IMPE reference lower
> (line DayINFUpSmA03S02 date, sort lcolor(red) lpattern(dash)) /// 4 IMPE reference upper
> if date >= td(01jan2021) ///
> , xtitle(Date) xlabel(#$monthspast01jan2021merge, format(%tdYY-NN-DD) labsize(small)) xlabel(, grid) ///
> xlabel(, angle(forty_five)) ylabel(, format(%9.0fc) labsize(small)) ylabel(, labsize(small) angle(horizontal)) ///
> ytitle(Daily cases or infections) title("COVID-19 daily cases JOHN, and infections IMPE, $country", size(medium)) ///
> xscale(lwidth(vthin) lcolor(gray*.2)) yscale(lwidth(vthin) lcolor(gray*.2)) legend(region(lcolor(none))) legend(bexpand) ///
> legend(order(1 "JOHN cases" 2 "IMPE reference, mean" 3 "IMPE reference, lower" 4 "IMPE reference, upper") size(small) row(2)) ///
> subtitle("2021 on, IMPE infections reference scenario with uncertainty", size(small))  ///
> note("Uncertainty limits: dashed (– – –) curves", size(small))
{res}{txt}
{com}. 
. graph export "graph 26 COVID-19 daily cases, $country, reference scenario with uncertainty, IMPE.pdf", replace
{txt}(file /Users/farshadpourmalek/Downloads/covir2-main/20220506/code/merge/graph 26 COVID-19 daily cases, Iran, reference scenario with uncertainty, IMPE.pdf written in PDF format)

{com}. 
. 
. 
. ****
. * daily infections, 2 scenarios, IMPE 
. 
. twoway ///
> (line DayCasMeRaA00S00 date, sort lcolor(cyan) lwidth(thick)) /// 1 JOHN
> (line DayINFMeRaA03S02 date, sort lcolor(black)) /// 2 IMPE reference mean
> (line DayINFMeRaA03S01 date, sort lcolor(green) lwidth(thick) lpattern(tight_dot)) /// 3 IMPE better mean
> (line DayINFMeRaA03S03 date, sort lcolor(red) lwidth(thick) lpattern(tight_dot)) /// 4 IMPE worse mean
> (line DayINFUpSmA03S03 date, sort lcolor(red) lpattern(dash)) /// 5 IMPE worse upper
> if date >= td(01jan2021) ///
> , xtitle(Date) xlabel(#$monthspast01jan2021merge, format(%tdYY-NN-DD) labsize(small)) xlabel(, grid) ///
> xlabel(, angle(forty_five)) ylabel(, format(%9.0fc) labsize(small)) ylabel(, labsize(small) angle(horizontal)) ///
> ytitle(Daily cases or infections) title("COVID-19 daily JOHN, and infections IMPE, $country", size(medium)) ///
> xscale(lwidth(vthin) lcolor(gray*.2)) yscale(lwidth(vthin) lcolor(gray*.2)) legend(region(lcolor(none))) legend(bexpand) ///
> legend(order(1 "JOHN cases" 2 "IMPE reference, mean" 3 "IMPE better, mean" 4 "IMPE worse, mean" ///
> 5 "IMPE worse scenario, upper uncertainty limit") size(small) row(3)) ///
> subtitle("2021 on, 2 scenarios", size(small)) ///
> note("Better and worse scenarios: tight dot (|||||) curves; Uncertainty limits: dashed (– – –) curves", size(small))
{res}{txt}
{com}. 
. graph export "graph 27 COVID-19 daily cases, $country, 2 scenarios, IMPE.pdf", replace
{txt}(file /Users/farshadpourmalek/Downloads/covir2-main/20220506/code/merge/graph 27 COVID-19 daily cases, Iran, 2 scenarios, IMPE.pdf written in PDF format)

{com}. 
. 
. 
. 
. ****
. * daily estimated infections to reported cases IHME, IMPE, all time
. 
. 
. gen DayITCMeSmA02S01 =  DayINFMeSmA02S01 / DayCasMeRaA00S00
{txt}(167 missing values generated)

{com}. 
. label var DayITCMeSmA02S01  "Daily Infections IHME to cases JOHN"
{txt}
{com}. 
. gen DayITCMeRaA03S02 =  DayINFMeRaA03S02 / DayCasMeRaA00S00
{txt}(167 missing values generated)

{com}. 
. label var DayITCMeRaA03S02  "Daily Infections IMPE to cases JOHN"
{txt}
{com}. 
. 
. twoway ///
> (line DayITCMeSmA02S01 date, sort lcolor(black)) /// 1 "IHME"
> (line DayITCMeRaA03S02 date, sort lcolor(magenta)) /// 2 "IMPE"
> if date >= td(01jan2020) ///
> , xtitle(Date) xlabel(#$monthspast01jan2020merge, format(%tdYY-NN-DD) labsize(small)) xlabel(, grid) xlabel(, grid) ///
> xlabel(, angle(forty_five)) ylabel(, format(%15.0fc) labsize(small))  ylabel(, labsize(small) angle(horizontal)) ///
> ytitle(Daily estimated infections to reported cases) title("COVID-19 daily estimated infections to reported cases, $country", size(medium)) /// 
> xscale(lwidth(vthin) lcolor(gray*.2)) yscale(lwidth(vthin) lcolor(gray*.2)) legend(region(lcolor(none))) legend(bexpand) ///
> legend(order(1 "IHME" 2 "IMPE" 3) size(small) row(1)) ///
> subtitle("reference scenarios", size(small)) 
{res}{txt}
{com}. 
. graph export "graph 28 C19 daily estimated infections to reported cases, $country, reference scenarios.pdf", replace
{txt}(file /Users/farshadpourmalek/Downloads/covir2-main/20220506/code/merge/graph 28 C19 daily estimated infections to reported cases, Iran, reference scenarios.pdf written in PDF format)

{com}. 
. 
. 
. 
. ****
. * daily estimated infections to reported cases IHME, IMPE, 2021
. 
. 
. * smooth Infections to cases ratio of IHME and IMPE
. 
. tsset date, daily   
{res}{txt}{col 9}time variable:  {res}{col 25}date, 01Jan2020 to 01Sep2022
{txt}{col 17}delta:  {res}1 day
{txt}
{com}. 
. 
. foreach var of varlist ///
> DayITCMeSmA02S01 DayITCMeRaA03S02 {c -(}
{txt}  2{com}. 
. 
. tssmooth ma `var'_window = `var', window(3 1 3)
{txt}  3{com}. 
. tssmooth ma `var'sm = `var'_window, weights( 1 2 3 <4> 3 2 1) replace
{txt}  4{com}. 
. drop `var'_window
{txt}  5{com}. 
. {c )-}
{txt}The smoother applied was
{res}{p 5 5 5}(1/7)*[x(t-3) + x(t-2) + x(t-1) + 1*x(t) + x(t+1) + x(t+2) + x(t+3)]; x(t)= DayITCMeSmA02S01{p_end}
{txt}The smoother applied was
{res}{p 5 5 5}(1/16)*[1*x(t-3) + 2*x(t-2) + 3*x(t-1) + 4*x(t) + 3*x(t+1) + 2*x(t+2) + ...; x(t)= DayITCMeSmA02S01_window
{txt}The smoother applied was
{res}{p 5 5 5}(1/7)*[x(t-3) + x(t-2) + x(t-1) + 1*x(t) + x(t+1) + x(t+2) + x(t+3)]; x(t)= DayITCMeRaA03S02{p_end}
{txt}The smoother applied was
{res}{p 5 5 5}(1/16)*[1*x(t-3) + 2*x(t-2) + 3*x(t-1) + 4*x(t) + 3*x(t+1) + 2*x(t+2) + ...; x(t)= DayITCMeRaA03S02_window
{txt}
{smcl}
{com}. *
. 
. tsset, clear
{txt}
{com}. 
. ssc install labutil2
{txt}checking {hilite:labutil2} consistency and verifying not already installed...
all files already exist and are up to date.

{com}. 
. labvars DayITCMeSmA02S01sm DayITCMeRaA03S02sm ,names
{txt}
{com}. 
.           
. qui summ DayITCMeSmA02S01sm if date >= td(01jan2021) , detail
{txt}
{com}. 
. gen DayITCMeSmA02S01sm_median = r(p50)
{txt}
{com}. 
. replace DayITCMeSmA02S01sm_median = round(DayITCMeSmA02S01sm_median)
{txt}(975 real changes made)

{com}. 
. local DayITCMeSmA02S01sm_median = DayITCMeSmA02S01sm_median
{txt}
{com}. 
. 
. qui summ DayITCMeRaA03S02sm if date >= td(01jan2021) , detail
{txt}
{com}. 
. gen DayITCMeRaA03S02sm_median = r(p50)
{txt}
{com}. 
. replace DayITCMeRaA03S02sm_median = round(DayITCMeRaA03S02sm_median)
{txt}(975 real changes made)

{com}. 
. local DayITCMeRaA03S02sm_median = DayITCMeRaA03S02sm_median
{txt}
{com}. 
. twoway ///
> (line DayITCMeSmA02S01 date, sort lcolor(black*0.2)) /// 1 "IHME"
> (line DayITCMeRaA03S02 date, sort lcolor(magenta*0.2)) /// 2 "IMPE"
> (line DayITCMeSmA02S01sm date, sort lcolor(black) lwidth(thick)) /// 3 "IHME"
> (line DayITCMeRaA03S02sm date, sort lcolor(magenta) lwidth(thick)) /// 4 "IMPE"
> (line DayITCMeSmA02S01sm_median date, sort lcolor(black) lwidth(thin) lpattern(dash)) /// 5 "IHME"
> (line DayITCMeRaA03S02sm_median date, sort lcolor(magenta) lwidth(thin) lpattern(dash)) /// 6 "IMPE"
> if date >= td(01jan2021) ///
> , xtitle(Date) xlabel(#$monthspast01jan2021merge, format(%tdYY-NN-DD) labsize(small)) xlabel(, grid) xlabel(, grid) ///
> xlabel(, angle(forty_five)) ylabel(, format(%15.0fc) labsize(small))  ylabel(, labsize(small) angle(horizontal)) ///
> ytitle(Daily estimated infections to reported cases) title("COVID-19 daily estimated infections to reported cases, $country", size(medium)) /// 
> xscale(lwidth(vthin) lcolor(gray*.2)) yscale(lwidth(vthin) lcolor(gray*.2)) legend(region(lcolor(none))) legend(bexpand) ///
> legend(order(1 "IHME" 2 "IMPE" 3 "IHME smooth" 4 "IMPE smooth" 5 "IHME smooth meadian" 6 "IMPE smooth meadian") size(small) row(2)) ///
> subtitle("reference scenarios", size(small)) ///
> note("IHME smooth median 2021 on = `DayITCMeSmA02S01sm_median'; IMPE smooth median 2021 on = `DayITCMeRaA03S02sm_median'")
{res}{txt}
{com}. 
. graph export "graph 29 C19 daily estimated infections to reported cases, $country, reference scenarios 2021.pdf", replace
{txt}(file /Users/farshadpourmalek/Downloads/covir2-main/20220506/code/merge/graph 29 C19 daily estimated infections to reported cases, Iran, reference scenarios 2021.pdf written in PDF format)

{com}. 
. 
. 
. 
. 
. 
. *****************
. 
. * total deaths (graph numbers start with 31)
. 
. 
. ****
. * total deaths, reference scenario, all time
. 
. twoway ///
> (line TotDeaMeRaA00S00 date, sort lcolor(cyan) lwidth(vthick)) /// 1 "JOHN"
> (line TotDeaMeRaA01S00 date, sort lcolor(red)) /// 2 "DELP"
> (line TotDeaMeSmA02S01 date, sort lcolor(black)) /// 3 "IHME"
> (line TotDeaMeRaA03S02 date, sort lcolor(magenta)) /// 4 "IMPE"
> (line TotDeaMeRaA05S00 date, sort lcolor(green)) /// 5 "SRIV"
> if date >= td(01jan2020) ///
> , xtitle(Date) xlabel(#$monthspast01jan2020merge, format(%tdYY-NN-DD) labsize(small)) xlabel(, grid) ///
> xlabel(, angle(forty_five)) ylabel(, format(%9.0fc) labsize(small))  ylabel(, labsize(small) angle(horizontal)) ///
> ytitle(Total deaths) title("COVID-19 total deaths, $country", size(medium)) /// 
> xscale(lwidth(vthin) lcolor(gray*.2)) yscale(lwidth(vthin) lcolor(gray*.2)) legend(region(lcolor(none))) legend(bexpand) ///
> legend(order(1 "JOHN" 2 "DELP" 3 "IHME" 4 "IMPE" 5 "SRIV") size(small) row(1)) ///
> subtitle("reference scenarios", size(small)) 
{res}{txt}
{com}. 
. graph export "graph 31a COVID-19 total deaths, $country, reference scenarios, all time.pdf", replace
{txt}(file /Users/farshadpourmalek/Downloads/covir2-main/20220506/code/merge/graph 31a COVID-19 total deaths, Iran, reference scenarios, all time.pdf written in PDF format)

{com}. 
. 
. 
. ****
. * total deaths, reference scenario, all time, with IHME excess mortality 
. 
. twoway ///
> (line TotDeaMeRaA00S00 date, sort lcolor(cyan) lwidth(vthick)) /// 1 "JOHN"
> (line TotDeaMeRaA01S00 date, sort lcolor(red)) /// 2 "DELP"
> (line TotDeaMeSmA02S01 date, sort lcolor(black)) /// 3 "IHME"
> (line TotDeXMeSmA02S01 date, sort lcolor(black) lpattern(dash)) /// 4 "IHME excess"
> (line TotDeaMeRaA03S02 date, sort lcolor(magenta)) /// 5 "IMPE"
> (line TotDeaMeRaA05S00 date, sort lcolor(green)) /// 6 "SRIV"
> if date >= td(01jan2020) ///
> , xtitle(Date) xlabel(#$monthspast01jan2020merge, format(%tdYY-NN-DD) labsize(small)) xlabel(, grid) ///
> xlabel(, angle(forty_five)) ylabel(, format(%9.0fc) labsize(small))  ylabel(, labsize(small) angle(horizontal)) ///
> ytitle(Total deaths) title("COVID-19 total deaths, $country", size(medium)) /// 
> xscale(lwidth(vthin) lcolor(gray*.2)) yscale(lwidth(vthin) lcolor(gray*.2)) legend(region(lcolor(none))) legend(bexpand) ///
> legend(order(1 "JOHN" 2 "DELP" 3 "IHME" 4 "IHME excess" 5 "IMPE" 6 "SRIV") size(small) row(1)) ///
> subtitle("reference scenarios", size(small)) 
{res}{txt}
{com}. 
. graph export "graph 31b COVID-19 total deaths, $country, reference scenarios, all time.pdf", replace
{txt}(file /Users/farshadpourmalek/Downloads/covir2-main/20220506/code/merge/graph 31b COVID-19 total deaths, Iran, reference scenarios, all time.pdf written in PDF format)

{com}. 
. 
. 
. ****
. * total deaths, reference scenario, 2021
. 
. twoway ///
> (line TotDeaMeRaA00S00 date, sort lcolor(cyan) lwidth(vthick)) /// 1 "JOHN"
> (line TotDeaMeRaA01S00 date, sort lcolor(red)) /// 2 "DELP"
> (line TotDeaMeSmA02S01 date, sort lcolor(black)) /// 3 "IHME"
> (line TotDeaMeRaA03S02 date, sort lcolor(magenta)) /// 4 "IMPE"
> (line TotDeaMeRaA05S00 date, sort lcolor(green)) /// 5 "SRIV"
> if date >= td(01jan2021) ///
> , xtitle(Date) xlabel(#$monthspast01jan2021merge, format(%tdYY-NN-DD) labsize(small)) xlabel(, grid) ///
> xlabel(, angle(forty_five)) ylabel(, format(%9.0fc) labsize(small)) ylabel(, labsize(small) angle(horizontal)) ///
> ytitle(Total deaths) title("COVID-19 total deaths, $country", size(medium)) /// 
> xscale(lwidth(vthin) lcolor(gray*.2)) yscale(lwidth(vthin) lcolor(gray*.2)) legend(region(lcolor(none))) legend(bexpand) ///
> legend(order(1 "JOHN" 2 "DELP" 3 "IHME" 4 "IMPE" 5 "SRIV") size(small) row(1)) ///
> subtitle("2021 on, reference scenarios", size(small)) 
{res}{txt}
{com}. 
. graph export "graph 32a COVID-19 total deaths, $country, reference scenarios.pdf", replace
{txt}(file /Users/farshadpourmalek/Downloads/covir2-main/20220506/code/merge/graph 32a COVID-19 total deaths, Iran, reference scenarios.pdf written in PDF format)

{com}. 
. 
. 
. ****
. * total deaths, reference scenario, 2021, with IHME excess mortality 
. 
. twoway ///
> (line TotDeaMeRaA00S00 date, sort lcolor(cyan) lwidth(vthick)) /// 1 "JOHN"
> (line TotDeaMeRaA01S00 date, sort lcolor(red)) /// 2 "DELP"
> (line TotDeaMeSmA02S01 date, sort lcolor(black)) /// 3 "IHME"
> (line TotDeXMeSmA02S01 date, sort lcolor(black) lpattern(dash)) /// 4 "IHME excess"
> (line TotDeaMeRaA03S02 date, sort lcolor(magenta)) /// 5 "IMPE"
> (line TotDeaMeRaA05S00 date, sort lcolor(green)) /// 6 "SRIV"
> if date >= td(01jan2021) ///
> , xtitle(Date) xlabel(#$monthspast01jan2021merge, format(%tdYY-NN-DD) labsize(small)) xlabel(, grid) ///
> xlabel(, angle(forty_five)) ylabel(, format(%9.0fc) labsize(small)) ylabel(, labsize(small) angle(horizontal)) ///
> ytitle(Total deaths) title("COVID-19 total deaths, $country", size(medium)) /// 
> xscale(lwidth(vthin) lcolor(gray*.2)) yscale(lwidth(vthin) lcolor(gray*.2)) legend(region(lcolor(none))) legend(bexpand) ///
> legend(order(1 "JOHN" 2 "DELP" 3 "IHME" 4 "IHME excess" 5 "IMPE" 6 "SRIV") size(small) row(1)) ///
> subtitle("2021 on, reference scenarios", size(small)) 
{res}{txt}
{com}. 
. graph export "graph 32b COVID-19 total deaths, $country, reference scenarios.pdf", replace
{txt}(file /Users/farshadpourmalek/Downloads/covir2-main/20220506/code/merge/graph 32b COVID-19 total deaths, Iran, reference scenarios.pdf written in PDF format)

{com}. 
. 
. 
. ****
. * total deaths, reference scenario, CI, 2021
. 
. twoway ///
> (line TotDeaMeRaA00S00 date, sort lcolor(cyan) lwidth(vthick)) /// 1 JOHN
> (line TotDeaMeRaA01S00 date, sort lcolor(red)) /// 2 DELP mean
> (line TotDeaLoRaA01S00 date, sort lcolor(red) lpattern(dash)) /// 3 DELP lower
> (line TotDeaUpRaA01S00 date, sort lcolor(red) lpattern(dash)) /// 4 DELP upper
> (line TotDeaMeSmA02S01 date, sort lcolor(black)) /// 5 IHME mean
> (line TotDeaLoSmA02S01 date, sort lcolor(black) lpattern(dash)) /// 6 IHME lower
> (line TotDeaUpSmA02S01 date, sort lcolor(black) lpattern(dash)) /// 7 IHME upper
> (line TotDeaMeRaA03S02 date, sort lcolor(magenta)) /// 8 IMPE mean
> (line TotDeaLoRaA03S02 date, sort lcolor(magenta) lpattern(dash)) /// 9 IMPE lower
> (line TotDeaUpRaA03S02 date, sort lcolor(magenta) lpattern(dash)) /// 10 IMPE upper
> (line TotDeaMeRaA05S00 date, sort lcolor(green)) /// 11 SRIV mean
> (line TotDeaLoRaA05S00 date, sort lcolor(green) lpattern(dash)) /// 12 SRIV lower
> (line TotDeaUpRaA05S00 date, sort lcolor(green) lpattern(dash)) /// 13 SRIV upper
> if date >= td(01jan2021) ///
> , xtitle(Date) xlabel(#$monthspast01jan2021merge, format(%tdYY-NN-DD) labsize(small)) xlabel(, grid) ///
> xlabel(, angle(forty_five)) ylabel(, format(%9.0fc) labsize(small))  ylabel(, labsize(small) angle(horizontal)) ///
> ytitle(Total deaths) title("COVID-19 total deaths, $country", size(medium)) ///
> xscale(lwidth(vthin) lcolor(gray*.2)) yscale(lwidth(vthin) lcolor(gray*.2)) legend(region(lcolor(none))) legend(bexpand) ///
> legend(order(1 "JOHN" 2 "DELP" 5 "IHME" 8 "IMPE" 11 "SRIV") size(small) row(1)) ///
> note("Uncertainty limits: dashed curves") ///
> subtitle("2021 on, reference scenarios with uncertainty", size(small)) 
{res}{txt}
{com}. 
. graph export "graph 33 COVID-19 total deaths, $country, reference scenarios, CI.pdf", replace
{txt}(file /Users/farshadpourmalek/Downloads/covir2-main/20220506/code/merge/graph 33 COVID-19 total deaths, Iran, reference scenarios, CI.pdf written in PDF format)

{com}. 
. 
. 
. 
. *****************
. 
. * total cases or infections (graph numbers start with 41)
. 
. 
. ****
. * total cases or infections, reference scenario, all time
. 
. twoway ///
> (line TotCasMeRaA00S00 date, sort lcolor(cyan) lwidth(vthick)) /// 1 "JOHN"
> (line TotCasMeRaA01S00 date, sort lcolor(red)) /// 2 "DELP"
> (line TotINFMeSmA02S01 date, sort lcolor(black)) /// 3 "IHME"
> (line TotINFMeRaA03S02 date, sort lcolor(magenta)) /// 4 "IMPE"
> (line TotCasMeRaA05S00 date, sort lcolor(green)) /// 5 "SRIV"
> if date >= td(01jan2020) ///
> , xtitle(Date) xlabel(#$monthspast01jan2020merge, format(%tdYY-NN-DD) labsize(small)) xlabel(, grid) ///
> xlabel(, angle(forty_five)) ylabel(, format(%12.0fc) labsize(small))  ylabel(, labsize(small) angle(horizontal)) ///
> ytitle(Total cases or infections) title("COVID-19 total cases or infections, $country", size(medium)) /// 
> xscale(lwidth(vthin) lcolor(gray*.2)) yscale(lwidth(vthin) lcolor(gray*.2)) legend(region(lcolor(none))) legend(bexpand) ///
> legend(order(1 "JOHN cases" 2 "DELP cases" 3 "IHME infections" 4 "IMPE infections" ///
> 5 "SRIV cases") size(small) row(2)) ///
> subtitle("reference scenarios", size(small)) 
{res}{txt}
{com}. 
. graph export "graph 41 COVID-19 total cases, $country, reference scenarios, all time.pdf", replace
{txt}(file /Users/farshadpourmalek/Downloads/covir2-main/20220506/code/merge/graph 41 COVID-19 total cases, Iran, reference scenarios, all time.pdf written in PDF format)

{com}. 
. 
. 
. ****
. * total cases or infections, reference scenario, 2021
. 
. twoway ///
> (line TotCasMeRaA00S00 date, sort lcolor(cyan) lwidth(vthick)) /// 1 "JOHN"
> (line TotCasMeRaA01S00 date, sort lcolor(red)) /// 2 "DELP"
> (line TotINFMeSmA02S01 date, sort lcolor(black)) /// 3 "IHME"
> (line TotINFMeRaA03S02 date, sort lcolor(magenta)) /// 4 "IMPE"
> (line TotCasMeRaA05S00 date, sort lcolor(green)) /// 5 "SRIV"
> if date >= td(01jan2021) ///
> , xtitle(Date) xlabel(#$monthspast01jan2021merge, format(%tdYY-NN-DD) labsize(small)) xlabel(, grid) ///
> xlabel(, angle(forty_five)) ylabel(, format(%12.0fc) labsize(small))  ylabel(, labsize(small) angle(horizontal)) ///
> ytitle(Total cases or infections) title("COVID-19 total cases or infections, $country", size(medium)) /// 
> xscale(lwidth(vthin) lcolor(gray*.2)) yscale(lwidth(vthin) lcolor(gray*.2)) legend(region(lcolor(none))) legend(bexpand) ///
> legend(order(1 "JOHN cases" 2 "DELP cases" 3 "IHME infections" 4 "IMPE infections" ///
> 5 "SRIV cases") size(small) row(2)) ///
> subtitle("2021 on, reference scenarios", size(small)) 
{res}{txt}
{com}. 
. graph export "graph 42 COVID-19 total cases, $country, reference scenarios.pdf", replace
{txt}(file /Users/farshadpourmalek/Downloads/covir2-main/20220506/code/merge/graph 42 COVID-19 total cases, Iran, reference scenarios.pdf written in PDF format)

{com}. 
. 
. 
. ****
. * total cases or infections, reference scenario, CI, 2021
. 
. twoway ///
> (line TotCasMeRaA00S00 date, sort lcolor(cyan) lwidth(vthick)) /// 1 JOHN
> (line TotCasMeRaA01S00 date, sort lcolor(red)) /// 2 "DELP"
> (line TotCasLoRaA01S00 date, sort lcolor(red) lpattern(dash)) /// 3 "DELP"
> (line TotCasUpRaA01S00 date, sort lcolor(red) lpattern(dash)) /// 4 "DELP"
> (line TotINFMeSmA02S01 date, sort lcolor(black)) /// 5 IHME mean
> (line TotINFLoSmA02S01 date, sort lcolor(black) lpattern(dash)) /// 6 IHME lower
> (line TotINFUpSmA02S01 date, sort lcolor(black) lpattern(dash)) /// 7 IHME upper
> (line TotINFMeRaA03S02 date, sort lcolor(magenta)) /// 8 IMPE mean
> (line TotINFLoRaA03S02 date, sort lcolor(magenta) lpattern(dash)) /// 9 IMPE lower
> (line TotINFUpRaA03S02 date, sort lcolor(magenta) lpattern(dash)) /// 10 IMPE upper
> (line TotCasMeRaA05S00 date, sort lcolor(green)) /// 8 SRIV mean
> (line TotCasLoRaA05S00 date, sort lcolor(green) lpattern(dash)) /// 9 SRIV lower
> (line TotCasUpRaA05S00 date, sort lcolor(green) lpattern(dash)) /// 10 SRIV upper
> if date >= td(01jan2021) ///
> , xtitle(Date) xlabel(`dates2021', format(%tdYY-NN-DD) labsize(small)) xlabel(, grid) ///
> xlabel(, angle(forty_five)) ylabel(, format(%12.0fc) labsize(small))  ylabel(, labsize(small) angle(horizontal)) ///
> ytitle(Total cases or infections) title("COVID-19 total cases or infections, $country", size(medium)) ///
> xscale(lwidth(vthin) lcolor(gray*.2)) yscale(lwidth(vthin) lcolor(gray*.2)) legend(region(lcolor(none))) legend(bexpand) ///
> legend(order(1 "JOHN cases" 2 "DELP cases" 5 "IHME infections" 8 "IMPE infections" ///
> 8 "SRIV cases") size(small) row(2)) ///
> subtitle("2021 on, reference scenarios with uncertainty", size(small)) ///
> note("Uncertainty limits: dashed curves")
{res}{txt}
{com}. 
. graph export "graph 43 COVID-19 total cases, $country, reference scenarios, CI.pdf", replace
{txt}(file /Users/farshadpourmalek/Downloads/covir2-main/20220506/code/merge/graph 43 COVID-19 total cases, Iran, reference scenarios, CI.pdf written in PDF format)

{com}. 
. 
. 
. ****************
. 
. * daily CFR / IFR (graph numbers start with 51)
. 
. 
. ****
. * CFR / IFR all studies, all time, reference scenarios, all time
. 
. twoway ///
> (line DayCfrMeRaA00S00 date, sort lcolor(cyan) lwidth(thick)) /// 1 "JOHN"
> (line DayCfrMeRaA01S00 date, sort lcolor(red)) /// 2 "DELP"
> (line infection_fatality_A02S01 date, sort lcolor(black)) /// 3 "IHME"
> (line DayIFRMeRaA03S02 date, sort lcolor(magenta)) /// 4 "IMPE"
> (line DayCfrMeRaA05S00 date, sort lcolor(green)) /// 5 "SRIV"
> if date >= td(01jan2020) ///
> , xtitle(Date) xlabel(#$monthspast01jan2020merge, format(%tdYY-NN-DD) labsize(small)) xlabel(, grid) ///
> xlabel(, angle(forty_five)) ylabel(, format(%12.0fc) labsize(small))  ylabel(, labsize(small) angle(horizontal)) ///
> ytitle(Daily CFR or IFR) title("COVID-19 daily CFR or IFR, $country", size(medium)) /// 
> xscale(lwidth(vthin) lcolor(gray*.2)) yscale(lwidth(vthin) lcolor(gray*.2)) legend(region(lcolor(none))) legend(bexpand) ///
> legend(order(1 "JOHN CFR" 2 "DELP CFR" 3 "IHME IFR" 4 "IMPE IFR" 5 "SRIV CFR") size(small) row(2)) ///
> subtitle("reference scenarios", size(small) color(white))
{res}{txt}
{com}. 
. graph export "graph 51 COVID-19 daily CFR, $country, reference scenarios, all time.pdf", replace
{txt}(file /Users/farshadpourmalek/Downloads/covir2-main/20220506/code/merge/graph 51 COVID-19 daily CFR, Iran, reference scenarios, all time.pdf written in PDF format)

{com}. 
. 
. 
. ****
. * cfr all studies, reference scenarios, 2021
. 
. twoway ///
> (line DayCfrMeRaA00S00 date, sort lcolor(cyan) lwidth(thick)) /// 1 "JOHN"
> (line DayCfrMeRaA01S00 date, sort lcolor(red)) /// 2 "DELP"
> (line infection_fatality_A02S01 date, sort lcolor(black)) /// 3 "IHME"
> (line DayIFRMeRaA03S02 date, sort lcolor(magenta)) /// 4 "IMPE"
> (line DayCfrMeRaA05S00 date, sort lcolor(green)) /// 5 "SRIV"
> if date >= td(01jan2021) ///
> , xtitle(Date) xlabel(#$monthspast01jan2021merge, format(%tdYY-NN-DD) labsize(small)) xlabel(, grid) ///
> xlabel(, angle(forty_five)) ylabel(, format(%12.0fc) labsize(small))  ylabel(, labsize(small) angle(horizontal)) ///
> ytitle(Daily CFR or IFR) title("COVID-19 daily CFR or IFR, $country", size(medium)) /// 
> xscale(lwidth(vthin) lcolor(gray*.2)) yscale(lwidth(vthin) lcolor(gray*.2)) legend(region(lcolor(none))) legend(bexpand) ///
> legend(order(1 "JOHN CFR" 2 "DELP CFR" 3 "IHME IFR" 4 "IMPE IFR" 5 "SRIV CFR") size(small) row(2)) ///
> subtitle("2021 on, reference scenarios", size(small))
{res}{txt}
{com}. 
. graph export "graph 52 COVID-19 daily CFR, $country, reference scenarios.pdf", replace
{txt}(file /Users/farshadpourmalek/Downloads/covir2-main/20220506/code/merge/graph 52 COVID-19 daily CFR, Iran, reference scenarios.pdf written in PDF format)

{com}. 
. 
. 
. 
. 
. ************************
. 
. * other outcomes (graph numbers start with 71)
. 
. 
. * all hospital-related outcomes, all time
. 
. twoway ///
> (line DayHosMeRaA01S00 date, sort lcolor(red) lwidth(thick)) /// 1 DELP Hospitalized (Daily Cases Active Hospitalized Mean DELP S0)
> (line DayVenMeRaA01S00 date, sort lcolor(red) lpattern(dash)  lwidth(thick)) /// 2 DELP Ventilated (Daily Cases Active Ventilated Mean DELP S0)
> (line DayBedMeSmA02S01 date, sort lcolor(black)) /// 3 IHME Bed need (Daily Beds needed Mean IHME S1)
> (line DayIcuMeSmA02S01 date, sort lcolor(green)) /// 4 IHME ICU need (Daily ICU beds needed Mean IHME S1)
> (line DayAdmMeSmA02S01 date, sort lcolor(yellow)) /// 5 IHME Admissions (Daily hospital admissions Mean IHME S1)
> (line DayHodMeRaA03S01 date, sort lcolor(magenta)) /// 6 IMPE Hosp demand (Daily hospital demand Mean A03 S01 )
> (line DayIcdMeRaA03S01 date, sort lcolor(magenta) lpattern(dash_dot)) /// 7 IMPE ICU demand (Daily ICU demand Mean A03 S01 )
> if date >= td(01jan2020) ///
> , xtitle(Date) xlabel(#$monthspast01jan2020merge, format(%tdYY-NN-DD) labsize(small)) xlabel(, grid) ///
> xlabel(, angle(forty_five)) ylabel(, format(%9.0fc) labsize(small))  ylabel(, labsize(small) angle(horizontal)) ///
> ytitle(Daily outcomes) title("COVID-19 daily hospital-related outcomes $country", size(medium)) ///
> xscale(lwidth(vthin) lcolor(gray*.2)) yscale(lwidth(vthin) lcolor(gray*.2)) legend(region(lcolor(none))) legend(bexpand) ///
> legend(order(1 "DELP Hospitalized" 2 "DELP Ventilated" 3 "IHME Bed need" 4 "IHME ICU need" ///
> 5 "IHME Admissions" 6 "IMPE Hosp demand" ///
> 7 "IMPE ICU demand") rows(4) size(small)) ///
> subtitle("reference scenarios", size(small) color(white)) 
{res}{txt}
{com}. 
. graph export "graph 71a COVID-19 hospital-related outcomes, all time.pdf", replace
{txt}(file /Users/farshadpourmalek/Downloads/covir2-main/20220506/code/merge/graph 71a COVID-19 hospital-related outcomes, all time.pdf written in PDF format)

{com}. 
. * ICU new of IHME retired
. 
. 
. 
. 
. * all hospital-related outcomes, all time
. 
. twoway ///
> (line DayHosMeRaA01S00 date, sort lcolor(red) lwidth(thick)) /// 1 DELP Hospitalized (Daily Cases Active Hospitalized Mean DELP S0)
> (line DayVenMeRaA01S00 date, sort lcolor(red) lpattern(dash)  lwidth(thick)) /// 2 DELP Ventilated (Daily Cases Active Ventilated Mean DELP S0)
> (line DayBedMeSmA02S01 date, sort lcolor(black)) /// 3 IHME Bed need (Daily Beds needed Mean IHME S1)
> (line DayIcuMeSmA02S01 date, sort lcolor(green)) /// 4 IHME ICU need (Daily ICU beds needed Mean IHME S1)
> (line DayAdmMeSmA02S01 date, sort lcolor(yellow)) /// 5 IHME Admissions (Daily hospital admissions Mean IHME S1)
> (line DayHodMeRaA03S01 date, sort lcolor(magenta)) /// 6 IMPE Hosp demand (Daily hospital demand Mean A03 S01 )
> (line DayIcdMeRaA03S01 date, sort lcolor(magenta) lpattern(dash_dot)) /// 7 IMPE ICU demand (Daily ICU demand Mean A03 S01 )
> (line DayBEDMeSmA02    date, sort lcolor(black) lpattern(dash)) /// 8
> (line DayICUMeSmA02    date, sort lcolor(cyan) lpattern(dash)) /// 9
> if date >= td(01jan2020) ///
> , xtitle(Date) xlabel(#$monthspast01jan2020merge, format(%tdYY-NN-DD) labsize(small)) xlabel(, grid) ///
> xlabel(, angle(forty_five)) ylabel(, format(%9.0fc) labsize(small))  ylabel(, labsize(small) angle(horizontal)) ///
> ytitle(Daily outcomes) title("COVID-19 daily hospital-related outcomes $country", size(medium)) ///
> xscale(lwidth(vthin) lcolor(gray*.2)) yscale(lwidth(vthin) lcolor(gray*.2)) legend(region(lcolor(none))) legend(bexpand) ///
> legend(order(1 "DELP Hospitalized" 2 "DELP Ventilated" 3 "IHME Bed need" 4 "IHME ICU need" ///
> 5 "IHME Admissions" 6 "IMPE Hosp demand" ///
> 7 "IMPE ICU demand" 8 "IHME All bed capcity" 9 "IHME ICU bed capacity") rows(4) size(small)) ///
> subtitle("reference scenarios", size(small) color(white)) 
{res}{txt}
{com}. 
. graph export "graph 71b COVID-19 hospital-related outcomes, all time.pdf", replace
{txt}(file /Users/farshadpourmalek/Downloads/covir2-main/20220506/code/merge/graph 71b COVID-19 hospital-related outcomes, all time.pdf written in PDF format)

{com}. 
. 
. 
. 
. 
. 
. * daily hospital-related outcomes, DELP, IHME, IMPE, wo IHME Bed need, IMPE Hosp demand
. 
. twoway ///
> (line DayHosMeRaA01S00 date, sort lcolor(red) lwidth(thick)) /// 1 DELP Hospitalized (Daily Cases Active Hospitalized Mean DELP S0)
> (line DayVenMeRaA01S00 date, sort lcolor(red) lpattern(dash)  lwidth(thick)) /// 2 DELP Ventilated (Daily Cases Active Ventilated Mean DELP S0)
> (line DayIcuMeSmA02S01 date, sort lcolor(green)) /// 3 IHME ICU need (Daily ICU beds needed Mean IHME S1)
> (line DayAdmMeSmA02S01 date, sort lcolor(yellow)) /// 4 IHME Admissions (Daily hospital admissions Mean IHME S1)
> (line DayIcdMeRaA03S01 date, sort lcolor(magenta) lpattern(dash_dot)) /// 5 IMPE ICU demand (Daily ICU demand Mean A03 S01 )
> (line DayICUMeSmA02    date, sort lcolor(cyan) lpattern(dash)) /// 6
> if date >= td(01jan2021) ///
> , xtitle(Date) xlabel(#$monthspast01jan2021merge, format(%tdYY-NN-DD) labsize(small)) xlabel(, grid) ///
> xlabel(, angle(forty_five)) ylabel(, format(%9.0fc) labsize(small))  ylabel(, labsize(small) angle(horizontal)) ///
> ytitle(Daily outcomes) title("COVID-19 daily hospital-related outcomes $country", size(medium)) ///
> xscale(lwidth(vthin) lcolor(gray*.2)) yscale(lwidth(vthin) lcolor(gray*.2)) legend(region(lcolor(none))) legend(bexpand) ///
> legend(order(1 "DELP Hospitalized" 2 "DELP Ventilated" 3 "IHME ICU need" ///
> 4 "IHME Admissions" 5 "IMPE ICU demand" 6 "IHME All bed capcity") rows(3) size(small)) ///
> subtitle("2021 on, without IHME Bed need, IMPE Hosp demand, reference scenarios", size(small)) ///
> note("Uncertainty limits: dashed curves")
{res}{txt}
{com}. 
. graph export "graph 72 COVID-19 hospital-related outcomes, wo extremes, 2021.pdf", replace
{txt}(file /Users/farshadpourmalek/Downloads/covir2-main/20220506/code/merge/graph 72 COVID-19 hospital-related outcomes, wo extremes, 2021.pdf written in PDF format)

{com}. 
. 
. 
. *******************************
. 
. * daily cases to deaths (CTD) 
. 
. 
. ****
. * Daily cases or infections to deaths (CTD / ITD) all studies, reference scenarios, all time
. 
. twoway ///
> (line DayCTDMeRaA00S00 date, sort lcolor(cyan) lwidth(vthick)) /// 1 "JOHN"
> (line DayCTDMeRaA01S00 date, sort lcolor(red)) /// 2 "DELP"
> (line DayITDMeRaA02S01 date, sort lcolor(black)) /// 3 "IHME"
> (line DayITDMeRaA03S02 date, sort lcolor(magenta)) /// 4 "IMPE"
> (line DayCTDMeRaA05S00 date, sort lcolor(green)) /// 5 "SRIV"
> if date >= td(01jan2020) ///
> , xtitle(Date) xlabel(#$monthspast01jan2020merge, format(%tdYY-NN-DD) labsize(small)) xlabel(, grid) ///
> xlabel(, angle(forty_five)) ylabel(, format(%12.0fc) labsize(small))  ylabel(, labsize(small) angle(horizontal)) ///
> ytitle(Daily cases or infections to deaths) title("COVID-19 daily cases or infections, to deaths, $country", size(medium)) /// 
> xscale(lwidth(vthin) lcolor(gray*.2)) yscale(lwidth(vthin) lcolor(gray*.2) titlegap(2)) legend(region(lcolor(none))) legend(bexpand) ///
> legend(order(1 "JOHN cases" 2 "DELP cases" 3 "IHME infections" 4 "IMPE infections" 5 "SRIV cases") size(small) row(2)) ///
> subtitle("reference scenarios", size(small))
{res}{txt}
{com}. 
. graph export "graph 81 COVID-19 daily cases to deaths, $country, reference scenarios, all time.pdf", replace
{txt}(file /Users/farshadpourmalek/Downloads/covir2-main/20220506/code/merge/graph 81 COVID-19 daily cases to deaths, Iran, reference scenarios, all time.pdf written in PDF format)

{com}. 
. 
. 
. ****
. * Daily cases or infections to deaths (CTD / ITD) all studies, reference scenarios, 2021
. 
. twoway ///
> (line DayCTDMeRaA00S00 date, sort lcolor(cyan) lwidth(thick)) /// 1 "JOHN"
> (line DayCTDMeRaA01S00 date, sort lcolor(red)) /// 2 "DELP"
> (line DayITDMeRaA02S01 date, sort lcolor(black)) /// 3 "IHME"
> (line DayITDMeRaA03S02 date, sort lcolor(magenta)) /// 4 "IMPE"
> (line DayCTDMeRaA05S00 date, sort lcolor(green)) /// 5 "SRIV"
> if date >= td(01jan2021) ///
> , xtitle(Date) xlabel(#$monthspast01jan2021merge, format(%tdYY-NN-DD) labsize(small)) xlabel(, grid) ///
> xlabel(, angle(forty_five)) ylabel(, format(%12.0fc) labsize(small))  ylabel(, labsize(small) angle(horizontal)) ///
> ytitle(Daily cases or infections to deaths) title("COVID-19 daily cases or infections, to deaths, $country", size(medium)) /// 
> xscale(lwidth(vthin) lcolor(gray*.2)) yscale(lwidth(vthin) lcolor(gray*.2) titlegap(2)) legend(region(lcolor(none))) legend(bexpand) ///
> legend(order(1 "JOHN cases" 2 "DELP cases" 3 "IHME infections" 4 "IMPE infections" 5 "SRIV cases") size(small) row(2)) ///
> subtitle("2021 on, reference scenarios", size(small))
{res}{txt}
{com}. 
. graph export "graph 82 COVID-19 daily cases to deaths, $country, reference scenarios.pdf", replace
{txt}(file /Users/farshadpourmalek/Downloads/covir2-main/20220506/code/merge/graph 82 COVID-19 daily cases to deaths, Iran, reference scenarios.pdf written in PDF format)

{com}. 
. 
. 
. ****
. * Total cases to deaths (CTD / ITD) all studies, all time, reference scenarios, all time
. 
. twoway ///
> (line TotCTDMeRaA00S00 date, sort lcolor(cyan) lwidth(vthick)) /// 1 "JOHN"
> (line TotCTDMeRaA01S00 date, sort lcolor(red)) /// 2 "DELP"
> (line TotITDMeRaA02S01 date, sort lcolor(black)) /// 3 "IHME"
> (line TotITDMeRaA03S02 date, sort lcolor(magenta)) /// 4 "IMPE"
> (line TotCTDMeRaA05S00 date, sort lcolor(green)) /// 5 "SRIV"
> if date >= td(01jan2020) ///
> , xtitle(Date) xlabel(#$monthspast01jan2020merge, format(%tdYY-NN-DD) labsize(small)) xlabel(, grid) ///
> xlabel(, angle(forty_five)) ylabel(, format(%12.0fc) labsize(small))  ylabel(, labsize(small) angle(horizontal)) ///
> ytitle(Total cases or infections to deaths) title("COVID-19 total cases or infections, to deaths, $country", size(medium)) /// 
> xscale(lwidth(vthin) lcolor(gray*.2)) yscale(lwidth(vthin) lcolor(gray*.2) titlegap(2)) legend(region(lcolor(none))) legend(bexpand) ///
> legend(order(1 "JOHN cases" 2 "DELP cases" 3 "IHME infections" 4 "IMPE infections" 5 "SRIV cases") size(small) row(2)) ///
> subtitle("reference scenarios", size(small))
{res}{txt}
{com}. 
. graph export "graph 83 COVID-19 total cases to deaths, $country, reference scenarios, all time.pdf", replace
{txt}(file /Users/farshadpourmalek/Downloads/covir2-main/20220506/code/merge/graph 83 COVID-19 total cases to deaths, Iran, reference scenarios, all time.pdf written in PDF format)

{com}. 
. 
. 
. ****
. * Total cases to deaths (CTD / ITD) all studies, reference scenarios, 2021
. 
. twoway ///
> (line TotCTDMeRaA00S00 date, sort lcolor(cyan) lwidth(vthick)) /// 1 "JOHN"
> (line TotCTDMeRaA01S00 date, sort lcolor(red)) /// 2 "DELP"
> (line TotITDMeRaA02S01 date, sort lcolor(black)) /// 3 "IHME"
> (line TotITDMeRaA03S02 date, sort lcolor(magenta)) /// 4 "IMPE"
> (line TotCTDMeRaA05S00 date, sort lcolor(green)) /// 5 "SRIV"
> if date >= td(01jan2021) ///
> , xtitle(Date) xlabel(#$monthspast01jan2021merge, format(%tdYY-NN-DD) labsize(small)) xlabel(, grid) ///
> xlabel(, angle(forty_five)) ylabel(, format(%12.0fc) labsize(small))  ylabel(, labsize(small) angle(horizontal)) ///
> ytitle(Total cases or infections to deaths) title("COVID-19 total cases or infections, to deaths, $country", size(medium)) /// 
> xscale(lwidth(vthin) lcolor(gray*.2)) yscale(lwidth(vthin) lcolor(gray*.2) titlegap(2)) legend(region(lcolor(none))) legend(bexpand) ///
> legend(order(1 "JOHN cases" 2 "DELP cases" 3 "IHME infections" 4 "IMPE infections" 5 "SRIV cases") size(small) row(2)) ///
> subtitle("2021 on, reference scenarios", size(small))
{res}{txt}
{com}. 
. graph export "graph 84 COVID-19 total cases to deaths, $country, reference scenarios.pdf", replace
{txt}(file /Users/farshadpourmalek/Downloads/covir2-main/20220506/code/merge/graph 84 COVID-19 total cases to deaths, Iran, reference scenarios.pdf written in PDF format)

{com}. 
. 
. 
. 
. *******************************
. 
. *  estimated to reported (graph numbers start with 91)
. 
. 
. * daily deaths estimated to reported  
. 
. 
. ****
. * daily deaths estimated to reported (DER) all studies, reference scenarios, all time
. 
. twoway ///
> (line DayDERMeRaA00S00 date, sort lcolor(cyan) lwidth(vthick)) /// 1 "JOHN"
> (line DayDERMeRaA01S00 date, sort lcolor(red)) /// 2 "DELP"
> (line DayDERMeRaA02S01 date, sort lcolor(black)) /// 3 "IHME"
> (line DayDERMeRaA03S02 date, sort lcolor(magenta)) /// 4 "IMPE"
> (line DayDERMeRaA05S00 date, sort lcolor(green)) /// 5 "SRIV"
> if date >= td(01jan2020) ///
> , xtitle(Date) xlabel(#$monthspast01jan2020merge, format(%tdYY-NN-DD) labsize(small)) xlabel(, grid) ///
> xlabel(, angle(forty_five)) ylabel(, format(%12.0fc) labsize(small))  ylabel(, labsize(small) angle(horizontal)) ///
> ytitle(Daily deaths estimated to reported) title("COVID-19 daily deaths, estimated to reported, $country", size(medium)) /// 
> xscale(lwidth(vthin) lcolor(gray*.2)) yscale(lwidth(vthin) lcolor(gray*.2) titlegap(2)) legend(region(lcolor(none))) legend(bexpand) ///
> legend(order(1 "JOHN" 2 "DELP" 3 "IHME" 4 "IMPE" 5 "SRIV") size(small) row(1)) ///
> subtitle("reference scenarios", size(small))
{res}{txt}
{com}. 
. graph export "graph 91 COVID-19 daily deaths estimated to reported, $country, reference scenarios, all time.pdf", replace
{txt}(file /Users/farshadpourmalek/Downloads/covir2-main/20220506/code/merge/graph 91 COVID-19 daily deaths estimated to reported, Iran, reference scenarios, all time.pdf written in PDF format)

{com}. 
. 
. 
. ****
. * daily deaths estimated to reported (DER) all studies, reference scenarios, 2021
. 
. twoway ///
> (line DayDERMeRaA00S00 date, sort lcolor(cyan) lwidth(vthick)) /// 1 "JOHN"
> (line DayDERMeRaA01S00 date, sort lcolor(red)) /// 2 "DELP"
> (line DayDERMeRaA02S01 date, sort lcolor(black)) /// 3 "IHME"
> (line DayDERMeRaA03S02 date, sort lcolor(magenta)) /// 4 "IMPE"
> (line DayDERMeRaA05S00 date, sort lcolor(green)) /// 5 "SRIV"
> if date >= td(01jan2021) ///
> , xtitle(Date) xlabel(#$monthspast01jan2021merge, format(%tdYY-NN-DD) labsize(small)) xlabel(, grid) ///
> xlabel(, angle(forty_five)) ylabel(, format(%12.1fc) labsize(small))  ylabel(, labsize(small) angle(horizontal)) ///
> ytitle(Daily deaths estimated to reported) title("COVID-19 daily deaths, estimated to reported, $country", size(medium)) /// 
> xscale(lwidth(vthin) lcolor(gray*.2)) yscale(lwidth(vthin) lcolor(gray*.2) titlegap(2)) legend(region(lcolor(none))) legend(bexpand) ///
> legend(order(1 "JOHN" 2 "DELP" 3 "IHME" 4 "IMPE" 5 "SRIV") size(small) row(1)) ///
> subtitle("reference scenarios", size(small))
{res}{txt}
{com}. 
. graph export "graph 92 COVID-19 daily deaths estimated to reported, $country, reference scenarios.pdf", replace
{txt}(file /Users/farshadpourmalek/Downloads/covir2-main/20220506/code/merge/graph 92 COVID-19 daily deaths estimated to reported, Iran, reference scenarios.pdf written in PDF format)

{com}. 
. 
. 
. * daily cases or infections estimated to reported cases
. 
. 
. ****
. * daily cases or infections estimated to reported cases (CER / IER) all studies, reference scenarios, all time 
. 
. twoway ///
> (line DayCERMeRaA00S00 date, sort lcolor(cyan) lwidth(vthick)) /// 1 "JOHN"
> (line DayCERMeRaA01S00 date, sort lcolor(red)) /// 2 "DELP"
> (line DayIERMeRaA02S01 date, sort lcolor(black)) /// 3 "IHME"
> (line DayIERMeRaA03S02 date, sort lcolor(magenta)) /// 4 "IMPE"
> (line DayCERMeRaA05S00 date, sort lcolor(green)) /// 5 "SRIV"
> if date >= td(01jan2020) ///
> , xtitle(Date) xlabel(#$monthspast01jan2020merge, format(%tdYY-NN-DD) labsize(small)) xlabel(, grid) ///
> xlabel(, angle(forty_five)) ylabel(, format(%12.0fc) labsize(small))  ylabel(, labsize(small) angle(horizontal)) ///
> ytitle(Daily cases or infections estimated to reported) title("COVID-19 daily cases estimated to reported, $country", size(medium)) /// 
> xscale(lwidth(vthin) lcolor(gray*.2)) yscale(lwidth(vthin) lcolor(gray*.2) titlegap(3)) legend(region(lcolor(none))) legend(bexpand) ///
> legend(order(1 "JOHN cases" 2 "DELP cases" 3 "IHME infections" 4 "IMPE infections" 5 "SRIV cases") size(small) row(2)) ///
> subtitle("daily cases or infections estimated, to reported cases; reference scenarios", size(small))
{res}{txt}
{com}. 
. graph export "graph 93 COVID-19 daily cases estimated to reported, $country, reference scenarios, all time .pdf", replace
{txt}(file /Users/farshadpourmalek/Downloads/covir2-main/20220506/code/merge/graph 93 COVID-19 daily cases estimated to reported, Iran, reference scenarios, all time .pdf written in PDF format)

{com}. 
. 
. 
. ****
. * daily cases or infections estimated to reported cases (CER / IER) all studies, 2021-01-01 on, reference scenarios
. 
. twoway ///
> (line DayCERMeRaA00S00 date, sort lcolor(cyan) lwidth(vthick)) /// 1 "JOHN"
> (line DayCERMeRaA01S00 date, sort lcolor(red)) /// 2 "DELP"
> (line DayIERMeRaA02S01 date, sort lcolor(black)) /// 3 "IHME"
> (line DayIERMeRaA03S02 date, sort lcolor(magenta)) /// 4 "IMPE"
> (line DayCERMeRaA05S00 date, sort lcolor(green)) /// 5 "SRIV"
> if date >= td(01jan2021) ///
> , xtitle(Date) xlabel(#$monthspast01jan2021merge, format(%tdYY-NN-DD) labsize(small)) xlabel(, grid) ///
> xlabel(, angle(forty_five)) ylabel(, format(%12.0fc) labsize(small))  ylabel(, labsize(small) angle(horizontal)) ///
> ytitle(Daily cases or infections estimated to reported) title("COVID-19 daily cases estimated to reported, $country", size(medium)) /// 
> xscale(lwidth(vthin) lcolor(gray*.2)) yscale(lwidth(vthin) lcolor(gray*.2) titlegap(3)) legend(region(lcolor(none))) legend(bexpand) ///
> legend(order(1 "JOHN cases" 2 "DELP cases" 3 "IHME infections" 4 "IMPE infections" 5 "SRIV cases") size(small) row(2)) ///
> subtitle("daily cases or infections estimated, to reported cases; reference scenarios", size(small))
{res}{txt}
{com}. 
. graph export "graph 94 COVID-19 daily cases estimated to reported, $country, reference scenarios.pdf", replace
{txt}(file /Users/farshadpourmalek/Downloads/covir2-main/20220506/code/merge/graph 94 COVID-19 daily cases estimated to reported, Iran, reference scenarios.pdf written in PDF format)

{com}. 
. 
. 
. ****
. * total deaths estimated to reported (DER) all studies, reference scenarios, all time
. 
. twoway ///
> (line TotDERMeRaA00S00 date, sort lcolor(cyan) lwidth(vthick)) /// 1 "JOHN
> (line TotDERMeRaA01S00 date, sort lcolor(red)) /// 2 "DELP"
> (line TotDERMeRaA02S01 date, sort lcolor(black)) /// 3 "IHME"
> (line TotDERMeRaA03S02 date, sort lcolor(magenta)) /// 4 "IMPE"
> (line TotDERMeRaA05S00 date, sort lcolor(green)) /// 5 "SRIV"
> if date >= td(01jan2020) ///
> , xtitle(Date) xlabel(#$monthspast01jan2020merge, format(%tdYY-NN-DD) labsize(small)) xlabel(, grid) ///
> xlabel(, angle(forty_five)) ylabel(, format(%12.0fc) labsize(small))  ylabel(, labsize(small) angle(horizontal)) ///
> ytitle(Total deaths estimated to reported) title("COVID-19 total deaths, estimated to reported, $country", size(medium)) /// 
> xscale(lwidth(vthin) lcolor(gray*.2)) yscale(lwidth(vthin) lcolor(gray*.2) titlegap(5)) legend(region(lcolor(none))) legend(bexpand) ///
> legend(order(1 "JOHN" 2 "DELP" 3 "IHME" 4 "IMPE" 5 "SRIV") size(small) row(1)) ///
> subtitle("reference scenarios", size(small))
{res}{txt}
{com}. 
. graph export "graph 95 COVID-19 total deaths estimated to reported, $country, reference scenarios, all time.pdf", replace
{txt}(file /Users/farshadpourmalek/Downloads/covir2-main/20220506/code/merge/graph 95 COVID-19 total deaths estimated to reported, Iran, reference scenarios, all time.pdf written in PDF format)

{com}. 
. 
. 
. ****
. * total deaths estimated to reported (DER) all studies, reference scenarios, 2021
. 
. twoway ///
> (line TotDERMeRaA00S00 date, sort lcolor(cyan) lwidth(vthick)) /// 1 "JOHN
> (line TotDERMeRaA01S00 date, sort lcolor(red)) /// 2 "DELP"
> (line TotDERMeRaA02S01 date, sort lcolor(black)) /// 3 "IHME"
> (line TotDERMeRaA03S02 date, sort lcolor(magenta)) /// 4 "IMPE"
> (line TotDERMeRaA05S00 date, sort lcolor(green)) /// 5 "SRIV"
> if date >= td(01jan2021) ///
> , xtitle(Date) xlabel(#$monthspast01jan2021merge, format(%tdYY-NN-DD) labsize(small)) xlabel(, grid) ///
> xlabel(, angle(forty_five)) ylabel(, format(%12.2fc) labsize(small))  ylabel(, labsize(small) angle(horizontal)) ///
> ytitle(Total deaths estimated to reported) title("COVID-19 total deaths, estimated to reported, $country", size(medium)) /// 
> xscale(lwidth(vthin) lcolor(gray*.2)) yscale(lwidth(vthin) lcolor(gray*.2) titlegap(5)) legend(region(lcolor(none))) legend(bexpand) ///
> legend(order(1 "JOHN" 2 "DELP" 3 "IHME" 4 "IMPE" 5 "SRIV") size(small) row(1)) ///
> subtitle("reference scenarios", size(small))
{res}{txt}
{com}. 
. graph export "graph 96 COVID-19 total deaths estimated to reported, $country, reference scenarios.pdf", replace
{txt}(file /Users/farshadpourmalek/Downloads/covir2-main/20220506/code/merge/graph 96 COVID-19 total deaths estimated to reported, Iran, reference scenarios.pdf written in PDF format)

{com}. 
. 
. 
. ****
. * total cases or infections or infections estimated to reported cases (CER / IER) all studies, reference scenarios, all time
. 
. twoway ///
> (line TotCERMeRaA00S00 date, sort lcolor(cyan) lwidth(vthick)) /// 1 "JOHN"
> (line TotCERMeRaA01S00 date, sort lcolor(red)) /// 2 "DELP"
> (line TotIERMeRaA02S01 date, sort lcolor(black)) /// 3 "IHME"
> (line TotIERMeRaA03S02 date, sort lcolor(magenta)) /// 4 "IMPE"
> (line TotCERMeRaA05S00 date, sort lcolor(green)) /// 5 "SRIV"
> if date >= td(01jan2020) ///
> , xtitle(Date) xlabel(#$monthspast01jan2020merge, format(%tdYY-NN-DD) labsize(small)) xlabel(, grid) ///
> xlabel(, angle(forty_five)) ylabel(, format(%12.0fc) labsize(small))  ylabel(, labsize(small) angle(horizontal)) ///
> ytitle(Total cases or infections estimated to reported) title("COVID-19 total cases estimated to reported, $country", size(medium)) /// 
> xscale(lwidth(vthin) lcolor(gray*.2)) yscale(lwidth(vthin) lcolor(gray*.2) titlegap(5)) legend(region(lcolor(none))) legend(bexpand) ///
> legend(order(1 "JOHN cases" 2 "DELP cases" 3 "IHME infections" 4 "IMPE infections" 5 "SRIV cases") size(small) row(2)) ///
> subtitle("total cases or infections estimated, to reported cases; reference scenarios", size(small))
{res}{txt}
{com}. 
. graph export "graph 97 COVID-19 total cases estimated to reported, $country, reference scenarios.pdf", replace
{txt}(file /Users/farshadpourmalek/Downloads/covir2-main/20220506/code/merge/graph 97 COVID-19 total cases estimated to reported, Iran, reference scenarios.pdf written in PDF format)

{com}. 
. 
. 
. ****
. * total cases or infections or infections estimated to reported cases (CER / IER) all studies, reference scenarios, 2021
. 
. twoway ///
> (line TotCERMeRaA00S00 date, sort lcolor(cyan) lwidth(vthick)) /// 1 "JOHN"
> (line TotCERMeRaA01S00 date, sort lcolor(red)) /// 2 "DELP"
> (line TotIERMeRaA02S01 date, sort lcolor(black)) /// 3 "IHME"
> (line TotIERMeRaA03S02 date, sort lcolor(magenta)) /// 4 "IMPE"
> (line TotCERMeRaA05S00 date, sort lcolor(green)) /// 5 "SRIV"
> if date >= td(01jan2021) ///
> , xtitle(Date) xlabel(#$monthspast01jan2021merge, format(%tdYY-NN-DD) labsize(small)) xlabel(, grid) ///
> xlabel(, angle(forty_five)) ylabel(, format(%12.0fc) labsize(small))  ylabel(, labsize(small) angle(horizontal)) ///
> ytitle(Total cases or infections estimated to reported) title("COVID-19 total cases estimated to reported, $country", size(medium)) /// 
> xscale(lwidth(vthin) lcolor(gray*.2)) yscale(lwidth(vthin) lcolor(gray*.2) titlegap(5)) legend(region(lcolor(none))) legend(bexpand) ///
> legend(order(1 "JOHN cases" 2 "DELP cases" 3 "IHME infections" 4 "IMPE infections" 5 "SRIV cases") size(small) row(2)) ///
> subtitle("total cases or infections estimated, to reported cases; reference scenarios", size(small))
{res}{txt}
{com}. 
. graph export "graph 98 COVID-19 total cases estimated to reported, $country, reference scenarios.pdf", replace
{txt}(file /Users/farshadpourmalek/Downloads/covir2-main/20220506/code/merge/graph 98 COVID-19 total cases estimated to reported, Iran, reference scenarios.pdf written in PDF format)

{com}. 
. 
. 
. 
. 
. 
. *****************
. 
. * IHME graphs
. 
. 
. 
. * R effective, 01jun2021 on
. 
. twoway ///
> (line reff_mean_A02S02 date, sort lcolor(green) lwidth(thick)) ///
> (line reff_mean_A02S01 date, sort lcolor(black) lwidth(thick)) ///
> (line reff_lower_A02S01 date, sort lcolor(black*.5) lpattern(dash)) ///
> (line reff_upper_A02S01 date, sort lcolor(black*.5) lpattern(dash)) ///
> if date >= td(01jun2021) ///
> , xtitle(Date) xlabel(#$monthspast01jan2021merge, format(%tdYY-NN-DD) labsize(small)) xlabel(, grid) xlabel(, grid) ///
> xlabel(, angle(forty_five)) ylabel(, format(%12.1fc) labsize(small))  ylabel(, labsize(small) angle(horizontal)) ///
> ytitle(R effective) title("COVID-19 R effective, $country, IHME, 2 scenarios", size(medium)) ///
> xscale(lwidth(vthin) lcolor(gray*.2)) yscale(lwidth(vthin) lcolor(gray*.2)) legend(region(lcolor(none))) legend(bexpand) ///
> legend(order(1 "Better" 2 "Reference") rows(1)) ///
> note(Uncertainty limits: dashed curves)
{res}{txt}
{com}. 
. graph export "graph 101 COVID-19 R effective, $country, 2 scenarios 01jun2021 on.pdf", replace
{txt}(file /Users/farshadpourmalek/Downloads/covir2-main/20220506/code/merge/graph 101 COVID-19 R effective, Iran, 2 scenarios 01jun2021 on.pdf written in PDF format)

{com}. 
. 
. 
. 
. * daily Infection outcomes ratios, 2 scenarios 
.   
. twoway ///
> (line infection_detection_A02S01 date, sort lcolor(green)) ///
> (line infection_hospitalization_A02S01 date, sort lcolor(black)) ///
> (line infection_fatality_A02S01 date, sort lcolor(red)) ///
> (line infection_detection_A02S02 date, sort lcolor(green) lpattern(dash)) ///
> (line infection_hospitalization_A02S02 date, sort lcolor(black) lpattern(dash)) ///
> (line infection_fatality_A02S02 date, sort lcolor(red) lpattern(dash)) ///
> if date >= td(01jan2020) ///
> , xtitle(Date) xlabel(#$monthspast01jan2020merge, format(%tdYY-NN-DD) labsize(small)) xlabel(, grid) xlabel(, grid) ///
> xlabel(, angle(forty_five)) ylabel(, format(%9.2fc) labsize(small))  ylabel(, labsize(small) angle(horizontal)) ///
> ytitle(Daily infection outcome ratios) title("COVID-19 daily infection outcome ratios, $country, IHME, 2 scenarios", size(medium)) ///
> xscale(lwidth(vthin) lcolor(gray*.2)) yscale(lwidth(vthin) lcolor(gray*.2)) legend(region(lcolor(none))) legend(bexpand) ///
> legend(order(1 "Infection detection ratio" 2 "Infection hospitalization ratio" 3 "Infection fatality ratio") rows(2)) ///
> note("Better scenario: dashed curves")
{res}{txt}
{com}. 
. graph export "graph 102 COVID-19 daily Infection outcomes ratios, $country 2 scenarios, IHME.pdf", replace
{txt}(file /Users/farshadpourmalek/Downloads/covir2-main/20220506/code/merge/graph 102 COVID-19 daily Infection outcomes ratios, Iran 2 scenarios, IHME.pdf written in PDF format)

{com}. 
. 
. 
. 
. * daily % change in mobility, CI
. 
. twoway ///
> (line mobility_mean_A02S02 date, sort lcolor(green) lwidth(vthick) lpattern(tight_dot)) ///
> (line mobility_mean_A02S01 date, sort lcolor(black)) ///
> if date >= td(01jan2020) ///
> , xtitle(Date) xlabel(#$monthspast01jan2020merge, format(%tdYY-NN-DD) labsize(small)) xlabel(, grid) xlabel(, grid) ///
> xlabel(, angle(forty_five)) ylabel(, format(%12.1fc) labsize(small))  ylabel(, labsize(small) angle(horizontal)) ///
> ytitle(Daily % change in mobility from baseline) title("COVID-19 daily % change in mobility, $country, IHME, 2 scenarios", size(medium)) ///
> xscale(lwidth(vthin) lcolor(gray*.2)) yscale(lwidth(vthin) lcolor(gray*.2)) legend(region(lcolor(none))) legend(bexpand) ///
> legend(order(1 "Better" 2 "Reference") rows(1)) 
{res}{txt}
{com}. 
. graph export "graph 103 COVID-19 daily mobility, $country, 2 scenarios IHME.pdf", replace
{txt}(file /Users/farshadpourmalek/Downloads/covir2-main/20220506/code/merge/graph 103 COVID-19 daily mobility, Iran, 2 scenarios IHME.pdf written in PDF format)

{com}. 
. 
. 
. 
. * daily mask use Percent of population reporting always wearing a mask when leaving home
. 
. twoway ///
> (line mask_use_mean_A02S02 date, sort lcolor(green) lwidth(vthick) lpattern(tight_dot)) ///
> (line mask_use_mean_A02S01 date, sort lcolor(black)) ///
> if date >= td(01jan2020) ///
> , xtitle(Date) xlabel(#$monthspast01jan2020merge, format(%tdYY-NN-DD) labsize(small)) xlabel(, grid) xlabel(, grid) ///
> xlabel(, angle(forty_five)) ylabel(, format(%12.1fc) labsize(small))  ylabel(, labsize(small) angle(horizontal)) ///
> ytitle(Daily mask use) title("COVID-19 daily mask use, $country, IHME, 2 scenarios", size(medium)) ///
> xscale(lwidth(vthin) lcolor(gray*.2)) yscale(lwidth(vthin) lcolor(gray*.2)) legend(region(lcolor(none))) legend(bexpand) ///
> legend(order(1 "Better" 2 "Reference") rows(1)) ///
> subtitle(Percent of population reporting always wearing a mask when leaving home, size(small))
{res}{txt}
{com}. 
. graph export "graph 104 COVID-19 daily mask_use, $country, 2 scenarios IHME.pdf", replace
{txt}(file /Users/farshadpourmalek/Downloads/covir2-main/20220506/code/merge/graph 104 COVID-19 daily mask_use, Iran, 2 scenarios IHME.pdf written in PDF format)

{com}. 
. 
. 
. * cumulative vaccinated percent
. 
. twoway ///
> (line cumulative_all_vaccin_pct date, sort lcolor(black)) ///
> (line cumul_all_effect_vacci_pct date, sort lcolor(blue)) ///
> (line cumul_all_fully_vacci_pct date, sort lcolor(green) lwidth(thick)) ///
> if date >= td(01dec2020) ///
> , xtitle(Date) xlabel(#$monthspast01jan2021merge, format(%tdYY-NN-DD) labsize(small)) xlabel(, grid) xlabel(, grid) ///
> xlabel(, angle(forty_five)) ylabel(, format(%15.1fc) labsize(small))  ylabel(, labsize(small) angle(horizontal)) ///
> ytitle(% Cumulative vaccinated percent) title("COVID-19 cumulative vaccinated percent, $country, IHME, 2 scenarios", size(medium)) ///
> xscale(lwidth(vthin) lcolor(gray*.2)) yscale(lwidth(vthin) lcolor(gray*.2)) legend(region(lcolor(none))) legend(bexpand) ///
> legend(order(1 "Vaccinated" 2 "Effectively vaccinated" 3 "Fully vaccinated") rows(1)) ///
> note("Vaccinated: Initially vaccinated (one dose of two doses)" ///
> "Effectively vaccinated: one and two dose with efficacy" ///
> "Fully vaccinated: one of one and two of two doses", size(small))
{res}{txt}
{com}. 
. graph export "graph 105 COVID-19 cumulative vaccinated percent, $country IHME.pdf", replace
{txt}(file /Users/farshadpourmalek/Downloads/covir2-main/20220506/code/merge/graph 105 COVID-19 cumulative vaccinated percent, Iran IHME.pdf written in PDF format)

{com}. 
. 
. 
. 
. 
. * daily vaccinated percent
. 
. twoway ///
> (line daily_all_vaccin_pct date, sort lcolor(black)) ///
> (line daily_all_effect_vacci_pct date, sort lcolor(blue)) ///
> (line daily_all_fully_vacci_pct date, sort lcolor(green) lwidth(thick)) ///
> if date >= td(01dec2020) ///
> , xtitle(Date) xlabel(#$monthspast01jan2021merge, format(%tdYY-NN-DD) labsize(small)) xlabel(, grid) xlabel(, grid) ///
> xlabel(, angle(forty_five)) ylabel(, format(%15.1fc) labsize(small))  ylabel(, labsize(small) angle(horizontal)) ///
> ytitle(% Daily vaccinated percent) title("COVID-19 daily vaccinated percent, $country, IHME, 2 scenarios", size(medium)) ///
> xscale(lwidth(vthin) lcolor(gray*.2)) yscale(lwidth(vthin) lcolor(gray*.2)) legend(region(lcolor(none))) legend(bexpand) ///
> legend(order(1 "Vaccinated" 2 "Effectively vaccinated" 3 "Fully vaccinated") rows(1)) ///
> note("Vaccinated: Initially vaccinated (one dose of two doses)" ///
> "Effectively vaccinated: one and two dose with efficacy" ///
> "Fully vaccinated: one of one and two of two doses", size(small))
{res}{txt}
{com}. 
. graph export "graph 106 COVID-19 daily vaccinated percent, $country.pdf", replace
{txt}(file /Users/farshadpourmalek/Downloads/covir2-main/20220506/code/merge/graph 106 COVID-19 daily vaccinated percent, Iran.pdf written in PDF format)

{com}. 
. 
. 
. 
. * daily vaccinated number
. 
. twoway ///
> (line daily_all_vaccinated date, sort lcolor(black)) ///
> (line daily_all_effectively_vacci date, sort lcolor(blue)) ///
> (line daily_all_fully_vaccinated date, sort lcolor(green) lwidth(thick)) ///
> if date >= td(01jan2021) ///
> , xtitle(Date) xlabel(#$monthspast01jan2021merge, format(%tdYY-NN-DD) labsize(small)) xlabel(, grid) xlabel(, grid) ///
> xlabel(, angle(forty_five)) ylabel(, format(%15.0fc) labsize(small))  ylabel(, labsize(small) angle(horizontal)) ///
> ytitle(Daily vaccinated number) title("COVID-19 daily vaccinated number, $country, IHME, 2 scenarios", size(medium)) ///
> xscale(lwidth(vthin) lcolor(gray*.2)) yscale(lwidth(vthin) lcolor(gray*.2)) legend(region(lcolor(none))) legend(bexpand) ///
> legend(order(1 "Vaccinated" 2 "Effectively vaccinated" 3 "Fully vaccinated") rows(1)) ///
> note("Vaccinated: Initially vaccinated (one dose of two doses)" ///
> "Effectively vaccinated: one and two dose with efficacy" ///
> "Fully vaccinated: one of one and two of two doses", size(small))
{res}{txt}
{com}. 
. graph export "graph 107 COVID-19 daily vaccinated number, $country.pdf", replace
{txt}(file /Users/farshadpourmalek/Downloads/covir2-main/20220506/code/merge/graph 107 COVID-19 daily vaccinated number, Iran.pdf written in PDF format)

{com}. 
. 
. 
. *
. 
. 
. 
. 
. 
. ************
. 
. * restore native scheme (of the local machine)
. 
. set scheme $nativescheme
{txt}
{com}. 
. di c(scheme)
{res}_GRSTYLE_
{txt}
{com}. 
. 
. view "log country merge.smcl"
{txt}
{com}. 
. log close
      {txt}name:  {res}<unnamed>
       {txt}log:  {res}/Users/farshadpourmalek/Downloads/covir2-main/20220506/code/merge/log country merge.smcl
  {txt}log type:  {res}smcl
 {txt}closed on:  {res} 7 May 2022, 17:10:19
{txt}{.-}
{smcl}
{txt}{sf}{ul off}