{smcl}
{txt}{sf}{ul off}{.-}
      name:  {res}<unnamed>
       {txt}log:  {res}/Users/farshadpourmalek/Downloads/covir2-main/20210405/code/SOLT/log Iran SOLT.smcl
  {txt}log type:  {res}smcl
 {txt}opened on:  {res}24 Apr 2021, 07:49:18
{txt}
{com}. 
. ***************************************************************************
. * This is "do Iran SOLT.do"
. 
. * Project: Rapid review of estimates of COVID Iran - No 2
. * Person: Farshad Pourmalek pourmalek_farshad@yahoo.com
. * Time (initial): 2021-02-10
. 
. * OBJECTIVE: Get and prepare SOLT data for Iran, Locate peak dates and values
. ***************************************************************************
. 
. 
. * Get SOLT estimates 
. 
. clear 
{txt}
{com}. 
. import excel using "SOLT dig data.xlsx", clear 
{res}{txt}
{com}. 
. 
. rename D DayActMeRaA06S01V00
{res}{txt}
{com}. 
. label var DayActMeRaA06S01V00 "Daily Active cases SOLT S1"
{txt}
{com}. 
. rename E DayActMeRaA06S02V00
{res}{txt}
{com}. 
. label var DayActMeRaA06S02V00 "Daily Active cases SOLT S2"
{txt}
{com}. 
. keep DayActMeRaA06S01V00 DayActMeRaA06S02V00
{txt}
{com}. 
. drop in 1 
{txt}(1 observation deleted)

{com}. 
. destring DayActMeRaA06S01V00, replace
{txt}DayActMeRaA06S01V00: all characters numeric; {res}replaced {txt}as {res}long
{txt}
{com}. 
. destring DayActMeRaA06S02V00, replace
{txt}DayActMeRaA06S02V00: all characters numeric; {res}replaced {txt}as {res}long
{txt}
{com}. 
. 
. di td(15feb2020) // 21960
{res}21960
{txt}
{com}. 
. gen date2 = .
{txt}(610 missing values generated)

{com}. 
. replace date2 = 21960 in 1
{txt}(1 real change made)

{com}. 
. replace date2 = date2[_n-1] + 1 in 2/l
{txt}(609 real changes made)

{com}. 
. gen date = date2
{txt}
{com}. format date %tdDDMonCCYY
{txt}
{com}. codebook date 

{txt}{hline}
{res}date{right:(unlabeled)}
{txt}{hline}

{col 19}type:  numeric daily date ({res}float{txt})

{col 18}range:  [{res}21960{txt},{res}22569{txt}]{col 55}units:  {res}1
{col 8}{txt}or equivalently:  [{res}15feb2020{txt},{res}16oct2021{txt}]{col 55}units:  {res}days
{col 10}{txt}unique values:  {res}610{col 51}{txt}missing .:  {res}0{txt}/{res}610

{txt}{col 19}mean:{res}{col 26} 22264.5{txt} = {res}15dec2020{txt} (+ 12 hours)
{col 15}std. dev:{res}{col 26} 176.236

{txt}{col 12}percentiles:{col 32}10%{col 42}25%{col 52}50%{col 62}75%{col 72}90%
{res}{col 27} 22020.5{col 37}   22112{col 47} 22264.5{col 57}   22417{col 67} 22508.5
{col 26}15apr2020{col 36}16jul2020{col 46}15dec2020{col 56}17may2021{col 66}16aug2021
{txt}
{com}. 
. drop date2
{txt}
{com}. 
. gen loc_grand_name = "Iran"
{txt}
{com}. 
. sort date
{txt}
{com}. 
. compress
  {txt}variable {bf}date{sf} was {bf}{res}float{sf}{txt} now {bf}{res}int{sf}
{txt}  (1,220 bytes saved)

{com}. 
. save "Iran SOLT.dta", replace 
{txt}(note: file Iran SOLT.dta not found)
file Iran SOLT.dta saved

{com}. 
. 
. 
. *********
. 
. /*
> * Scenarios
> 
> S1 = Reopening scenario 1 = Percentage of population "free from quarantine" upon reopening 
> at lowest point between second and third peaks (about 2020-09-01) is 35% and at lowest point between third and fourth peaks (about 2021-03-01 )is 20%. 
> 
> 
> S2 = Reopening scenario 2 = Percentage of population "free from quarantine" upon reopening 
> at lowest point between second and third peaks (about 2020-09-01) is 32% and at lowest point between third and fourth peaks (about 2021-03-01 )is 22%. 
> 
> */
. 
. 
. 
. *************************************************************************
. 
. * graphs
. 
. 
. grstyle init
{res}{txt}
{com}. 
. grstyle color background white
{txt}
{com}.  
. 
. twoway /// 
> (line DayActMeRaA06S01V00 date, sort lcolor(red)) ///
> (line DayActMeRaA06S02V00 date, sort lcolor(blue)) ///
> , xtitle(Date) xlabel(#19, format(%tdYY-NN-DD) labsize(small)) xlabel(, grid) xlabel(, grid) ///
> xlabel(, angle(forty_five)) ylabel(, format(%9.0fc) labsize(small))  ylabel(, labsize(small) angle(horizontal)) ///
> ytitle(Daily Active cases) title("COVID-19 daily Active cases, Iran, SOLT, 2 scenarios", size(medium)) ///
> xscale(lwidth(vthin) lcolor(gray*.2)) yscale(lwidth(vthin) lcolor(gray*.2)) legend(region(lcolor(none))) legend(bexpand) ///
> legend(order(1 "S1" 2 "S2"))
{res}{txt}
{com}. 
. 
. graph save "graph COVID-19 daily Active cases a, Iran, SOLT.gph", replace
{txt}(note: file graph COVID-19 daily Active cases a, Iran, SOLT.gph not found)
{res}{txt}(file graph COVID-19 daily Active cases a, Iran, SOLT.gph saved)

{com}. graph export "graph COVID-19 daily Active cases, Iran, SOLT.pdf", replace
{txt}(file /Users/farshadpourmalek/Downloads/covir2-main/20210405/code/SOLT/graph COVID-19 daily Active cases, Iran, SOLT.pdf written in PDF format)

{com}. 
. 
. 
. 
. 
. 
. 
. 
. 
. *************************************************************************
. 
. * Locate peak dates and values
. 
. 
. * first peak 
. 
. * S1
. 
. summ DayActMeRaA06S01V00 if date > td(01apr2020) & date < td(30apr2020) 

{txt}    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayActM~1V00 {c |}{res}         28    26122.39     4946.66      18883      32909
{txt}
{com}. 
. gen DayActMeRaA06S01V00P1V = r(max)
{txt}
{com}. 
. summ date if DayActMeRaA06S01V00 == DayActMeRaA06S01V00P1V & date > td(01apr2020) & date < td(30apr2020) 

{txt}    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
{space 8}date {c |}{res}          1       22013           .      22013      22013
{txt}
{com}. 
. gen DayActMeRaA06S01V00P1D = r(max)
{txt}
{com}. 
. label var DayActMeRaA06S01V00P1V "DayActMeRaA06S01V00 Peak 1 Value"
{txt}
{com}. label var DayActMeRaA06S01V00P1D "DayActMeRaA06S01V00 Peak 1 Date"
{txt}
{com}. 
. format DayActMeRaA06S01V00P1D %tdDDMonCCYY
{txt}
{com}. 
. tab1 DayActMeRaA06S01V00P1V DayActMeRaA06S01V00P1D

{res}-> tabulation of DayActMeRaA06S01V00P1V  

{txt}DayActMeRaA {c |}
   06S01V00 {c |}
     Peak 1 {c |}
      Value {c |}      Freq.     Percent        Cum.
{hline 12}{c +}{hline 35}
      32909 {c |}{res}        610      100.00      100.00
{txt}{hline 12}{c +}{hline 35}
      Total {c |}{res}        610      100.00

-> tabulation of DayActMeRaA06S01V00P1D  

{txt}DayActMeRaA {c |}
   06S01V00 {c |}
Peak 1 Date {c |}      Freq.     Percent        Cum.
{hline 12}{c +}{hline 35}
  08Apr2020 {c |}{res}        610      100.00      100.00
{txt}{hline 12}{c +}{hline 35}
      Total {c |}{res}        610      100.00
{txt}
{com}. 
. 
. * S2
. 
. summ DayActMeRaA06S02V00 if date > td(01apr2020) & date < td(30apr2020) 

{txt}    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayActM~2V00 {c |}{res}         28    26122.39     4946.66      18883      32909
{txt}
{com}. 
. gen DayActMeRaA06S02V00P1V = r(max)
{txt}
{com}. 
. summ date if DayActMeRaA06S02V00 == DayActMeRaA06S02V00P1V & date > td(01apr2020) & date < td(30apr2020) 

{txt}    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
{space 8}date {c |}{res}          1       22013           .      22013      22013
{txt}
{com}. 
. gen DayActMeRaA06S02V00P1D = r(max)
{txt}
{com}. 
. label var DayActMeRaA06S02V00P1V "DayActMeRaA06S02V00 Peak 1 Value"
{txt}
{com}. label var DayActMeRaA06S02V00P1D "DayActMeRaA06S02V00 Peak 1 Date"
{txt}
{com}. 
. format DayActMeRaA06S02V00P1D %tdDDMonCCYY
{txt}
{com}. 
. tab1 DayActMeRaA06S02V00P1V DayActMeRaA06S02V00P1D

{res}-> tabulation of DayActMeRaA06S02V00P1V  

{txt}DayActMeRaA {c |}
   06S02V00 {c |}
     Peak 1 {c |}
      Value {c |}      Freq.     Percent        Cum.
{hline 12}{c +}{hline 35}
      32909 {c |}{res}        610      100.00      100.00
{txt}{hline 12}{c +}{hline 35}
      Total {c |}{res}        610      100.00

-> tabulation of DayActMeRaA06S02V00P1D  

{txt}DayActMeRaA {c |}
   06S02V00 {c |}
Peak 1 Date {c |}      Freq.     Percent        Cum.
{hline 12}{c +}{hline 35}
  08Apr2020 {c |}{res}        610      100.00      100.00
{txt}{hline 12}{c +}{hline 35}
      Total {c |}{res}        610      100.00
{txt}
{com}. 
. 
. * second peak 
. 
. * S1
. 
. summ DayActMeRaA06S01V00 if date > td(01jul2020) & date < td(30jul2020)

{txt}    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayActM~1V00 {c |}{res}         28    30737.96    1571.595      29011      33245
{txt}
{com}. 
. gen DayActMeRaA06S01V00P2V = r(max)
{txt}
{com}. 
. summ date if DayActMeRaA06S01V00 == DayActMeRaA06S01V00P2V & date > td(01jul2020) & date < td(30jul2020) 

{txt}    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
{space 8}date {c |}{res}          1       22101           .      22101      22101
{txt}
{com}. 
. gen DayActMeRaA06S01V00P2D = r(max)
{txt}
{com}. 
. label var DayActMeRaA06S01V00P2V "DayActMeRaA06S01V00 Peak 2 Value"
{txt}
{com}. label var DayActMeRaA06S01V00P2D "DayActMeRaA06S01V00 Peak 2 Date"
{txt}
{com}. 
. format DayActMeRaA06S01V00P2D %tdDDMonCCYY
{txt}
{com}. 
. tab1 DayActMeRaA06S01V00P2V DayActMeRaA06S01V00P2D

{res}-> tabulation of DayActMeRaA06S01V00P2V  

{txt}DayActMeRaA {c |}
   06S01V00 {c |}
     Peak 2 {c |}
      Value {c |}      Freq.     Percent        Cum.
{hline 12}{c +}{hline 35}
      33245 {c |}{res}        610      100.00      100.00
{txt}{hline 12}{c +}{hline 35}
      Total {c |}{res}        610      100.00

-> tabulation of DayActMeRaA06S01V00P2D  

{txt}DayActMeRaA {c |}
   06S01V00 {c |}
Peak 2 Date {c |}      Freq.     Percent        Cum.
{hline 12}{c +}{hline 35}
  05Jul2020 {c |}{res}        610      100.00      100.00
{txt}{hline 12}{c +}{hline 35}
      Total {c |}{res}        610      100.00
{txt}
{com}. 
. 
. * S2
. 
. summ DayActMeRaA06S02V00 if date > td(01jul2020) & date < td(30jul2020)

{txt}    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayActM~2V00 {c |}{res}         28    30737.96    1571.595      29011      33245
{txt}
{com}. 
. gen DayActMeRaA06S02V00P2V = r(max)
{txt}
{com}. 
. summ date if DayActMeRaA06S02V00 == DayActMeRaA06S02V00P2V & date > td(01jul2020) & date < td(30jul2020) 

{txt}    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
{space 8}date {c |}{res}          1       22101           .      22101      22101
{txt}
{com}. 
. gen DayActMeRaA06S02V00P2D = r(max)
{txt}
{com}. 
. label var DayActMeRaA06S02V00P2V "DayActMeRaA06S02V00 Peak 2 Value"
{txt}
{com}. label var DayActMeRaA06S02V00P2D "DayActMeRaA06S02V00 Peak 2 Date"
{txt}
{com}. 
. format DayActMeRaA06S02V00P2D %tdDDMonCCYY
{txt}
{com}. 
. tab1 DayActMeRaA06S02V00P2V DayActMeRaA06S02V00P2D

{res}-> tabulation of DayActMeRaA06S02V00P2V  

{txt}DayActMeRaA {c |}
   06S02V00 {c |}
     Peak 2 {c |}
      Value {c |}      Freq.     Percent        Cum.
{hline 12}{c +}{hline 35}
      33245 {c |}{res}        610      100.00      100.00
{txt}{hline 12}{c +}{hline 35}
      Total {c |}{res}        610      100.00

-> tabulation of DayActMeRaA06S02V00P2D  

{txt}DayActMeRaA {c |}
   06S02V00 {c |}
Peak 2 Date {c |}      Freq.     Percent        Cum.
{hline 12}{c +}{hline 35}
  05Jul2020 {c |}{res}        610      100.00      100.00
{txt}{hline 12}{c +}{hline 35}
      Total {c |}{res}        610      100.00
{txt}
{com}. 
. 
. * third peak 
. 
. * S1 
. 
. summ DayActMeRaA06S01V00 if date > td(01nov2020) & date < td(30nov2020)

{txt}    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayActM~1V00 {c |}{res}         28    216730.6    10243.29     191943     226749
{txt}
{com}. 
. gen DayActMeRaA06S01V00P3V = r(max)
{txt}
{com}. 
. summ date if DayActMeRaA06S01V00 == DayActMeRaA06S01V00P3V & date > td(01nov2020) & date < td(30nov2020)

{txt}    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
{space 8}date {c |}{res}          1       22230           .      22230      22230
{txt}
{com}. 
. gen DayActMeRaA06S01V00P3D = r(max)
{txt}
{com}. 
. label var DayActMeRaA06S01V00P3V "DayActMeRaA06S01V00 Peak 3 Value"
{txt}
{com}. label var DayActMeRaA06S01V00P3D "DayActMeRaA06S01V00 Peak 3 Date"
{txt}
{com}. 
. format DayActMeRaA06S01V00P3D %tdDDMonCCYY
{txt}
{com}. 
. tab1 DayActMeRaA06S01V00P3V DayActMeRaA06S01V00P3D

{res}-> tabulation of DayActMeRaA06S01V00P3V  

{txt}DayActMeRaA {c |}
   06S01V00 {c |}
     Peak 3 {c |}
      Value {c |}      Freq.     Percent        Cum.
{hline 12}{c +}{hline 35}
     226749 {c |}{res}        610      100.00      100.00
{txt}{hline 12}{c +}{hline 35}
      Total {c |}{res}        610      100.00

-> tabulation of DayActMeRaA06S01V00P3D  

{txt}DayActMeRaA {c |}
   06S01V00 {c |}
Peak 3 Date {c |}      Freq.     Percent        Cum.
{hline 12}{c +}{hline 35}
  11Nov2020 {c |}{res}        610      100.00      100.00
{txt}{hline 12}{c +}{hline 35}
      Total {c |}{res}        610      100.00
{txt}
{com}. 
. 
. * S2
. 
. summ DayActMeRaA06S02V00 if date > td(01nov2020) & date < td(30nov2020)

{txt}    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayActM~2V00 {c |}{res}         28    115043.3    3869.202     106019     118353
{txt}
{com}. 
. gen DayActMeRaA06S02V00P3V = r(max)
{txt}
{com}. 
. summ date if DayActMeRaA06S02V00 == DayActMeRaA06S02V00P3V & date > td(01nov2020) & date < td(30nov2020)

{txt}    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
{space 8}date {c |}{res}          1       22241           .      22241      22241
{txt}
{com}. 
. gen DayActMeRaA06S02V00P3D = r(max)
{txt}
{com}. 
. label var DayActMeRaA06S02V00P3V "DayActMeRaA06S02V00 Peak 3 Value"
{txt}
{com}. label var DayActMeRaA06S02V00P3D "DayActMeRaA06S02V00 Peak 3 Date"
{txt}
{com}. 
. format DayActMeRaA06S02V00P3D %tdDDMonCCYY
{txt}
{com}. 
. tab1 DayActMeRaA06S02V00P3V DayActMeRaA06S02V00P3D

{res}-> tabulation of DayActMeRaA06S02V00P3V  

{txt}DayActMeRaA {c |}
   06S02V00 {c |}
     Peak 3 {c |}
      Value {c |}      Freq.     Percent        Cum.
{hline 12}{c +}{hline 35}
     118353 {c |}{res}        610      100.00      100.00
{txt}{hline 12}{c +}{hline 35}
      Total {c |}{res}        610      100.00

-> tabulation of DayActMeRaA06S02V00P3D  

{txt}DayActMeRaA {c |}
   06S02V00 {c |}
Peak 3 Date {c |}      Freq.     Percent        Cum.
{hline 12}{c +}{hline 35}
  22Nov2020 {c |}{res}        610      100.00      100.00
{txt}{hline 12}{c +}{hline 35}
      Total {c |}{res}        610      100.00
{txt}
{com}.  
. 
. * fourth peak 
. 
. * S1 
. 
. summ DayActMeRaA06S01V00 if date > td(01jun2021) & date < td(30jul2021)

{txt}    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayActM~1V00 {c |}{res}         58    98503.69    6091.536      82763     105011
{txt}
{com}. 
. gen DayActMeRaA06S01V00P4V = r(max)
{txt}
{com}. 
. summ date if DayActMeRaA06S01V00 == DayActMeRaA06S01V00P4V & date > td(01jun2021) & date < td(30jul2021)

{txt}    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
{space 8}date {c |}{res}          1       22469           .      22469      22469
{txt}
{com}. 
. gen DayActMeRaA06S01V00P4D = r(max)
{txt}
{com}. 
. label var DayActMeRaA06S01V00P4V "DayActMeRaA06S02V00 Peak 4 Value"
{txt}
{com}. label var DayActMeRaA06S01V00P4D "DayActMeRaA06S02V00 Peak 4 Date"
{txt}
{com}. 
. format DayActMeRaA06S01V00P4D %tdDDMonCCYY
{txt}
{com}. 
. tab1 DayActMeRaA06S01V00P4V DayActMeRaA06S01V00P4D

{res}-> tabulation of DayActMeRaA06S01V00P4V  

{txt}DayActMeRaA {c |}
   06S02V00 {c |}
     Peak 4 {c |}
      Value {c |}      Freq.     Percent        Cum.
{hline 12}{c +}{hline 35}
     105011 {c |}{res}        610      100.00      100.00
{txt}{hline 12}{c +}{hline 35}
      Total {c |}{res}        610      100.00

-> tabulation of DayActMeRaA06S01V00P4D  

{txt}DayActMeRaA {c |}
   06S02V00 {c |}
Peak 4 Date {c |}      Freq.     Percent        Cum.
{hline 12}{c +}{hline 35}
  08Jul2021 {c |}{res}        610      100.00      100.00
{txt}{hline 12}{c +}{hline 35}
      Total {c |}{res}        610      100.00
{txt}
{com}. 
. 
. * S2
. 
. label var DayActMeRaA06S01V00P4V "DayActMeRaA06S01V00 Peak 4V alue"
{txt}
{com}. label var DayActMeRaA06S01V00P4D "DayActMeRaA06S01V00 Peak 4 Date"
{txt}
{com}. 
. summ DayActMeRaA06S02V00 if date > td(01may2021) & date < td(30may2021)

{txt}    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayActM~2V00 {c |}{res}         28    262176.5    9985.189     237289     272240
{txt}
{com}. 
. gen DayActMeRaA06S02V00P4V = r(max)
{txt}
{com}. 
. summ date if DayActMeRaA06S02V00 == DayActMeRaA06S02V00P4V & date > td(01may2021) & date < td(30may2021)

{txt}    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
{space 8}date {c |}{res}          1       22416           .      22416      22416
{txt}
{com}. 
. gen DayActMeRaA06S02V00P4D = r(max)
{txt}
{com}. 
. label var DayActMeRaA06S02V00P4V "DayActMeRaA06S02V00 Peak 4 Value"
{txt}
{com}. label var DayActMeRaA06S02V00P4D "DayActMeRaA06S02V00 Peak 4 Date"
{txt}
{com}. 
. format DayActMeRaA06S02V00P4D %tdDDMonCCYY
{txt}
{com}. 
. tab1 DayActMeRaA06S02V00P4V DayActMeRaA06S02V00P4D

{res}-> tabulation of DayActMeRaA06S02V00P4V  

{txt}DayActMeRaA {c |}
   06S02V00 {c |}
     Peak 4 {c |}
      Value {c |}      Freq.     Percent        Cum.
{hline 12}{c +}{hline 35}
     272240 {c |}{res}        610      100.00      100.00
{txt}{hline 12}{c +}{hline 35}
      Total {c |}{res}        610      100.00

-> tabulation of DayActMeRaA06S02V00P4D  

{txt}DayActMeRaA {c |}
   06S02V00 {c |}
Peak 4 Date {c |}      Freq.     Percent        Cum.
{hline 12}{c +}{hline 35}
  16May2021 {c |}{res}        610      100.00      100.00
{txt}{hline 12}{c +}{hline 35}
      Total {c |}{res}        610      100.00
{txt}
{com}. 
. 
. 
. sort date
{txt}
{com}. 
. compress
  {txt}variable {bf}DayActMeRaA06S01V00P1D{sf} was {bf}{res}float{sf}{txt} now {bf}{res}int{sf}
  {txt}variable {bf}DayActMeRaA06S02V00P1D{sf} was {bf}{res}float{sf}{txt} now {bf}{res}int{sf}
  {txt}variable {bf}DayActMeRaA06S01V00P2D{sf} was {bf}{res}float{sf}{txt} now {bf}{res}int{sf}
  {txt}variable {bf}DayActMeRaA06S02V00P2D{sf} was {bf}{res}float{sf}{txt} now {bf}{res}int{sf}
  {txt}variable {bf}DayActMeRaA06S01V00P3D{sf} was {bf}{res}float{sf}{txt} now {bf}{res}int{sf}
  {txt}variable {bf}DayActMeRaA06S02V00P3D{sf} was {bf}{res}float{sf}{txt} now {bf}{res}int{sf}
  {txt}variable {bf}DayActMeRaA06S01V00P4D{sf} was {bf}{res}float{sf}{txt} now {bf}{res}int{sf}
  {txt}variable {bf}DayActMeRaA06S02V00P4D{sf} was {bf}{res}float{sf}{txt} now {bf}{res}int{sf}
{txt}  (9,760 bytes saved)

{com}. 
. save "Iran SOLT.dta", replace 
{txt}file Iran SOLT.dta saved

{com}. 
. 
. 
.  
.  
. 
. view "log Iran SOLT.smcl"
{txt}
{com}. 
. log close
      {txt}name:  {res}<unnamed>
       {txt}log:  {res}/Users/farshadpourmalek/Downloads/covir2-main/20210405/code/SOLT/log Iran SOLT.smcl
  {txt}log type:  {res}smcl
 {txt}closed on:  {res}24 Apr 2021, 07:49:20
{txt}{.-}
{smcl}
{txt}{sf}{ul off}