{smcl}
{com}{sf}{ul off}{txt}{.-}
      name:  {res}<unnamed>
       {txt}log:  {res}/Users/farshadpourmalek/Downloads/covir2-main/20210405/code/DELP/log Iran DELP.smcl
  {txt}log type:  {res}smcl
 {txt}opened on:  {res}24 Apr 2021, 07:46:00
{txt}
{com}. 
. ***************************************************************************
. * This is "do Iran DELP.do"
. 
. * Project: Rapid review of estimates of COVID Iran - No 2
. * Person: Farshad Pourmalek pourmalek_farshad@yahoo.com
. * Time (initial): 2021-02-10
. 
. * OBJECTIVE: Get and prepare DELPHI data for Iran, Locate peak dates and values
. ***************************************************************************
. 
. 
. * Get DELPHI data for Iran
. 
. /* Their latest estimations file “covid_analytics_projections.csv” is located on web page (https://www.covidanalytics.io/projections), 
> linked via “Download Most Recent Predictions” located all the way down the page. 
> Trying to extract the "web address" of this file (like what is doable for all other studies) leads to the actual data in raw format. 
> The file can be downlaoded, and moved to "$pathcovir2/DELP"  */
. 
. 
. import delimited using "covid_analytics_projections.csv", clear varnames(1)
{res}{text}(16 vars, 9,840 obs)

{com}. 
. rename country loc_grand_name
{res}{txt}
{com}. 
. keep if loc_grand_name == "Iran"
{txt}(9,799 observations deleted)

{com}. 
. 
. * gen date
. 
. rename day date_original
{res}{txt}
{com}. 
. gen year = substr(date_original,1,4) 
{txt}
{com}. gen month = substr(date_original,6,2) 
{txt}
{com}. gen day = substr(date_original,9,2) 
{txt}
{com}. egen date2 = concat(day month year)
{txt}
{com}. gen date = date(date2, "DMY", 2050)
{txt}
{com}. format date %tdDDMonCCYY
{txt}
{com}. codebook date

{txt}{hline}
{res}date{right:(unlabeled)}
{txt}{hline}

{col 19}type:  numeric daily date ({res}float{txt})

{col 18}range:  [{res}22375{txt},{res}22415{txt}]{col 55}units:  {res}1
{col 8}{txt}or equivalently:  [{res}05apr2021{txt},{res}15may2021{txt}]{col 55}units:  {res}days
{col 10}{txt}unique values:  {res}41{col 51}{txt}missing .:  {res}0{txt}/{res}41

{txt}{col 19}mean:{res}{col 26}   22395{txt} = {res}25apr2021{txt}
{col 15}std. dev:{res}{col 26} 11.9791

{txt}{col 12}percentiles:{col 32}10%{col 42}25%{col 52}50%{col 62}75%{col 72}90%
{res}{col 27}   22379{col 37}   22385{col 47}   22395{col 57}   22405{col 67}   22411
{col 26}09apr2021{col 36}15apr2021{col 46}25apr2021{col 56}05may2021{col 66}11may2021
{txt}
{com}. 
. drop year month day date2
{txt}
{com}. 
. 
. * rename outcome variables
. 
. 
. * total vars
. 
. rename totaldetecteddeaths   TotDeaMeRaA01S00V03
{res}{txt}
{com}. rename totaldetecteddeathslb TotDeaLoRaA01S00V03
{res}{txt}
{com}. rename totaldetecteddeathsub TotDeaUpRaA01S00V03
{res}{txt}
{com}. 
. label var TotDeaMeRaA01S00V03 "Total Deaths Mean DELP S0 V3"
{txt}
{com}. label var TotDeaMeRaA01S00V03 "Total Deaths Lower DELP S0 V3"
{txt}
{com}. label var TotDeaMeRaA01S00V03 "Total Deaths Upper DELP S0 V3"
{txt}
{com}. 
. rename totaldetected   TotCasMeRaA01S00V03
{res}{txt}
{com}. rename totaldetectedlb TotCasLoRaA01S00V03
{res}{txt}
{com}. rename totaldetectedub TotCasUpRaA01S00V03
{res}{txt}
{com}. 
. label var TotCasMeRaA01S00V03 "Total Cases Mean DELP S0 V3"
{txt}
{com}. label var TotCasMeRaA01S00V03 "Total Cases Lower DELP S0 V3"
{txt}
{com}. label var TotCasMeRaA01S00V03 "Total Cases Upper DELP S0 V3"
{txt}
{com}. 
. 
. * gen daily vars and rename
. 
. sort date
{txt}
{com}. 
. gen DayDeaMeRaA01S00V03 =  TotDeaMeRaA01S00V03[_n] - TotDeaMeRaA01S00V03[_n-1]
{txt}(1 missing value generated)

{com}. 
. gen DayDeaLoRaA01S00V03 =  TotDeaLoRaA01S00V03[_n] - TotDeaLoRaA01S00V03[_n-1]
{txt}(1 missing value generated)

{com}. 
. gen DayDeaUpRaA01S00V03 =  TotDeaUpRaA01S00V03[_n] - TotDeaUpRaA01S00V03[_n-1]
{txt}(1 missing value generated)

{com}. 
. gen DayCasMeRaA01S00V03 =  TotCasMeRaA01S00V03[_n] - TotCasMeRaA01S00V03[_n-1]
{txt}(1 missing value generated)

{com}. 
. gen DayCasLoRaA01S00V03 =  TotCasLoRaA01S00V03[_n] - TotCasLoRaA01S00V03[_n-1]
{txt}(1 missing value generated)

{com}. 
. gen DayCasUpRaA01S00V03 =  TotCasUpRaA01S00V03[_n] - TotCasUpRaA01S00V03[_n-1]
{txt}(1 missing value generated)

{com}. 
. 
. label var DayDeaMeRaA01S00V03 "Daily Deaths Mean DELP S0 V3"
{txt}
{com}. label var DayDeaLoRaA01S00V03 "Daily Deaths Lower DELP S0 V3"
{txt}
{com}. label var DayDeaUpRaA01S00V03 "Daily Deaths Upper DELP S0 V3"
{txt}
{com}. 
. label var DayCasMeRaA01S00V03 "Daily Cases Mean DELP S0 V3"
{txt}
{com}. label var DayCasLoRaA01S00V03 "Daily Cases Lower DELP S0 V3"
{txt}
{com}. label var DayCasUpRaA01S00V03 "Daily Cases Upper DELP S0 V3"
{txt}
{com}. 
. label var TotDeaMeRaA01S00V03 "Total Deaths Mean DELP S0 V3"
{txt}
{com}. label var TotDeaLoRaA01S00V03 "Total Deaths Lower DELP S0 V3"
{txt}
{com}. label var TotDeaUpRaA01S00V03 "Total Deaths Upper DELP S0 V3"
{txt}
{com}. 
. label var TotCasMeRaA01S00V03 "Total Cases Mean DELP S0 V3"
{txt}
{com}. label var TotCasLoRaA01S00V03 "Total Cases Lower DELP S0 V3"
{txt}
{com}. label var TotCasUpRaA01S00V03 "Total Cases Upper DELP S0 V3"
{txt}
{com}. 
. 
. * 
. 
. * other outcomes
. 
. * active activehospitalized activeventilated cumulativehospitalized
. 
. /*
> ***********************
> * rename convention
> 
> active                                  Act
> 
> activehospitalized              Hos
> 
> activeventilated                Ven
> 
> cumulativehospitalized  Hos
> 
> */
. 
. 
. rename active DayActMeRaA01S00V03
{res}{txt}
{com}. 
. rename activehospitalized DayHosMeRaA01S00V03
{res}{txt}
{com}. 
. rename activeventilated DayVenMeRaA01S00V03
{res}{txt}
{com}. 
. rename cumulativehospitalized TotHosMeRaA01S00V03
{res}{txt}
{com}. 
. label var DayActMeRaA01S00V03 "Daily Cases Active Mean DELP S0 V3"
{txt}
{com}. 
. label var DayHosMeRaA01S00V03 "Daily Cases Active Hospitalized Mean DELP S0 V3"
{txt}
{com}. 
. label var DayVenMeRaA01S00V03 "Daily Cases Active Ventilated Mean DELP S0 V3"
{txt}
{com}. 
. label var TotHosMeRaA01S00V03 "Total Cases Active Mean DELP S0 V3"
{txt}
{com}. 
.  
. 
. keep ///
> loc_grand_name date ///
> TotDeaMeRaA01S00V03 TotDeaLoRaA01S00V03 TotDeaUpRaA01S00V03 ///
> DayDeaMeRaA01S00V03 DayDeaLoRaA01S00V03 DayDeaUpRaA01S00V03 ///
> TotCasMeRaA01S00V03 TotCasLoRaA01S00V03 TotCasUpRaA01S00V03 ///
> DayCasMeRaA01S00V03 DayCasLoRaA01S00V03 DayCasUpRaA01S00V03 ///
> DayActMeRaA01S00V03 DayHosMeRaA01S00V03 DayVenMeRaA01S00V03 TotHosMeRaA01S00V03
{txt}
{com}. 
. 
. order ///
> loc_grand_name date ///
> TotDeaMeRaA01S00V03 TotDeaLoRaA01S00V03 TotDeaUpRaA01S00V03 ///
> DayDeaMeRaA01S00V03 DayDeaLoRaA01S00V03 DayDeaUpRaA01S00V03 ///
> TotCasMeRaA01S00V03 TotCasLoRaA01S00V03 TotCasUpRaA01S00V03 ///
> DayCasMeRaA01S00V03 DayCasLoRaA01S00V03 DayCasUpRaA01S00V03 ///
> DayActMeRaA01S00V03 DayHosMeRaA01S00V03 DayVenMeRaA01S00V03 TotHosMeRaA01S00V03
{txt}
{com}. 
. 
. 
. * gen cfr
. 
. gen DayCfrMeRaA01S00V03 = 100 * DayDeaMeRaA01S00V03 / DayCasMeRaA01S00V03
{txt}(1 missing value generated)

{com}. gen DayCfrLoRaA01S00V03 = 100 * DayDeaLoRaA01S00V03 / DayCasLoRaA01S00V03
{txt}(4 missing values generated)

{com}. gen DayCfrUpRaA01S00V03 = 100 * DayDeaUpRaA01S00V03 / DayCasUpRaA01S00V03
{txt}(1 missing value generated)

{com}. 
. label var DayCfrMeRaA01S00V03 "Daily CFR Mean DELP S0 V3"
{txt}
{com}. label var DayCfrLoRaA01S00V03 "Daily CFR Lower DELP S0 V3"
{txt}
{com}. label var DayCfrUpRaA01S00V03 "Daily CFR Upper DELP S0 V3"
{txt}
{com}. 
. 
. 
. 
. *
. 
. 
. 
. 
. 
. * gen "Daily cases mean div by daily deaths mean DELP DayCbD" for visulization of temporal relation of deaths and cases peaks 
. 
. 
.         summ DayDeaMeRaA01S00V03 

{txt}    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayDeaMeR~03 {c |}{res}         40      59.575    7.883405         46         72
{txt}
{com}.         gen DayDeMMeRaA01S00V03 = r(mean)
{txt}
{com}.         label var DayDeMMeRaA01S00V03 "Daily deaths mean DELP DayDeM"
{txt}
{com}. 
.         summ DayCasMeRaA01S00V03 

{txt}    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayCasMeR~03 {c |}{res}         40    7112.375    646.8832       5913       8037
{txt}
{com}.         gen DayCaMMeRaA01S00V03 = r(mean)
{txt}
{com}.         label var DayCaMMeRaA01S00V03 "Daily cases mean DELP DayCaM"
{txt}
{com}.                               
.         gen DayCbDMeRaA01S00V03 = DayCaMMeRaA01S00V03 / DayDeaMeRaA01S00V03
{txt}(1 missing value generated)

{com}.         label var DayCbDMeRaA01S00V03 "Daily cases mean div by daily deaths mean DELP DayCbD"
{txt}
{com}.         summ DayCbDMeRaA01S00V03

{txt}    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayCbDMeR~03 {c |}{res}         40    121.5165    16.63432   98.78299   154.6169
{txt}
{com}.         
.         gen DayDMuMeRaA01S00V03 = DayDeaMeRaA01S00V03 * DayCbDMeRaA01S00V03
{txt}(1 missing value generated)

{com}.     label var DayDMuMeRaA01S00V03 "Daily deaths scaled (times means of cases by deaths) only for visualization DELP"
{txt}
{com}.         summ DayDMuMeRaA01S00V03        

{txt}    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayDMuMeR~03 {c |}{res}         40    7112.375    .0001349   7112.375   7112.375
{txt}
{com}. 
. 
. 
. 
. ***********************
. 
. * graphs
. 
. 
. grstyle init
{res}{txt}
{com}. 
. grstyle color background white
{txt}
{com}. 
. 
. 
. 
. codebook date if DayDeaMeRaA01S00V03 != .

{txt}{hline}
{res}date{right:(unlabeled)}
{txt}{hline}

{col 19}type:  numeric daily date ({res}float{txt})

{col 18}range:  [{res}22376{txt},{res}22415{txt}]{col 55}units:  {res}1
{col 8}{txt}or equivalently:  [{res}06apr2021{txt},{res}15may2021{txt}]{col 55}units:  {res}days
{col 10}{txt}unique values:  {res}40{col 51}{txt}missing .:  {res}0{txt}/{res}40

{txt}{col 19}mean:{res}{col 26} 22395.5{txt} = {res}25apr2021{txt} (+ 12 hours)
{col 15}std. dev:{res}{col 26} 11.6905

{txt}{col 12}percentiles:{col 32}10%{col 42}25%{col 52}50%{col 62}75%{col 72}90%
{res}{col 27} 22379.5{col 37} 22385.5{col 47} 22395.5{col 57} 22405.5{col 67} 22411.5
{col 26}09apr2021{col 36}15apr2021{col 46}25apr2021{col 56}05may2021{col 66}11may2021
{txt}
{com}. 
. 
. 
. 
. * daily deaths wo CI
. 
. 
. twoway  ///
> (line DayDeaMeRaA01S00V03 date, sort lcolor(green)) ///
> if loc_grand_name == "Iran" & DayDeaMeRaA01S00V03 != ., legend(off) ///    
> xtitle(Date) xlabel(22371 "21-04-01" 22385 "21-04-15" 22401 "21-05-01" 22415 "21-05-15", format(%tdYY-NN-DD) labsize(small)) xlabel(, grid) xlabel(, grid) ///
> xlabel(, angle(forty_five)) ylabel(, format(%9.0fc) labsize(small))  ylabel(, labsize(small) angle(horizontal)) ///
> ytitle(Daily deaths) title("COVID-19 daily deaths, Iran, DELP, single scenario", size(medium)) ///
> xscale(lwidth(vthin) lcolor(gray*.2)) yscale(lwidth(vthin) lcolor(gray*.2)) legend(region(lcolor(none))) legend(bexpand)        
{res}{txt}
{com}.    
.            
. graph save "graph 1 COVID-19 daily deaths, Iran, DELP wo CI.gph", replace
{res}{txt}(file graph 1 COVID-19 daily deaths, Iran, DELP wo CI.gph saved)

{com}. graph export "graph 1 COVID-19 daily deaths, Iran, DELP wo CI.pdf", replace
{txt}(file /Users/farshadpourmalek/Downloads/covir2-main/20210405/code/DELP/graph 1 COVID-19 daily deaths, Iran, DELP wo CI.pdf written in PDF format)

{com}. 
. 
. * daily deaths with CI
. 
. 
. twoway (rarea DayDeaLoRaA01S00V03 DayDeaUpRaA01S00V03 date, sort color(green*.2)) ///
> (line DayDeaMeRaA01S00V03 date, sort lcolor(green)) ///
> if loc_grand_name == "Iran" & DayDeaMeRaA01S00V03 != ., legend(off) ///    
> xtitle(Date) xlabel(22371 "21-04-01" 22385 "21-04-15" 22401 "21-05-01" 22415 "21-05-15", format(%tdYY-NN-DD) labsize(small)) xlabel(, grid) xlabel(, grid) ///
> xlabel(, angle(forty_five)) ylabel(, format(%9.0fc) labsize(small))  ylabel(, labsize(small) angle(horizontal)) ///
> ytitle(Daily deaths) title("COVID-19 daily deaths, Iran, DELP, single scenario", size(medium)) ///
> xscale(lwidth(vthin) lcolor(gray*.2)) yscale(lwidth(vthin) lcolor(gray*.2)) legend(region(lcolor(none))) legend(bexpand) ///
> subtitle("with confidence limits", size(small)) 
{res}{txt}
{com}.   
.            
. graph save "graph 2 COVID-19 daily deaths, Iran, DELP with CI.gph", replace
{res}{txt}(file graph 2 COVID-19 daily deaths, Iran, DELP with CI.gph saved)

{com}. graph export "graph 2 COVID-19 daily deaths, Iran, DELP with CI.pdf", replace
{txt}(file /Users/farshadpourmalek/Downloads/covir2-main/20210405/code/DELP/graph 2 COVID-19 daily deaths, Iran, DELP with CI.pdf written in PDF format)

{com}. 
. 
. 
. * total deaths wo CI 
. 
. 
. twoway  ///
> (line TotDeaMeRaA01S00V03 date, sort lcolor(green)) ///
> if loc_grand_name == "Iran" & DayDeaMeRaA01S00V03 != ., legend(off) ///    
> xtitle(Date) xlabel(22371 "21-04-01" 22385 "21-04-15" 22401 "21-05-01" 22415 "21-05-15", format(%tdYY-NN-DD) labsize(small)) xlabel(, grid) xlabel(, grid) ///
> xlabel(, angle(forty_five)) ylabel(, format(%9.0fc) labsize(small))  ylabel(, labsize(small) angle(horizontal)) ///
> ytitle(Total deaths) title("COVID-19 total deaths, Iran, DELP, single scenario", size(medium)) ///
> xscale(lwidth(vthin) lcolor(gray*.2)) yscale(lwidth(vthin) lcolor(gray*.2)) legend(region(lcolor(none))) legend(bexpand)
{res}{txt}
{com}. 
. graph save "graph 3 COVID-19 total deaths, Iran, DELP wo CI.gph", replace
{res}{txt}(file graph 3 COVID-19 total deaths, Iran, DELP wo CI.gph saved)

{com}. graph export "graph 3 COVID-19 total deaths, Iran, DELP wo CI.pdf", replace
{txt}(file /Users/farshadpourmalek/Downloads/covir2-main/20210405/code/DELP/graph 3 COVID-19 total deaths, Iran, DELP wo CI.pdf written in PDF format)

{com}. 
. 
. 
. 
. * total deaths with CI 
. 
. 
. twoway (rarea TotDeaLoRaA01S00V03 TotDeaUpRaA01S00V03 date, sort color(green*.2)) ///
> (line TotDeaMeRaA01S00V03 date, sort lcolor(green)) ///
> if loc_grand_name == "Iran" & DayDeaMeRaA01S00V03 != ., legend(off) ///    
> xtitle(Date) xlabel(22371 "21-04-01" 22385 "21-04-15" 22401 "21-05-01" 22415 "21-05-15", format(%tdYY-NN-DD) labsize(small)) xlabel(, grid) xlabel(, grid) ///
> xlabel(, angle(forty_five)) ylabel(, format(%9.0fc) labsize(small))  ylabel(, labsize(small) angle(horizontal)) ///
> ytitle(Total deaths) title("COVID-19 total deaths, Iran, DELP, single scenario", size(medium)) ///
> xscale(lwidth(vthin) lcolor(gray*.2)) yscale(lwidth(vthin) lcolor(gray*.2)) legend(region(lcolor(none))) legend(bexpand) ///
> subtitle("with confidence limits", size(small)) 
{res}{txt}
{com}.         
.    
.            
. graph save "graph 4 COVID-19 total deaths, Iran, DELP with CI.gph", replace
{res}{txt}(file graph 4 COVID-19 total deaths, Iran, DELP with CI.gph saved)

{com}. graph export "graph 4 COVID-19 total deaths, Iran, DELP with CI.pdf", replace
{txt}(file /Users/farshadpourmalek/Downloads/covir2-main/20210405/code/DELP/graph 4 COVID-19 total deaths, Iran, DELP with CI.pdf written in PDF format)

{com}. 
. 
. 
. * daily cases wo CI
. 
. twoway ///
> (line DayCasMeRaA01S00V03 date, sort lcolor(green)) ///
> if loc_grand_name == "Iran" & DayDeaMeRaA01S00V03 != ., legend(off) ///    
> xtitle(Date) xlabel(22371 "21-04-01" 22385 "21-04-15" 22401 "21-05-01" 22415 "21-05-15", format(%tdYY-NN-DD) labsize(small)) xlabel(, grid) xlabel(, grid) ///
> xlabel(, angle(forty_five)) ylabel(, format(%9.0fc) labsize(small))  ylabel(, labsize(small) angle(horizontal)) ///
> ytitle(Daily cases) title("COVID-19 daily cases, Iran, DELP, single scenario", size(medium)) ///
> xscale(lwidth(vthin) lcolor(gray*.2)) yscale(lwidth(vthin) lcolor(gray*.2)) legend(region(lcolor(none))) legend(bexpand)        
{res}{txt}
{com}.            
. 
. graph save "graph 5 COVID-19 daily cases, Iran, DELP wo CI.gph", replace
{res}{txt}(file graph 5 COVID-19 daily cases, Iran, DELP wo CI.gph saved)

{com}. graph export "graph 5 COVID-19 daily cases, Iran, DELP wo CI.pdf", replace
{txt}(file /Users/farshadpourmalek/Downloads/covir2-main/20210405/code/DELP/graph 5 COVID-19 daily cases, Iran, DELP wo CI.pdf written in PDF format)

{com}. 
. 
. 
. * daily cases with CI
. 
. twoway (rarea DayCasLoRaA01S00V03 DayCasUpRaA01S00V03 date, sort color(green*.2)) ///
> (line DayCasMeRaA01S00V03 date, sort lcolor(green)) ///
> if loc_grand_name == "Iran" & DayDeaMeRaA01S00V03 != ., legend(off) ///    
> xtitle(Date) xlabel(22371 "21-04-01" 22385 "21-04-15" 22401 "21-05-01" 22415 "21-05-15", format(%tdYY-NN-DD) labsize(small)) xlabel(, grid) xlabel(, grid) ///
> xlabel(, angle(forty_five)) ylabel(, format(%9.0fc) labsize(small))  ylabel(, labsize(small) angle(horizontal)) ///
> ytitle(Daily cases) title("COVID-19 daily cases, Iran, DELP, single scenario", size(medium)) ///
> xscale(lwidth(vthin) lcolor(gray*.2)) yscale(lwidth(vthin) lcolor(gray*.2)) legend(region(lcolor(none))) legend(bexpand) ///
> subtitle("with confidence limits", size(small)) 
{res}{txt}
{com}.         
.            
. 
. graph save "graph 6 COVID-19 daily cases, Iran, DELP with CI.gph", replace
{res}{txt}(file graph 6 COVID-19 daily cases, Iran, DELP with CI.gph saved)

{com}. graph export "graph 6 COVID-19 daily cases, Iran, DELP with CI.pdf", replace
{txt}(file /Users/farshadpourmalek/Downloads/covir2-main/20210405/code/DELP/graph 6 COVID-19 daily cases, Iran, DELP with CI.pdf written in PDF format)

{com}. 
. 
. 
. 
. 
. 
. * total cases wo CI
. 
. twoway ///
> (line TotCasMeRaA01S00V03 date, sort lcolor(green)) ///
> if loc_grand_name == "Iran" & DayDeaMeRaA01S00V03 != ., legend(off) ///    
> xtitle(Date) xlabel(22371 "21-04-01" 22385 "21-04-15" 22401 "21-05-01" 22415 "21-05-15", format(%tdYY-NN-DD) labsize(small)) xlabel(, grid) xlabel(, grid) ///
> xlabel(, angle(forty_five)) ylabel(, format(%9.0fc) labsize(small))  ylabel(, labsize(small) angle(horizontal)) ///
> ytitle(Total cases) title("COVID-19 total cases, Iran, DELP, single scenario", size(medium)) ///
> xscale(lwidth(vthin) lcolor(gray*.2)) yscale(lwidth(vthin) lcolor(gray*.2)) legend(region(lcolor(none))) legend(bexpand)        
{res}{txt}
{com}.            
. 
. graph save "graph 7 COVID-19 total cases, Iran, DELP wo CI.gph", replace
{res}{txt}(file graph 7 COVID-19 total cases, Iran, DELP wo CI.gph saved)

{com}. graph export "graph 7 COVID-19 total cases, Iran, DELP wo CI.pdf", replace
{txt}(file /Users/farshadpourmalek/Downloads/covir2-main/20210405/code/DELP/graph 7 COVID-19 total cases, Iran, DELP wo CI.pdf written in PDF format)

{com}. 
. 
. 
. * total cases with CI
. 
. twoway (rarea TotCasLoRaA01S00V03 TotCasUpRaA01S00V03 date, sort color(green*.2)) ///
> (line TotCasMeRaA01S00V03 date, sort lcolor(green)) ///
> if loc_grand_name == "Iran" & DayDeaMeRaA01S00V03 != ., legend(off) ///    
> xtitle(Date) xlabel(22371 "21-04-01" 22385 "21-04-15" 22401 "21-05-01" 22415 "21-05-15", format(%tdYY-NN-DD) labsize(small)) xlabel(, grid) xlabel(, grid) ///
> xlabel(, angle(forty_five)) ylabel(, format(%9.0fc) labsize(small))  ylabel(, labsize(small) angle(horizontal)) ///
> ytitle(Total cases) title("COVID-19 total cases, Iran, DELP, single scenario", size(medium)) ///
> xscale(lwidth(vthin) lcolor(gray*.2)) yscale(lwidth(vthin) lcolor(gray*.2)) legend(region(lcolor(none))) legend(bexpand) ///
> subtitle("with confidence limits", size(small)) 
{res}{txt}
{com}.         
.            
. 
. graph save "graph 8 COVID-19 total cases, Iran, DELP with CI.gph", replace
{res}{txt}(file graph 8 COVID-19 total cases, Iran, DELP with CI.gph saved)

{com}. graph export "graph 8 COVID-19 total cases, Iran, DELP with CI.pdf", replace
{txt}(file /Users/farshadpourmalek/Downloads/covir2-main/20210405/code/DELP/graph 8 COVID-19 total cases, Iran, DELP with CI.pdf written in PDF format)

{com}. 
. 
. 
. 
. 
. * daily cfr 
. 
. twoway (rarea DayCfrLoRaA01S00V03 DayCfrUpRaA01S00V03 date, sort color(green*.2)) ///
> (line DayCfrMeRaA01S00V03 date, sort lcolor(green)) ///
> if loc_grand_name == "Iran" & DayDeaMeRaA01S00V03 != ., legend(off) ///    
> xtitle(Date) xlabel(22371 "21-04-01" 22385 "21-04-15" 22401 "21-05-01" 22415 "21-05-15", format(%tdYY-NN-DD) labsize(small)) xlabel(, grid) xlabel(, grid) ///
> xlabel(, angle(forty_five)) ylabel(, format(%9.2fc) labsize(small))  ylabel(, labsize(small) angle(horizontal)) ///
> ytitle(Daily cases) title("COVID-19 daily CFR, Iran, DELP, single scenario", size(medium)) ///
> xscale(lwidth(vthin) lcolor(gray*.2)) yscale(lwidth(vthin) lcolor(gray*.2)) legend(region(lcolor(none))) legend(bexpand)        
{res}{txt}
{com}.            
. 
. graph save "graph 9 COVID-19 daily CFR, Iran, DELP.gph", replace
{res}{txt}(file graph 9 COVID-19 daily CFR, Iran, DELP.gph saved)

{com}. graph export "graph 9 COVID-19 daily CFR, Iran, DELP.pdf", replace
{txt}(file /Users/farshadpourmalek/Downloads/covir2-main/20210405/code/DELP/graph 9 COVID-19 daily CFR, Iran, DELP.pdf written in PDF format)

{com}. 
. 
. 
. 
. 
. 
. 
. * daily cases active, active hospitalized, active ventilated
. 
. * DayCasAcRaA01S00V03 DayCasAhRaA01S00V03 DayCasAvRaA01S00V03 TotCasAcRaA01S00V03
. 
. 
. twoway ///
> (line DayActMeRaA01S00V03 date, sort lcolor(green)) ///
> (line DayHosMeRaA01S00V03 date, sort lcolor(black)) ///
> (line DayVenMeRaA01S00V03 date, sort lcolor(red)) ///
> if loc_grand_name == "Iran" & DayDeaMeRaA01S00V03 != ., ///        
> xtitle(Date) xlabel(22371 "21-04-01" 22385 "21-04-15" 22401 "21-05-01" 22415 "21-05-15", format(%tdYY-NN-DD) labsize(small)) xlabel(, grid) xlabel(, grid) ///
> xlabel(, angle(forty_five)) ylabel(, format(%9.0fc) labsize(small))  ylabel(, labsize(small) angle(horizontal)) ///
> ytitle(Daily outcome) title("COVID-19 daily cases, Iran, DELP, single scenario", size(medium)) ///
> xscale(lwidth(vthin) lcolor(gray*.2)) yscale(lwidth(vthin) lcolor(gray*.2)) legend(region(lcolor(none))) legend(bexpand) ///
> legend(order(1 "Active cases" 2 "Active hospitalized" 3 "Active ventilated") rows(1)) ///
> subtitle("active cases, active hospitalized, active ventilated", size(small))   
{res}{txt}
{com}. 
. 
.            
. graph save "graph 10 COVID-19 daily cases etc, Iran, DELP wo CI.gph", replace
{res}{txt}(file graph 10 COVID-19 daily cases etc, Iran, DELP wo CI.gph saved)

{com}. graph export "graph 10 COVID-19 daily cases etc, Iran, DELP wo CI.pdf", replace
{txt}(file /Users/farshadpourmalek/Downloads/covir2-main/20210405/code/DELP/graph 10 COVID-19 daily cases etc, Iran, DELP wo CI.pdf written in PDF format)

{com}. 
. 
. 
. 
. * daily active hospitalized, active ventilated
. 
. 
. twoway ///
> (line DayHosMeRaA01S00V03 date, sort lcolor(black)) ///
> (line DayVenMeRaA01S00V03 date, sort lcolor(red)) ///
> if loc_grand_name == "Iran" & DayDeaMeRaA01S00V03 != .,  ///       
> xtitle(Date) xlabel(22371 "21-04-01" 22385 "21-04-15" 22401 "21-05-01" 22415 "21-05-15", format(%tdYY-NN-DD) labsize(small)) xlabel(, grid) xlabel(, grid) ///
> xlabel(, angle(forty_five)) ylabel(, format(%9.0fc) labsize(small))  ylabel(, labsize(small) angle(horizontal)) ///
> ytitle(Daily outcome) title("COVID-19 daily cases, Iran, DELP, single scenario", size(medium)) ///
> xscale(lwidth(vthin) lcolor(gray*.2)) yscale(lwidth(vthin) lcolor(gray*.2)) legend(region(lcolor(none))) legend(bexpand) ///
> legend(order(1 "Active hospitalized" 2 "Active ventilated") rows(1)) ///
> subtitle("active hospitalized, active ventilated", size(small)) 
{res}{txt}
{com}. 
.            
. 
. graph save "graph 11 COVID-19 daily cases etc, Iran, DELP wo CI.gph", replace
{res}{txt}(file graph 11 COVID-19 daily cases etc, Iran, DELP wo CI.gph saved)

{com}. graph export "graph 11 COVID-19 daily cases etc, Iran, DELP wo CI.pdf", replace
{txt}(file /Users/farshadpourmalek/Downloads/covir2-main/20210405/code/DELP/graph 11 COVID-19 daily cases etc, Iran, DELP wo CI.pdf written in PDF format)

{com}. 
. 
. 
. 
. 
. 
. ** DayCas DayDea DayDea_multip
. 
. 
. 
. twoway ///
> (line DayCasMeRaA01S00V03 date, sort lcolor(blue)) ///
> (line DayDeaMeRaA01S00V03 date, sort lcolor(red)) ///
> (line DayDMuMeRaA01S00V03 date, sort lpattern(dot) lcolor(red)) ///
> if date > td(01jan2020) ///
> , xtitle(Date) xlabel(, format(%tdYY-NN-DD) labsize(small)) xlabel(, grid) xlabel(, grid) ///
> xlabel(, angle(forty_five)) ylabel(, format(%12.0fc) labsize(small)) ylabel(, labsize(small) angle(horizontal)) ///
> ytitle(Daily cases and deaths) title("COVID-19 daily cases and deaths, Iran, DELP", size(medium)) ///
> xscale(lwidth(vthin) lcolor(gray*.2)) yscale(lwidth(vthin) lcolor(gray*.2)) yscale(titlegap(4)) legend(region(lcolor(none)))  ///
> legend(order(1 "Daily cases" 2 "Daily deaths" 3 "Daily deaths scaled for visualization") size(small)) ///
> subtitle("Daily deaths, scaled = times (means of cases divided by deaths) for visualization only", size(small)) ///
> note("Single scenario, mean estimate")
{res}{txt}
{com}. 
. 
. qui graph save "graph 12 COVID-19 daily deaths and cases Iran, DELP.gph", replace
{txt}
{com}. qui graph export "graph 12 COVID-19 daily deaths and cases Iran, DELP.pdf", replace
{txt}
{com}. 
. 
. 
. 
. 
. 
. 
. 
. 
. 
. 
. 
. 
. 
. 
. *************************************
. 
. * Locate peak dates and values - deaths 
. 
. 
. 
. 
. * consistently decreasing
. 
. 
. * start value (P7)
. 
. summ DayDeaMeRaA01S00V03 

{txt}    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayDeaMeR~03 {c |}{res}         40      59.575    7.883405         46         72
{txt}
{com}. 
. gen DayDeaMeRaA01S00V03P7V = r(max)
{txt}
{com}. 
. label var DayDeaMeRaA01S00V03P7V "DayDeaMeRaA01S00V03 start Value"
{txt}
{com}. 
. summ date 

{txt}    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
{space 8}date {c |}{res}         41       22395    11.97915      22375      22415
{txt}
{com}. 
. gen DayDeaMeRaA01S00V03P7D = r(min)
{txt}
{com}. 
. label var DayDeaMeRaA01S00V03P7D "DayDeaMeRaA01S00V03 start Date"
{txt}
{com}. 
. format DayDeaMeRaA01S00V03P7D %tdDDMonCCYY
{txt}
{com}. 
. 
. summ DayDeaLoRaA01S00V03 if date == DayDeaMeRaA01S00V03P7D

{txt}    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayDeaLoR~03 {c |}{res}          0
{txt}
{com}. 
. gen DayDeaLoRaA01S00V03P7V = r(min)
{txt}(41 missing values generated)

{com}. 
. label var DayDeaLoRaA01S00V03P7V "DayDeaLoRaA01S00V03 start Value"
{txt}
{com}. 
. 
. summ DayDeaUpRaA01S00V03 if date == DayDeaMeRaA01S00V03P7D

{txt}    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayDeaUpR~03 {c |}{res}          0
{txt}
{com}. 
. gen DayDeaUpRaA01S00V03P7V = r(max)
{txt}(41 missing values generated)

{com}. 
. label var DayDeaUpRaA01S00V03P7V "DayDeaUpRaA01S00V03 start Value"
{txt}
{com}. 
. 
. tab1 DayDeaMeRaA01S00V03P7V DayDeaLoRaA01S00V03P7V DayDeaUpRaA01S00V03P7V DayDeaMeRaA01S00V03P7D

{res}-> tabulation of DayDeaMeRaA01S00V03P7V  

{txt}DayDeaMeRaA {c |}
   01S00V03 {c |}
start Value {c |}      Freq.     Percent        Cum.
{hline 12}{c +}{hline 35}
         72 {c |}{res}         41      100.00      100.00
{txt}{hline 12}{c +}{hline 35}
      Total {c |}{res}         41      100.00

-> tabulation of DayDeaLoRaA01S00V03P7V  
{txt}no observations

{res}-> tabulation of DayDeaUpRaA01S00V03P7V  
{txt}no observations

{res}-> tabulation of DayDeaMeRaA01S00V03P7D  

{txt}DayDeaMeRaA {c |}
   01S00V03 {c |}
 start Date {c |}      Freq.     Percent        Cum.
{hline 12}{c +}{hline 35}
  05Apr2021 {c |}{res}         41      100.00      100.00
{txt}{hline 12}{c +}{hline 35}
      Total {c |}{res}         41      100.00
{txt}
{com}. 
. tab1 DayDeaMeRaA01S00V03 DayDeaLoRaA01S00V03 DayDeaUpRaA01S00V03 if date == td(06apr2021)

{res}-> tabulation of DayDeaMeRaA01S00V03 if date == td(06apr2021) 

      {txt}Daily {c |}
Deaths Mean {c |}
 DELP S0 V3 {c |}      Freq.     Percent        Cum.
{hline 12}{c +}{hline 35}
         72 {c |}{res}          1      100.00      100.00
{txt}{hline 12}{c +}{hline 35}
      Total {c |}{res}          1      100.00

-> tabulation of DayDeaLoRaA01S00V03 if date == td(06apr2021) 

      {txt}Daily {c |}
     Deaths {c |}
 Lower DELP {c |}
      S0 V3 {c |}      Freq.     Percent        Cum.
{hline 12}{c +}{hline 35}
          0 {c |}{res}          1      100.00      100.00
{txt}{hline 12}{c +}{hline 35}
      Total {c |}{res}          1      100.00

-> tabulation of DayDeaUpRaA01S00V03 if date == td(06apr2021) 

      {txt}Daily {c |}
     Deaths {c |}
 Upper DELP {c |}
      S0 V3 {c |}      Freq.     Percent        Cum.
{hline 12}{c +}{hline 35}
        335 {c |}{res}          1      100.00      100.00
{txt}{hline 12}{c +}{hline 35}
      Total {c |}{res}          1      100.00
{txt}
{com}. 
. 
. 
. 
. * end value (P8)
. 
. summ DayDeaMeRaA01S00V03 if date == td(15may2021)

{txt}    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayDeaMeR~03 {c |}{res}          1          46           .         46         46
{txt}
{com}. 
. gen DayDeaMeRaA01S00V03P8V = r(max)
{txt}
{com}. 
. label var DayDeaMeRaA01S00V03P8V "DayDeaMeRaA01S00V03 end Value"
{txt}
{com}. 
. 
. summ date 

{txt}    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
{space 8}date {c |}{res}         41       22395    11.97915      22375      22415
{txt}
{com}. 
. gen DayDeaMeRaA01S00V03P8D = r(max) 
{txt}
{com}. 
. label var DayDeaMeRaA01S00V03P8D "DayDeaMeRaA01S00V03 end Date"
{txt}
{com}. 
. format DayDeaMeRaA01S00V03P8D %tdDDMonCCYY
{txt}
{com}. 
. 
. summ DayDeaLoRaA01S00V03 if date == DayDeaMeRaA01S00V03P8D

{txt}    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayDeaLoR~03 {c |}{res}          1          25           .         25         25
{txt}
{com}. 
. gen DayDeaLoRaA01S00V03P8V = r(max)
{txt}
{com}. 
. label var DayDeaLoRaA01S00V03P8V "DayDeaLoRaA01S00V03 end Value"
{txt}
{com}. 
. 
. summ DayDeaUpRaA01S00V03 if date == DayDeaMeRaA01S00V03P8D

{txt}    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayDeaUpR~03 {c |}{res}          1          67           .         67         67
{txt}
{com}. 
. gen DayDeaUpRaA01S00V03P8V = r(min)
{txt}
{com}. 
. label var DayDeaUpRaA01S00V03P8V "DayDeaUpRaA01S00V03 end Value"
{txt}
{com}. 
. 
. tab1 DayDeaMeRaA01S00V03P8V DayDeaLoRaA01S00V03P8V DayDeaUpRaA01S00V03P8V DayDeaMeRaA01S00V03P8D

{res}-> tabulation of DayDeaMeRaA01S00V03P8V  

{txt}DayDeaMeRaA {c |}
   01S00V03 {c |}
  end Value {c |}      Freq.     Percent        Cum.
{hline 12}{c +}{hline 35}
         46 {c |}{res}         41      100.00      100.00
{txt}{hline 12}{c +}{hline 35}
      Total {c |}{res}         41      100.00

-> tabulation of DayDeaLoRaA01S00V03P8V  

{txt}DayDeaLoRaA {c |}
   01S00V03 {c |}
  end Value {c |}      Freq.     Percent        Cum.
{hline 12}{c +}{hline 35}
         25 {c |}{res}         41      100.00      100.00
{txt}{hline 12}{c +}{hline 35}
      Total {c |}{res}         41      100.00

-> tabulation of DayDeaUpRaA01S00V03P8V  

{txt}DayDeaUpRaA {c |}
   01S00V03 {c |}
  end Value {c |}      Freq.     Percent        Cum.
{hline 12}{c +}{hline 35}
         67 {c |}{res}         41      100.00      100.00
{txt}{hline 12}{c +}{hline 35}
      Total {c |}{res}         41      100.00

-> tabulation of DayDeaMeRaA01S00V03P8D  

{txt}DayDeaMeRaA {c |}
   01S00V03 {c |}
   end Date {c |}      Freq.     Percent        Cum.
{hline 12}{c +}{hline 35}
  15May2021 {c |}{res}         41      100.00      100.00
{txt}{hline 12}{c +}{hline 35}
      Total {c |}{res}         41      100.00
{txt}
{com}. 
. tab1 DayDeaMeRaA01S00V03 DayDeaLoRaA01S00V03 DayDeaUpRaA01S00V03 if date == td(15may2021)

{res}-> tabulation of DayDeaMeRaA01S00V03 if date == td(15may2021) 

      {txt}Daily {c |}
Deaths Mean {c |}
 DELP S0 V3 {c |}      Freq.     Percent        Cum.
{hline 12}{c +}{hline 35}
         46 {c |}{res}          1      100.00      100.00
{txt}{hline 12}{c +}{hline 35}
      Total {c |}{res}          1      100.00

-> tabulation of DayDeaLoRaA01S00V03 if date == td(15may2021) 

      {txt}Daily {c |}
     Deaths {c |}
 Lower DELP {c |}
      S0 V3 {c |}      Freq.     Percent        Cum.
{hline 12}{c +}{hline 35}
         25 {c |}{res}          1      100.00      100.00
{txt}{hline 12}{c +}{hline 35}
      Total {c |}{res}          1      100.00

-> tabulation of DayDeaUpRaA01S00V03 if date == td(15may2021) 

      {txt}Daily {c |}
     Deaths {c |}
 Upper DELP {c |}
      S0 V3 {c |}      Freq.     Percent        Cum.
{hline 12}{c +}{hline 35}
         67 {c |}{res}          1      100.00      100.00
{txt}{hline 12}{c +}{hline 35}
      Total {c |}{res}          1      100.00
{txt}
{com}. 
. 
. *************************************************
. 
. * Locate peak dates and values - cases 
. 
. 
. * consistently decreasing
. 
. 
. 
. * start value (P7)
. 
. 
. gen DayCasMeRaA01S00V03P7D = td(06apr2021)
{txt}
{com}. 
. label var DayCasMeRaA01S00V03P7D "DayCasMeRaA01S00V03 start Date"
{txt}
{com}. 
. format DayCasMeRaA01S00V03P7D %tdDDMonCCYY
{txt}
{com}. 
. 
. summ DayCasMeRaA01S00V03 if date == DayCasMeRaA01S00V03P7D

{txt}    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayCasMeR~03 {c |}{res}          1        8037           .       8037       8037
{txt}
{com}. 
. gen DayCasMeRaA01S00V03P7V = r(max)
{txt}
{com}. 
. label var DayCasMeRaA01S00V03P7V "DayCasMeRaA01S00V03 start Value"
{txt}
{com}. 
. 
. summ DayCasLoRaA01S00V03 if date == DayCasMeRaA01S00V03P7D

{txt}    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayCasLoR~03 {c |}{res}          1           0           .          0          0
{txt}
{com}. 
. gen DayCasLoRaA01S00V03P7V = r(min)
{txt}
{com}. 
. label var DayCasLoRaA01S00V03P7V "DayCasLoRaA01S00V03 start Value"
{txt}
{com}. 
. 
. summ DayCasUpRaA01S00V03 if date == DayCasMeRaA01S00V03P7D

{txt}    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayCasUpR~03 {c |}{res}          1       23813           .      23813      23813
{txt}
{com}. 
. gen DayCasUpRaA01S00V03P7V = r(max)
{txt}
{com}. 
. label var DayCasUpRaA01S00V03P7V "DayCasUpRaA01S00V03 start Value"
{txt}
{com}. 
. tab1 DayCasMeRaA01S00V03P7V DayCasLoRaA01S00V03P7V DayCasUpRaA01S00V03P7V DayCasMeRaA01S00V03P7D

{res}-> tabulation of DayCasMeRaA01S00V03P7V  

{txt}DayCasMeRaA {c |}
   01S00V03 {c |}
start Value {c |}      Freq.     Percent        Cum.
{hline 12}{c +}{hline 35}
       8037 {c |}{res}         41      100.00      100.00
{txt}{hline 12}{c +}{hline 35}
      Total {c |}{res}         41      100.00

-> tabulation of DayCasLoRaA01S00V03P7V  

{txt}DayCasLoRaA {c |}
   01S00V03 {c |}
start Value {c |}      Freq.     Percent        Cum.
{hline 12}{c +}{hline 35}
          0 {c |}{res}         41      100.00      100.00
{txt}{hline 12}{c +}{hline 35}
      Total {c |}{res}         41      100.00

-> tabulation of DayCasUpRaA01S00V03P7V  

{txt}DayCasUpRaA {c |}
   01S00V03 {c |}
start Value {c |}      Freq.     Percent        Cum.
{hline 12}{c +}{hline 35}
      23813 {c |}{res}         41      100.00      100.00
{txt}{hline 12}{c +}{hline 35}
      Total {c |}{res}         41      100.00

-> tabulation of DayCasMeRaA01S00V03P7D  

{txt}DayCasMeRaA {c |}
   01S00V03 {c |}
 start Date {c |}      Freq.     Percent        Cum.
{hline 12}{c +}{hline 35}
  06Apr2021 {c |}{res}         41      100.00      100.00
{txt}{hline 12}{c +}{hline 35}
      Total {c |}{res}         41      100.00
{txt}
{com}. 
. tab1 DayCasMeRaA01S00V03 DayCasLoRaA01S00V03 DayCasUpRaA01S00V03 if date == td(06apr2021)

{res}-> tabulation of DayCasMeRaA01S00V03 if date == td(06apr2021) 

{txt}Daily Cases {c |}
  Mean DELP {c |}
      S0 V3 {c |}      Freq.     Percent        Cum.
{hline 12}{c +}{hline 35}
       8037 {c |}{res}          1      100.00      100.00
{txt}{hline 12}{c +}{hline 35}
      Total {c |}{res}          1      100.00

-> tabulation of DayCasLoRaA01S00V03 if date == td(06apr2021) 

{txt}Daily Cases {c |}
 Lower DELP {c |}
      S0 V3 {c |}      Freq.     Percent        Cum.
{hline 12}{c +}{hline 35}
          0 {c |}{res}          1      100.00      100.00
{txt}{hline 12}{c +}{hline 35}
      Total {c |}{res}          1      100.00

-> tabulation of DayCasUpRaA01S00V03 if date == td(06apr2021) 

{txt}Daily Cases {c |}
 Upper DELP {c |}
      S0 V3 {c |}      Freq.     Percent        Cum.
{hline 12}{c +}{hline 35}
      23813 {c |}{res}          1      100.00      100.00
{txt}{hline 12}{c +}{hline 35}
      Total {c |}{res}          1      100.00
{txt}
{com}. 
. 
. 
. 
. 
. * end value (P8)
. 
. summ DayCasMeRaA01S00V03 

{txt}    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayCasMeR~03 {c |}{res}         40    7112.375    646.8832       5913       8037
{txt}
{com}. 
. gen DayCasMeRaA01S00V03P8V = r(min)
{txt}
{com}. 
. label var DayCasMeRaA01S00V03P8V "DayCasMeRaA01S00V03 end Value"
{txt}
{com}. 
. 
. summ date 

{txt}    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
{space 8}date {c |}{res}         41       22395    11.97915      22375      22415
{txt}
{com}. 
. gen DayCasMeRaA01S00V03P8D = r(max)
{txt}
{com}. 
. label var DayCasMeRaA01S00V03P8D "DayCasMeRaA01S00V03 end Date"
{txt}
{com}. 
. format DayCasMeRaA01S00V03P8D %tdDDMonCCYY
{txt}
{com}. 
. 
. summ DayCasLoRaA01S00V03 if date == DayCasMeRaA01S00V03P8D

{txt}    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayCasLoR~03 {c |}{res}          1        4658           .       4658       4658
{txt}
{com}. 
. gen DayCasLoRaA01S00V03P8V = r(max)
{txt}
{com}. 
. label var DayCasLoRaA01S00V03P8V "DayCasLoRaA01S00V03 end Value"
{txt}
{com}. 
. 
. summ DayCasUpRaA01S00V03 if date == DayCasMeRaA01S00V03P8D

{txt}    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayCasUpR~03 {c |}{res}          1        7168           .       7168       7168
{txt}
{com}. 
. gen DayCasUpRaA01S00V03P8V = r(min)
{txt}
{com}. 
. label var DayCasUpRaA01S00V03P8V "DayCasUpRaA01S00V03 end Value"
{txt}
{com}. 
. tab1 DayCasMeRaA01S00V03P8V DayCasLoRaA01S00V03P8V DayCasUpRaA01S00V03P8V DayCasMeRaA01S00V03P8D

{res}-> tabulation of DayCasMeRaA01S00V03P8V  

{txt}DayCasMeRaA {c |}
   01S00V03 {c |}
  end Value {c |}      Freq.     Percent        Cum.
{hline 12}{c +}{hline 35}
       5913 {c |}{res}         41      100.00      100.00
{txt}{hline 12}{c +}{hline 35}
      Total {c |}{res}         41      100.00

-> tabulation of DayCasLoRaA01S00V03P8V  

{txt}DayCasLoRaA {c |}
   01S00V03 {c |}
  end Value {c |}      Freq.     Percent        Cum.
{hline 12}{c +}{hline 35}
       4658 {c |}{res}         41      100.00      100.00
{txt}{hline 12}{c +}{hline 35}
      Total {c |}{res}         41      100.00

-> tabulation of DayCasUpRaA01S00V03P8V  

{txt}DayCasUpRaA {c |}
   01S00V03 {c |}
  end Value {c |}      Freq.     Percent        Cum.
{hline 12}{c +}{hline 35}
       7168 {c |}{res}         41      100.00      100.00
{txt}{hline 12}{c +}{hline 35}
      Total {c |}{res}         41      100.00

-> tabulation of DayCasMeRaA01S00V03P8D  

{txt}DayCasMeRaA {c |}
   01S00V03 {c |}
   end Date {c |}      Freq.     Percent        Cum.
{hline 12}{c +}{hline 35}
  15May2021 {c |}{res}         41      100.00      100.00
{txt}{hline 12}{c +}{hline 35}
      Total {c |}{res}         41      100.00
{txt}
{com}. 
. tab1 DayCasMeRaA01S00V03 DayCasLoRaA01S00V03 DayCasUpRaA01S00V03 if date == td(15may2021)

{res}-> tabulation of DayCasMeRaA01S00V03 if date == td(15may2021) 

{txt}Daily Cases {c |}
  Mean DELP {c |}
      S0 V3 {c |}      Freq.     Percent        Cum.
{hline 12}{c +}{hline 35}
       5913 {c |}{res}          1      100.00      100.00
{txt}{hline 12}{c +}{hline 35}
      Total {c |}{res}          1      100.00

-> tabulation of DayCasLoRaA01S00V03 if date == td(15may2021) 

{txt}Daily Cases {c |}
 Lower DELP {c |}
      S0 V3 {c |}      Freq.     Percent        Cum.
{hline 12}{c +}{hline 35}
       4658 {c |}{res}          1      100.00      100.00
{txt}{hline 12}{c +}{hline 35}
      Total {c |}{res}          1      100.00

-> tabulation of DayCasUpRaA01S00V03 if date == td(15may2021) 

{txt}Daily Cases {c |}
 Upper DELP {c |}
      S0 V3 {c |}      Freq.     Percent        Cum.
{hline 12}{c +}{hline 35}
       7168 {c |}{res}          1      100.00      100.00
{txt}{hline 12}{c +}{hline 35}
      Total {c |}{res}          1      100.00
{txt}
{com}. 
. 
. 
. sort date
{txt}
{com}. 
. compress
  {txt}variable {bf}date{sf} was {bf}{res}float{sf}{txt} now {bf}{res}int{sf}
  {txt}variable {bf}DayDeaMeRaA01S00V03{sf} was {bf}{res}float{sf}{txt} now {bf}{res}byte{sf}
  {txt}variable {bf}DayDeaLoRaA01S00V03{sf} was {bf}{res}float{sf}{txt} now {bf}{res}byte{sf}
  {txt}variable {bf}DayDeaUpRaA01S00V03{sf} was {bf}{res}float{sf}{txt} now {bf}{res}int{sf}
  {txt}variable {bf}DayCasMeRaA01S00V03{sf} was {bf}{res}float{sf}{txt} now {bf}{res}int{sf}
  {txt}variable {bf}DayCasLoRaA01S00V03{sf} was {bf}{res}float{sf}{txt} now {bf}{res}int{sf}
  {txt}variable {bf}DayCasUpRaA01S00V03{sf} was {bf}{res}float{sf}{txt} now {bf}{res}int{sf}
  {txt}variable {bf}DayHosMeRaA01S00V03{sf} was {bf}{res}long{sf}{txt} now {bf}{res}int{sf}
  {txt}variable {bf}DayVenMeRaA01S00V03{sf} was {bf}{res}long{sf}{txt} now {bf}{res}int{sf}
  {txt}variable {bf}TotHosMeRaA01S00V03{sf} was {bf}{res}long{sf}{txt} now {bf}{res}int{sf}
  {txt}variable {bf}DayDeaMeRaA01S00V03P7V{sf} was {bf}{res}float{sf}{txt} now {bf}{res}byte{sf}
  {txt}variable {bf}DayDeaMeRaA01S00V03P7D{sf} was {bf}{res}float{sf}{txt} now {bf}{res}int{sf}
  {txt}variable {bf}DayDeaLoRaA01S00V03P7V{sf} was {bf}{res}float{sf}{txt} now {bf}{res}byte{sf}
  {txt}variable {bf}DayDeaUpRaA01S00V03P7V{sf} was {bf}{res}float{sf}{txt} now {bf}{res}byte{sf}
  {txt}variable {bf}DayDeaMeRaA01S00V03P8V{sf} was {bf}{res}float{sf}{txt} now {bf}{res}byte{sf}
  {txt}variable {bf}DayDeaMeRaA01S00V03P8D{sf} was {bf}{res}float{sf}{txt} now {bf}{res}int{sf}
  {txt}variable {bf}DayDeaLoRaA01S00V03P8V{sf} was {bf}{res}float{sf}{txt} now {bf}{res}byte{sf}
  {txt}variable {bf}DayDeaUpRaA01S00V03P8V{sf} was {bf}{res}float{sf}{txt} now {bf}{res}byte{sf}
  {txt}variable {bf}DayCasMeRaA01S00V03P7D{sf} was {bf}{res}float{sf}{txt} now {bf}{res}int{sf}
  {txt}variable {bf}DayCasMeRaA01S00V03P7V{sf} was {bf}{res}float{sf}{txt} now {bf}{res}int{sf}
  {txt}variable {bf}DayCasLoRaA01S00V03P7V{sf} was {bf}{res}float{sf}{txt} now {bf}{res}byte{sf}
  {txt}variable {bf}DayCasUpRaA01S00V03P7V{sf} was {bf}{res}float{sf}{txt} now {bf}{res}int{sf}
  {txt}variable {bf}DayCasMeRaA01S00V03P8V{sf} was {bf}{res}float{sf}{txt} now {bf}{res}int{sf}
  {txt}variable {bf}DayCasMeRaA01S00V03P8D{sf} was {bf}{res}float{sf}{txt} now {bf}{res}int{sf}
  {txt}variable {bf}DayCasLoRaA01S00V03P8V{sf} was {bf}{res}float{sf}{txt} now {bf}{res}int{sf}
  {txt}variable {bf}DayCasUpRaA01S00V03P8V{sf} was {bf}{res}float{sf}{txt} now {bf}{res}int{sf}
  {txt}variable {bf}loc_grand_name{sf} was {bf}{res}str24{sf}{txt} now {bf}{res}str4{sf}
{txt}  (3,321 bytes saved)

{com}. 
. save "Iran DELP.dta", replace
{txt}file Iran DELP.dta saved

{com}. 
. 
. 
. 
. 
. 
. view "log Iran DELP.smcl"
{txt}
{com}. 
. log close
      {txt}name:  {res}<unnamed>
       {txt}log:  {res}/Users/farshadpourmalek/Downloads/covir2-main/20210405/code/DELP/log Iran DELP.smcl
  {txt}log type:  {res}smcl
 {txt}closed on:  {res}24 Apr 2021, 07:46:09
{txt}{.-}
{smcl}
{txt}{sf}{ul off}