{smcl}
{com}{sf}{ul off}{txt}{.-}
      name:  {res}<unnamed>
       {txt}log:  {res}/Users/farshadpourmalek/Downloads/covir2-main/20220116/code/JOHN/log country JOHN.smcl
  {txt}log type:  {res}smcl
 {txt}opened on:  {res}17 Jan 2022, 07:36:42
{txt}
{com}. 
. ***************************************************************************
. * This is "do country JOHN.do"
. 
. * Project: CovidVisualized country - countries without subnational estimates
. * Person: Farshad Pourmalek pourmalek_farshad@yahoo.com
. * Time (initial): 2021-02-10
. 
. * OBJECTIVE: Get and prepare Johns Hopkins data for country
. ***************************************************************************
. 
. 
. 
. * get Johns Hopkins data for deaths
. 
. 
. import delimited ///
> "https://raw.githubusercontent.com/CSSEGISandData/COVID-19/master/csse_covid_19_data/csse_covid_19_time_series/time_series_covid19_deaths_global.csv" ///
> , clear varnames(1) colrange(2:2)
{res}{text}(1 var, 280 obs)

{com}. 
. save "time_series_covid19_deaths_global col 2.dta", replace
{txt}file time_series_covid19_deaths_global col 2.dta saved

{com}. 
. 
. import delimited ///
> "https://raw.githubusercontent.com/CSSEGISandData/COVID-19/master/csse_covid_19_data/csse_covid_19_time_series/time_series_covid19_deaths_global.csv" ///
> , clear varnames(1) colrange(5)
{res}{text}(726 vars, 280 obs)

{com}. 
. 
. save "time_series_covid19_deaths_global col 5 on.dta", replace
{txt}file time_series_covid19_deaths_global col 5 on.dta saved

{com}. 
. 
. use "time_series_covid19_deaths_global col 2.dta", clear 
{txt}
{com}. 
. merge 1:1 _n using "time_series_covid19_deaths_global col 5 on.dta"
{res}
{txt}{col 5}Result{col 38}# of obs.
{col 5}{hline 41}
{col 5}not matched{col 30}{res}               0
{txt}{col 5}matched{col 30}{res}             280{txt}  (_merge==3)
{col 5}{hline 41}

{com}. 
. 
. rename countryregion loc_grand_name
{res}{txt}
{com}. 
. label var loc_grand_name "location grand name"
{txt}
{com}. 
. keep if regexm(loc_grand_name,"$country") == 1
{txt}(279 observations deleted)

{com}. 
. order loc_grand_name, last
{txt}
{com}. 
. gen counter = _n
{txt}
{com}. 
. reshape long v, i(counter) 
{txt}(note: j = 1 2 3 4 5 6 7 8 9 10 11 12 13 14 15 16 17 18 19 20 21 22 23 24 25 26 27 28 29 30 31 32 33 34 35 36 37 38 39 40 41 42 43 44 45 46 47 48 49 50 51 52 53 54 55 56 57 58 59 60 61 62 63 64 65 66 67 68 69 70 71 72 73 74 75 76 77 78 79 80 81 82 83 84 85 86 87 88 89 90 91 92 93 94 95 96 97 98 99 100 101 102 103 104 105 106 107 108 109 110 111 112 113 114 115 116 117 118 119 120 121 122 123 124 125 126 127 128 129 130 131 132 133 134 135 136 137 138 139 140 141 142 143 144 145 146 147 148 149 150 151 152 153 154 155 156 157 158 159 160 161 162 163 164 165 166 167 168 169 170 171 172 173 174 175 176 177 178 179 180 181 182 183 184 185 186 187 188 189 190 191 192 193 194 195 196 197 198 199 200 201 202 203 204 205 206 207 208 209 210 211 212 213 214 215 216 217 218 219 220 221 222 223 224 225 226 227 228 229 230 231 232 233 234 235 236 237 238 239 240 241 242 243 244 245 246 247 248 249 250 251 252 253 254 255 256 257 258 259 260 261 262 263 264 265 266 267 268 269 270 271 272 273 274 275 276 277 278 279 280 281 282 283 284 285 286 287 288 289 290 291 292 293 294 295 296 297 298 299 300 301 302 303 304 305 306 307 308 309 310 311 312 313 314 315 316 317 318 319 320 321 322 323 324 325 326 327 328 329 330 331 332 333 334 335 336 337 338 339 340 341 342 343 344 345 346 347 348 349 350 351 352 353 354 355 356 357 358 359 360 361 362 363 364 365 366 367 368 369 370 371 372 373 374 375 376 377 378 379 380 381 382 383 384 385 386 387 388 389 390 391 392 393 394 395 396 397 398 399 400 401 402 403 404 405 406 407 408 409 410 411 412 413 414 415 416 417 418 419 420 421 422 423 424 425 426 427 428 429 430 431 432 433 434 435 436 437 438 439 440 441 442 443 444 445 446 447 448 449 450 451 452 453 454 455 456 457 458 459 460 461 462 463 464 465 466 467 468 469 470 471 472 473 474 475 476 477 478 479 480 481 482 483 484 485 486 487 488 489 490 491 492 493 494 495 496 497 498 499 500 501 502 503 504 505 506 507 508 509 510 511 512 513 514 515 516 517 518 519 520 521 522 523 524 525 526 527 528 529 530 531 532 533 534 535 536 537 538 539 540 541 542 543 544 545 546 547 548 549 550 551 552 553 554 555 556 557 558 559 560 561 562 563 564 565 566 567 568 569 570 571 572 573 574 575 576 577 578 579 580 581 582 583 584 585 586 587 588 589 590 591 592 593 594 595 596 597 598 599 600 601 602 603 604 605 606 607 608 609 610 611 612 613 614 615 616 617 618 619 620 621 622 623 624 625 626 627 628 629 630 631 632 633 634 635 636 637 638 639 640 641 642 643 644 645 646 647 648 649 650 651 652 653 654 655 656 657 658 659 660 661 662 663 664 665 666 667 668 669 670 671 672 673 674 675 676 677 678 679 680 681 682 683 684 685 686 687 688 689 690 691 692 693 694 695 696 697 698 699 700 701 702 703 704 705 706 707 708 709 710 711 712 713 714 715 716 717 718 719 720 721 722 723 724 725 726)

Data{col 36}wide{col 43}->{col 48}long
{hline 77}
Number of obs.                 {res}       1   {txt}->{res}     726
{txt}Number of variables            {res}     729   {txt}->{res}       5
{txt}j variable (726 values)                   ->   {res}_j
{txt}xij variables:
                         {res}v1 v2 ... v726   {txt}->   {res}v
{txt}{hline 77}

{com}. 
. drop counter 
{txt}
{com}. 
. codebook _j

{txt}{hline}
{res}_j{right:(unlabeled)}
{txt}{hline}

{col 19}type:  numeric ({res}int{txt})

{col 18}range:  [{res}1{txt},{res}726{txt}]{col 55}units:  {res}1
{col 10}{txt}unique values:  {res}726{col 51}{txt}missing .:  {res}0{txt}/{res}726

{txt}{col 19}mean:{res}{col 26}   363.5
{txt}{col 15}std. dev:{res}{col 26} 209.722

{txt}{col 12}percentiles:{col 32}10%{col 42}25%{col 52}50%{col 62}75%{col 72}90%
{res}{col 27}      73{col 37}     182{col 47}   363.5{col 57}     545{col 67}     654
{txt}
{com}. 
. 
. 
. gen date = date("22 Jan 2020", "DMY")
{txt}
{com}. 
. replace date = date + _j - 1
{txt}(725 real changes made)

{com}. 
. format date %td
{txt}
{com}. 
. codebook date

{txt}{hline}
{res}date{right:(unlabeled)}
{txt}{hline}

{col 19}type:  numeric daily date ({res}float{txt})

{col 18}range:  [{res}21936{txt},{res}22661{txt}]{col 55}units:  {res}1
{col 8}{txt}or equivalently:  [{res}22jan2020{txt},{res}16jan2022{txt}]{col 55}units:  {res}days
{col 10}{txt}unique values:  {res}726{col 51}{txt}missing .:  {res}0{txt}/{res}726

{txt}{col 19}mean:{res}{col 26} 22298.5{txt} = {res}18jan2021{txt} (+ 12 hours)
{col 15}std. dev:{res}{col 26} 209.722

{txt}{col 12}percentiles:{col 32}10%{col 42}25%{col 52}50%{col 62}75%{col 72}90%
{res}{col 27}   22008{col 37}   22117{col 47} 22298.5{col 57}   22480{col 67}   22589
{col 26}03apr2020{col 36}21jul2020{col 46}18jan2021{col 56}19jul2021{col 66}05nov2021
{txt}
{com}. 
. order date 
{txt}
{com}. 
. rename v TotDeaMeRaA00S00
{res}{txt}
{com}. 
. label var TotDeaMeRaA00S00 "Total Deaths JOHN"
{txt}
{com}. 
. destring TotDeaMeRaA00S00, replace
{txt}TotDeaMeRaA00S00: all characters numeric; {res}replaced {txt}as {res}long
{txt}
{com}. 
. list TotDeaMeRaA00S00 if date == td(19feb2020) // Shoule be 2
{txt}
     {c TLC}{hline 10}{c TRC}
     {c |} {res}TotDe~00 {txt}{c |}
     {c LT}{hline 10}{c RT}
 29. {c |} {res}       2 {txt}{c |}
     {c BLC}{hline 10}{c BRC}

{com}. 
. gen DayDeaMeRaA00S00 =  TotDeaMeRaA00S00[_n] - TotDeaMeRaA00S00[_n-1]
{txt}(1 missing value generated)

{com}. 
. label var DayDeaMeRaA00S00 "Daily Deaths JOHN"
{txt}
{com}. 
. replace DayDeaMeRaA00S00 = TotDeaMeRaA00S00 if _j == 1
{txt}(1 real change made)

{com}. 
. replace TotDeaMeRaA00S00 = . if date < td(19feb2020)
{txt}(28 real changes made, 28 to missing)

{com}. 
. replace DayDeaMeRaA00S00 = . if date < td(19feb2020)
{txt}(28 real changes made, 28 to missing)

{com}. 
. drop _j _merge
{txt}
{com}. 
. 
. 
. gen DayDeaMeRaA00S00_CF2 = DayDeaMeRaA00S00 * 2
{txt}(28 missing values generated)

{com}. 
. label var DayDeaMeRaA00S00_CF2 "Daily Deaths JOHN correction factor 2"
{txt}
{com}. 
. gen DayDeaMeRaA00S00_CF5 = DayDeaMeRaA00S00 * 5
{txt}(28 missing values generated)

{com}. 
. label var DayDeaMeRaA00S00_CF5 "Daily Deaths JOHN correction factor 5"
{txt}
{com}. 
. gen TotDeaMeRaA00S00_CF2 = TotDeaMeRaA00S00 * 2
{txt}(28 missing values generated)

{com}. 
. label var TotDeaMeRaA00S00_CF2 "Total Deaths JOHN correction factor 2"
{txt}
{com}. 
. gen TotDeaMeRaA00S00_CF5 = TotDeaMeRaA00S00 * 5
{txt}(28 missing values generated)

{com}. 
. label var TotDeaMeRaA00S00_CF5 "Total Deaths JOHN correction factor 5"
{txt}
{com}. 
. 
. 
. order date loc_grand_name DayDeaMeRaA00S00 TotDeaMeRaA00S00 DayDeaMeRaA00S00_CF2 DayDeaMeRaA00S00_CF5 TotDeaMeRaA00S00_CF2 TotDeaMeRaA00S00_CF5
{txt}
{com}.                                         
. 
. sort date
{txt}
{com}. 
. save "country JOHN deaths.dta", replace
{txt}(note: file country JOHN deaths.dta not found)
file country JOHN deaths.dta saved

{com}. 
. 
. 
. 
. 
. 
. 
. 
. 
. * get Johns Hopkins data for cases
. 
. 
. import delimited using ///
> "https://raw.githubusercontent.com/CSSEGISandData/COVID-19/master/csse_covid_19_data/csse_covid_19_time_series/time_series_covid19_confirmed_global.csv" ///
> , clear varnames(1) colrange(2:2)
{res}{text}(1 var, 280 obs)

{com}. 
. save "time_series_covid19_confirmed_global col 2.dta", replace
{txt}(note: file time_series_covid19_confirmed_global col 2.dta not found)
file time_series_covid19_confirmed_global col 2.dta saved

{com}. 
. 
. import delimited using ///
> "https://raw.githubusercontent.com/CSSEGISandData/COVID-19/master/csse_covid_19_data/csse_covid_19_time_series/time_series_covid19_confirmed_global.csv" ///
> , clear varnames(1) colrange(5)
{res}{text}(726 vars, 280 obs)

{com}. 
. save "time_series_covid19_confirmed_global col 5 on.dta", replace
{txt}(note: file time_series_covid19_confirmed_global col 5 on.dta not found)
file time_series_covid19_confirmed_global col 5 on.dta saved

{com}. 
. 
. use "time_series_covid19_confirmed_global col 2.dta", clear 
{txt}
{com}. 
. merge 1:1 _n using "time_series_covid19_confirmed_global col 5 on.dta"
{res}
{txt}{col 5}Result{col 38}# of obs.
{col 5}{hline 41}
{col 5}not matched{col 30}{res}               0
{txt}{col 5}matched{col 30}{res}             280{txt}  (_merge==3)
{col 5}{hline 41}

{com}. 
. 
. rename countryregion loc_grand_name
{res}{txt}
{com}. 
. keep if regexm(loc_grand_name,"$country") == 1
{txt}(279 observations deleted)

{com}. 
. order loc_grand_name, last
{txt}
{com}. 
. gen counter = _n
{txt}
{com}. 
. reshape long v, i(counter) 
{txt}(note: j = 1 2 3 4 5 6 7 8 9 10 11 12 13 14 15 16 17 18 19 20 21 22 23 24 25 26 27 28 29 30 31 32 33 34 35 36 37 38 39 40 41 42 43 44 45 46 47 48 49 50 51 52 53 54 55 56 57 58 59 60 61 62 63 64 65 66 67 68 69 70 71 72 73 74 75 76 77 78 79 80 81 82 83 84 85 86 87 88 89 90 91 92 93 94 95 96 97 98 99 100 101 102 103 104 105 106 107 108 109 110 111 112 113 114 115 116 117 118 119 120 121 122 123 124 125 126 127 128 129 130 131 132 133 134 135 136 137 138 139 140 141 142 143 144 145 146 147 148 149 150 151 152 153 154 155 156 157 158 159 160 161 162 163 164 165 166 167 168 169 170 171 172 173 174 175 176 177 178 179 180 181 182 183 184 185 186 187 188 189 190 191 192 193 194 195 196 197 198 199 200 201 202 203 204 205 206 207 208 209 210 211 212 213 214 215 216 217 218 219 220 221 222 223 224 225 226 227 228 229 230 231 232 233 234 235 236 237 238 239 240 241 242 243 244 245 246 247 248 249 250 251 252 253 254 255 256 257 258 259 260 261 262 263 264 265 266 267 268 269 270 271 272 273 274 275 276 277 278 279 280 281 282 283 284 285 286 287 288 289 290 291 292 293 294 295 296 297 298 299 300 301 302 303 304 305 306 307 308 309 310 311 312 313 314 315 316 317 318 319 320 321 322 323 324 325 326 327 328 329 330 331 332 333 334 335 336 337 338 339 340 341 342 343 344 345 346 347 348 349 350 351 352 353 354 355 356 357 358 359 360 361 362 363 364 365 366 367 368 369 370 371 372 373 374 375 376 377 378 379 380 381 382 383 384 385 386 387 388 389 390 391 392 393 394 395 396 397 398 399 400 401 402 403 404 405 406 407 408 409 410 411 412 413 414 415 416 417 418 419 420 421 422 423 424 425 426 427 428 429 430 431 432 433 434 435 436 437 438 439 440 441 442 443 444 445 446 447 448 449 450 451 452 453 454 455 456 457 458 459 460 461 462 463 464 465 466 467 468 469 470 471 472 473 474 475 476 477 478 479 480 481 482 483 484 485 486 487 488 489 490 491 492 493 494 495 496 497 498 499 500 501 502 503 504 505 506 507 508 509 510 511 512 513 514 515 516 517 518 519 520 521 522 523 524 525 526 527 528 529 530 531 532 533 534 535 536 537 538 539 540 541 542 543 544 545 546 547 548 549 550 551 552 553 554 555 556 557 558 559 560 561 562 563 564 565 566 567 568 569 570 571 572 573 574 575 576 577 578 579 580 581 582 583 584 585 586 587 588 589 590 591 592 593 594 595 596 597 598 599 600 601 602 603 604 605 606 607 608 609 610 611 612 613 614 615 616 617 618 619 620 621 622 623 624 625 626 627 628 629 630 631 632 633 634 635 636 637 638 639 640 641 642 643 644 645 646 647 648 649 650 651 652 653 654 655 656 657 658 659 660 661 662 663 664 665 666 667 668 669 670 671 672 673 674 675 676 677 678 679 680 681 682 683 684 685 686 687 688 689 690 691 692 693 694 695 696 697 698 699 700 701 702 703 704 705 706 707 708 709 710 711 712 713 714 715 716 717 718 719 720 721 722 723 724 725 726)

Data{col 36}wide{col 43}->{col 48}long
{hline 77}
Number of obs.                 {res}       1   {txt}->{res}     726
{txt}Number of variables            {res}     729   {txt}->{res}       5
{txt}j variable (726 values)                   ->   {res}_j
{txt}xij variables:
                         {res}v1 v2 ... v726   {txt}->   {res}v
{txt}{hline 77}

{com}. 
. drop counter 
{txt}
{com}. 
. codebook _j

{txt}{hline}
{res}_j{right:(unlabeled)}
{txt}{hline}

{col 19}type:  numeric ({res}int{txt})

{col 18}range:  [{res}1{txt},{res}726{txt}]{col 55}units:  {res}1
{col 10}{txt}unique values:  {res}726{col 51}{txt}missing .:  {res}0{txt}/{res}726

{txt}{col 19}mean:{res}{col 26}   363.5
{txt}{col 15}std. dev:{res}{col 26} 209.722

{txt}{col 12}percentiles:{col 32}10%{col 42}25%{col 52}50%{col 62}75%{col 72}90%
{res}{col 27}      73{col 37}     182{col 47}   363.5{col 57}     545{col 67}     654
{txt}
{com}. 
. gen date = date("22 Jan 2020", "DMY")
{txt}
{com}. 
. replace date = date + _j - 1
{txt}(725 real changes made)

{com}. 
. format date %td
{txt}
{com}. 
. codebook date

{txt}{hline}
{res}date{right:(unlabeled)}
{txt}{hline}

{col 19}type:  numeric daily date ({res}float{txt})

{col 18}range:  [{res}21936{txt},{res}22661{txt}]{col 55}units:  {res}1
{col 8}{txt}or equivalently:  [{res}22jan2020{txt},{res}16jan2022{txt}]{col 55}units:  {res}days
{col 10}{txt}unique values:  {res}726{col 51}{txt}missing .:  {res}0{txt}/{res}726

{txt}{col 19}mean:{res}{col 26} 22298.5{txt} = {res}18jan2021{txt} (+ 12 hours)
{col 15}std. dev:{res}{col 26} 209.722

{txt}{col 12}percentiles:{col 32}10%{col 42}25%{col 52}50%{col 62}75%{col 72}90%
{res}{col 27}   22008{col 37}   22117{col 47} 22298.5{col 57}   22480{col 67}   22589
{col 26}03apr2020{col 36}21jul2020{col 46}18jan2021{col 56}19jul2021{col 66}05nov2021
{txt}
{com}. 
. order date 
{txt}
{com}. 
. rename v TotCasMeRaA00S00
{res}{txt}
{com}. 
. label var TotCasMeRaA00S00 "Total Cases JOHN"
{txt}
{com}. 
. destring TotCasMeRaA00S00, replace
{txt}TotCasMeRaA00S00: all characters numeric; {res}replaced {txt}as {res}long
{txt}
{com}. 
. gen DayCasMeRaA00S00 =  TotCasMeRaA00S00[_n] - TotCasMeRaA00S00[_n-1]
{txt}(1 missing value generated)

{com}. 
. label var DayCasMeRaA00S00 "Daily Cases JOHN"
{txt}
{com}. 
. replace DayCasMeRaA00S00 = TotCasMeRaA00S00 if _j == 1
{txt}(1 real change made)

{com}. 
. replace TotCasMeRaA00S00 = . if date < td(19feb2020)
{txt}(28 real changes made, 28 to missing)

{com}. 
. replace DayCasMeRaA00S00 = . if date < td(19feb2020)
{txt}(28 real changes made, 28 to missing)

{com}. 
. drop _j _merge
{txt}
{com}. 
. 
. gen DayCasMeRaA00S00_CF2 = DayCasMeRaA00S00 * 2
{txt}(28 missing values generated)

{com}. 
. label var DayCasMeRaA00S00_CF2 "Daily Cases JOHN correction factor 2"
{txt}
{com}. 
. gen DayCasMeRaA00S00_CF5 = DayCasMeRaA00S00 * 5
{txt}(28 missing values generated)

{com}. 
. label var DayCasMeRaA00S00_CF5 "Daily Cases JOHN correction factor 5"
{txt}
{com}. 
. gen TotCasMeRaA00S00_CF2 = TotCasMeRaA00S00 * 2
{txt}(28 missing values generated)

{com}. 
. label var TotCasMeRaA00S00_CF2 "Total Cases JOHN correction factor 2"
{txt}
{com}. 
. gen TotCasMeRaA00S00_CF5 = TotCasMeRaA00S00 * 5
{txt}(28 missing values generated)

{com}. 
. label var TotCasMeRaA00S00_CF5 "Total Cases JOHN correction factor 5"
{txt}
{com}. 
. 
. order date loc_grand_name DayCasMeRaA00S00 TotCasMeRaA00S00 DayCasMeRaA00S00_CF2 DayCasMeRaA00S00_CF5 TotCasMeRaA00S00_CF2 TotCasMeRaA00S00_CF5
{txt}
{com}. 
. sort date
{txt}
{com}. 
. compress
  {txt}variable {bf}date{sf} was {bf}{res}float{sf}{txt} now {bf}{res}int{sf}
  {txt}variable {bf}loc_grand_name{sf} was {bf}{res}str32{sf}{txt} now {bf}{res}str4{sf}
{txt}  (21,780 bytes saved)

{com}. 
. save "country JOHN Cases.dta", replace
{txt}(note: file country JOHN Cases.dta not found)
file country JOHN Cases.dta saved

{com}. 
. 
. 
. 
. 
. 
. 
. 
. * get Johns Hopkins data for recovered
. 
. import delimited ///
> "https://raw.githubusercontent.com/CSSEGISandData/COVID-19/master/csse_covid_19_data/csse_covid_19_time_series/time_series_covid19_recovered_global.csv" ///
> , clear varnames(1) colrange(2:2)
{res}{text}(1 var, 265 obs)

{com}. 
. save "time_series_covid19_recovered_global col 2.dta", replace
{txt}(note: file time_series_covid19_recovered_global col 2.dta not found)
file time_series_covid19_recovered_global col 2.dta saved

{com}. 
. 
. import delimited ///
> "https://raw.githubusercontent.com/CSSEGISandData/COVID-19/master/csse_covid_19_data/csse_covid_19_time_series/time_series_covid19_recovered_global.csv" ///
> , clear varnames(1) colrange(5)
{res}{text}(726 vars, 265 obs)

{com}. 
. save "time_series_covid19_recovered_global col 5 on.dta", replace
{txt}(note: file time_series_covid19_recovered_global col 5 on.dta not found)
file time_series_covid19_recovered_global col 5 on.dta saved

{com}. 
. 
. use "time_series_covid19_recovered_global col 2.dta", clear 
{txt}
{com}. 
. merge 1:1 _n using "time_series_covid19_recovered_global col 5 on.dta"
{res}
{txt}{col 5}Result{col 38}# of obs.
{col 5}{hline 41}
{col 5}not matched{col 30}{res}               0
{txt}{col 5}matched{col 30}{res}             265{txt}  (_merge==3)
{col 5}{hline 41}

{com}. 
. 
. rename countryregion loc_grand_name
{res}{txt}
{com}. 
. keep if regexm(loc_grand_name,"$country") == 1
{txt}(264 observations deleted)

{com}. 
. order loc_grand_name, last
{txt}
{com}. 
. 
. gen counter = _n
{txt}
{com}. 
. reshape long v, i(counter) 
{txt}(note: j = 1 2 3 4 5 6 7 8 9 10 11 12 13 14 15 16 17 18 19 20 21 22 23 24 25 26 27 28 29 30 31 32 33 34 35 36 37 38 39 40 41 42 43 44 45 46 47 48 49 50 51 52 53 54 55 56 57 58 59 60 61 62 63 64 65 66 67 68 69 70 71 72 73 74 75 76 77 78 79 80 81 82 83 84 85 86 87 88 89 90 91 92 93 94 95 96 97 98 99 100 101 102 103 104 105 106 107 108 109 110 111 112 113 114 115 116 117 118 119 120 121 122 123 124 125 126 127 128 129 130 131 132 133 134 135 136 137 138 139 140 141 142 143 144 145 146 147 148 149 150 151 152 153 154 155 156 157 158 159 160 161 162 163 164 165 166 167 168 169 170 171 172 173 174 175 176 177 178 179 180 181 182 183 184 185 186 187 188 189 190 191 192 193 194 195 196 197 198 199 200 201 202 203 204 205 206 207 208 209 210 211 212 213 214 215 216 217 218 219 220 221 222 223 224 225 226 227 228 229 230 231 232 233 234 235 236 237 238 239 240 241 242 243 244 245 246 247 248 249 250 251 252 253 254 255 256 257 258 259 260 261 262 263 264 265 266 267 268 269 270 271 272 273 274 275 276 277 278 279 280 281 282 283 284 285 286 287 288 289 290 291 292 293 294 295 296 297 298 299 300 301 302 303 304 305 306 307 308 309 310 311 312 313 314 315 316 317 318 319 320 321 322 323 324 325 326 327 328 329 330 331 332 333 334 335 336 337 338 339 340 341 342 343 344 345 346 347 348 349 350 351 352 353 354 355 356 357 358 359 360 361 362 363 364 365 366 367 368 369 370 371 372 373 374 375 376 377 378 379 380 381 382 383 384 385 386 387 388 389 390 391 392 393 394 395 396 397 398 399 400 401 402 403 404 405 406 407 408 409 410 411 412 413 414 415 416 417 418 419 420 421 422 423 424 425 426 427 428 429 430 431 432 433 434 435 436 437 438 439 440 441 442 443 444 445 446 447 448 449 450 451 452 453 454 455 456 457 458 459 460 461 462 463 464 465 466 467 468 469 470 471 472 473 474 475 476 477 478 479 480 481 482 483 484 485 486 487 488 489 490 491 492 493 494 495 496 497 498 499 500 501 502 503 504 505 506 507 508 509 510 511 512 513 514 515 516 517 518 519 520 521 522 523 524 525 526 527 528 529 530 531 532 533 534 535 536 537 538 539 540 541 542 543 544 545 546 547 548 549 550 551 552 553 554 555 556 557 558 559 560 561 562 563 564 565 566 567 568 569 570 571 572 573 574 575 576 577 578 579 580 581 582 583 584 585 586 587 588 589 590 591 592 593 594 595 596 597 598 599 600 601 602 603 604 605 606 607 608 609 610 611 612 613 614 615 616 617 618 619 620 621 622 623 624 625 626 627 628 629 630 631 632 633 634 635 636 637 638 639 640 641 642 643 644 645 646 647 648 649 650 651 652 653 654 655 656 657 658 659 660 661 662 663 664 665 666 667 668 669 670 671 672 673 674 675 676 677 678 679 680 681 682 683 684 685 686 687 688 689 690 691 692 693 694 695 696 697 698 699 700 701 702 703 704 705 706 707 708 709 710 711 712 713 714 715 716 717 718 719 720 721 722 723 724 725 726)

Data{col 36}wide{col 43}->{col 48}long
{hline 77}
Number of obs.                 {res}       1   {txt}->{res}     726
{txt}Number of variables            {res}     729   {txt}->{res}       5
{txt}j variable (726 values)                   ->   {res}_j
{txt}xij variables:
                         {res}v1 v2 ... v726   {txt}->   {res}v
{txt}{hline 77}

{com}. 
. drop counter 
{txt}
{com}. 
. codebook _j

{txt}{hline}
{res}_j{right:(unlabeled)}
{txt}{hline}

{col 19}type:  numeric ({res}int{txt})

{col 18}range:  [{res}1{txt},{res}726{txt}]{col 55}units:  {res}1
{col 10}{txt}unique values:  {res}726{col 51}{txt}missing .:  {res}0{txt}/{res}726

{txt}{col 19}mean:{res}{col 26}   363.5
{txt}{col 15}std. dev:{res}{col 26} 209.722

{txt}{col 12}percentiles:{col 32}10%{col 42}25%{col 52}50%{col 62}75%{col 72}90%
{res}{col 27}      73{col 37}     182{col 47}   363.5{col 57}     545{col 67}     654
{txt}
{com}. 
. 
. gen date = date("22 Jan 2020", "DMY")
{txt}
{com}. 
. replace date = date + _j - 1
{txt}(725 real changes made)

{com}. 
. format date %td
{txt}
{com}. 
. codebook date

{txt}{hline}
{res}date{right:(unlabeled)}
{txt}{hline}

{col 19}type:  numeric daily date ({res}float{txt})

{col 18}range:  [{res}21936{txt},{res}22661{txt}]{col 55}units:  {res}1
{col 8}{txt}or equivalently:  [{res}22jan2020{txt},{res}16jan2022{txt}]{col 55}units:  {res}days
{col 10}{txt}unique values:  {res}726{col 51}{txt}missing .:  {res}0{txt}/{res}726

{txt}{col 19}mean:{res}{col 26} 22298.5{txt} = {res}18jan2021{txt} (+ 12 hours)
{col 15}std. dev:{res}{col 26} 209.722

{txt}{col 12}percentiles:{col 32}10%{col 42}25%{col 52}50%{col 62}75%{col 72}90%
{res}{col 27}   22008{col 37}   22117{col 47} 22298.5{col 57}   22480{col 67}   22589
{col 26}03apr2020{col 36}21jul2020{col 46}18jan2021{col 56}19jul2021{col 66}05nov2021
{txt}
{com}. 
. order date 
{txt}
{com}. 
. rename v TotRecMeRaA00S00
{res}{txt}
{com}. 
. label var TotRecMeRaA00S00 "Total RECovered JOHN"
{txt}
{com}. 
. destring TotRecMeRaA00S00, replace
{txt}TotRecMeRaA00S00: all characters numeric; {res}replaced {txt}as {res}long
{txt}
{com}. 
. list TotRecMeRaA00S00 if date == td(19feb2020) // Shoule be 2
{txt}
     {c TLC}{hline 10}{c TRC}
     {c |} {res}TotRe~00 {txt}{c |}
     {c LT}{hline 10}{c RT}
 29. {c |} {res}       0 {txt}{c |}
     {c BLC}{hline 10}{c BRC}

{com}. 
. gen DayRecMeRaA00S00 =  TotRecMeRaA00S00[_n] - TotRecMeRaA00S00[_n-1]
{txt}(1 missing value generated)

{com}. 
. label var DayRecMeRaA00S00 "Daily RECovered JOHN"
{txt}
{com}. 
. replace DayRecMeRaA00S00 = TotRecMeRaA00S00 if _j == 1
{txt}(1 real change made)

{com}. 
. replace TotRecMeRaA00S00 = . if date < td(19feb2020)
{txt}(28 real changes made, 28 to missing)

{com}. 
. replace DayRecMeRaA00S00 = . if date < td(19feb2020)
{txt}(28 real changes made, 28 to missing)

{com}. 
. drop _j _merge
{txt}
{com}.                                         
. 
. sort date
{txt}
{com}. 
. save "country JOHN recovered.dta", replace
{txt}(note: file country JOHN recovered.dta not found)
file country JOHN recovered.dta saved

{com}. 
. 
. 
. 
. 
. 
. 
. * merge deaths and cases and recovered
. 
. use "country JOHN deaths.dta", clear 
{txt}
{com}. 
. merge 1:1 date using "country JOHN Cases.dta"
{res}
{txt}{col 5}Result{col 38}# of obs.
{col 5}{hline 41}
{col 5}not matched{col 30}{res}               0
{txt}{col 5}matched{col 30}{res}             726{txt}  (_merge==3)
{col 5}{hline 41}

{com}. 
. drop _merge
{txt}
{com}. 
. merge 1:1 date using "country JOHN recovered.dta"
{res}
{txt}{col 5}Result{col 38}# of obs.
{col 5}{hline 41}
{col 5}not matched{col 30}{res}               0
{txt}{col 5}matched{col 30}{res}             726{txt}  (_merge==3)
{col 5}{hline 41}

{com}. 
. drop _merge
{txt}
{com}. 
. *
. 
. * gen cfr
. 
. gen DayCfrMeRaA00S00 = 100 * DayDeaMeRaA00S00 / DayCasMeRaA00S00
{txt}(28 missing values generated)

{com}. 
. label var DayCfrMeRaA00S00 "Daily CFR JOHN"
{txt}
{com}. 
. *
. 
. 
. ****** add obs 01 Jan 2020 to 21 Jan 2020 for better graphing
. 
. 
. expand 22 in 1
{txt}(21 observations created)

{com}. 
. sort date
{txt}
{com}. 
. rename date date_original 
{res}{txt}
{com}. 
. gen date = .
{txt}(747 missing values generated)

{com}. 
. replace date = td(01Jan2020) in 1
{txt}(1 real change made)

{com}. 
. replace date = date[_n-1] + 1 in 2/l
{txt}(746 real changes made)

{com}. 
. format date %tdDDMonCCYY
{txt}
{com}. 
. codebook date

{txt}{hline}
{res}date{right:(unlabeled)}
{txt}{hline}

{col 19}type:  numeric daily date ({res}float{txt})

{col 18}range:  [{res}21915{txt},{res}22661{txt}]{col 55}units:  {res}1
{col 8}{txt}or equivalently:  [{res}01jan2020{txt},{res}16jan2022{txt}]{col 55}units:  {res}days
{col 10}{txt}unique values:  {res}747{col 51}{txt}missing .:  {res}0{txt}/{res}747

{txt}{col 19}mean:{res}{col 26}   22288{txt} = {res}08jan2021{txt}
{col 15}std. dev:{res}{col 26} 215.785

{txt}{col 12}percentiles:{col 32}10%{col 42}25%{col 52}50%{col 62}75%{col 72}90%
{res}{col 27}   21989{col 37}   22101{col 47}   22288{col 57}   22475{col 67}   22587
{col 26}15mar2020{col 36}05jul2020{col 46}08jan2021{col 56}14jul2021{col 66}03nov2021
{txt}
{com}. 
. drop date_original
{txt}
{com}. 
. order date
{txt}
{com}. 
. 
. * gen prevalent case
. 
. * Daily prevalent cases = Total Cases - (Total Deaths + Total recovered)
. 
. gen DayActMeRaA00S00 = TotCasMeRaA00S00 - TotDeaMeRaA00S00 - TotRecMeRaA00S00
{txt}(49 missing values generated)

{com}. 
. label var DayActMeRaA00S00 "Daily Active JOHN"
{txt}
{com}. 
. 
. 
. * smooth 
. 
. tsset date, daily   
{res}{txt}{col 9}time variable:  {res}{col 25}date, 01Jan2020 to 16Jan2022
{txt}{col 17}delta:  {res}1 day
{txt}
{com}. 
. 
. tssmooth ma DayDeaMeRaA00S00_window = DayDeaMeRaA00S00 if DayDeaMeRaA00S00 >= 0, window(3 1 3)
{txt}The smoother applied was
{res}{p 5 5 5}(1/7)*[x(t-3) + x(t-2) + x(t-1) + 1*x(t) + x(t+1) + x(t+2) + x(t+3)]; x(t)= DayDeaMeRaA00S00 {p_end}
{txt}
{com}. 
. tssmooth ma DayDeaMeSmA00S00 = DayDeaMeRaA00S00_window, weights( 1 2 3 <4> 3 2 1) replace
{txt}The smoother applied was
{res}{p 5 5 5}(1/16)*[1*x(t-3) + 2*x(t-2) + 3*x(t-1) + 4*x(t) + 3*x(t+1) + 2*x(t+2) + ...; x(t)= DayDeaMeRaA00S00_window
{txt}
{smcl}
{com}. 
. label var DayDeaMeSmA00S00 "Daily deaths smooth A00 JOHN"
{txt}
{com}. 
. drop DayDeaMeRaA00S00_window
{txt}
{com}. 
. 
. tssmooth ma DayCasMeRaA00S00_window = DayCasMeRaA00S00 if DayCasMeRaA00S00 >= 0, window(3 1 3)
{txt}The smoother applied was
{res}{p 5 5 5}(1/7)*[x(t-3) + x(t-2) + x(t-1) + 1*x(t) + x(t+1) + x(t+2) + x(t+3)]; x(t)= DayCasMeRaA00S00 {p_end}
{txt}
{com}. 
. tssmooth ma DayCasMeSmA00S00 = DayCasMeRaA00S00_window, weights( 1 2 3 <4> 3 2 1) replace
{txt}The smoother applied was
{res}{p 5 5 5}(1/16)*[1*x(t-3) + 2*x(t-2) + 3*x(t-1) + 4*x(t) + 3*x(t+1) + 2*x(t+2) + ...; x(t)= DayCasMeRaA00S00_window
{txt}
{smcl}
{com}. 
. label var DayCasMeSmA00S00 "Daily cases smooth A00 JOHN"
{txt}
{com}. 
. drop DayCasMeRaA00S00_window
{txt}
{com}. 
. tsset, clear
{txt}
{com}. 
. 
. 
. **********************
. 
. * Peak Dates (P?D) and Peak Values (P?V), and Post-peaks (PP?), smoothed values
. 
. 
. * deaths
. 
. 
. * peak 1 - deaths P1 20-03-01 20-05-01 - 22009 04Apr2020 137.6071 
. 
. summ DayDeaMeSmA00S00 if date > td(01mar2020) & date < td(01may2020)

{txt}    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayDeaMeS~00 {c |}{res}         60    99.27321    37.55751   11.90179   137.6071
{txt}
{com}. gen DayDeaMeSmA00S00P1V = r(max)
{txt}
{com}. label var DayDeaMeSmA00S00P1V "Daily deaths smooth JOHN Peak 1 Value"
{txt}
{com}. 
. summ date if DayDeaMeSmA00S00 == DayDeaMeSmA00S00P1V & date > td(01mar2020) & date < td(01may2020)

{txt}    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
{space 8}date {c |}{res}          1       22009           .      22009      22009
{txt}
{com}. gen DayDeaMeSmA00S00P1D = r(mean)
{txt}
{com}. label var DayDeaMeSmA00S00P1D "Daily deaths smooth JOHN Peak 1 Date"
{txt}
{com}. format DayDeaMeSmA00S00P1D %tdDDMonCCYY 
{txt}
{com}. 
. 
. 
. * peak 2 - deaths P2 20-07-01 20-09-01 - 22120 24Jul2020 215.0536
. 
. summ DayDeaMeSmA00S00 if date > td(01jul2020) & date < td(01sep2020)

{txt}    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayDeaMeS~00 {c |}{res}         61    173.9933    31.73449   112.3393   215.0536
{txt}
{com}. 
. gen DayDeaMeSmA00S00P2V = r(max)
{txt}
{com}. label var DayDeaMeSmA00S00P2V "Daily deaths smooth JOHN Peak 2 Value"
{txt}
{com}. 
. summ date if DayDeaMeSmA00S00 == DayDeaMeSmA00S00P2V & date > td(01jul2020) & date < td(01sep2020)

{txt}    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
{space 8}date {c |}{res}          1       22120           .      22120      22120
{txt}
{com}. gen DayDeaMeSmA00S00P2D = r(mean)
{txt}
{com}. label var DayDeaMeSmA00S00P2D "Daily deaths smooth JOHN Peak 2 Date"
{txt}
{com}. format DayDeaMeSmA00S00P2D %tdDDMonCCYY 
{txt}
{com}. 
. 
. 
. * peak 3 - deaths P3 20-11-01 20-12-01 - 22237 18Nov2020 470.8839
. 
. summ DayDeaMeSmA00S00 if date > td(01nov2020) & date < td(01dec2020)

{txt}    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayDeaMeS~00 {c |}{res}         29    444.8861    24.15167   384.3929   470.8839
{txt}
{com}. 
. gen DayDeaMeSmA00S00P3V = r(max)
{txt}
{com}. label var DayDeaMeSmA00S00P3V "Daily deaths smooth JOHN Peak 3 Value"
{txt}
{com}. 
. summ date if DayDeaMeSmA00S00 == DayDeaMeSmA00S00P3V & date > td(01nov2020) & date < td(01dec2020)

{txt}    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
{space 8}date {c |}{res}          1       22237           .      22237      22237
{txt}
{com}. gen DayDeaMeSmA00S00P3D = r(mean)
{txt}
{com}. label var DayDeaMeSmA00S00P3D "Daily deaths smooth JOHN Peak 3 Date"
{txt}
{com}. format DayDeaMeSmA00S00P3D %tdDDMonCCYY 
{txt}
{com}. 
. 
. 
. * peak 4 - deaths P4 21-04-01 21-06-01 - 22396 26Apr2021 428.0268
. 
. summ DayDeaMeSmA00S00 if date > td(01apr2021) & date < td(01jun2021)

{txt}    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayDeaMeS~00 {c |}{res}         60    288.6522    90.06408   122.7143   428.0268
{txt}
{com}. 
. gen DayDeaMeSmA00S00P4V = r(max)
{txt}
{com}. label var DayDeaMeSmA00S00P4V "Daily deaths smooth JOHN Peak 4 Value"
{txt}
{com}. 
. summ date if DayDeaMeSmA00S00 == DayDeaMeSmA00S00P4V & date > td(01apr2021) & date < td(01jun2021)

{txt}    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
{space 8}date {c |}{res}          1       22396           .      22396      22396
{txt}
{com}. gen DayDeaMeSmA00S00P4D = r(mean)
{txt}
{com}. label var DayDeaMeSmA00S00P4D "Daily deaths smooth JOHN Peak 4 Date"
{txt}
{com}. format DayDeaMeSmA00S00P4D %tdDDMonCCYY 
{txt}
{com}. 
. 
. 
. * peak 5 - deaths P5 21-08-01 21-09-01 - 22517 25Aug2021 639.7053
. 
. summ DayDeaMeSmA00S00 if date > td(01aug2021) & date < td(01sep2021)

{txt}    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayDeaMeS~00 {c |}{res}         30    555.1878    80.53964   368.5714   639.7053
{txt}
{com}. 
. gen DayDeaMeSmA00S00P5V = r(max)
{txt}
{com}. label var DayDeaMeSmA00S00P5V "Daily deaths smooth JOHN Peak 5 Value"
{txt}
{com}. 
. summ date if DayDeaMeSmA00S00 == DayDeaMeSmA00S00P5V & date > td(01aug2021) & date < td(01sep2021)

{txt}    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
{space 8}date {c |}{res}          1       22517           .      22517      22517
{txt}
{com}. gen DayDeaMeSmA00S00P5D = r(mean)
{txt}
{com}. label var DayDeaMeSmA00S00P5D "Daily deaths smooth JOHN Peak 5 Date"
{txt}
{com}. format DayDeaMeSmA00S00P5D %tdDDMonCCYY 
{txt}
{com}. 
. 
. 
. 
. 
. 
. * POST Peak 1 - deaths PP1 20-05-01 20-06-01 - 22037 02May2020 67.01786
. 
. summ DayDeaMeSmA00S00 if date > td(01may2020) & date < td(01jun2020)

{txt}    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayDeaMeS~00 {c |}{res}         30    57.59911    4.303899   51.33929   67.01786
{txt}
{com}. gen DayDeaMeSmA00S00PP1V = r(min)
{txt}
{com}. label var DayDeaMeSmA00S00PP1V "Daily deaths smooth JOHN POST Peak 1 Value"
{txt}
{com}. 
. summ date if DayDeaMeSmA00S00 == DayDeaMeSmA00S00PP1V & date > td(01may2020) & date < td(01jun2020)

{txt}    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
{space 8}date {c |}{res}          1       22048           .      22048      22048
{txt}
{com}. gen DayDeaMeSmA00S00PP1D = r(mean)
{txt}
{com}. label var DayDeaMeSmA00S00PP1D "Daily deaths smooth JOHN POST Peak 1 Date"
{txt}
{com}. format DayDeaMeSmA00S00PP1D %tdDDMonCCYY 
{txt}
{com}. 
. 
. 
. * POST Peak 2 - deaths PP2 20-08-01 20-10-01 - 22129 02Aug2020 204.9732
. 
. summ DayDeaMeSmA00S00 if date > td(01aug2020) & date < td(01oct2020)

{txt}    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayDeaMeS~00 {c |}{res}         60    153.3214    28.15558   112.3393   204.9732
{txt}
{com}. 
. gen DayDeaMeSmA00S00PP2V = r(min)
{txt}
{com}. label var DayDeaMeSmA00S00PP2V "Daily deaths smooth JOHN POST Peak 2 Value"
{txt}
{com}. 
. summ date if DayDeaMeSmA00S00 == DayDeaMeSmA00S00PP2V & date > td(01aug2020) & date < td(01oct2020)

{txt}    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
{space 8}date {c |}{res}          1       22157           .      22157      22157
{txt}
{com}. gen DayDeaMeSmA00S00PP2D = r(mean)
{txt}
{com}. label var DayDeaMeSmA00S00PP2D "Daily deaths smooth JOHN POST Peak 2 Date"
{txt}
{com}. format DayDeaMeSmA00S00PP2D %tdDDMonCCYY 
{txt}
{com}. 
. 
. 
. * POST Peak 3 - deaths PP3 21-01-01 21-04-01 - 22282 02Jan2021 112.3214 
. 
. summ DayDeaMeSmA00S00 if date > td(01jan2021) & date < td(01apr2021)

{txt}    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayDeaMeS~00 {c |}{res}         89    82.89256    8.129402   68.69643   112.3214
{txt}
{com}. 
. gen DayDeaMeSmA00S00PP3V = r(min)
{txt}
{com}. label var DayDeaMeSmA00S00PP3V "Daily deaths smooth JOHN POST Peak 3 Value"
{txt}
{com}. 
. summ date if DayDeaMeSmA00S00 == DayDeaMeSmA00S00PP3V & date > td(01jan2021) & date < td(01apr2021)

{txt}    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
{space 8}date {c |}{res}          1       22321           .      22321      22321
{txt}
{com}. gen DayDeaMeSmA00S00PP3D = r(mean)
{txt}
{com}. label var DayDeaMeSmA00S00PP3D "Daily deaths smooth JOHN POST Peak 3 Date"
{txt}
{com}. format DayDeaMeSmA00S00PP3D %tdDDMonCCYY 
{txt}
{com}. 
. 
. 
. 
. * POST peak 4 - deaths PP4 21-06-01 21-07-01 - 22433 02Jun2021 167.9732
. 
. summ DayDeaMeSmA00S00 if date > td(01jun2021) & date < td(01jul2021)

{txt}    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayDeaMeS~00 {c |}{res}         29     136.516    11.86686   122.3125   167.9732
{txt}
{com}. 
. gen DayDeaMeSmA00S00PP4V = r(min)
{txt}
{com}. label var DayDeaMeSmA00S00PP4V "Daily deaths smooth JOHN POST Peak 4 Value"
{txt}
{com}. 
. summ date if DayDeaMeSmA00S00 == DayDeaMeSmA00S00PP4V & date > td(01jun2021) & date < td(01jul2021)

{txt}    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
{space 8}date {c |}{res}          1       22452           .      22452      22452
{txt}
{com}. gen DayDeaMeSmA00S00PP4D = r(mean)
{txt}
{com}. label var DayDeaMeSmA00S00PP4D "Daily deaths smooth JOHN POST Peak 4 Date"
{txt}
{com}. format DayDeaMeSmA00S00PP4D %tdDDMonCCYY 
{txt}
{com}. 
. 
. 
. 
. * POST peak 5 - deaths PP5 21-10-01 21-11-01 - 22555 02Oct2021 237.9375
. 
. summ DayDeaMeSmA00S00 if date > td(01oct2021) & date < td(01jan2022)

{txt}    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayDeaMeS~00 {c |}{res}         91    120.5022    58.15924       38.5   237.9375
{txt}
{com}. 
. gen DayDeaMeSmA00S00PP5V = r(min)
{txt}
{com}. label var DayDeaMeSmA00S00PP5V "Daily deaths smooth JOHN Peak 5 Value"
{txt}
{com}. 
. summ date if DayDeaMeSmA00S00 == DayDeaMeSmA00S00PP5V & date > td(01oct2021) & date < td(01nov2021)

{txt}    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
{space 8}date {c |}{res}          0
{txt}
{com}. gen DayDeaMeSmA00S00PP5D = r(mean)
{txt}(747 missing values generated)

{com}. label var DayDeaMeSmA00S00PP5D "Daily deaths smooth JOHN Peak 5 Date"
{txt}
{com}. format DayDeaMeSmA00S00PP5D %tdDDMonCCYY 
{txt}
{com}. 
. 
. 
. * peak 1 - deaths P1 20-03-01 20-05-01 - 22009 04Apr2020 137.6071 
. * peak 2 - deaths P2 20-07-01 20-09-01 - 22120 24Jul2020 215.0536
. * peak 3 - deaths P3 20-11-01 20-12-01 - 22237 18Nov2020 470.8839
. * peak 4 - deaths P4 21-04-01 21-06-01 - 22396 26Apr2021 428.0268
. * peak 5 - deaths P5 21-08-01 21-09-01 - 22517 25Aug2021 639.7053
. 
. * POST Peak 1 - deaths PP1 20-05-01 20-06-01 - 22048 13May2020 51.33929
. * POST Peak 2 - deaths PP2 20-08-01 20-10-01 - 22157 30Aug2020 112.3393
. * POST Peak 3 - deaths PP3 21-01-01 21-04-01 - 22321 10Feb2021 68.69643 
. * POST peak 4 - deaths PP4 21-06-01 21-07-01 - 22452 21Jun2021 122.3125
. * POST peak 5 - deaths PP5 21-10-01 21-11-01 - 22569 16Oct2021 204.2943
. 
. 
. 
. gen DayDeaMeSmA00S00PD = . 
{txt}(747 missing values generated)

{com}. label var DayDeaMeSmA00S00PD "Daily deaths smooth JOHN Peak Dates"
{txt}
{com}. replace DayDeaMeSmA00S00PD = DayDeaMeSmA00S00P1D if date == DayDeaMeSmA00S00P1D
{txt}(1 real change made)

{com}. replace DayDeaMeSmA00S00PD = DayDeaMeSmA00S00P2D if date == DayDeaMeSmA00S00P2D
{txt}(1 real change made)

{com}. replace DayDeaMeSmA00S00PD = DayDeaMeSmA00S00P3D if date == DayDeaMeSmA00S00P3D
{txt}(1 real change made)

{com}. replace DayDeaMeSmA00S00PD = DayDeaMeSmA00S00P4D if date == DayDeaMeSmA00S00P4D
{txt}(1 real change made)

{com}. replace DayDeaMeSmA00S00PD = DayDeaMeSmA00S00P5D if date == DayDeaMeSmA00S00P5D
{txt}(1 real change made)

{com}. 
. gen DayDeaMeSmA00S00PV = . 
{txt}(747 missing values generated)

{com}. label var DayDeaMeSmA00S00PV "Daily deaths smooth JOHN Peak Values"
{txt}
{com}. replace DayDeaMeSmA00S00PV = DayDeaMeSmA00S00P1V if date == DayDeaMeSmA00S00P1D
{txt}(1 real change made)

{com}. replace DayDeaMeSmA00S00PV = DayDeaMeSmA00S00P2V if date == DayDeaMeSmA00S00P2D
{txt}(1 real change made)

{com}. replace DayDeaMeSmA00S00PV = DayDeaMeSmA00S00P3V if date == DayDeaMeSmA00S00P3D
{txt}(1 real change made)

{com}. replace DayDeaMeSmA00S00PV = DayDeaMeSmA00S00P4V if date == DayDeaMeSmA00S00P4D
{txt}(1 real change made)

{com}. replace DayDeaMeSmA00S00PV = DayDeaMeSmA00S00P5V if date == DayDeaMeSmA00S00P5D
{txt}(1 real change made)

{com}. 
. 
. 
. gen DayDeaMeSmA00S00PPD = . 
{txt}(747 missing values generated)

{com}. label var DayDeaMeSmA00S00PPD "Daily deaths smooth JOHN POST Peak Dates"
{txt}
{com}. replace DayDeaMeSmA00S00PPD = DayDeaMeSmA00S00PP1D if date == DayDeaMeSmA00S00PP1D
{txt}(1 real change made)

{com}. replace DayDeaMeSmA00S00PPD = DayDeaMeSmA00S00PP2D if date == DayDeaMeSmA00S00PP2D
{txt}(1 real change made)

{com}. replace DayDeaMeSmA00S00PPD = DayDeaMeSmA00S00PP3D if date == DayDeaMeSmA00S00PP3D
{txt}(1 real change made)

{com}. replace DayDeaMeSmA00S00PPD = DayDeaMeSmA00S00PP4D if date == DayDeaMeSmA00S00PP4D
{txt}(1 real change made)

{com}. replace DayDeaMeSmA00S00PPD = DayDeaMeSmA00S00PP5D if date == DayDeaMeSmA00S00PP5D
{txt}(0 real changes made)

{com}. 
. gen DayDeaMeSmA00S00PPV = . 
{txt}(747 missing values generated)

{com}. label var DayDeaMeSmA00S00PPV "Daily deaths smooth JOHN POST Peak Values"
{txt}
{com}. replace DayDeaMeSmA00S00PPV = DayDeaMeSmA00S00PP1V if date == DayDeaMeSmA00S00PP1D
{txt}(1 real change made)

{com}. replace DayDeaMeSmA00S00PPV = DayDeaMeSmA00S00PP2V if date == DayDeaMeSmA00S00PP2D
{txt}(1 real change made)

{com}. replace DayDeaMeSmA00S00PPV = DayDeaMeSmA00S00PP3V if date == DayDeaMeSmA00S00PP3D
{txt}(1 real change made)

{com}. replace DayDeaMeSmA00S00PPV = DayDeaMeSmA00S00PP4V if date == DayDeaMeSmA00S00PP4D
{txt}(1 real change made)

{com}. replace DayDeaMeSmA00S00PPV = DayDeaMeSmA00S00PP5V if date == DayDeaMeSmA00S00PP5D
{txt}(0 real changes made)

{com}. 
. 
. 
. 
. 
. 
. 
. 
. 
. 
. 
. * cases
. 
. 
. * peak 1 - cases P1 20-03-01 20-05-01 - 22005 31Mar2020 2923.036
. 
. summ DayCasMeSmA00S00 if date > td(01mar2020) & date < td(01may2020)

{txt}    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayCasMeS~00 {c |}{res}         60    1553.007    668.5454   504.1786   2923.036
{txt}
{com}. gen DayCasMeSmA00S00P1V = r(max)
{txt}
{com}. label var DayCasMeSmA00S00P1V "Daily cases smooth JOHN Peak 1 Value"
{txt}
{com}. 
. summ date if DayCasMeSmA00S00 == DayCasMeSmA00S00P1V & date > td(01mar2020) & date < td(01may2020)

{txt}    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
{space 8}date {c |}{res}          1       22005           .      22005      22005
{txt}
{com}. gen DayCasMeSmA00S00P1D = r(mean)
{txt}
{com}. label var DayCasMeSmA00S00P1D "Daily cases smooth JOHN Peak 1 Date"
{txt}
{com}. format DayCasMeSmA00S00P1D %tdDDMonCCYY 
{txt}
{com}. 
. 
. 
. * peak 2 - cases P2 20-03-01 20-09-01 - 22069 03Jun2020 2869.813
. 
. summ DayCasMeSmA00S00 if date > td(01may2020) & date < td(01sep2020)

{txt}    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayCasMeS~00 {c |}{res}        122     2292.01     351.513    1090.08   2869.813
{txt}
{com}. 
. gen DayCasMeSmA00S00P2V = r(max)
{txt}
{com}. label var DayCasMeSmA00S00P2V "Daily cases smooth JOHN Peak 2 Value"
{txt}
{com}. 
. summ date if DayCasMeSmA00S00 == DayCasMeSmA00S00P2V & date > td(01may2020) & date < td(01sep2020)

{txt}    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
{space 8}date {c |}{res}          1       22069           .      22069      22069
{txt}
{com}. gen DayCasMeSmA00S00P2D = r(mean)
{txt}
{com}. label var DayCasMeSmA00S00P2D "Daily cases smooth JOHN Peak 2 Date"
{txt}
{com}. format DayCasMeSmA00S00P2D %tdDDMonCCYY 
{txt}
{com}. 
. 
. 
. * peak 3 - cases P3 20-11-01 21-01-01 - 22247 28Nov2020 13579.87
. 
. summ DayCasMeSmA00S00 if date > td(01nov2020) & date < td(01jan2021)

{txt}    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayCasMeS~00 {c |}{res}         60    10062.78    2799.816   5989.375   13579.87
{txt}
{com}. 
. gen DayCasMeSmA00S00P3V = r(max)
{txt}
{com}. label var DayCasMeSmA00S00P3V "Daily cases smooth JOHN Peak 3 Value"
{txt}
{com}. 
. summ date if DayCasMeSmA00S00 == DayCasMeSmA00S00P3V & date > td(01nov2020) & date < td(01jan2021)

{txt}    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
{space 8}date {c |}{res}          1       22247           .      22247      22247
{txt}
{com}. gen DayCasMeSmA00S00P3D = r(mean)
{txt}
{com}. label var DayCasMeSmA00S00P3D "Daily cases smooth JOHN Peak 3 Date"
{txt}
{com}. format DayCasMeSmA00S00P3D %tdDDMonCCYY 
{txt}
{com}. 
. 
. 
. * peak 4 - cases P4 21-04-01 21-06-01 - 22387 17Apr2021 23945.28
. 
. summ DayCasMeSmA00S00 if date > td(01apr2021) & date < td(01jun2021)

{txt}    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayCasMeS~00 {c |}{res}         60    16921.65    4892.895   9786.616   23945.28
{txt}
{com}. 
. gen DayCasMeSmA00S00P4V = r(max)
{txt}
{com}. label var DayCasMeSmA00S00P4V "Daily cases smooth JOHN Peak 4 Value"
{txt}
{com}. 
. summ date if DayCasMeSmA00S00 == DayCasMeSmA00S00P4V & date > td(01apr2021) & date < td(01jun2021)

{txt}    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
{space 8}date {c |}{res}          1       22387           .      22387      22387
{txt}
{com}. gen DayCasMeSmA00S00P4D = r(mean)
{txt}
{com}. label var DayCasMeSmA00S00P4D "Daily cases smooth JOHN Peak 4 Date"
{txt}
{com}. format DayCasMeSmA00S00P4D %tdDDMonCCYY 
{txt}
{com}. 
. 
. 
. * peak 5 - cases P5 21-08-01 21-09-01 - 22506 14Aug2021 38735.95
. 
. summ DayCasMeSmA00S00 if date > td(01aug2021) & date < td(01sep2021)

{txt}    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayCasMeS~00 {c |}{res}         30    35868.11    2071.513   30721.28   38735.95
{txt}
{com}. 
. gen DayCasMeSmA00S00P5V = r(max)
{txt}
{com}. label var DayCasMeSmA00S00P5V "Daily cases smooth JOHN Peak 5 Value"
{txt}
{com}. 
. summ date if DayCasMeSmA00S00 == DayCasMeSmA00S00P5V & date > td(01aug2021) & date < td(01sep2021)

{txt}    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
{space 8}date {c |}{res}          1       22506           .      22506      22506
{txt}
{com}. gen DayCasMeSmA00S00P5D = r(mean)
{txt}
{com}. label var DayCasMeSmA00S00P5D "Daily cases smooth JOHN Peak 5 Date"
{txt}
{com}. format DayCasMeSmA00S00P5D %tdDDMonCCYY 
{txt}
{com}. 
. 
. 
. 
. 
. 
. * POST Peak 1 - cases PP1 20-04-01 20-06-01 - 22035 30Apr2020 1035.179
. 
. summ DayCasMeSmA00S00 if date > td(01apr2020) & date < td(01jun2020)

{txt}    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayCasMeS~00 {c |}{res}         60    1747.906    497.2995   1035.179    2798.33
{txt}
{com}. gen DayCasMeSmA00S00PP1V = r(min)
{txt}
{com}. label var DayCasMeSmA00S00PP1V "Daily cases smooth JOHN POST Peak 1 Value"
{txt}
{com}. 
. summ date if DayCasMeSmA00S00 == DayCasMeSmA00S00PP1V & date > td(01apr2020) & date < td(01jun2020)

{txt}    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
{space 8}date {c |}{res}          1       22035           .      22035      22035
{txt}
{com}. gen DayCasMeSmA00S00PP1D = r(mean)
{txt}
{com}. label var DayCasMeSmA00S00PP1D "Daily cases smooth JOHN POST Peak 1 Date"
{txt}
{com}. format DayCasMeSmA00S00PP1D %tdDDMonCCYY 
{txt}
{com}. 
. 
. 
. * POST Peak 2 - cases PP2 20-06-01 20-10-01 - 22159 01Sep2020 1861.08
. 
. summ DayCasMeSmA00S00 if date > td(01jun2020) & date < td(01oct2020)

{txt}    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayCasMeS~00 {c |}{res}        121    2499.327    371.6381    1861.08   3586.902
{txt}
{com}. 
. gen DayCasMeSmA00S00PP2V = r(min)
{txt}
{com}. label var DayCasMeSmA00S00PP2V "Daily cases smooth JOHN POST Peak 2 Value"
{txt}
{com}. 
. summ date if DayCasMeSmA00S00 == DayCasMeSmA00S00PP2V & date > td(01jun2020) & date < td(01oct2020)

{txt}    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
{space 8}date {c |}{res}          1       22159           .      22159      22159
{txt}
{com}. gen DayCasMeSmA00S00PP2D = r(mean)
{txt}
{com}. label var DayCasMeSmA00S00PP2D "Daily cases smooth JOHN POST Peak 2 Date"
{txt}
{com}. format DayCasMeSmA00S00PP2D %tdDDMonCCYY 
{txt}
{com}. 
. 
. 
. * POST Peak 3 - cases PP3 21-01-01 21-04-01 - 22299 19Jan2021 6103
. 
. summ DayCasMeSmA00S00 if date > td(01jan2021) & date < td(01apr2021)

{txt}    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayCasMeS~00 {c |}{res}         89    7374.516    987.7061       6103    10526.3
{txt}
{com}. 
. gen DayCasMeSmA00S00PP3V = r(min)
{txt}
{com}. label var DayCasMeSmA00S00PP3V "Daily cases smooth JOHN POST Peak 3 Value"
{txt}
{com}. 
. summ date if DayCasMeSmA00S00 == DayCasMeSmA00S00PP3V & date > td(01jan2021) & date < td(01apr2021)

{txt}    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
{space 8}date {c |}{res}          1       22299           .      22299      22299
{txt}
{com}. gen DayCasMeSmA00S00PP3D = r(mean)
{txt}
{com}. label var DayCasMeSmA00S00PP3D "Daily cases smooth JOHN POST Peak 3 Date"
{txt}
{com}. format DayCasMeSmA00S00PP3D %tdDDMonCCYY 
{txt}
{com}. 
. 
. 
. 
. * POST peak 4 - cases PP4 21-05-01 21-07-01 - 22437 06Jun2021 8230.759
. 
. summ DayCasMeSmA00S00 if date > td(01may2021) & date < td(01jul2021)

{txt}    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayCasMeS~00 {c |}{res}         60    11488.59    2884.883   8230.759    18982.1
{txt}
{com}. 
. gen DayCasMeSmA00S00PP4V = r(min)
{txt}
{com}. label var DayCasMeSmA00S00PP4V "Daily cases smooth JOHN POST Peak 4 Value"
{txt}
{com}. 
. summ date if DayCasMeSmA00S00 == DayCasMeSmA00S00PP4V & date > td(01may2021) & date < td(01jul2021)

{txt}    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
{space 8}date {c |}{res}          1       22437           .      22437      22437
{txt}
{com}. gen DayCasMeSmA00S00PP4D = r(mean)
{txt}
{com}. label var DayCasMeSmA00S00PP4D "Daily cases smooth JOHN POST Peak 4 Date"
{txt}
{com}. format DayCasMeSmA00S00PP4D %tdDDMonCCYY 
{txt}
{com}. 
. 
. 
. 
. * POST peak 5 - cases PP5 21-10-01 21-11-01 - 22561 08Oct2021 11266.88
. 
. summ DayCasMeSmA00S00 if date > td(01oct2021) & date < td(01jan2022)

{txt}    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayCasMeS~00 {c |}{res}         91    6532.471    3680.588   1674.866   12852.61
{txt}
{com}. 
. gen DayCasMeSmA00S00PP5V = r(min)
{txt}
{com}. label var DayCasMeSmA00S00PP5V "Daily cases smooth JOHN Peak 5 Value"
{txt}
{com}. 
. summ date if DayCasMeSmA00S00 == DayCasMeSmA00S00PP5V & date > td(01oct2021) & date < td(01nov2021)

{txt}    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
{space 8}date {c |}{res}          0
{txt}
{com}. gen DayCasMeSmA00S00PP5D = r(mean)
{txt}(747 missing values generated)

{com}. label var DayCasMeSmA00S00PP5D "Daily cases smooth JOHN Peak 5 Date"
{txt}
{com}. format DayCasMeSmA00S00PP5D %tdDDMonCCYY 
{txt}
{com}. 
. 
. 
. gen DayCasMeSmA00S00PD = . 
{txt}(747 missing values generated)

{com}. label var DayCasMeSmA00S00PD "Daily cases smooth JOHN Peak Dates"
{txt}
{com}. replace DayCasMeSmA00S00PD = DayCasMeSmA00S00P1D if date == DayCasMeSmA00S00P1D
{txt}(1 real change made)

{com}. replace DayCasMeSmA00S00PD = DayCasMeSmA00S00P2D if date == DayCasMeSmA00S00P2D
{txt}(1 real change made)

{com}. replace DayCasMeSmA00S00PD = DayCasMeSmA00S00P3D if date == DayCasMeSmA00S00P3D
{txt}(1 real change made)

{com}. replace DayCasMeSmA00S00PD = DayCasMeSmA00S00P4D if date == DayCasMeSmA00S00P4D
{txt}(1 real change made)

{com}. replace DayCasMeSmA00S00PD = DayCasMeSmA00S00P5D if date == DayCasMeSmA00S00P5D
{txt}(1 real change made)

{com}. 
. gen DayCasMeSmA00S00PV = . 
{txt}(747 missing values generated)

{com}. label var DayCasMeSmA00S00PV "Daily cases smooth JOHN Peak Values"
{txt}
{com}. replace DayCasMeSmA00S00PV = DayCasMeSmA00S00P1V if date == DayCasMeSmA00S00P1D
{txt}(1 real change made)

{com}. replace DayCasMeSmA00S00PV = DayCasMeSmA00S00P2V if date == DayCasMeSmA00S00P2D
{txt}(1 real change made)

{com}. replace DayCasMeSmA00S00PV = DayCasMeSmA00S00P3V if date == DayCasMeSmA00S00P3D
{txt}(1 real change made)

{com}. replace DayCasMeSmA00S00PV = DayCasMeSmA00S00P4V if date == DayCasMeSmA00S00P4D
{txt}(1 real change made)

{com}. replace DayCasMeSmA00S00PV = DayCasMeSmA00S00P5V if date == DayCasMeSmA00S00P5D
{txt}(1 real change made)

{com}. 
. 
. 
. gen DayCasMeSmA00S00PPD = . 
{txt}(747 missing values generated)

{com}. label var DayCasMeSmA00S00PPD "Daily cases smooth JOHN POST Peak Dates"
{txt}
{com}. replace DayCasMeSmA00S00PPD = DayCasMeSmA00S00PP1D if date == DayCasMeSmA00S00PP1D
{txt}(1 real change made)

{com}. replace DayCasMeSmA00S00PPD = DayCasMeSmA00S00PP2D if date == DayCasMeSmA00S00PP2D
{txt}(1 real change made)

{com}. replace DayCasMeSmA00S00PPD = DayCasMeSmA00S00PP3D if date == DayCasMeSmA00S00PP3D
{txt}(1 real change made)

{com}. replace DayCasMeSmA00S00PPD = DayCasMeSmA00S00PP4D if date == DayCasMeSmA00S00PP4D
{txt}(1 real change made)

{com}. replace DayCasMeSmA00S00PPD = DayCasMeSmA00S00PP5D if date == DayCasMeSmA00S00PP5D
{txt}(0 real changes made)

{com}. 
. 
. 
. gen DayCasMeSmA00S00PPV = . 
{txt}(747 missing values generated)

{com}. label var DayCasMeSmA00S00PPV "Daily cases smooth JOHN POST Peak Values"
{txt}
{com}. replace DayCasMeSmA00S00PPV = DayCasMeSmA00S00PP1V if date == DayCasMeSmA00S00PP1D
{txt}(1 real change made)

{com}. replace DayCasMeSmA00S00PPV = DayCasMeSmA00S00PP2V if date == DayCasMeSmA00S00PP2D
{txt}(1 real change made)

{com}. replace DayCasMeSmA00S00PPV = DayCasMeSmA00S00PP3V if date == DayCasMeSmA00S00PP3D
{txt}(1 real change made)

{com}. replace DayCasMeSmA00S00PPV = DayCasMeSmA00S00PP4V if date == DayCasMeSmA00S00PP4D
{txt}(1 real change made)

{com}. replace DayCasMeSmA00S00PPV = DayCasMeSmA00S00PP5V if date == DayCasMeSmA00S00PP5D
{txt}(0 real changes made)

{com}. 
. 
. * peak 1 - cases P1 20-03-01 20-05-01 - 22005 31Mar2020 2923.036
. * peak 2 - cases P2 20-03-01 20-09-01 - 22069 03Jun2020 2869.813
. * peak 3 - cases P3 20-11-01 21-01-01 - 22247 28Nov2020 13579.87
. * peak 4 - cases P4 21-04-01 21-06-01 - 22387 17Apr2021 23945.28
. * peak 5 - cases P5 21-08-01 21-09-01 - 22506 14Aug2021 38735.95
. 
. * POST Peak 1 - cases PP1 20-04-01 20-06-01 - 22035 30Apr2020 1035.179
. * POST Peak 2 - cases PP2 20-06-01 20-10-01 - 22159 01Sep2020 1861.08
. * POST Peak 3 - cases PP3 21-01-01 21-04-01 - 22299 19Jan2021 6103
. * POST peak 4 - cases PP4 21-05-01 21-07-01 - 22437 06Jun2021 8230.759
. * POST peak 5 - cases PP5 21-10-01 21-11-01 - 22561 08Oct2021 11266.88
. 
. 
. 
. 
. 
. 
. 
. **************
. 
. * graphs
. 
. ssc install grstyle, replace
{txt}checking {hilite:grstyle} consistency and verifying not already installed...
all files already exist and are up to date.

{com}. 
. grstyle init
{res}{txt}
{com}. 
. grstyle color background white
{txt}
{com}. 
. 
. 
. 
. * gen monthspast vars for #thicknumber of graphs
. 
. 
. 
. gen today_date_string = "`c(current_date)'"
{txt}
{com}. 
. gen year = substr(today_date_string,8,4) 
{txt}
{com}. gen month = substr(today_date_string,4,3) 
{txt}
{com}. gen day = substr(today_date_string,1,2) 
{txt}
{com}. egen date2 = concat(day month year)
{txt}
{com}. 
. gen today_numericdailydate  = date(date2, "DMY", 2050)
{txt}
{com}. format today_numericdailydate  %tdDDMonCCYY
{txt}
{com}. 
. drop year month day date2 today_date_string
{txt}
{com}. 
. codebook today_numericdailydate 

{txt}{hline}
{res}today_numericdailydate{right:(unlabeled)}
{txt}{hline}

{col 19}type:  numeric daily date ({res}float{txt})

{col 18}range:  [{res}22662{txt},{res}22662{txt}]{col 55}units:  {res}1
{col 8}{txt}or equivalently:  [{res}17jan2022{txt},{res}17jan2022{txt}]{col 55}units:  {res}days
{col 10}{txt}unique values:  {res}1{col 51}{txt}missing .:  {res}0{txt}/{res}747

{txt}{col 13}tabulation:  Freq.  Value
{col 21}{res}       747{col 33}22662{col 40}{txt}17jan2022

{com}. 
. gen monthspast01jan2020 = ((today_numericdailydate - td(01jan2020)) / 30) + 1
{txt}
{com}. 
. replace monthspast01jan2020 = round(monthspast01jan2020)
{txt}(747 real changes made)

{com}. 
. global monthspast01jan2020 = monthspast01jan2020
{txt}
{com}. 
. di $monthspast01jan2020
{res}26
{txt}
{com}. 
. 
. 
. gen monthspast01jan2021 = ((today_numericdailydate - td(01jan2021)) / 30) + 1
{txt}
{com}. 
. replace monthspast01jan2021 = round(monthspast01jan2021)
{txt}(747 real changes made)

{com}. 
. global monthspast01jan2021 = monthspast01jan2021
{txt}
{com}. 
. di $monthspast01jan2021
{res}14
{txt}
{com}. 
. 
. 
. gen monthspast01jan2022 = ((today_numericdailydate - td(01jan2022)) / 30) + 1
{txt}
{com}. 
. replace monthspast01jan2022 = round(monthspast01jan2022)
{txt}(747 real changes made)

{com}. 
. global monthspast01jan2022 = monthspast01jan2022
{txt}
{com}. 
. di $monthspast01jan2022
{res}2
{txt}
{com}. 
. 
. 
. 
. 
. 
. 
. 
. 
. * daily deaths, JOHN
. 
. twoway ///
> (line DayDeaMeRaA00S00 date, sort lcolor(black) lwidth(medium)) /// 1 "JOHN raw"
> (line DayDeaMeSmA00S00 date, sort lcolor(cyan*1.2) lwidth(thick)) /// 2 "JOHN smooth"
> , xtitle(Date) xlabel(#$monthspast01jan2020, format(%tdYY-NN-DD) labsize(small)) xlabel(, grid) xlabel(, grid) ///
> xlabel(, angle(forty_five)) ylabel(, format(%9.0fc) labsize(small))  ylabel(, labsize(small) angle(horizontal)) ///
> ytitle(Daily deaths) title("COVID-19 daily deaths, $country, Johns Hopkins", size(medium)) ///
> xscale(lwidth(vthin) lcolor(gray*.2)) yscale(lwidth(vthin) lcolor(gray*.2)) legend(region(lcolor(none))) legend(bexpand) ///
> legend(order(1 "Raw deaths" 2 "Smooth deaths") size(small) row(1)) 
{res}{txt}
{com}. 
. graph save "graph 1 COVID-19 daily deaths, $country, Johns Hopkins.gph", replace
{txt}(note: file graph 1 COVID-19 daily deaths, Iran, Johns Hopkins.gph not found)
{res}{txt}(file graph 1 COVID-19 daily deaths, Iran, Johns Hopkins.gph saved)

{com}. graph export "graph 1 COVID-19 daily deaths, $country, Johns Hopkins.pdf", replace
{txt}(file /Users/farshadpourmalek/Downloads/covir2-main/20220116/code/JOHN/graph 1 COVID-19 daily deaths, Iran, Johns Hopkins.pdf written in PDF format)

{com}. 
. 
. 
. 
. * daily cases, JOHN
. 
. twoway ///
> (line DayCasMeRaA00S00 date, sort lcolor(black) lwidth(medium)) /// 1 "JOHN raw"
> (line DayCasMeSmA00S00 date, sort lcolor(cyan*1.2) lwidth(thick)) /// 2 "JOHN smooth"
> , xtitle(Date) xlabel(#$monthspast01jan2020, format(%tdYY-NN-DD) labsize(small)) xlabel(, grid) xlabel(, grid) ///
> xlabel(, angle(forty_five)) ylabel(, format(%9.0fc) labsize(small))  ylabel(, labsize(small) angle(horizontal)) ///
> ytitle(Daily cases) title("COVID-19 daily cases, $country, Johns Hopkins", size(medium)) ///
> xscale(lwidth(vthin) lcolor(gray*.2)) yscale(lwidth(vthin) lcolor(gray*.2)) legend(region(lcolor(none))) legend(bexpand) ///
> legend(order(1 "Raw cases" 2 "Smooth cases") size(small) row(1)) 
{res}{txt}
{com}. 
. graph save "graph 2 COVID-19 daily cases, $country, Johns Hopkins.gph", replace
{txt}(note: file graph 2 COVID-19 daily cases, Iran, Johns Hopkins.gph not found)
{res}{txt}(file graph 2 COVID-19 daily cases, Iran, Johns Hopkins.gph saved)

{com}. graph export "graph 2 COVID-19 daily cases, $country, Johns Hopkins.pdf", replace
{txt}(file /Users/farshadpourmalek/Downloads/covir2-main/20220116/code/JOHN/graph 2 COVID-19 daily cases, Iran, Johns Hopkins.pdf written in PDF format)

{com}. 
. 
. 
. 
. 
. * total deaths
. 
. twoway ///
> (line TotDeaMeRaA00S00 date, sort lcolor(black)) ///
> , xtitle(Date) xlabel(#$monthspast01jan2020, format(%tdYY-NN-DD) labsize(small)) xlabel(, grid) xlabel(, grid) ///
> xlabel(, angle(forty_five)) ylabel(, format(%9.0fc) labsize(small))  ylabel(, labsize(small) angle(horizontal)) ///
> ytitle(Total deaths) title("COVID-19 total deaths, $country, Johns Hopkins", size(medium)) ///
> xscale(lwidth(vthin) lcolor(gray*.2)) yscale(lwidth(vthin) lcolor(gray*.2)) legend(region(lcolor(none))) legend(bexpand) 
{res}{txt}
{com}. 
. graph save "graph 3 COVID-19 total deaths, $country, Johns Hopkins.gph", replace
{txt}(note: file graph 3 COVID-19 total deaths, Iran, Johns Hopkins.gph not found)
{res}{txt}(file graph 3 COVID-19 total deaths, Iran, Johns Hopkins.gph saved)

{com}. graph export "graph 3 COVID-19 total deaths, $country, Johns Hopkins.pdf", replace
{txt}(file /Users/farshadpourmalek/Downloads/covir2-main/20220116/code/JOHN/graph 3 COVID-19 total deaths, Iran, Johns Hopkins.pdf written in PDF format)

{com}. 
. 
. 
. 
. * total cases 
. 
. twoway ///
> (line TotCasMeRaA00S00 date, sort lcolor(black)) ///
> , xtitle(Date) xlabel(#$monthspast01jan2020, format(%tdYY-NN-DD) labsize(small)) xlabel(, grid) xlabel(, grid) ///
> xlabel(, angle(forty_five)) ylabel(, format(%9.0fc) labsize(small))  ylabel(, labsize(small) angle(horizontal)) ///
> ytitle(Total cases) title("COVID-19 total cases, $country, Johns Hopkins", size(medium)) ///
> xscale(lwidth(vthin) lcolor(gray*.2)) yscale(lwidth(vthin) lcolor(gray*.2)) legend(region(lcolor(none))) legend(bexpand) 
{res}{txt}
{com}. 
. graph save "graph 4 COVID-19 total cases, $country, Johns Hopkins.gph", replace
{txt}(note: file graph 4 COVID-19 total cases, Iran, Johns Hopkins.gph not found)
{res}{txt}(file graph 4 COVID-19 total cases, Iran, Johns Hopkins.gph saved)

{com}. graph export "graph 4 COVID-19 total cases, $country, Johns Hopkins.pdf", replace
{txt}(file /Users/farshadpourmalek/Downloads/covir2-main/20220116/code/JOHN/graph 4 COVID-19 total cases, Iran, Johns Hopkins.pdf written in PDF format)

{com}. 
. 
. 
. 
. 
. * daily cfr 
. 
. twoway ///
> (line DayCfrMeRaA00S00 date, sort lcolor(black)) ///
> , xtitle(Date) xlabel(#$monthspast01jan2020, format(%tdYY-NN-DD) labsize(small)) xlabel(, grid) xlabel(, grid) ///
> xlabel(, angle(forty_five)) ylabel(, format(%9.0fc) labsize(small))  ylabel(, labsize(small) angle(horizontal)) ///
> ytitle(Daily CFR) title("COVID-19 daily CFR, $country, Johns Hopkins", size(medium)) ///
> xscale(lwidth(vthin) lcolor(gray*.2)) yscale(lwidth(vthin) lcolor(gray*.2)) legend(region(lcolor(none))) legend(bexpand) 
{res}{txt}
{com}. 
. graph save "graph 5 COVID-19 daily CFR, $country, Johns Hopkins.gph", replace
{txt}(note: file graph 5 COVID-19 daily CFR, Iran, Johns Hopkins.gph not found)
{res}{txt}(file graph 5 COVID-19 daily CFR, Iran, Johns Hopkins.gph saved)

{com}. graph export "graph 5 COVID-19 daily CFR, $country, Johns Hopkins.pdf", replace
{txt}(file /Users/farshadpourmalek/Downloads/covir2-main/20220116/code/JOHN/graph 5 COVID-19 daily CFR, Iran, Johns Hopkins.pdf written in PDF format)

{com}. 
. 
. 
. 
. 
. * daily cfr 2021 on 
. 
. twoway ///
> (line DayCfrMeRaA00S00 date, sort lcolor(black)) ///
> if date >= td(01jan2021) ///
> , xtitle(Date) xlabel(#$monthspast01jan2021, format(%tdYY-NN-DD) labsize(small)) xlabel(, grid) xlabel(, grid) ///
> xlabel(, angle(forty_five)) ylabel(, format(%9.1fc) labsize(small))  ylabel(, labsize(small) angle(horizontal)) ///
> ytitle(Daily CFR) title("COVID-19 daily CFR, $country, Johns Hopkins", size(medium)) ///
> xscale(lwidth(vthin) lcolor(gray*.2)) yscale(lwidth(vthin) lcolor(gray*.2)) legend(region(lcolor(none))) legend(bexpand) ///
> subtitle("after 2021-01-01", size(small))
{res}{txt}
{com}. 
. graph save "graph 6 COVID-19 daily CFR, $country, Johns Hopkins, 2021.gph", replace
{txt}(note: file graph 6 COVID-19 daily CFR, Iran, Johns Hopkins, 2021.gph not found)
{res}{txt}(file graph 6 COVID-19 daily CFR, Iran, Johns Hopkins, 2021.gph saved)

{com}. graph export "graph 6 COVID-19 daily CFR, $country, Johns Hopkins, 2021.pdf", replace
{txt}(file /Users/farshadpourmalek/Downloads/covir2-main/20220116/code/JOHN/graph 6 COVID-19 daily CFR, Iran, Johns Hopkins, 2021.pdf written in PDF format)

{com}. 
. 
. 
. 
. 
. * visualize timing of deaths and cases peaks
. 
. summ DayDeaMeRaA00S00 

{txt}    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayDeaMeR~00 {c |}{res}        698    189.2192    144.9235          0        709
{txt}
{com}. gen DayDeMMeRaA00S00 = r(mean)
{txt}
{com}. label var DayDeMMeRaA00S00 "Daily deaths mean JOHN DayDeM"
{txt}
{com}. 
. summ DayCasMeRaA00S00 

{txt}    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayCasMeR~00 {c |}{res}        698    8912.655    8925.981          2      50228
{txt}
{com}. gen DayCaMMeRaA00S00 = r(mean)
{txt}
{com}. label var DayCaMMeRaA00S00 "Daily cases mean JOHN DayCaM"
{txt}
{com}. 
. gen DayCbDMeRaA00S00 = DayCaMMeRaA00S00 / DayDeMMeRaA00S00
{txt}
{com}. label var DayCbDMeRaA00S00 "Daily cases mean div by daily deaths mean JOHN DayCbD"
{txt}
{com}. summ DayCbDMeRaA00S00

{txt}    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayCbDMeR~00 {c |}{res}        747    47.10228           0   47.10228   47.10228
{txt}
{com}. 
. gen DayDeaMeRaA00multip = DayDeaMeRaA00S00 * DayCbDMeRaA00S00 
{txt}(49 missing values generated)

{com}. label var DayDeaMeRaA00multip "Daily deaths scaled (times means of cases by deaths) only for visualization JOHN"
{txt}
{com}. summ DayDeaMeRaA00multip

{txt}    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayDeaMeRa~p {c |}{res}        698    8912.655    6826.226          0   33395.51
{txt}
{com}. 
. 
. 
. twoway ///
> (line DayCasMeRaA00S00 date, sort lcolor(blue)) ///
> (line DayDeaMeRaA00S00 date, sort lcolor(red)) ///
> (line DayDeaMeRaA00multip date, sort lpattern(tight_dot) lcolor(red)) ///
> if date > td(01jan2020)  /// 
> , xtitle(Date) xlabel(#$monthspast01jan2020, format(%tdYY-NN-DD) labsize(small)) xlabel(, grid) xlabel(, grid) ///
> xlabel(, angle(forty_five)) ylabel(, format(%9.0fc) labsize(small))  ylabel(, labsize(small) angle(horizontal)) ///
> ytitle(Daily cases and deaths) title("COVID-19 daily cases and deaths, $country, Johns Hopkins", size(medium)) ///
> xscale(lwidth(vthin) lcolor(gray*.2)) yscale(lwidth(vthin) lcolor(gray*.2)) legend(region(lcolor(none)))  ///
> legend(order(1 "Daily cases" 2 "Daily deaths" 3 "Daily deaths scaled for visualization only")) ///
> note("Daily deaths scaled (times means of cases by deaths) only for visualization JOHN") ///
> subtitle("comparison of timing of peaks", size(small))
{res}{txt}
{com}. 
. graph save "graph 7 COVID-19 daily deaths and cases timing, $country, Johns Hopkins.gph", replace
{txt}(note: file graph 7 COVID-19 daily deaths and cases timing, Iran, Johns Hopkins.gph not found)
{res}{txt}(file graph 7 COVID-19 daily deaths and cases timing, Iran, Johns Hopkins.gph saved)

{com}. graph export "graph 7 COVID-19 daily deaths and cases timing, $country, Johns Hopkins.pdf", replace
{txt}(file /Users/farshadpourmalek/Downloads/covir2-main/20220116/code/JOHN/graph 7 COVID-19 daily deaths and cases timing, Iran, Johns Hopkins.pdf written in PDF format)

{com}. 
. 
. 
. 
. 
. * daily recovered
. 
. twoway ///
> (line DayRecMeRaA00S00 date, sort lcolor(black)) ///
> , xtitle(Date) xlabel(#$monthspast01jan2020, format(%tdYY-NN-DD) labsize(small)) xlabel(, grid) xlabel(, grid) ///
> xlabel(, angle(forty_five)) ylabel(, format(%9.0fc) labsize(small))  ylabel(, labsize(small) angle(horizontal)) ///
> ytitle(Daily recovered) title("COVID-19 daily recovered, $country, Johns Hopkins", size(medium)) ///
> xscale(lwidth(vthin) lcolor(gray*.2)) yscale(lwidth(vthin) lcolor(gray*.2)) legend(region(lcolor(none))) legend(bexpand) 
{res}{txt}
{com}. 
. graph save "graph 8 COVID-19 daily recovered, $country, Johns Hopkins.gph", replace
{txt}(note: file graph 8 COVID-19 daily recovered, Iran, Johns Hopkins.gph not found)
{res}{txt}(file graph 8 COVID-19 daily recovered, Iran, Johns Hopkins.gph saved)

{com}. graph export "graph 8 COVID-19 daily recovered, $country, Johns Hopkins.pdf", replace
{txt}(file /Users/farshadpourmalek/Downloads/covir2-main/20220116/code/JOHN/graph 8 COVID-19 daily recovered, Iran, Johns Hopkins.pdf written in PDF format)

{com}. 
. 
. 
. 
. * daily active
. 
. twoway ///
> (line DayActMeRaA00S00 date, sort lcolor(black)) ///
> , xtitle(Date) xlabel(#$monthspast01jan2020, format(%tdYY-NN-DD) labsize(small)) xlabel(, grid) xlabel(, grid) ///
> xlabel(, angle(forty_five)) ylabel(, format(%9.0fc) labsize(small))  ylabel(, labsize(small) angle(horizontal)) ///
> ytitle(Daily active) title("COVID-19 daily active cases, $country, Johns Hopkins", size(medium)) ///
> xscale(lwidth(vthin) lcolor(gray*.2)) yscale(lwidth(vthin) lcolor(gray*.2)) legend(region(lcolor(none))) legend(bexpand) 
{res}{txt}
{com}. 
. graph save "graph 9 COVID-19 daily active, $country, Johns Hopkins.gph", replace
{txt}(note: file graph 9 COVID-19 daily active, Iran, Johns Hopkins.gph not found)
{res}{txt}(file graph 9 COVID-19 daily active, Iran, Johns Hopkins.gph saved)

{com}. graph export "graph 9 COVID-19 daily active, $country, Johns Hopkins.pdf", replace
{txt}(file /Users/farshadpourmalek/Downloads/covir2-main/20220116/code/JOHN/graph 9 COVID-19 daily active, Iran, Johns Hopkins.pdf written in PDF format)

{com}. 
. 
. ***
. 
. 
. qui compress
{txt}
{com}. 
. sort date loc_grand_name
{txt}
{com}. 
. 
. save "country JOHN.dta", replace
{txt}(note: file country JOHN.dta not found)
file country JOHN.dta saved

{com}. 
. 
. 
. view "log country JOHN.smcl"
{txt}
{com}. 
. log close
      {txt}name:  {res}<unnamed>
       {txt}log:  {res}/Users/farshadpourmalek/Downloads/covir2-main/20220116/code/JOHN/log country JOHN.smcl
  {txt}log type:  {res}smcl
 {txt}closed on:  {res}17 Jan 2022, 07:37:06
{txt}{.-}
{smcl}
{txt}{sf}{ul off}